[
  {
    "productId": "EfJOyTJcIJ",
    "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=bbd6dcdb3b7f27cd427fa99cb073862a0ea919a0%3A724851215&click_sum=2ab64d42&ref=stl_listing-1",
    "title": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Unique Light Fixture",
    "description": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Clay-light Artwork, Unique Light Fixture  Art Creation , Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by past traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for the sense of belonging through the local material culture.Color: Forest green,  white, Mint, burgundy, orangeMeasurements:Height\t17.7 inchDiameter 7.9 inch",
    "reviews": [
      "Great lamps! I enjoy looking at them every day!",
      "Amazing product! Really good quality !",
      "Beautifully made. Packaged with care. Arrived as scheduled."
    ]
  },
  {
    "productId": "HMxVfXrrfJ",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=8c44f5249a49cf18017d3e918affdf9f580901d4%3A654638870&click_sum=6d52ea73&ref=stl_listing-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "CdBdMLUjKt",
    "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=f2fd2b66ff35f26c21e9d47606dbb57170531e52%3A776223242&click_sum=e3d53b31&ref=stl_listing-3",
    "title": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture",
    "description": "Give your home a boost of warmth and a homely feel with a delicate natural terracotta lamp.Made by hand in a small boutique studio in Tel AvivAll necessary fitting parts are included.Technical:Lamp holder: E27Transparent cable : 150 cm / 60 inchesCeiling rose: 10 cm / 4 inchesEnergy-saving LED light bulbs are recommended. We prefer the Edison Vintage style Bulb.Voltage 110V-250V | 25 to 40W maxThis piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless of creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.Please note that this object is handmade, and each piece is unique.This object can be ordered in various colors and prints, talk to us for more info.You can see similar models here:https://www.etsy.com/il-en/listing/776245646/ceiling-lamp-pendant-terra-cotta-lamphttps://www.etsy.com/il-en/listing/776221084/hanging-terracotta-ceramic-lamp-colorfu",
    "reviews": [
      "Amazing product! Really good quality !",
      "Beautifully made. Packaged with care. Arrived as scheduled.",
      "What a beautiful piece. Also, communication is as good as it gets, and same for packaging and shipping. Thank you!"
    ]
  },
  {
    "productId": "LYsvcZvAvl",
    "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=4e43f9123749a3e38998c3a1b8a480f408c64374%3A712573399&click_sum=5d7eeab1&ref=stl_listing-1",
    "title": "Vintage Armchair from Mid Century, Mustard, Restored",
    "description": "Attention! Please contact us before order the chair if you are customer from United Kingdom - regarding to the Brexit.Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standardThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.Wood has been sanded and secured with high quality oil to expose the beautiful wood grains.The shape has been preserved in every detail as original.Dimensions:Width - 22.8 in, 58 cmHeight - 31.4 in, 80 cmDepth - 24.8 in, 63 cmSeat Width - 18.1 in, 46 cmSeat Height - 14.2 in, 36 cm",
    "reviews": [
      "Beautiful chair with crafted wood finish. Slightly firmer than expected but very comfortable. Gorgeous colour.",
      "Great product. Very happy with our chairs."
    ]
  },
  {
    "productId": "GukQUEKAhU",
    "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=5a0e17fcfc58963c7bd0d7ba29ab90177b224224%3A649720699&click_sum=4ec35c34&ref=stl_listing-2",
    "title": "Completely restored Black and White cocktail chair from 1970's",
    "description": "Dimensions in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in------------------------------------------------------------------------------------------The mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white colored upholstery fabric for the refurbishment.Our manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.",
    "reviews": [
      "Very beautiful cocktail chairs, they arrived well packed. I’m very happy with this purchase!",
      "this is the second chair I buy. they are wonderful.",
      "It's reallly a beautiful and comfortable cocktail chair, looks like shown on the pictures and came quickly and safely packed. Thank you very much!",
      "I am very happy with this purchase. The seller was friendly and honest and the communication was fast. Shipping (to Germany) is not cheap, but executed professionally. I was able to phone the driver and ask for the exact hour of delivery. The chairs were wrapped well and arrived without a scratch. They looked exactly the same like the one I already had and now make a great set around my dining table. I can definitely recommend this shop!"
    ]
  },
  {
    "productId": "cYSTkrHBDy",
    "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=29ea2f3eae67b09122a034401ea20fc80201eb54%3A1110352719&click_sum=8bc487b3&ref=stl_listing-3",
    "title": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade Sherpa chair mid century set, small comfy armchair for living room",
    "description": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade furniture Sherpa chair  bring a 60's Furniture feel into your home with this solid wood Mid century Armchair Upholstered in boucle teddy soft fabricOur Mid century armchair is made from solid wood and upholstered with brown faux leather.⚒ All furniture is handmade in our shop!Armchairs can be upholstered in another fabric or stained in another color, contact me for more info➤ **note for NON-EU buyers - please be aware of possible import fees and taxes, these are calculated additionally when the items are sent and these fees are collected by the delivery company and paid on your behalf to your government. The amount of these fees varies in every non-EU country.*** We are sending from Croatia which is a part of the EU - for EU buyers there are no additional fees *➤ Check out my shop for more Mid Century Vintage Furniture ➤https://www.etsy.com/shop/RetroDesignCRODimensions:• Overall height: 74 Centimeters / 29.6 inches• Overall width: 63 Centimeters / 25.2 inches• Overall depth: 70 Centimeters / 28 inches• Seat height: 40 Centimeters / 16 inches• Seat width: 50 Centimeters / 20 inches• Seat depth: 50 Centimeters / 20 inchesMaterials:• Stained Solid Beech Wood• Boucle teddy fabric• High quality furniture foam density 30*simple assembly required instructions included",
    "reviews": [
      "Lovely chair, exactly what we wanted",
      "Very good quality armchair that meets our expectations.\nThe follow-up is top notch: thank you Marija!",
      "Very nice armchair! Comfortable and very pretty"
    ]
  },
  {
    "productId": "qggHJzGbaC",
    "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=d5c3bd0816cd3a8a7a292f62c0c157a8cf25137a%3A903050205&click_sum=485e6f41&ref=stl_listing-1",
    "title": "Large Vegan Suede Yellow Desert Knot Floor Cushion ,suede ottoman, Knot Floor Pillow, Modern pouf, ottoman cushion, pouf ottoman, suede pouf",
    "description": "Soft, cozy with beautiful earthy tones. We can't get enough of the new vegan suede collection!  The vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. These floor cushions are beautiful and functional. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner.Size: 75X75 cm / 30X30 inchHeight: 35 cm / 14 inchMaterials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric.Care: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean.Production and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase.Custom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout.Please Read about our shipping, refunds and exchanges policies.For any thoughts or questions please send us a Message and We'll be happy to answer ASAP.Buyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs.",
    "reviews": [
      "Love, love, love this stool.!  So unique and adds a touch of elegance and unexpected whimsy to my vanity.",
      "She is great to deal with. Very responsive. It’s exactly as beautiful as the photos! It’s very well built, strong and sturdy. A work of art. Love it!",
      "I love how it turns out.",
      "Better than expected. Absolutely gorgeous and super quick communication."
    ]
  },
  {
    "productId": "rHWtdRfFXf",
    "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=d8826a1660a44880cef0ef6eb575e9878cadf154%3A904960951&click_sum=bb8b70fe&ref=stl_listing-2",
    "title": "Floor Pillow | Meditation Cushion | Floor Cushion | Floor Pouf | Floor Seating | Round Floor Pillow | Square Floor Pillow | Teal Home Decor",
    "description": "Get ready to get comfy with my new floor pillows!Imagine moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. With my new floor pillows those dreams are now realities!The original print for this floor pillow was created in my design studio in Maine & the floor pillow is made to order thanks to the help of my fabulous sewing partner.Two different shapes-the circle and the square-plus two different sizes... All those choices equals soft, comfy, and oh-so-pretty floor pillows that are great on their own, or stacked for even more comfort. Let's be honest-chairs are so last year.••• PLEASE NOTE •••The pillows have a small \"X\" stitch detail in the center of the pillow... tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time... keeping your pillow plump and comfy sit after sit after sit :)PRODUCT DIMENSIONS(Please note there is a 1\"-2\" tolerance on all printed textile products)23\" Round : 23\" x 7\" Tall26\" Round : 26\" x 7\" Tall23\" Square : 23\" x 23\" x 7\" Tall26\" Square : 26\" x 26\" x 7\" TallPRODUCT DETAILS100% woven polyester printed fabricSewn closed with premium poly fillCARE INSTRUCTIONSSpot clean onlyPRODUCTIONPlease allow up to 5 - 10 business days for production of your custom made item.• PLEASE NOTE •I am currently unable to deliver to PO Boxes. Please provide a physical mailing address with your order. Thanks!RETURN POLICY FOR THIS PRODUCTYour floor pillow is custom made just for you and as a result I am unable to offer returns/exchanges unless your item arrives damaged or defective.",
    "reviews": [
      "This is a beautiful comforter and arrived just in time for my birthday thanks to the excellent customer service!  Thanks so much!!",
      "Just moved to Honolulu for few years, and this was so appropriate for our space.",
      "The material seems to be a polyester but it works to give excellent color. Love the design.",
      "Thank you for the shower curtain, communication, and quick delivery. - Erica"
    ]
  },
  {
    "productId": "wPeKRitCSu",
    "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=96112436a79e613f5d35b5d8a830e4571a7f5c18%3A266515154&click_sum=b2795a60&ref=stl_listing-3&sts=1",
    "title": "Kids Knitted Footstool, Crochet Pouf Ottoman, Grey Knitted Pouf Kids, Knitted Pouffe Ottoman, Nursery Pouf Ottoman, Scandinavian Decor",
    "description": "Welcome to Zuri House!Children just love to play and explore new objects and textures. They are sure to love this cozy knitted pouffe to sit, play, climb and rest. You will love it too! This pouffe is a beautiful addition to any nursery or young child's room.This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.ABOUT THIS POUFFEMaterial:-fabric inner bag filled with polystyrene beads-knitted cover made with chunky cotton cordColour: LIGHT GREYSizes:SMALL:Diameter: Approximately 45cm (18”)Height: Approximately 30cm (12”)MEDIUM:Diameter: Approximately 50cm (20”)Height: Approximately 40cm (16”)Care:-the knitted cover can be removed for washing (it can be washed in 30 degrees in the washing machine)-the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.MORE OF OUR KNITTED POUFFESIN SMALL SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332437IN MEDIUM SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27316506IN LARGE SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332459PLEASE NOTEI always try to describe my items as accurate as possible. I provide detailed information about used materials and the product dimensions. Please make sure that the item you would like to order meets your expectations. I always try to show the actual colours of my products but please remember that they may slightly vary from the colour on your screen due to monitor colour restrictions.FOLLOW ME!www.facebook.com/nebozuri/www.instagram.com/zuri_house/www.pinterest.com/zurihouse/www.zurihouse.comQUESTIONS?If you have a question about this pouffe or would like it in another size or color, please use the Message Seller button below and I’ll get right back to you!Thank you for shopping at Zuri House!",
    "reviews": [
      "Absolutely lovely item beautifully made and packaged. Very quick and helpful communication. LOVE it !",
      "Thank you!:)",
      "Such a nice addition to my son's room, he loves it and so do I. Purchased a medium too!",
      "Amazing quality, just what I wanted to finish off my nursery",
      "High quality product and super soft. Just like the photos on the sellers page. Love it!"
    ]
  },
  {
    "productId": "Simrnyrp9b",
    "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=f454e980ef7a1727335e8ee9bf00b56c6e9d10f8%3A811521978&click_sum=aac3e77b&ref=stl_listing-1&sts=1",
    "title": "Illustrated Parian Porcelain Vase - Stroke / Brushstroke",
    "description": "With it’s assured, bold brushstrokes against a bright white base the Stroke Long Vase is a declaration of a love of pattern and bold design. Perfect as a stand out piece for a mantlepiece, sideboard, or as a centre piece for your dining table. Ideal for holding bundles of your favourite blooms and leafy bouquets, the Stroke Long Vase will be sure to make an impact with or without foliage.Slipcast in Parian porcelain, the Big Pot is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent. Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with.From start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.Material: Parian porcelainFinish: Matte outside, glossy insideSize: 21.5cm x 9cm (ø)",
    "reviews": [
      "Exactly as described and such a beautiful piece. Love the matt exterior and the glazed interior as well as the semi-translucent nature of the material. The perfectly positioned hand painted strokes show the care and thought that went into producing it.",
      "I love this mug! It is so beautiful. It was very well packaged too!",
      "I only wish it came in a larger version too! Love it!"
    ]
  },
  {
    "productId": "EpOXfkfJZs",
    "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=5e1754b324c28fdc06d0948aef3b9c2e3cda1157%3A986518800&click_sum=5a6fc16d&ref=stl_listing-2",
    "title": "Small amphora vase, old Greek pottery inspired vase, handmade ceramic vase",
    "description": "A beautiful hand-built small amphora vase with black and white triangle pattern.It works great as a decorative item or can carry beautifully a bouquet of small flowers/a little tree branch...It was made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white upon which it was fired to cone 8 (1250C) in an electric kiln. The base was left unglazed and is impressed with my maker's mark.DIMENSIONS & MATERIALS:~ speckled stoneware clay, non toxic glossy white glaze~ app. 13.5cm high and 9cm wide (5.3\" x 3.5\")Dishwasher safe.CONDITION OF THE PRODUCTSBecause all our pieces are handcrafted, there may be minor variations form item to item.SHIPPING INFORMATION:All orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days.All EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of Slovenia. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days.There is a shipping upgrade option to Express DHL for European orders. Please see listing \"Shipping Upgrade\" for further details.",
    "reviews": [
      "The quality is excellent and the shipping was fast.",
      "The quality is excellent and the shipping was fast.",
      "The quality is excellent and the shipping was fast.",
      "Very happy with my bowl. So beautiful and good quality."
    ]
  },
  {
    "productId": "oPFcJQqdvs",
    "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6feda9640107085d2d4c8e6764845f9f8865a564%3A908084516&click_sum=877918f3&ref=stl_listing-3",
    "title": "Burlap Jute Glass Vase, Hand Painted, Black and White, Home Decor Art, Unique Gifts",
    "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.- Handcrafted with jute, burlap fabric, and glass bottle.- Dimensions - 5\" tall; base 5.5\" wide.- Beautiful addition to your home or office decor.- Indoor use only.",
    "reviews": [
      "love these vases I have 4 now and I love them, True ART!",
      "Unlike any vase I've seen. DenzCrafts has a unique style and aesthetic. I will be adding to my collection :)",
      "These are So Gorgeous. Truly works of art. Very unique and looks so high end!"
    ]
  },
  {
    "productId": "JQNAGuahkX",
    "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4267fbc19523823bb00f050be5abbe67e613464e%3A1206357075&click_sum=e5181a2f&ref=stl_listing-1",
    "title": "Cushion covers - Exclusive pattern - Unique design - Handmade - Decorative cushion - Cushion cover - Handmade - Exclusive pattern",
    "description": "🔵 CUSHION COVER 🟧💻 Exclusive pattern digitally designed - Exclusive pattern digitally designed🖨 Printed in the South of France - Printed in South of France✂ Handcrafted in my workshop - Handcrafted in my workshop⚡ Creation in limited series - Limited edition designMAIN FEATURES :- Wallet closure- Face fabric = Water-repellent and UV-resistant fabric- Back fabric = Heavy duty 100% cotton twill- Slightly textured print quality- Fully overlocked on the reverse🧼 MAINTENANCE:Wash at 30°C. Natural drying. Do not wring. Iron at low temperature.📮 Shipments by post with tracking",
    "reviews": [
      "Deliciously retro but with shimmering colors",
      "Seller was super helpful and very responsive in helping me track the package",
      "Amazing colors and design!! Gifted for a friend and wishing I had one :)"
    ]
  },
  {
    "productId": "bvFxQnoRIE",
    "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=c51efe61e21eb2ad687f6a114ebb8cac78abd714%3A566822148&click_sum=5c02316e&ref=stl_listing-2",
    "title": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow",
    "description": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow-------------------------------Let sparks of happiness fly with this gem of a pillow! We dare you to find something happier than this line-up of colorful stripes. We believe that lovely things and bright colors can give hope during difficult times and joy on gloomy winter days—especially when they come to us with an inspiring origin story. This cloth is made by an indigenous family who came to Cuenca to sell their handiwork, the colorful stripes are woven on an antique loom and take weeks to make. Of course, the pattern caught our eye from a mile away and while there are many stripe options available, this is our favorite. When you see this pillow in your home, imagine the women and girls of this community who wear this cloth as a skirt, and remember that we are all connected to each other in a sisterhood of love and empowerment.-------------------------------Striped Fabric: 100% hand-loomed cotton.Size: 19\" x 19\"**Stripes vary slightly in each one**-------------------------------Very soft to the touch. Hidden zipper at bottom. Pillow insert not included. For a fuller look, get a pillow an inch or two larger. Sewn for About Love by an interior design studio in Ecuador.-------------------------------Notes from Other Women:\"This pillow is even better in person!\"",
    "reviews": [
      "This sweater is soooo soft and warm!  It is a tiny bit tight around the armpit, but other than that, it is as beautiful as in the photos!  It also stretches and conforms to my body!  I love it!  And because it is wool, it will be easy to clean.  This was the best present my hubby could have given me.  Thank you to A Shop About Love",
      "Love my new sweater! I have wanted a nice white sweater for dress up or dress down and this is it.",
      "This is an incredibly cozy sweater,  made of the softest wool ever (think cashmere); 10 stars for that!  I purchased size XL, looking for relaxed fit - I am usually a size 12 and could have probably gone with a size L.  Wouldn't have been much of an issue except that with the XL, the pockets come down almost mid-thigh, and I am not petite (5'8\").  Last and not least, for the cost, my sweater came with several loose ends, that I will take care of to ensure no unraveling of stitches in the future.  Overall a great purchase - thank you!",
      "Hello, Tutti! Thanks so much for sharing about the sweater. So glad you’re enjoying the coziness. And so sorry about the yarn ends. We work with many knitters in villages in the Andes and I’m sorry this slipped through our own quality checks. But thank you for mentioning it and we’ll work to improve that detail on our end!"
    ]
  },
  {
    "productId": "RjCtcoCVpJ",
    "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=a1fa1fe56d77ddc1d516a86e5352588bb16eb60c%3A1168874671&click_sum=a77e9ec2&ref=stl_listing-3",
    "title": "Throw Pillow • Parquet Design • modern mid century mod red orange stripe gift design couch living room colorful party cotton pillow cover",
    "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.100% cotton with zipper closing16\" squareDesigned in Canada • Made in IndiaPillow form not included.",
    "reviews": [
      "Love this calendar, I was looking for a smaller one and this one is perfect!",
      "I’ve ordered a calendar two years in a row now and I don’t plan on stopping for 2025. They’re on gorgeous paper, the designs themselves are great and it’s the perfect size to not take up too much space on my wall.\n\nLove it!",
      "love the designs and looks great on my wall :)",
      "Great quality, looks exactly like the picture! Colours really pop, I love it"
    ]
  },
  {
    "productId": "GXADDvEQkq",
    "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=5ac3278d92b87e16842116bc79f6b985b171bc56%3A790049531&click_sum=d2fee15f&ref=stl_listing-1&sts=1",
    "title": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign",
    "description": "Wood Address Sign-Note in the personalization area your address. If your address is not obvious with only numbers and a street name please specify which goes on the top of the graphic bar and which goes on the bottom.FINISHESThese will come painted with black exterior grade paint if ordering painted unless otherwise specified (See our color chart). Unpainted comes sanded and ready to be finished at home. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.MEASUREMENTSThe sign is 14.5\" wide and the height will vary depending on the length of the address.MATERIALWe use a high-quality cabinet grade 1/4\" thick baltic birch wood.HANGINGThese come with two drill holes in the graphic bar. Be careful not to drill too far and crack the wood when installing.All designs and photos owned by Michael Miles Creations: © Copyright 2017-present | All Rights Reserved --------We have SOLE OWNERSHIP of any and all designs we create. We do not give anyone permission to copy our designs.FINISH OPTIONSIf you order painted and do not note a color in the personalization area, your cutout will automatically be painted black.Unfinished means your order comes sanded and ready to be painted or stained at home.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.",
    "reviews": [
      "Love it. It matches my house trim perfectly.",
      "Perfect. Exactly what we expected.\nImpressive communicationskills from Supplier.",
      "Exactly as expected. It’s best house number display in the neighborhood 😊"
    ]
  },
  {
    "productId": "hWAnpPKhzO",
    "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=fb8d18c68750ed71292538b0a93dde2bb9aae0e2%3A1439690652&click_sum=a51df7b0&ref=stl_listing-2&sts=1",
    "title": "Round Address Sign, Geometric Address Sign, Round House Numbers, Modern Address Plaque, Custom Address Sign, House Number Plaque",
    "description": "Geometric carved design with acrylic house numbers - the perfect modern piece for your home address sign. These are great housewarming gifts, realtor closing gifts or just to spruce up your front porch or door decor.HOW TO ORDER- Choose Your Size- Note Your Text Color- Note your background paint or stain color choice in the personalization area.They come with a sawtooth hanger to hang.",
    "reviews": [
      "Love it! Great quality, turned out better than I imagined it! Highly recommend",
      "Beautiful sign. Can't wait to put it out next Christmas!",
      "Thank you so much for taking the time to leave a review!",
      "Exactly what I have been looking for!",
      "So glad you like it, thank you!",
      "Great quality\nExactly as I ordered!\nSo cute, expectations exceeded!",
      "Thank you for taking the time to leave us a review!"
    ]
  },
  {
    "productId": "naMFfoOHmy",
    "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=fb5a03ed64d65c1c157e136f113a148259ef280c%3A1453867189&click_sum=19c9d815&ref=stl_listing-3&sts=1",
    "title": "Herringbone Address Sign, Modern House Number Sign, House Numbers, Address Plaque, Realtor Closing Gift, Personalized Housewarming Gift",
    "description": "Modern Herringbone House Number Sign - UnframedThe perfect address sign for your modern home exterior. The backer is made out of wood and the numbers are acrylic - the wood is sealed with an exterior grade sealer to help preserve the life. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.HOW TO ORDER- The backer can be any stain or paint color shown on our color charts -  note in the personalizationarea what paint or stain you would like.-  The text can only be black or white-  Select if you want it vertical or horizontalThe numbers will be made to fit the sign regardless of how many numbers you order. Less numbers will be taller and centered on the sign. If you need a custom size please reach out and I would be happy to help.MEASUREMENTSThe sign is 7\" x 21\" shown with early american stain. Keep in mind all wood will stain differently.MATERIALWe use a high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted.HANGINGThese come with either a sawtooth hanger on the back or a d-ring.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.",
    "reviews": [
      "Love it! Great quality, turned out better than I imagined it! Highly recommend",
      "Beautiful sign. Can't wait to put it out next Christmas!",
      "Thank you so much for taking the time to leave a review!",
      "Exactly what I have been looking for!",
      "So glad you like it, thank you!"
    ]
  },
  {
    "productId": "STNOskZfvq",
    "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=3d5f8f3f04a6c494a8e02520a771904919581c03%3A630678328&click_sum=4b02089e&ref=stl_listing-1",
    "title": "Faux olive wreath , Every Day Wreath",
    "description": "Hooray!! This wreath was picked by the ETSY Design team for 2019 Holiday Advertisement!Watch on YouTube link:https://www.youtube.com/watch?v=trS4fmZ3puQWhat a great piece for your rustic home decoration!This wreath is made to order.This wreath is made on a rustic grapevine base with artificial olives and leaves.This beautiful olive wreath is the perfect accent to your home or gift to your friends.The grapevines wreath is natural so all the grapevines are different.And it's great for double doors. Just add 2 in the cart. This wreath is ideal for inside or outside.Made from 14\", 18\" and 24\" natural rustic grapevines.Size approx: 18\". 22\"and 28\" (tip to tip)If you are sending this as a gift, please write the message in the notes area on check out and let me know if the item is being shipped to the person directly.I would write your gift message on a  pretty card and would not add any receipt.This wreath is great for indoor or outdoor use, but a covered or sheltered area is recommended.  Direct sunlight and rain will fade your wreath over time.Please feel free to contact me with any questions or to request a custom order!Thank you so much.",
    "reviews": [
      "Love the wreath!!! Very well made. It’s exactly what I wanted for my front door. Thanks Jim!!!",
      "Beautiful, a little squished in shipping but simply beautiful, thank you so much.\nEnjoy a Blessed, Happy and Holy Christmas.🙏🌲",
      "Looks terrific. I even placed a ribbon on it for Christmas.",
      "Absolutely beautiful!! Looks just as it’s pictured."
    ]
  },
  {
    "productId": "MfaFKvJeQM",
    "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=dcf3edfa922c2f66569b3c94abdff2cd9ac81022%3A962426777&click_sum=1a315c81&ref=stl_listing-2&sts=1",
    "title": "Lavender Hoop Wreath,Modern Summer Lavender Wreath,Spring Lambs Ear Wreath,Farmhouse Front Door Decor,Simple Eucalyptus Door Wreath,Mom Gift",
    "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.𝗪𝗿𝗲𝗮𝘁𝗵 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Arrives ready to display• Made on an 12\" 14\" 16\" or 18\" wooden or gold metal ring• Hand designed using premium materials• Wreath is sprayed with a UV protectant𝗪𝗿𝗲𝗮𝘁𝗵 𝗖𝗮𝗿𝗲• Indoor/Outdoor covered use only• This wreath cannot be directly exposed to moisture𝗜𝘁𝗲𝗺 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Some greenery may vary slightly• I do hand pick each wreath and take great care in finding quality grapevine.• Do to the nature of the grapevine wreath, I cannot guarantee a perfectly round wreath, or exact measurement(within 1-2 inches)𝗦𝘁𝗮𝘆 𝗜𝗻 𝗧𝗼𝘂𝗰𝗵Instagram.com/twistedpine.wreaths/pinterest.com/twistedpinewreaths/View our Entire Collection of Wreaths:www.etsy.com/shop/twistedpinewreathsTHE FRAUDULENT WEBSITE WREATHFALL /FACEBOOK HAS COPIED SEVERAL OF MINE & OTHER ETSY SELLERS ORIGINAL IMAGES.. PLEASE DO NOT BUY FROM THAT SITE. THEY ARE NOT ORIGINAL PRODUCTS",
    "reviews": [
      "I love this wreath and have had several comments of how nice it looks.",
      "This item is very high quality and matched the description exactly. The seller was very communicative, reaching out when she could not obtain a hoop and offering alternatives. I would definitely recommend and buy again.",
      "This is my second wreath I’ve gotten from Twisted Pines and they do not disappoint. I love them. Well made and a beautiful designs.",
      "Seller was very communicative, which was greatly appreciated."
    ]
  },
  {
    "productId": "rLQKKmMaMU",
    "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=15133188b5a21788e5649f727e944a3b4e2fb9c6%3A1223343994&click_sum=b1ec6bd8&ref=stl_listing-3&sts=1",
    "title": "Farmhouse wreath for front door, Eucalyptus wreath, Greenery decor, French country decor, Farmhouse kitchen, Year round wreath",
    "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\" Can be enjoyed inside or outside year round for curb appeal!Handmade in Northern, Virginia with love. This item is made to order.View my other wreaths here:https://www.etsy.com/shop/NovaWreathsVisit me on Instagram @NovaWreaths: https://www.instagram.com/novawreaths© 2023, Lauren Cleary",
    "reviews": [
      "Look even nicer in person! Beautiful wreath",
      "This wreath is exactly as pictured and absolutely beautiful. It’s exactly what I wanted for my front door!",
      "Very unique piece high quality"
    ]
  },
  {
    "productId": "FebdFaEKSZ",
    "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=b1098f91a88060f62d43045a6b407a1bcf3ce19c%3A1168985443&click_sum=5605043b&ref=stl_listing-1&bes=1&sts=1",
    "title": "Last Name Doormat, Housewarming Gift, Wedding Gift, Closing Gift, Custom Personalized Doormat, Welcome Doormat, Front Door Mat, Monogram Rug",
    "description": "Our high-quality doormats are made from all-natural coir fibers, making them eco-friendly. They feature a vinyl back for durability and sturdiness.____________________CARE INSTRUCTIONSWe recommend that coir doormats be used in a covered area to be sheltered from the elements. When coir doormats get wet and cannot dry properly, the fibers can soak up the water. The water then pushes the natural coconut oil to the surface of the fibers giving it a darker and stained appearance. This can also deteriorate the design causing it to fade quickly.Shedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help. All rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers. All mats are hand cut, so please allow for a 1 inch +/- variance in length. If you are needing an exact measurement, please reach out to us so we can verify that we can provide one that fits your needs. Doormats are .5 to .75 inches thick.____________________CUSTOM DESIGN OR PERSONALIZATION ADD-ONThis listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing. If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below. Please note that we DO NOT offer proofs for pre-designed items unless specifically requested. All custom orders will get a proof, including orders with personalization add-ons. No proofs will be provided until after purchase.PERSONALIZATION ADD-ON: https://bit.ly/PersonalizedAddOnCUSTOM DESIGN LISTING: https://bit.ly/CustomDesignDoormatIf you have questions regarding proofs, personalizations, or custom options, please feel free to send us a message. We would be glad to answer them for you.____________________BLEMISHED OPTIONSometimes we get mats with dark spots or other stains and blemishes beyond the natural ones mentioned above. However, they do not inhibit the actual function of the doormat. As a company, we try to be mindful of our waste and genuinely hate the thought of throwing them in a landfill; therefore, we choose to offer them at cost. Please note that we do not provide photos of our blemished doormats because our items are made to order, and we cannot guarantee which one you will receive.We usually have at least a few blemished items in stock. If you are interested in purchasing the blemished option, please let us know, and we will be glad to add one if available to the listing inventory. There is a limit of 1 per customer per purchase. By buying a blemished mat, you agree to its flaws, and all sales are final.____________________RESOURCESSHOP HOME PAGE:https://www.etsy.com/shop/hamlinrowshopMORE PERSONALIZED DOORMATS: https://bit.ly/PersonalizeDoormats",
    "reviews": [
      "Great, showed up sooner then expected and good quality .",
      "Love item. Great quality and size for front door",
      "These were a perfect gift! Great quality!"
    ]
  },
  {
    "productId": "xklhLwMQOx",
    "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=b653ff16f1cf704c6711daa768004b22d5b98e33%3A612462127&click_sum=657a7a13&ref=stl_listing-2&sts=1",
    "title": "pizza doormat . welcome mat . gift for her . coir mat . custom door mat . cute doormat . housewarming gift . bridesmaid gift . wedding gift",
    "description": "Charm every pizza loving guest by adding this hand painted pizza doormat to your front step! Or give this coir welcome mat as a housewarming gift or wedding gift to your loved ones.Each welcome mat is made from a durable PVC back and a natural coir front that's perfect for the outdoors or inside. While coir doormats are extremely durable, they will last much longer if placed under an awning to protect them from the elements. Simply give your mat a good shake to clean!Looking for a custom doormat? I'd love to chat - send me a message!/ DETAILS∘ Doormat measurement: 18\" x 30\"∘ Materials: PVC backing, natural coir (coconut husk) front, acrylic paint∘ Care instructions: simply shake it or spot cleanHas your doormat design started to fade?Touching up a faded design is easy! Use black acrylic paint and a small firm bristle brush to trace the design and bring new life to a mat that is getting worn out.Thank you for choosing Grateful Paper Co.!✚ View all doormats:https://etsy.me/3yn6A8H✚ View all mini mats:https://etsy.me/2Vp6eQn✚ Need a custom doormat?Custom full size mat:https://etsy.me/3xhZxgdCustom mini mat:https://etsy.me/3C8AEqYCustom doormat dimensions:https://etsy.me/3lFMfbjLove the designs you're seeing in the shop? Join our mailing list and get a bundle of 3 wall art printables absolutely free! Sign up here: https://bit.ly/3Gx6fot",
    "reviews": [
      "This doormat is the perfect housewarming gift! It is very well made and matches the description perfectly.  The mat arrived quickly and exceeded my expectations. I would definitely order from this seller again.",
      "I love this doormat so much. ❤️ It’s sturdy, high quality, and most importantly, fun and unique! My husband and I bought this for our new home in Colorado, and it was one of the first things I unpacked. 😊",
      "Amazing doormat but even better customer service! Heather is the sweetest and got the item out to me TWO DAYS after I ordered it! I needed the item within 7 days and she got it to me in two… I couldn’t believe it when I saw the package today! The quality of the doormat is exceptional too."
    ]
  },
  {
    "productId": "PhuVkQO3LG",
    "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=7b62c1a9518ecbf5a51ab11b13e591e12439e35f%3A1183106995&click_sum=edea5b44&ref=stl_listing-3&sts=1",
    "title": "Custom Last Name Retro Doormat, home decor, custom doormat, welcome mat, housewarming, front door mat, welcome doormat, closing gift",
    "description": "Personalized Welcome DoormatPLEASE READ, IMPORTANT INFORMATION ABOUT PERSONALIZATIONWe will copy and paste the personalization exactly as you type it into the personalization box for the last name on this design. \"THE\" is automatically applied to the top of the doormat (just like the listing photo) UNLESS you specifically ask us to leave it off in the personalization box. If you do not give us an EST. date, we will automatically leave that off. We can also put anything else on this design besides a last name, PLEASE make sure that you are very clear in your description when placing your order. If you have any questions, please send us a message and we'd be happy to help!Our doormats are high quality 100% coir. They are hand painted by me with outdoor industrial paint that has a built in UV protection to help protect the design from wear and fading. Each mat is backed with a slip-resistant sturdy PVC rubber backing. We offer a variety of sizes and all of our mats are 1 inch thick.The mats are best placed under a covered area such as a porch, we do not recommend placing mat in areas of direct sunlight, rain, or snow.CARE: clean by giving the mat a good shake. Best to keep in a dry area such as a covered entryway, we DO NOT recommend direct sunlight, rain or snow as that will fade & cause wear to your doormat!Due to the nature of our product, RETURNS WILL NOT BE ACCEPTED DUE TO WEAR OR FADING. Doormats will not be refunded or replaced from wear.*FLAWED DOORMATS: When we order our doormats, some come with slight imperfections such as dark spots, slight staining, small chipped corner or a small hole on the back of the mat not visible from the front of the doormat. If you are interested in a flawed doormat please send us a message and we will let you know if we have any in stock. If we do have any available, we will send you a photo of the doormat for you to approve before moving forward on the order. PLEASE NOTE, all flawed doormats are sold at a HUGE discounted price and all sales are FINAL. You are agreeing to the flaws during messaging and finalize the sale when you purchase the doormat.We suggest replacing your doormat every few months as doormats tend to be a seasonal item. We are always adding more items so be sure to check back here for our new designs :)Each mat is unique. Some may be darker or lighter than the photo, coir is made from the husks of coconuts and some fibers might be thicker or thinner than others. There may also be chunks of the husks in the fibers.We love CUSTOM ORDERS! Message us and let us know what you have in mind and we'll make it happen",
    "reviews": [
      "so cute & exactly what i wanted!",
      "Love our doormat so cute great quality",
      "Exactly as pictured. Very happy!"
    ]
  },
  {
    "productId": "qwDfhIFpCE",
    "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=950c45282fcb043b54892ca907f815fbc7d84844%3A775841802&click_sum=b51ef572&ref=stl_listing-1&bes=1&sts=1",
    "title": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign",
    "description": "Welcome sign for front porchThis adorable WELCOME sign will add a colorful touch to your front door is our latest design, capturing the trendy floral designs so prevalent in today's decor. The sign is made of solid wood with painted on letters.✔HAND PAINTED on letters, NOT VINYL STICKERS SO LETTERS WILL NOT CURL WITH AGE and NOT SPRAY PAINTED SO YOU DON'T GET THE FUZZY EDGES✔SPACING & CENTERING ACCURACY: NEW AND IMPROVED!✔Distressed look✔CAN BE HUNG ON A WALL (SEE \"CUSTOM OPTIONS\" SECTION BELOW)✔GREAT AS A GIFT! We're happy to insert a card with a personal note from you. Just let us know what you would like it to say!✔MADE IN USA✔CUSTOM ORDERS ACCEPTED!⭐️⭐️⭐️⭐️⭐️ 5 STAR RATINGS! People say: \"Love it\", \"Beautiful\", \"Very well done\", \"Just like the pictures\", \"She loves it!\"✎ADDITIONAL DETAILS:PRODUCT DESCRIPTIONThis adorably delightful WELCOME sign will add a charming touch to your front door. The sign is made of solid wood with painted on letters, highly durable and it looks great! Our top seller is our 5' x 10\" sign. Check out our reviews! We stain and then give it a distressed and rustic look. Please note, these signs are indeed RUSTIC, and are made one-by-one to that effect which means that each piece has some variation. The distressed look means that the painted letters are given an \"aged\" look. Please review all of the photos and note that parts of the letters have \"aged\" away giving a partly \"erased\" or \"smudged\" look, perhaps even creating some asymmetry in the letters, as well as some color variation in the stain. Given that distressing is done on each piece individually each piece is unique, so expect some slight variation from the model pictured. ✔CHECK OUT THE PHOTOS TO SEE MORE DETAILS.SPACING & CENTERING ACCURACY: We've made & sold over 15,000 Welcome Signs and one of the things we've been striving for is more precision in the spacing and centering of the letters on our signs. We've invested in new technology and tools that allow us to finely tune the spacing and centering of the letters on our signs so you can be sure that when you receive one of our signs it doesn't look off center or have spacing errors between the letters.SIZESRead our sizes as Height x Width. So if it is a 5' x 10\" sign when reading the measurements the first figure is the height, so 5 feet, and the second number is the width, so 10 inches (technically 9 1/4\" in lumber measurements).  This WELCOME sign comes in 4 sizes!  5 feet x 9 1/4\" , 4 feet by 6 1/2\", 3 feet by 5.5\" inches, and 2 feet by 5.5 inches wide.HOW TO USE ITYour new solid wood welcome sign can be placed anywhere you like by simply resting it back against something as pictured  (For a long life we keep it in a covered location such as a porch with an awning, etc.). Most folks place them near their front door, on a porch, a patio, a deck, walkway or even in a guest room.  If you would like a freestanding sign it is possible to attach a stake on the back and stake it into the ground.PRODUCT CAREWe use one of the most expensive and most durable paints available. This ensures the durability of your sign.  However, like anything exposed to the natural elements (sun, wind, water, etc.) it will wear. We recommend that you place this sign in a covered location, such as a covered porch area.***WHEN YOU PLACE YOUR ORDER PLEASE DOUBLE CHECK YOUR ADDRESS AND THE COLOR & SIZE YOU SELECTED IN YOUR ORDER. THIS IS IMPORTANT AND WILL HELP YOU AVOID UNNECESSARY SHIPPING CHARGES.BROWSE OUR SHOPSee our other stuff:https://www.etsy.com/shop/NativeRange*Native Range, LLC",
    "reviews": [
      "This sign is exactly what we needed for our front door. Very well made too!",
      "Looks great and is great quality!",
      "Loved the rustic look of the welcome sign!",
      "Just what I was looking for and absolutely love it"
    ]
  },
  {
    "productId": "CDSZPMggxc",
    "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=7ad9a23df887e29d4d643325b5ee7a1285b6b7db%3A511215666&click_sum=70e7cf2c&ref=stl_listing-2&sts=1",
    "title": "large wooden porch vases, welcome sign, reclaimed wood, rustic, floor vases, farmhouse decor, large floor vase,  porch decor, set of 2",
    "description": "This set of 2 large wooden porch vases will add a little rustic charm to your porch or living room! A welcome sign and rustic vases all in one! Unique farmhouse and  porch decor will welcome your guests to your home! Fill with large stems or branches and you will have a beautiful eye-catching entry. The large vase measures 24\" x 6 and the smaller one measures 18\" x 6\".  These vases are made form reclaimed wood that has been sanded and stained gray.",
    "reviews": [
      "So fun! Look great! Love!",
      "I absolutely love these! They are adorable on my front porch thank you",
      "Super cute!! Had them put my house number on the second one. Sometimes delivery people mistakes my unit between my neighbor so hopefully this will also help them! Recommended!",
      "Nice product. A little shorter than I expected"
    ]
  },
  {
    "productId": "KYnRmugJgO",
    "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=2975da989550db39ffbf25daa16b8f0caf0b64a6%3A1095987590&click_sum=80a6bef0&ref=stl_listing-3",
    "title": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming Gift",
    "description": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming GiftElevate your home decor with a beautiful metal sign. Made with 18 guage steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. Add a touch of elegance to your home on the inside, outside, or both!Each sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.• 18 Gauge Steel• 5 Color Options (Black, Red, White, Copper, Silver)• 6 Sizes - 36\", 30\", 24\", 18\", 14\", 12\" *Selected size is based on the maximum height or width of the sign depending on physical orientation• Mounting Hardware Not IncludedHave another design in mind? We'd love to help your vision come to life. (Additional design fee may apply.)",
    "reviews": [
      "loved it! It’s the perfect gift!",
      "Great quality, fast shipping! Will order again :)"
    ]
  },
  {
    "productId": "bpUPSihqNf",
    "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=f40e0d5e59fce4acbb85f4c063463934343eedb3%3A615762911&click_sum=4daef902&ref=stl_listing-1&sts=1",
    "title": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911",
    "description": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911This utility style sconce is perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.The sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.FINISH OPTIONS-----------------------• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 10\"Width: 10\"Depth: 12.5\"ShadeHeight: 3.25\"Width: 10\"5\" Wall CanopyClearance From Wall: 2\"This light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Turns on and off at socket.Installation: Direct Wired into wall (Installation Hardware Included)If you would like to make this light a plug-in fixture:Please visit our Add Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!",
    "reviews": [
      "Love, looks great in my room.",
      "Nice !  Seller was helpful with issue ! Thank you Donna",
      "Item as described, highly recommend this Etsy Shop."
    ]
  },
  {
    "productId": "ChNFwufXKC",
    "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=a57f3ec672232f8b5fdf5046add089a76289575c%3A1165269880&click_sum=dc68bd1d&ref=stl_listing-2&sts=1",
    "title": "Outdoor Modern Wall Lantern With Integrated LED's and Unique Reflective Center Cone - Farmhouse Design",
    "description": "19703 Lantern-Modern Unique Design: Contemporary and Minimalist European Lantern design with sleek integrated LED that provides an ample amount of light. This wall sconce creates a distinct yet tasteful appearance wherever you choose to install.-Excellent Quality: All ECD Lighting Fixtures are made of sturdy die-caste aluminum and sealed with a weather-proof coating that will ensure the longevity of your fixtures.-ETL Certified: All ECD Lighting fixtures have ETL certifications for the driver and fixture. This fixture is suitable for wet locations and all climates.-Energy Efficient: Integrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours and putting an end to the constant need to change burnt out bulbs. SAVE THOUSANDS on bulbs!!-Variety of Use: Perfect for residential spaces such as exterior entrances, garage, patio, porch, etc.. Additionally a great fixture for commercial use in restaurants, common buildings, office spaces, and multi-use buildings.Easy InstallationAll ECD Lighting fixtures include our patented easy installation hardware!No electrician required and every fixture can be installed with 3 steps in less than 10 minutes.ALWAYS make sure your power is turned off before installation*1. Attach the back plate to the junction box.2. Connect the corresponding wires with the screw caps provided.3. Secure the fixture to the junction box with the provided screws.The ECD WayFrom the moment you switch these lights on, they will improve the look of your home and your quality of living. Choose ECD to light the way for you!",
    "reviews": [
      "Love this fixture. It fits perfectly in our midcentury home. Simple, yet elegant and modern. We paired it with a warm Edison-type bulb that really complements the glass and design.",
      "These are stunning and exactly as described.  The seller was very accommodating and jumped through hoops to get these delivered - thank you",
      "Light fixture is beautiful, exactly as pictured. Casts the most amazing light / shadows on the wall due to the blown glass formations! A note to buyer though; 25 watts is very low. This is more of a night light."
    ]
  },
  {
    "productId": "tuLqtXilcl",
    "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=a52d9d3d166dfc474a9c68e330a061f6f665e7d9%3A1051791566&click_sum=f221e642&ref=stl_listing-3&sts=1",
    "title": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748",
    "description": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade.FINISH OPTIONS-----------------------• Our Raw Brass finish features solid unfinished brass that is hand cleaned before leaving our shop. The brass will age and patina over time giving the finish a soft natural look.Please wear gloves while installing all fixtures. Touching raw brass with bare hands will tarnish the brass.If you would like the brass to be sealed:Please purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section.• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Polished Nickel - Mirror like metallic finish with a warm feel• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 9\"Width: 7\"Depth: 10\"Shade:Height: 4.25\"Width: 7\"Clearance from Wall: 2.55\" Wall CanopyThis light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Controlled from light switchInstallation: Direct Wired into Wall  (Installation Hardware Included)If you would like to add an On/Off switch or make this light a plug-in fixture:Please visit our Add-Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts.In order to keep the lamp temperature cool, please use LED bulbs only.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!",
    "reviews": [
      "Love the style of the lamps",
      "Beautiful brass lighting piece! Love it! Well crafted!! Only difference from picture is the dome piece is more black sheen than the brushed iron look.",
      "Beautiful! Just got it today and it's now installed. Wow. I love it!",
      "They look great and arrived quickly.  Edison bulbs were included.  We are very happy with the product."
    ]
  },
  {
    "productId": "KgqWbdzGRn",
    "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=ebbf765b750b9cab1137733f9e17cdc6a4dac848%3A1316603667&click_sum=47137b9d&ref=stl_listing-1",
    "title": "Linen bedding set, Double king duvet cover and pillows in Green color, 100% natural flax sheets set custom sizes",
    "description": "Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.Here at SOUTH, we don't do shortcuts. We are crazy about effortless luxury, comfort, sustainability, and quality. That means we use only top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home - the more you use it, the more fabulous, soft, and YOURS it will become!WHY OUR LINEN IS SO AMAZING?Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. Also, we use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.🎁 READY AS A GIFTA linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.randed card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Green;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUS CA King + Standard pillowcasesDuvet 104x94” / 264x239cm, pillowcases\t20x26” / 51x66cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cmCUSTOM SIZES:If your comforters are a different size than our standards - no worries, just message us with your measurements and we will make you your perfect bedding set. No extra charge💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
    "reviews": [
      "Beautiful bedding, color quality is perfect.  Delivery without problems.  I recommend",
      "Really happy with the linen throw blanket. It's quickly becoming the new favorite around the house.",
      "Beautiful quality and just as described.",
      "Lovely! Love the color, high quality."
    ]
  },
  {
    "productId": "ZrURmqgcqX",
    "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=2e8c84a390a3842e81021efb78371ec0a8a77302%3A1295727796&click_sum=abdbacf3&ref=stl_listing-2",
    "title": "Linen Pillowcase. Linen Pure Pillowcase. Linen Pillow Cover King, Queen, Standard, Euro sizes. Cappuccino linen pillowcover",
    "description": "Pure 100% Linen pillow cover will provide you maximum comfort.Because of linen's natural qualities, you will feel better and sleep deeper.- Price includes 1 Pillowcase- Pillowcase closure type - envelope;- Color: Almon- 100%  Extra Soft Linen ;- Fabric is: Oeko Tex 100 certified;- Made in Lithuania;Match it with almond sheets:https://www.etsy.com/listing/1110228783/linen-sheet-set-2-pillows-in-white-color?click_key=2a2aec771cf355711397c8539c706045b93a164a%3A1110228783&click_sum=fab2cb5a&ga_search_query=sheet%2Bset&ref=shop_items_search_10&frs=1&crt=1&variation1=2319224371And Beige duvet cover:https://www.etsy.com/listing/1071423946/linen-duvet-cover-in-beige-washed-linen?click_key=b88991db21dcd007eb5748e547ab74cc709bf561%3A1071423946&click_sum=5503be5b&ref=shop_home_active_10&frs=1💌SIZE CHART:US Standard 20x26\"US Queen 20x30\"US King 20x36\"US Body 20x54\"US Boudoir 12x16\"US Deco 18x18\"EU Deco Small 30x40 cmEU Deco Square 40x40 cmEU Standard 50x70 cmEU IKEA 50x60 cmEU Square 65x65 cmUK Standard 20x30\"UK Large Square 26x26\"DE Standard 40x80 cmDE King 80x80 cmCustom sizes available - write us a message to find out more.The actual colours may vary slightly because every computer monitor has a different capability to display colours.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: this shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems.",
    "reviews": [
      "Really happy with the linen throw blanket. It's quickly becoming the new favorite around the house.",
      "Beautiful quality and just as described.",
      "Lovely! Love the color, high quality.",
      "Love it -- such nice quality"
    ]
  },
  {
    "productId": "RdIEYlewQl",
    "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=25e54bf9b762d49e8b6651ef3de9ece1312d8bbb%3A1066602418&click_sum=8159b3bf&ref=stl_listing-3",
    "title": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes",
    "description": "Airy and lightweight, SAUTHS linen bedding is all about the effortless luxury we love to embrace. Our OEKO-TEX certified linen( this means that it is made free of harmful chemicals and is safe for human use) duvet covers are also incredibly durable, and their texture – can you believe it? – only improves with time.Top-quality European linen outperforms all other materials and makes all our products naturally strong, lustrous, and durable. Our products are organic and fully biodegradable.The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance.Pre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting.We accept CUSTOM ORDERS, so if you haven't found the size needed, let us know!🎁 Linen bedding can be the perfect gift for your beloved one and we will beautifully pack it for you, just give it as a note. Personalized Gift messages are available on our branded card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Cinnamon;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have a pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
    "reviews": [
      "Great quality and color, feels incredible.  Thank you!",
      "Really happy with the linen throw blanket. It's quickly becoming the new favorite around the house."
    ]
  },
  {
    "productId": "cMEpSycRfK",
    "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=e87754ed665cac6185cb2b70a2fbbabee46555ab%3A576508683&click_sum=02bb0a07&ref=stl_listing-1",
    "title": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - INTERIOR II -",
    "description": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life.- INTERIOR II -This print is available in three optional sizes:A4 - 9” x 12” (21 x 29.7 cm)A3 - 11.7\" x 16.5\" (29.7 x 42 cm)A2 - 16.5\" x 23.4\" (42 x 59.4 cm)Each print is signed and including a white border for framing.Important note: The frame is not includedThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.",
    "reviews": [
      "Im Happy\nAnd very good",
      "Love this print, so happy I was able to find it again!",
      "Gorgeous necklace and beautiful packaging. Delivery was speedy! Thank you.",
      "Good design! Even the box was cute!!"
    ]
  },
  {
    "productId": "cGsMuBUGZv",
    "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=9a377e301fc36d7d7cac47afa6d877c9588fe8a9%3A834853057&click_sum=20dbb497&ref=stl_listing-2&sts=1",
    "title": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable",
    "description": "Mid Century Modern, Fine Art Prints, Contemporary Art Prints, Abstract Art Style, Mid Century Poster, Midcentury Art Print, Abstract Print File, Fine Art Print For Sale Online, Entrance Wall Art, Apartment Wall Decor, Printable Guest Room, Printable Women Gift, Downloadable Art Prints._________________________________________________________THIS IS A DIGITAL DOWNLOAD, originated from Kala's original painting. Perfect for your home or office decor. Instant download and easy to print, without paying the shipping fee.Your order will consist of TWO high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7.This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.Upon purchase of this listing, Etsy will immediately provide you with a link to your download. Click on the link to download the file and save it to your computer! It’s that simple! You can print the artwork at your local printing center or by using online printing services.KINDLY NOTE:No physical product will be shipped and the frame is not included. Colors may vary slightly due to different color monitors and/or your printer or printing company's settings.TERMS & CONDITIONS:The images that are being provided to you are licensed copies for any reasonable PERSONAL PURPOSES, including but not limited to: printing, copying, emailing, and web publishing.Your license does not include use that results in financial gain, including but not limited to: advertising, stock photography, print sale profits, or resale of any nature.IMPORTANT:- Please do not! Share or sell digital files or printed versions via any online or physical channel.- I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.For a much bigger size than this, I only sell the limited edition original painting, both on high-quality paper (Fedrigoni Paper or Hahnemuehle Paper) or on canvas, and the size is according to your preference. To discuss for a custom abstract original painting like this, please contact me through email:  kalamasa.gallery [!at] gmail.comThank you for your purchase, It will surely help me as a small artist to keep creating and growing.CLICK here for similar individual art print:https://www.etsy.com/listing/833978801/abstract-green-prints-minimalist?ref=shop_home_active_16https://www.etsy.com/listing/833958685/abstract-emerald-green-prints-emerald?ref=shop_home_active_15https://www.etsy.com/listing/833971655/abstract-green-prints-emerald-green?ref=shop_home_active_14https://www.etsy.com/listing/833944255/abstract-botanical-prints-emerald-green?ref=shop_home_active_13CLICK here for the similar set of 2 prints option:https://www.etsy.com/listing/834855825/emerald-green-print-set-abstract-art?ref=shop_home_active_19&crt=1CLICK here for the similar set of 3 prints option:https://www.etsy.com/listing/830353484/emerald-green-wall-art-set-of-3-prints?ref=shop_home_active_4Please visit my main SHOP to see what is new and exciting!https://www.etsy.com/shop/KALAMASArtgallery",
    "reviews": [
      "love em, they're lovely, thanks",
      "thank you for your support. Glad you like my Abstract mountain art print. Happy decorating!",
      "Beautiful digital download!  I printed and framed mine and they’re perfect for my living room!",
      "Thank you for purchasing my Abstract Landscape National Park Print. Glad you really like it. Thanks for the support! 🫶🏽"
    ]
  },
  {
    "productId": "LuUJfsxKMO",
    "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=537491880fab15bc7d04f151e40fd31d5c9e2590%3A991191051&click_sum=89852432&ref=stl_listing-3",
    "title": "Dip dye tapestry, Ombre wall art, Macrame dip dye, Dip dye decor, Dip dye wall hanging, Green wall hanging, Green Décor, Boho wall hanging",
    "description": "ALL  A B O U T ...This is a made-to-order tapestry, please allow 2-3 weeks for it to be made and shipped.This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel.•\tThis piece is a made to order item, so feel free to contact me if you would like to order this piece in a different size or colour.•\tEach wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.•\tPlease note slight colour variations may occur.D I M E N S I O N S…Height 120cmWidth 90cmF O L L O W  U S  O N   S O C I A L   M E D I A…https://www.instagram.com/bourneandthread/https://www.pinterest.co.uk/bourneandthread/https://www.etsy.com/uk/shop/bourneandthreadA N D  F I N A L L Y…If you have any questions about the item, just click the 'Ask a question' button next to the price and I will get right back to you.I hope you love your wall hanging as much as I love making it for you.From my loving home to yours …Much Love xThis is an original design © bourneandthread 2019. All rights reserved.",
    "reviews": [
      "I am so happy with my purchase, perfect addition to my tall ceilings in the living room! Shipping to the US was a breeze and arrived earlier than anticipated.",
      "I looked everywhere for something that would fit on one of the walls in my bedroom. After a year of searching, I finally found it. It is more beautiful in person. It goes really well with the green wall on the other side. I just love it. The whole experience was great. Thank you!",
      "Haven’t yet been able to hang it, but it looks like the photo and is solid quality.",
      "I haven’t had the chance to hang it yet but it’s a beautiful work of art! Great quality!"
    ]
  },
  {
    "productId": "iSFqoxnQvt",
    "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=89dd3b2faa1ecaa79386a47c51c839cd946226da%3A774551709&click_sum=f42d887e&ref=stl_listing-1&sts=1",
    "title": "Bubble Cube Shaped Candle, Home Decor, Custom candle, Soy Beeswax, Housewarming gift, Air freshener, Handmade Gift, Mother's Day Gift",
    "description": "HANDMADE! MADE TO ORDER!❤REMINDER❤Do you like a \"Bubble Cup\" in the video?  It is beautiful because of its specialty, that's why it needs your more careful treatment. The correct burning way can bring you a wonderful burning experience! An inappropriate burning way may cause a large amount of wax to flow out.  PLEASE READ THE BURNING TIPS BELOW, or you can find them on the Thank You card in your package.❤THE CORRECT WAY TO BURN YOUR \"BUBBLE\" TO AVOID MESS!!!❤❤ Keep away from drafty areas.❤ Always keep your \"Bubble\" on a dish.❤ Before lighting, please trim the wick to 1/8\"-1/4\" and center it.❤ ❤ ❤VERY IMPORTANT: DO NOT BURN IT FOR MORE THAN 2 HOURS AT A TIME!!!❤❤❤Material: Natural Soy Wax, Pure White Beeswax, Candle Dyed, Cotton WickColor: Ivory (undyed), Gray, Dark Gray, Light Brown, Dusty RoseScent: Unscented, High Tide, Pink Sugar Crystals, Magnolia Peony, Pine ForestDimension: 2 3/8\" H,  2 3/8\" WMade in the USAThe super unique bubble-shaped candle is perfect for home decor, gifts! Light up your life and warm the people you love！We use high-quality, pure soy wax and blended it with white beeswax. When it is burning, the aroma released is healthy and environmentally friendly.  We offer different scents for you. Hope the following scents introduction below can help you to choose your favorite scent. Each one is hand-poured the moment you place your order.***Scent***❤High Tide❤Immerse yourself in the aromas of waves crashing onto a rocky coastline with a storm brewing in the distance. The churn of the sea, wrapping the water, sand, and salt together into a clean and ozonic scent. Top notes of lemon, orange, and fresh ozone give way to a heart of briny sea salt and a hint of jasmine. Powder and light musk balance the woody violet and cedar in the base. It is infused with natural essential oils, including cedarwood, orange, and elemi.Top: Ozone, CitrusMiddle: Sea Salt, JasmineBase: Violet, Cedar, Powder, Light Musk❤Pink Sugar Crystals❤A sweetly sophisticated take on a cotton candy fragrance. This sugary scent is enhanced by fruity notes of strawberry, raspberry, and black currant, while base notes of tonka, vanilla, and a hint of light musk keep this ultra-sweet scent grounded.Top: Black Currant, Strawberry, RaspberryMiddle: Sugar, FreesiaBase: Tonka, Vanilla, Light Musk❤Magnolia Peony❤Top: Cherry blossom, BergamotMiddle: Magnolia, Peony, Green Leaves, FreesiaBase: Amber, Powder❤Pine Forest❤Top: Eucalyptus, MintMiddle: Cypress, PineBase: Smoke, Tonka Bean❤Moonflower❤Top: Agave, PearMiddle: Cherry Blossom, Rose, MarineBase: Amber, Dark Musk, Powder***NOTICE***Each one is handmade and wrapped by hand, and due to the nature of this, they may vary slightly, some small imperfections may be present, which does not affect the use.***ABOUT SHIPPING***Made just for you. Candles take 3-5 business days to make. Ready to ship in 1 week.***BURNING INSTRUCTIONS***1. THE MOST IMPORTANT TIP: ALWAYS KEEP IT AWAY FROM DRAFTY AREAS & ALWAYS STAY STRAIGHT!2. WICK CARE: Before lighting, please trim the wick to 1/8\"-1/4\" and center it. Once the wick is too long or not centered during burning, please extinguish the flame in time, trim the wick, and center it.3. BURNING TIME: For regular candles, do not burn them for more than 4 hours at a time. For irregular candles, we recommend not burning more than 2 hours at a time.4. FOR SAFETY: Always keep the candle on a heat-safe plate or a candle holder. Keep away from combustible materials/things. Do not leave lighted candles in unattended places and out of the reach of pets or children.***ABOUT BULK PURCHASE***Wholesale quantities and prices are also available on request. If you have any questions feel free to contact me.Thank you!",
    "reviews": [
      "These candies are very pretty and unique. The case well-packaged. No imperfections in the wax. They’re exactly what I wanted.",
      "Have bought from this shop multiple times now. Quality product, beautiful packaging, brand is on point. I highly recommend!",
      "Great quality! Super cute and smells wonderful!",
      "Great product exactly as described"
    ]
  },
  {
    "productId": "pXtsiEVWMs",
    "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=f375963ae83beb6383c44fe416d0e93ab8691d07%3A785763623&click_sum=839a6608&ref=stl_listing-2",
    "title": "PALO SANTO - 8 oz Soy Candle - Hand-Poured - Candlefolk",
    "description": "PALO SANTOPeruvian palo santo wood blended with top notes of neroli and saffron - this rich and woody scent also has hints of cedarwood, amber, and moss.Top: Neroli, SaffronMiddle: Cedarwood, Palo SantoBase: Amber, MossABOUT OUR SOY CANDLESHand-poured in small batches, made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks.All of our candles are made, packaged, and shipped from our New York Studio.BURN TIMEThis candle will burn for approximately 45-50 hours.CANDLE CAREOn the first burn, allow the melt pool to reach the edges of the metal tin.This will help to prevent tunneling and give your candle a nice even burn. Trim the wick to about 1/4\" before each use.---------------------------------------------------------------------------------------------------------CONNECT WITH USInstagram: www.instagram.com/candlefolkcoFacebook: CandlefolkTwitter: @candlefolkco",
    "reviews": [
      "I use these candles on a warmer plate instead of burning, and they last a long time. This one smells very earthy and masculine without being overpowering.",
      "Wonderful customer service and my candles smell amazing! Thank you!",
      "Fast shipping.  Nice quality candle. Smells terrific!"
    ]
  },
  {
    "productId": "FuCCpEHIeP",
    "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=28c8e9a0bfbc67aae9bcdc4f179e0b5ef43b6ba7%3A879866486&click_sum=5cf5beff&ref=stl_listing-3&sts=1",
    "title": "HINOKI Essential Oil Candle ///  Grapefruit, Hinoki, Cypress",
    "description": "HINOKI :  100% Natural Soy + Essential Oil CandleCypress / Hinoki / GrapefruitThe scent of fresh mountain air.A cloud of cool mist, rolling through old-growth forests.The clean aroma of Japanese Cypress and dry Cedar,washed clean in a bath of sparkling Pink Grapefruit,create an atmosphere of clarity and tranquility.Use for:  Clarity and Awareness ( see below )+ 100% Natural+ Scented exclusively with essential oils+ 8 oz  /  up to 50 hr+ Vegan+ USA Made Vessel+ Hand-poured in Rhode Island+ 3.5\" high x 2.5\" wide---- Folklore ----The Tree of PurityOnce worshiped as a symbol of the sun goddess, The Hinoki tree has been revered as sacred in Japan for centuries. An emblem of purity and grace, the timber of the fragrant wood has been a traditionally used to build the most sacred of places; shrines and temples.Still used in many Shinto ceremonies today, Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.Uniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.",
    "reviews": [
      "Always a pleasure doing business with this shop..\nThey are truly amazing on all counts!\nLove & Light…",
      "This candle scents the upstairs & downstairs at the same time & smells amazing ~ thank you!",
      "Excellent, as described and love the scent! Looking forward to purchasing more in the near future,",
      "I am a huge fan of Muzi brand!\nHighest quality, excellent service, I can not say enough about the care and love that goes into each product..\n\nGrateful…\nPeace Profound,\nDenise"
    ]
  },
  {
    "productId": "gVHTtEcHxu",
    "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=72f8980b430ffdc539267b26e424e22381b7c4d4%3A570862928&click_sum=2b329283&ref=stl_listing-1&sts=1",
    "title": "Small Wooden Stool, Scandinavian decor side table Short Wooden Stool, Scandinavian Stool, Wood Plant Stool, Walnut stool,Midcentury home",
    "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.STOOL DETAILS⚬ COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or BlackWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.⚬ Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.⚬ Finished with a natural hard wax oil.⚬ Weight limit is 120kg⚬ You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.⚬ Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.⚬ Easy to assemble in 5 minutes.STOOL DIMENSIONS⚬ Seat diameter: 32 cm (12.59\")⚬ Height: 41 cm (16.14\")IMPORTANTYou have three way to see our stains:⚬ Third photo shows our samples of colors⚬ When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option⚬ You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want",
    "reviews": [
      "LOVE this stool! Solid quality and gorgeous stain",
      "Simple, well made, nice finish, stylish and solid, and it arrived with home made fudge, too. Easy to assemble, arrived in perfect condition, too. Great product, great value.",
      "really nice stool, shipped on time!",
      "Very cute, exactly as pictured."
    ]
  },
  {
    "productId": "MhkeRxWGoM",
    "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=ad49ac18924f04d5bcbe0568a447071a045f1240%3A793579884&click_sum=f5151a0f&ref=stl_listing-2",
    "title": "Cork Stools, Home & Living, Bedroom, Living room, Eco-friendly, Home Decor",
    "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.The stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.This collection combines the use of a natural material and simple forms.Collection: Furniture CollectionMaterial: Natural CorkDimensions:Cork stool #1 - Ø 30 x H 39 cmCork stool #2 - Ø 32 x H 45 cmYear: 2020Care instructionsYou should:> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;You should not:>clean it with any type of chemical and abrasive product;> place hot or sharp objects on the surfaces;> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years;",
    "reviews": [
      "Perfect for my Eames lounge",
      "Great product, great design, great customer service\nThank you Mariana",
      "The cutest bowl!! So beautifully made & adds the perfect touch to my kitchen! Will be buying again from this shop!"
    ]
  },
  {
    "productId": "UyTtcwswal",
    "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=f77ba6d3a671595059911d4a88e7b742ce4004f4%3A1198929077&click_sum=6b4d7b98&ref=stl_listing-3",
    "title": "Bonnet Wood Stool (Golden Yellow) | Scandinavian Design | Excellent for Plants and Seating",
    "description": "The Bonnet Stool is a hardy, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand and will look dynamite in combination with just about any thoughtfully decorated space.  It is Handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels.  The Bonnet Stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow.  It's available in two sizes and a variety of colors.  Also, feel free to reach out for custom colors and sizes either through our Etsy store or through email at  info [!at] whalecreek.co.",
    "reviews": [
      "This is the second one of these I purchased. I really like the look and feel of this item and would highly recommend it.",
      "Good quality and attractive design",
      "Set of 3, custom sizes and a custom color. PERFECT. Super sturdy, well finished… even the packaging was perfect - brown paper padding. The cardboard box was extra heavy and wisely taped so it arrived without a scratch. With all my customizations they were delivered in just a couple of weeks. Highly recommend!"
    ]
  },
  {
    "productId": "Dyv6hSsJFW",
    "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=79eaedb1d3461c15080dda471887639e8953fefa%3A865339439&click_sum=4b75e813&ref=stl_listing-1&sts=1",
    "title": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
    "description": "The Coiled was designed to dress your plants in style, just like the owner! Our planters will modernize and bring out the beauty of your plants. \"The Coiled\" exudes a bauhaus/Japanese cool!They all come with a drainage hole and 3 little \"feet\". If you prefer not to have the hole or feet, please leave me a note.Sizes (Inside diameter and all measurements are approximate):2.5\" diameter x 2.25\" tall (6.4 cm x 5.7 cm) (fits standard 2 inch pots)4.18\" diameter x 3.75\" tall (10.6 cm x 9.5 cm) (fits standard 4 inch pots) (video shown in this size)6.18\" diameter x 5.4\" tall (15.7 cm x 13.7 cm) (fits standard 6 inch pots)The colors come in a matte or sheen finish. This listing is for the matte finish colors only. You can find the sheen finish colors in my other listings. I have 2 blacks: the matte black is a soft non-reflective finish while the sheen black has a slight shine to it and a darker black finish. The white and light grey is a sheen finish but appears matte.All products are 3D printed out of a plant based bioplastic eco-friendly material. The natural wood and black wood matte finish is mixed with real recycled wood. They're all lightweight, durable and won't break if you accidentally drop them!*Free domestic shipping on orders $35 and more.*International customers contact us for a $20 discount code on orders over $150!*3D printed, sustainable and eco-friendly.*Design is original to Morse Studio Co.*Follow us on Instagram @morsestudioco for all the latest news and specials!",
    "reviews": [
      "This was a gift and she loved it!",
      "Small planter, but cute and nice",
      "I purchased this as a gift for a friend and she loved it! It arrived really quickly, too.",
      "Super cute and exactly as described!"
    ]
  },
  {
    "productId": "lyUkGtRRMA",
    "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=fa38c6c790c419b886b1b7789b1c61035f01a2c5%3A728731403&click_sum=c5bbe507&ref=stl_listing-2",
    "title": "Nude Pink and Brass Metal Floor Planter / Metal Plant Pot / Brass Planter Stand / Gold and Pink",
    "description": "MATERIALS: Brass, Aluminium with Static PaintCOLOR: Nude PinkDIMENSIONS:Pot Diameter: 20cm ,  Height (total): 30cm,  Brass Stand Height: 18cmGlobe Planter is now suitable for all house plants with its maxi size! Especially for the ones who like facing the sun... As being able to rotate to any direction on its brass stand, Globe Planter lets you to adjust your plants position easily. And it can now be placed on the floor with longer and spreading plants.With the perforated seperator inside, excessive water is collected at the bottom not to harm the roots. Plants can also be placed with their pots inside Globe Planter. In that case the seperator functions as a platform for your your pot.* The plants in photographs are for visual. They're not included in the product.--SHIPPING:We only ship with Express Shipping worldwide. Please check the dates with us if you are shopping for an anniversary or a special date and we’ll make sure that your shipment arrives timely.IMPORT FEES:*USA orders are free of import charges up to 800$ total of purchase.*For EU orders, VAT is collected at checkout by ETSY and no import charges apply at delivery below 150€.Please beware that import fees may occur on international shipments according to your government's customs regulations. Buyers are responsible for local taxes and customs fees that may apply.--",
    "reviews": [
      "Customer service and delivery was quick.",
      "Such a sweet planter! Make sure to check the dimensions. I thought it would be larger but I had miscalculated the dimensions. It is really more for table top than floor.",
      "Really cute! I like that you can adjust the pot on the base and LOVE that it has a drain insert.",
      "Arrived quickly and is super cute. Got it for my sister and she loves it."
    ]
  },
  {
    "productId": "AfUZaedfGX",
    "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=6c82fe82721e65ca169172bb56335ded416f729b%3A1435558019&click_sum=2a0ef4d1&ref=stl_listing-3",
    "title": "Tile Pattern Ceramic Planter / Small Indoor Planter / Cactus Plant Pot / Succulent Plant Pot",
    "description": "THIS PIECE IS MADE TO ORDER AND WILL SHIP IN 2-3 WEEKS.Stoneware planter with hand carved details in a bright red and pink combo. Perfect size for a small cactus or succulent.  Small hole in bottom of pot for water drainage.Approx 2.5” height x 3” diameter",
    "reviews": [
      "This is my favourite mug. I use it everyday! It is the perfect size, the handle is really comfortable, and it's so pretty!!",
      "Love the mug it's very well made"
    ]
  },
  {
    "productId": "OxTu1sX3eK",
    "url": "https://www.etsy.com/listing/264013568/personalized-engraved-working-compass?click_key=0904e1d75e2a112e460a5760e8a7440a0138185a%3A264013568&click_sum=ad7b3241&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-1&pro=1&frs=1&sts=1",
    "title": "Personalized Engraved Working Compass with Custom Handwriting, Gift for Men Anniversary, Gifts for Dad Birthday",
    "description": "Personalized Engraved Working Compass with Custom Handwriting, Gift for Men Anniversary, Gifts for Dad Birthday.This custom engraved compass made from top quality solid brass, and durable for outdoor use.If you want to find other \"engraved compasses\" please click this link!https://www.etsy.com/shop/SFdizayn?ref=seller-platform-mcnav§ion_id=16459965Diameter: 1.96 inchMaterial: BrassChain: Comes with the same chain as in the listing picturesCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.Engraving: We can engrave whatever you want and we can use every font that you want.This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband gift, boyfriend gift, valentines day gift, fathers day gift, birthday gift, groomsmen gift, and anniversary gift. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.*IMPORTANT MESSAGE ABOUT DELIVERY and TURNAROUND TIMEIf you add your phone number to your order notes; delivery would be faster than usual.Turnaround time is 1 business day and I ship your order in 1 day after your purchase. You can choose the Express delivery method at checkout.* HOW TO SEND YOUR ENGRAVING INSTRUCTIONSPlease put all your engraving instructions for each side in the '' add your personalization '' box on the product page. For example:Front side: abc...Inside: xyz...Leather pouch: klm...If you want me to engrave an image or images; please attach the image to the ETSY message box ( conversation box ) after your purchase.For handwriting engraving; please use white unlined ( blank ) paper with a black pen and take a picture of the paper. After your purchase please attach the image of your handwriting via the conversation box. Just send us a message.We can engrave one of the same mountain, lake, river, wave, waterfall, sun, and stars design as in our listing pictures or we can engrave your own design.",
    "reviews": [
      "I order this for my boyfriend as a valentines gift.\nThe quality of it was amazing.\nI was a bit concerned after I realized it was coming from overseas, not sure if I was going to get what I saw in the description and also on the picture’s…\nI was blown away… it was incredible… I loved it. And my boyfriend was extremely happy with the surprised…\nI will recommend anyone to buy it and I will look at the rest of the items this selles has!\nThank you so much for making our memories even more memorable 😊",
      "Great product & a reliable    delivery service !",
      "Just as described and pictured was shocked at the fast turnaround time. Well worth the cost!"
    ]
  },
  {
    "productId": "aqODxAMjcB",
    "url": "https://www.etsy.com/listing/385848388/personalized-printed-wood-family-name?click_key=0f155ee89234aea6eab6fd936a7ef8f729610e8b%3A385848388&click_sum=51ba4186&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-2&pro=1&frs=1&sts=1",
    "title": "Personalized Printed Wood Family Name Sign With Established Date And State Shape Design 16x20",
    "description": "Enhance your home's personal style with this gorgeous Personalized Printed Wood Family Name Sign. This custom-made wall art piece features your family name printed in a sophisticated font on high-quality wooden plaque, creating a unique and timeless addition to your décor.This personalized family name sign makes for a perfect gift for new homeowners, newlyweds, or for those looking to commemorate a family name. The sign is easy to hang and versatile, making it suitable for a variety of rooms including living rooms, dining rooms, family rooms and more.Each sign is meticulously crafted with the utmost care and attention to detail, ensuring both its beauty and durability. With its natural wooden grain, this sign adds a touch of rustic charm to your home. Boost your home's décor and order your Personalized Printed Wood Family Name Sign today!***ITEM DETAILS***- This sign measures 16\"x 20\" and will be 1/2\" thick.- The text and designs are printed directly onto the wood.  No decals are used, ensuring that your sign will not peel, chip, or fade.- Includes a saw tooth hanger on the back for easy hanging.- The wood background is a printed design and not real wood slats.- Handmade in our family owned business in Indiana.- This sign is meant for indoor use only.***SHIPPING***Most items from our shop ship in as little as 2-3 business days but please check the Shipping Policies on each listing to get an estimated delivery date.  If you have a specific date that you need the sign for, please let us know and we will do whatever we can to hurry the process.  Shipping will be via UPS or USPS from Indiana.***EXTRAS***To add gift wrapping to your order, please go here:www.etsy.com/listing/153227124***SHOP POLICIES***https://www.etsy.com/shop/mrcwoodproducts/policy***SEE OUR OTHER PRODUCTS***ETSY -http://www.mrcwoodproducts.etsy.comFACEBOOK - http://www.facebook.com/mrcwoodproducts",
    "reviews": [
      "Amazing gift for sister in law!",
      "I ordered this for my friends who I’ll be marrying in a few months. Ordering was seamless and delivered on time. Great quality and met all my expectations. I even added I requested for bees to the end of their name and it came out amazing!",
      "My Sister could not wait to hang this in her house!! It was PERFECT",
      "We love it!! 😍 it’s beautiful now I need to figure out where to hang it!"
    ]
  },
  {
    "productId": "gdTPOsPcUK",
    "url": "https://www.etsy.com/listing/256801592/personalized-driftwood-sign-longitude?click_key=ed5b4458bbe4d2db5f21627f7d8605bc24aacc91%3A256801592&click_sum=286851fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-3&frs=1&etp=1&sts=1",
    "title": "Personalized Driftwood Sign Longitude Latitude Custom Coordinates Housewarming Valentine gift new home anniversary coastal beach house decor",
    "description": "**Order by 2/6 for Valentine’s Day delivery!** This personalized coordinate sign is hand engraved on a unique piece of driftwood and is drilled and strung with durable twine for hanging. In addition to your custom coordinates, your personalized sign includes an engraved arrow compass. If you would prefer an alternate image, please specify.FORMAT OPTIONSDecimal Degree:  41.8781° N, 87.6297° WLat Long: 41.8781, -87.6297GPS: 41° 52' 41.21'' N, 87° 37' 47.27'' WIf you do not specify your format preference, we will engrave the Decimal Degree format.**PLEASE NOTE**:  If you have a preference for a certain size, shape or color of driftwood based on photos within our shop, please let us know and we'll do our best to use materials similar to your preferences. We are limited to the driftwood and sizes we have available and cannot guarantee availability of preferences. Also, please remember, part of what makes our artwork so special is that no two pieces of wood are the same, and so everything is one of a kind.A custom GPS coordinate sign is a unique gift and perfect for any home. Makes a great housewarming gift, wedding gift, Christmas gift, anniversary gift, or gift for the family with a cottage, lake house, shore house, cabin, or beach house.Multiple size options are available in the drop down menu and we also offer:---Rare & Extra Large Driftwood Signs:https://www.etsy.com/listing/498496884/rare-ancient-old-growth-driftwood-sign---Two Tier Driftwood Signs:https://www.etsy.com/listing/278932176/two-tier-longitude-latitude-sign-customCheck out our shop to view other options and arrangements:http://destinationtree.etsy.com/Don't see the size or configuration you're looking for? Please contact us with any special requests or questions and we would be happy to provide a custom quote.",
    "reviews": [
      "Beautiful piece! Grateful to have found this shop for the holidays! Highly recommend for unique and personalized gift giving!",
      "Simple stylish and absolutely perfect",
      "Excellent communication and help on making this custom order exactly what I was hoping for!",
      "We love our new sign! It looks fantastic and the interaction and customer service was great. We had a small issue with our sign when we received it and it was handled quickly and excellently and we will likely be purchasing more of these!!"
    ]
  },
  {
    "productId": "ROgjfpZqhr",
    "url": "https://www.etsy.com/listing/512748060/large-piggy-bank-black-white-piggy-bank?click_key=45b429c1570f76883d531f60910d2be1386223f8%3A512748060&click_sum=22c2be1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-4&pro=1",
    "title": "Large Piggy Bank, Black & White Piggy Bank, Ceramic Piggy Bank, Modern Piggy Bank, Personalized Piggy Bank, Christmas Gift, Desk Accessory",
    "description": "Large Black & White Ceramic Modern Personalized Piggy Bank, Christmas Gift, Desk Accessory---------------------------------------------------------------------------Pigz is a big, designed, and practical piggy bank.The space is illuminated by its colorful and fine presence. Its hug is round and chubby.It is just the right size to fill your dresser's empty surface. In the living room.  Near the computer. On a shelf in the nursery.DIMENSIONS:✦PIGZ 1 - Original Size8\"x8\"x6\" / 18*18*14 cm approx✦PIGZ 2 - Mini Size5\"x5\"x4\" / 13*13*12 cm approx✦The piggy is much lighter than you think (only 27 Oz /  14 OZ , 768 gr / 400 gr)MATERIALS:✦ Made out of double burned ceramic to ensure quality.✦ Extra glaze finish (glossy or matte).✦ Wooden snout (white maple or beech) is durable and easy to pull out.COLORS:White matteBlack mattePink MatteYellow glossyTurquoise glossyPERSONALIZATION:For a personalized piggy bank or cork, please follow this link:www.etsy.com/listing/1591491833MORE DETAILS:✦ Packed in a gift box that protects the item from breaking.✦ Handmade in Tel Aviv within 1-2 weeks.✦ Worldwide shipping.-----------------------------------------------------------------------------Want to see my new funky teddy bank design?https://www.etsy.com/listing/1100141041Are you looking for more unique home and office decor pieces?Back to our shop:https://www.etsy.com/shop/PIGZstore",
    "reviews": [
      "Item is so cute, love the matte black. Perfect for my 3yr old.",
      "First bank arrived broken but a replacement was sent immediately. Great customer service. This bank is for our grandson. It is adorable!!  Perfect size!!",
      "Looks exacting like photo and fast delivery time."
    ]
  },
  {
    "productId": "FgCNewIOfB",
    "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=d72a52ceab3decaaa5fb5164a9dc6da3f8841b61%3A214526797&click_sum=8c47a93f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-5&pro=1&frs=1&sts=1",
    "title": "Engraved Compass, Personalized Gifts for Men, Custom Working Compass, Handwriting Engraving, Anniversary Gift for Him",
    "description": "Engraved Compass, Personalized Gifts for Men, Custom Working Compass, Handwriting Engraving, Anniversary Gift for HimThis custom engraved made from top quality solid brass, and durable for outdoor use.Checkout my other compasses!https://www.etsy.com/shop/SFdizayn?ref=seller-platform-mcnav§ion_id=16459965Diameter: 1.96 inchMaterial: BrassChain: Comes with the same chain as in the listing picturesCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.Engraving: We can engrave whatever you want and we can use every font that you want.This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.*IMPORTANT MESSAGE ABOUT DELIVERY and TURNAROUND TIMEIf you add your phone number to your order notes; delivery would be faster than usual.Turnaround time is 1 business day and I ship your order in 1 day after your purchase. You can choose the Express delivery method at checkout.* HOW TO SEND YOUR ENGRAVING INSTRUCTIONSPlease put all your engraving instructions for each side in the '' add your personalization '' box on the product page. For example:Front side: abc...Inside: xyz...Leather pouch: klm...If you want me to engrave an image or images; please attach the image to the ETSY message box ( conversation box ) after your purchase.For handwriting engraving; please use white unlined ( blank ) paper with a black pen and take a picture of the paper. After your purchase please attach the image of your handwriting via the conversation box. Just send us a message.We can engrave one of the same mountain, lake, river, wave, waterfall, sun, and stars design as in our listing pictures or we can engrave your own design.",
    "reviews": [
      "It is even more beautiful than I imagined!",
      "Gift for my son. Says it’s nice I haven’t seen it yet  was shipped to him",
      "Beautiful Christmas gift for my husband as our first Christmas husband and wife",
      "Amazing, my nephew loved it."
    ]
  },
  {
    "productId": "vBrrb9GheB",
    "url": "https://www.etsy.com/listing/523854497/giant-wall-hanging-poppy-set-of-3-red?click_key=a72ceed10513ab10499c1339cb25983666a08ada%3A523854497&click_sum=a9ea3e74&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-6&frs=1&etp=1",
    "title": "Giant Wall Hanging Poppy Set of 3 Red Metal Flowers - Perfect Wall or Privacy Fence Accent - outdoor metal wall art for your home or garden",
    "description": "This is a set of 3 wall hanging poppies. Each poppy is made from welded plate steel. There are 2 smaller poppies in this set that measure 6 inches wide by 6 inches tall. The large poppy is 12 inches tall and 12 inches wide. Each of these flowers had a small hanger welded to the back so they can be secured using a simple wood screw or nail.I designed these for the privacy fence around my patio. The wood there was plain and I wanted some color. Buy a set and spice up your patio area with some pretty flowers.Also you can get this same set of flowers in other designs if you want. Simply browse my store and look at the flower shapes available. If you find something you like, message me and make a request for a set of wall flowers in the style of your choosing!",
    "reviews": [
      "I love these flowers - quality workmanship in the metal work, design, and color.  As soon as the weather permits, I’ll be hanging them  on my shed, I can’t wait.  I know they will add a pop of color and look beautiful on the wall.",
      "I just love them...attached them to my fence and smile every time I see them. I will be getting more!",
      "This is my second order from DC metals. Beautiful work."
    ]
  },
  {
    "productId": "bTaeyIOK9G",
    "url": "https://www.etsy.com/listing/536408395/wedding-marquee-lights-light-up-names?click_key=6d5b901fad6e742d16b200ac0eb8793697fda8a0%3A536408395&click_sum=24e98f90&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-7&etp=1&sts=1",
    "title": "Wedding Marquee Lights | Light up Names | Wedding Lights Decor | 12 Inch Marquee Letter Lights | Personalized Name Light | Light up Letters",
    "description": "Wedding Marquee Lights | Light up Names | Wedding Lights Decor | Marquee Letter LightsPut your name up in lights for your big day! (or bridal shower, baby shower, birthday party, etc.)These modern & contemporary marquee letters are sure to make a statement at your special occasion!Item Details:-White LED Marquee Metal Marquees-Marquees stand 12\" tall-2 openings on the back of each letter so it can be hung up-Available in letters A-Z, numbers and the \"&\" sign-On/Off switch-Cordless-Requires 2 AA batteries (not included)-Indoor use onlyNeed more than 25 marquees? Direct message us for a custom order!Want to see more products? Click below to visit our shop!https://www.etsy.com/shop/savethedatedesignsco/Thank you so much for choosing Save The Date Designs Co!Xo,Ashley",
    "reviews": [
      "I really like these they are very nice",
      "Quick arrival - heavy duty materials, quality.",
      "I love the letters very much!",
      "Great quality. I will use them at the engagement party, shower and wedding."
    ]
  },
  {
    "productId": "gEAmYcGbZA",
    "url": "https://www.etsy.com/listing/491927411/home-sweet-home-custom-christmas?click_key=1d25c6c04961235fa42dd15366c9eb4110050291%3A491927411&click_sum=b7597848&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-8&pro=1&sts=1",
    "title": "Home Sweet Home - Custom Christmas Ornament - House - Family - Housewarming Gift - First - New Home - Hand Stamped - Bronze Skeleton Key",
    "description": "Please read all of my shop's policies and announcements BEFORE making your purchase for imperative information regarding this purchase.Features:• 1 - 3.2\" Skeleton Style Key in your choice of color - Antiqued Bronze, Antiqued Silver or Gunmetal Black• 1 - 1.75\" x 0.375\" Aluminum Rectangle Tag - Brush Finished and Hand Stamped with your Wording of Choice - Choose the option you prefer in the drop down box when ordering - If you choose \"CUSTOM\" Please message me via Easy Conversation to verify the wording will adequately fit the tag Prior to placing your order :)• 1 - 7/8\" Aluminum Heart - Brush Finished and Hand Stamped with your choice of Address - Please provide the Street address in the Personalization Box - No City, State or Zip Code will be Hand-Stamped on the piece - If you would like City/State incorporated please contact me via message to discuss options BEFORE continuing. Some addresses may need to be abbreviated to adequately fit the tag - Ex: 123 Main Street could be abbreviated to 123 Main St - Please mention abbreviations you are okay with in the notes section as well• 1 - Antique Silver Tone House Charm• 1 - 050\" Aluminum Round - Hand-Stamped with your choice of year - Choose the year in the drop down box when ordering• Aluminum Jump Rings• Rustic/Red/Green Bakers Twine• Metal Ornament HookImportant Ordering Information - PLEASE READ :)Each and every letter & number on this piece is hand-stamped by me with my very own two hands. A bit of variation in spacing and depth of letters is to be expected which only contributes to the uniqueness of this handmade custom piece.If you have any questions and or special requests please do not hesitate to contact me via Etsy conversation. Thank you for shopping Amazingly Graced! ❤️",
    "reviews": [
      "Such a great Christmas ornament to celebrate our daughter’s first apartment!",
      "Thought it should be a bit larger, but okay",
      "Beautiful ornament!  Great gift and well made!  Thanks so much!",
      "Great for new home gift! Packaging was lovely and item was as described and customized."
    ]
  },
  {
    "productId": "yeKTpAf5cy",
    "url": "https://www.etsy.com/listing/520505868/outdoor-sign-rot-resistant-wooden-carved?click_key=52699ae507d952736db16f87137dcbde29cce67c%3A520505868&click_sum=79365ce1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-9&etp=1&sts=1",
    "title": "Outdoor Sign, Rot Resistant, Wooden Carved Cabin Sign, Pine Trees, Camp Sign, Weekend Camping, Lakehouse Sign, Cottage Sign, Benchmark Signs",
    "description": "MADE BY THE ACTUAL BENCHMARK SIGNS AND GIFTS!  Whether you would like a cabin sign, address plaque, short sign quote, or welcome sign, Benchmark Signs and Gifts is your one stop shop! All of our signs are made to order and we will personalize it however you would like. We start out with the finest quality lumber and bring each handpicked board to life with our unique carved designs!ORDERING:To place an order, please add to the shopping cart the sign style you would like to purchase. Next, in the \"Optional Notes section,” please let us know EXACTLY how you would like your sign personalized.   Please double-check to make sure the information is correct, as we will personalize the sign EXACTLY as you have indicated.Please keep in mind that wood is a natural item and every piece has unique coloring and wood grain patterns.  Finishes may vary slightly due to the inconsistencies in wood properties and picture lighting.DESIGNS COME AS SHOWN.  PLEASE CONTACT US PRIOR TO ORDERING FOR ADDITIONAL CHARGES FOR YOUR DESIGN CHANGES.  Thank you.Rustic edge signs are hand cut and sizes are approximate and may slightly vary from listed.",
    "reviews": [
      "Work of art. Very pleased",
      "From the initial message with the seller to the order, quick delivery, quality, and beautiful result, I couldn't be happier with the whole experience and product!! Highly recommend!",
      "Very nicely made. Perfect quality",
      "Very pleased it’s beautiful work of art"
    ]
  },
  {
    "productId": "IxbGdUxSSV",
    "url": "https://www.etsy.com/listing/251037170/girlfriend-gift-gift-for-her-unique-gift?click_key=9d28e69e34fd52a9d9f503cae28cad03959011fc%3A251037170&click_sum=d57dc4c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-10&pro=1&sts=1",
    "title": "Girlfriend Gift Gift for Her Unique Gift for Women Bedroom Love Girlfriend Birthday Gift Ideas Gift for Her Romance",
    "description": "Customize Your Magic Box for FREE💘💘💘Enter the message You would like to be projected. Our team will do the rest!🧙We are more than happy to bring to your attention our unique Magic Box. We are able to cut words into the wood, so that the holder can project a custom message on a wall. All you have to do is load the candle that is included in the package into the Magic Box and place it next to a wall in a dark room. Watch how the place will be filled with romantic light and words will be displayed on the wall. Then see the reaction of the people next to you ! 💘💘💘This product is perfect for you if you would like to make a present to a friend, a relative, people you LOVE. For family events, Christmas, St. Valentines, engagements, weddings, birthdays, name days and ALL kinds of emotional events !OUR MAGIC BOX is in the shape of a cuboid. The length of its sides is 12,5x12,5x11,7 centimeters or about 5 inches. It weighs around 0.8 pounds. Having in mind those parameters, please note that we are limited on the number of symbols we can cut on one side in order for the projection to be clear enough.Please, make sure Your message is not longer than three lines, 12 symbols per line.https://www.etsy.com/shop/MagicWoOod#aboutThank you so much for your credence!🙋❓If you have any other questions don`t hesitate to contact us.💘 Favorite our shop for great inspiration & one of a kind gifts💘https://www.etsy.com/shop/MagicWoOodThank you! ❤️Annie & Emmie 👧👧",
    "reviews": [
      "Wife loved it. I like the custom one off aspect. Only problem I had was trying to track the shipping. But it did arrive exactly on time.",
      "Thank You for your review!:) We always attach the tracking number to your order! :)",
      "This is the most darling little gift. I got it for my best friend and it means so much to her. The personalized message makes it extra special. The woodwork is beautiful definitely recommend. ❤️❤️❤️",
      "Thank You so much for your review, Lylah! :))",
      "Was a great Christmas gift",
      "Thank You so much, Courtney! :))",
      "great craftsmanship, absolutely love the guft",
      "Thank You for your review, Jenn! :)"
    ]
  },
  {
    "productId": "cjckmyULoS",
    "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=d31665fb07c3101a018f9dfbcc43f439a3ab1816%3A207134258&click_sum=23d0ed55&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-11&pro=1&frs=1&sts=1",
    "title": "5th Anniversary Gift, Photo on Wood, Picture on Wood, Wood Anniversary Gift, 5 Year Anniversary, Wood Wedding Gift, Custom Wood Burning",
    "description": "If you're searching for the perfect 5th anniversary gift or gift for any other occasion, look no further than our rustic wood photos. A wood anniversary gift is a great, traditional option for your 5th year of marriage. Not only are our custom pictures on wood ideal for anniversaries, but also make perfect gifts for weddings, housewarmings and so much more!ABOUT OUR WOOD PHOTOS:Have your own custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life.Purchasing as a GIFT? Add-on our gift wrapping option and have your custom wood photo wrapped in a natural burlap gift bag -https://www.etsy.com/listing/522661329/burlap-gift-bags-gift-wrapping-add-onDETAILS:• Because this is wood from a real tree, pieces may have knots which we try to place in the best spots possible for the photo provided.• Each piece of wood will vary in wood grain, making each one completely unique.• Several size options available to choose from. Due to the natural characteristics of the product, there may be slight variations of approximately ~0.5\" smaller or larger.• Photos will be cropped around the corners/edges, as this is the only way to fit a rectangular photo onto an oval piece of wood. All important aspects of the photo should not be located along the very edges of the picture.• Horizontal photos will be placed horizontally on the wood & vertical photos will be placed vertically unless otherwise requested.• White ink is not printed on the wood. This allows the natural grain of the wood to show through the photo. Colors of the photo on the wood may vary, as these are printed onto natural wood and not bright white paper.• A clear protective coating is applied over your wood photo to help protect against stains, water and scratching.• All wood photos come with complimentary hardware for hanging. If ordering a stand, hanging hardware is not included.• Stands are not included, but can be purchased separately.• The bark of the wood is not removed from the wood in order to preserve the natural look of our wood photos.• All orders are securely packaged with extra bubble wrap for added protection during shipping.• Made and Handcrafted in Florida, U.S.ACHOOSING YOUR PHOTO:• The better quality the photo, the better the results will be on the wood.• A 300 dpi photo taken in good lighting will give you the best possible print results.• Lower quality photos can be used, but please know that the quality will be the same on the wood.• Extremely dark, blurry, grainy or low-quality photos do not typically transfer well.• We ask that you DO NOT add any text to your photo, due to cropping reasons.ENGRAVINGS:• Looking for a way to make the back of the wood as beautiful as the front? Consider adding on one of our engraving options.• Select from a variety of premade and personalized designs and have them ENGRAVED onto the back of your wood photo.• Scroll through listing photos to see available engraving options.• Our custom text engraving option allows you to have any custom text engraved onto the back of the wood in the font that is shown. There is no character limit, but the longer the text is, the smaller it will be to fit onto the wood.• Our custom handwritten text engraving option allows you to add handwritten text to the back of the wood. For handwritten text, please send us a message through Etsy with an attachment that includes a digital or scanned copy of the handwritten text that you'd like engraved. Handwritten text MUST BE ON A PLAIN PAPER BACKGROUND. Text written on lined paper or paper with background designs will not work. The clearer the text is, the better the engraving will be.• Please keep in mind that because this is real wood, there may be some natural knots/marks on the piece. These may be more noticeable on the back of the wood than on the front, as there is no photo to cover them.HOW TO PLACE AN ORDER:1. Purchase this wood photo listing along with any upgrades that you'd like from the drop-down menus.2. Send us a high-quality digital photo to use through Etsy messages by simply clicking the \"ask a question\" link or \"contact\" link on our shop. You can also click this link:https://www.etsy.com/messages/new?with_id=15274040&referring_id=9226174&referring_type=shop&recipient_id=15274040Attach your photo to the message by clicking on \"attach image\" or the camera button and selecting your desired photo.FULL PRODUCT LINE:View our complete line of products and size options at www.woodphotos.com",
    "reviews": [
      "Beautiful work for my 5th wedding anniversary gift! I know my husband will enjoy it.",
      "Fantastic quality. Wife loved it for our anniversary",
      "Quality wood print that came in looking fantastic, if not a little faded which just adds to the wood aesthetic",
      "The seller was helpful and the item was made and shipped very fast!"
    ]
  },
  {
    "productId": "fOkSjBBsXB",
    "url": "https://www.etsy.com/listing/251651487/10th-anniversary-tin-rose-solid-pure?click_key=72367db3e06d6722226f31dcd47231d365603266%3A251651487&click_sum=c815946c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-12&etp=1&sts=1",
    "title": "10th Anniversary Tin Rose - Solid Pure Casted 100% Tin -  Rose",
    "description": "WE HAVE OFFICES IN UK AND USA - all orders placed from either of those countries will be delivered in 3 days outside of these countries approx 5-10 business daysA lovely new addition to our range is this solid cast tin rose, stunningly designed and crafted and polished to a shine. This is a heavy quality rose and is solid tin, not dipped and not plated.Give your partner a everlasting rose that never dies made from pure tin to mark the 10th wedding anniversary.Head approx 6 cm and stem approx 5-6 inchesCome with either 1 or 2 leaves on the stem depending in the castComes with a free 10th anniversary presentation tin and a little slip inside which explains about tin and why it is given for the 10th anniversary. Include date of manufacture stamp and a tin purity stamp.GREAT AS AN EXTRA GIFT WITH SOMETHING ELSE FROM OUR SHOP.",
    "reviews": [
      "Very timely delivery\nProduct was as shown",
      "Perfect gift for 10 year anniversary",
      "Packages with care. A solid piece."
    ]
  },
  {
    "productId": "SPXiwqgDHc",
    "url": "https://www.etsy.com/listing/170071374/new-home-ornament-housewarming-gift?click_key=25e1790fc2dc54c94cbfcb999d5e07852172c1d6%3A170071374&click_sum=e53d6cf9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-13&etp=1&sts=1",
    "title": "New Home Ornament, Housewarming gift, hostess gift, realtor, New House, Address Key, personalized, First Christmas, Home Sweet Home",
    "description": "THE DETAILS:Commemorate your first Holiday in your new home with this custom ornament...Each key is a very lightweight metal which is 3 1/8 inch long.  The tag is approximately 2 inches and hand-stamped, expect subtle differences in spacing, depth and alignment of text. Please see photos for examples.You can choose from several ribbons or cord to complete your ornament.Please leave house number and street ONLY.  City and state are not available on this item.  *House number and street name only!!I will work with your custom address and may or may not abbreviate common terms (ie st., ave., blvd. etc.) as necessary and based on artistic license as to how your address best formats on the tag.Item is hand-stamped to order. Hand-stamping is done one character at a time; as such, please expect differences in depth, alignment and spacing. No two pieces will look exactly alike.**if you leave additional information, it WILL NOT be added to your tag.  Your tag WILL include HOUSE NUMBER and STREET NAME and YEAR only.  Year is on the back of the tag.-If you would like a year other than 2024, please leave that in the 'note to seller' box at checkout.  If a year is not indicated, 2024 will be the default year. You MUST INDICATE IF YOU DO NOT WANT THE YEAR ON THE TAG. As stated above, if you don’t leave a note about the year, 2024 will be ON THE BACK OF THE TAG!-Item will be sent packaged in a white ORGANZA BAG appropriate for gifting.  No invoice will be included unless a specific request is made to send printed invoice.FAQsIs this item engraved?No, it is handstamped, a process that involves no machines, only a hammer, steel block and sets of metal stamps.  Each item is stamped to order.  It will no look engraved, because it is not engraved.  Expect it to look handstamped ie subtle differences in alignment, spacing and depth of stamping, including the occasional 'wonky' letter or number.  The letters will NOT be perfectly lined up.  If that is not your style, this is not your ornament :)Can I add text to the back?The back will have year only.  If you wish to add additional information, you can order an additional tag that can be attached to the key.  Here is the link to that listing:https://www.etsy.com/listing/491927875/address-tag-christmas-ornament-1st-home?click_key=3f6e1510665c2183e2ca3cc0227b989187caffd1%3A491927875&click_sum=6bddc4f1&ref=shop_home_active_67&crt=1&sts=1",
    "reviews": [
      "Absolutely beautiful! This was a gift for our first Valentine’s Day together, and I’m so happy with how it turned out. Beautiful work! Would definitely recommend!",
      "Super cute gift to put on gift bags, presents, or just to hang on Christmas tree.",
      "This was a housewarming gift",
      "I didn’t see it in person but the recipients loved it"
    ]
  },
  {
    "productId": "ErYojYbfHD",
    "url": "https://www.etsy.com/listing/475931494/scratch-off-map-poster-most-detailed?click_key=85f0f7ae3c5705e5c7e713ba233e986bbd85f595%3A475931494&click_sum=cb225552&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-14&frs=1&etp=1&sts=1",
    "title": "Scratch off Map Poster - Most Detailed World Map, gift for him, gift for her, travel gift, gift, wall hanging, travel map",
    "description": "✅ FREE SHIPPING*✅ It's the perfect nostalgic home decor scratch off world map gift for the travel enthusiast to document travel memories and favourite places.✅ Perfect travel map birthday gift for him or gift for her✅ Brilliant concept scratch off map allowing visited destinations to be scratched✅ Revealing the beautifully styled up to date detailed world map underneath.✅ It's the perfect map or gift for the travel enthusiast allowing complete personalization of the map to display a unique travel story.✅ Simply grab a coin and start scratching off all the destination’s you have been lucky enough to visit creating your own personalized continually changing world map.Not only are countries featured on the map, there are also cities shown on the top layer and the world map underneath, allowing for more detailed scratching. Our Scratch the World Print is perfect for planning the next holiday when the last one is disappointingly over and the holiday washing is in the machine!Please note: No frame is supplied with this print.--------------------------------------------------------------------------------------------✅ Shipping times:*Standard - 2-6 business days from order date (this includes make time and shipping time) - FREEExpress - 1-2 business days from order date (this includes make time and shipping time) - $20---------------------------------------------------------------------------------------------Size Guide:✅ 33.11\" (w) x 23.39\" (h) inches or 22\" (w) x 17\" (h) inches---------------------------------------------------------------------------------------------Finish Guide:✅ Scratch the World poster is printed onto high quality silk art paper with a gloss coating for luxury and works exactly like a scratch card, once the gold scratch is removed it reveals the mapping underneath.----------------------------------------------------------------------------------------------Internal product code:WM01174A_MS_SILKP (33.11\" (w) x 23.39\" (h) inches)WM01174A_SS_SILKP (22\" (w) x 17\" (h) inches)MAPS INTERNATIONAL - EXPERT MAP MAKERS: Our philosophy of 'cartographic excellence' combines detail, design and high-quality finishes in a range of stunning wall maps. As an Internationally renowned cartographic company, our expert team based in Minnesota and in the UK, work with passion, on a stunning range of maps for all moods and homes",
    "reviews": [
      "love the map. needs a frame",
      "Needed one that included Antartica as a gift for my sister's family, they love to travel. Such a neat gift idea! Shipping was fast.",
      "Gave it as a Christmas gift. It was awesome!"
    ]
  },
  {
    "productId": "gNCdxGJbMn",
    "url": "https://www.etsy.com/listing/83383628/married-to-the-sea-giclee-art-print?click_key=cbe3961131bbfbd459c789a6699c148345abae02%3A83383628&click_sum=fe7fddfa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-15&frs=1&etp=1",
    "title": "Married to the Sea . giclee art print",
    "description": "SIZES AVAILABLE:listed in inches - image size approximate5.5 x 7 (printed on 8.5 x 11 paper)8 x 10 (printed on 8.5 x 11 paper)11 x 14 (printed on 13 x 17 paper)16 x 20 (printed on 17 x 22 paper)22 x 28 (printed on 24 x 30 paper)30 x 40 (printed on 34 x 44 paper)40 x 50 (printed on 44 x 54 paper)PROMOTIONS: Free shipping with orders of $75 or more.Use coupon code FREESHIPPING at checkout :)Free 16x20 print with 30 and 40 inch prints, just leave your choice in the message to seller box at checkout.THE PRINT: This is a \"Giclée\" print of the original painting, made with archival pigment inks on heavy stock, environmentally friendly Hahnemühle Bamboo fine art paper. The matte paper nicely presents the brushstrokes and texture of my original paintings. All prints are signed with pencil in the border beneath the image unless you request otherwise.SHIPPING: All orders will ship within 5 business days. Please email me if you need faster shipping. Your print will come protected in an archival sleeve or vellum, and shipped in a rigid envelope or mailing tube depending on size, via Priority mail (2-3 days) domestic, and First Class mail (usually 7-14 days but up to five weeks depending on customs) international. Please see my shipping policies for country specific information.FRAMING SUGGESTIONS:All prints come unframed. I am happy to send suggestions, just let me know!Listing photos feature frames from Framebridge.comIf you place an order with Framebridge.com and let me know your order number your print can be shipped directly to them.Please let me know if you have any questions.Thanks,ClareBack to browsing the shop:ClareElsaesser.etsy.com",
    "reviews": [
      "Gorgeous!! \nMy daughter loves it",
      "Beautiful piece. The colors are deep but brilliant. Arrived quickly.",
      "Simply stunning print with vibrant colors. Even better in person.. Can't wait to buy from Claire."
    ]
  },
  {
    "productId": "TgCUlBCyim",
    "url": "https://www.etsy.com/listing/401089083/home-sweet-home-sign-wood-framed-sign?click_key=dd794daeede390154e3735a71f93c919a588b840%3A401089083&click_sum=1840db49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-16&pro=1&frs=1&sts=1",
    "title": "Home sweet home sign | wood framed sign | home wall decor | farmhouse wall decor | home sign | family name sign",
    "description": "Home Sweet Home SignSize options:10\"x20\", 12\"x24\", 16\"x32\", 20\"x40\", 20\"x48\"The frame and the background are both 100% wood.The lettering is printed directly onto the wooden background.The wood background is painted in matte white and can be cleaned with a damp/wet cloth and it will not ruin the print.Saw-tooth hangers are installed on the back for easy hanging.Made in the USAWhy choose Cherie Kay:We sincerely believe that you will love your sign!  We stand behind our product 100% and are here to take care of you and offer you amazing customer service.If there's anything you are not happy with we will do whatever we can to make it right!Instant 20% off code when you sign up for our email list. Copy and paste this link into your web browser... https://bit.ly/3bDyTpG(This promo code can not be combined with a sale discount.)Find us on Instagram and Facebook @cheriekayhome.Unfortunately, we do not do custom orders.View other signs...https://www.etsy.com/shop/CherieKaySigns",
    "reviews": [
      "Looks great on our wall!",
      "This product is just beautiful!! I had a question at first and the seller answered me with a hour. Looks absolutely beautiful in my family room. So happy with my purchase.",
      "Looks just like pictured.  Beautiful!",
      "Very nice workmanship. I love it."
    ]
  },
  {
    "productId": "CkbXNhVwsG",
    "url": "https://www.etsy.com/listing/240735247/picture-on-wood-custom-photo-on-wood?click_key=75bebf17674e389147282e2737e5827558b62fa9%3A240735247&click_sum=4d06d514&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-17&pro=1&frs=1&sts=1",
    "title": "Picture on Wood, Custom Photo on Wood, Rustic Portraits, Distressed Portraits, Reclaimed Wood Photo Transfer, Wood Photo Blocks",
    "description": "A personalized picture on wood is the perfect way to add a little rustic touch into your home decor. With a custom photo on wood, the possibilities endless. Wedding pictures, family photos and pet portraits are just a few ideas of special memories that can be captured on our wood photos.ABOUT OUR WOOD PHOTOS:Have your own custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life.Purchasing as a GIFT? Add-on our gift wrapping option and have your custom wood photo wrapped in a natural burlap gift bag -https://www.etsy.com/listing/522661329/burlap-gift-bags-gift-wrapping-add-onDETAILS:• Because this is wood from a real tree, pieces may have knots which we try to place in the best spots possible for the photo provided.• Each piece of wood will vary in wood grain, making each one completely unique.• Several size options available to choose from.• Photos will be cropped around the corners/edges, as this is the only way to fit a rectangular photo onto an oval piece of wood. All important aspects of the photo should not be located along the very edges of the picture.• Horizontal photos will be placed horizontally on the wood & vertical photos will be placed vertically unless otherwise requested.• White ink is not printed on the wood. This allows the natural grain of the wood to show through the photo. Colors of the photo on the wood may vary, as these are printed onto natural wood and not bright white paper.• A clear protective coating is applied over your wood photo to help protect against stains, water and scratching.• All wood photos come with complimentary hardware for hanging. If ordering a stand, hanging hardware is not included.• Stands are not included, but can be purchased separately.• The bark of the wood is not removed from the wood in order to preserve the natural look of our wood photos.• All orders are securely packaged with extra bubble wrap for added protection during shipping.• Made and Handcrafted in Florida, U.S.ACHOOSING YOUR PHOTO:• The better quality the photo, the better the results will be on the wood.• A 300 dpi photo taken in good lighting will give you the best possible print results.• Lower quality photos can be used, but please know that the quality will be the same on the wood.• Extremely dark, blurry, grainy or low-quality photos do not typically transfer well.• We ask that you DO NOT add any text to your photo, due to cropping reasons.ENGRAVINGS:• Looking for a way to make the back of the wood as beautiful as the front? Consider adding on one of our engraving options.• Select from a variety of premade and personalized designs and have them ENGRAVED onto the back of your wood photo.• Scroll through listing photos to see available engraving options.• Our custom text engraving option allows you to have any custom text engraved onto the back of the wood in the font that is shown. There is no character limit, but the longer the text is, the smaller it will be to fit onto the wood.• Our custom handwritten text engraving option allows you to add handwritten text to the back of the wood. For handwritten text, please send us a message through Etsy with an attachment that includes a digital or scanned copy of the handwritten text that you'd like engraved. Handwritten text MUST BE ON A PLAIN PAPER BACKGROUND. Text written on lined paper or paper with background designs will not work. The clearer the text is, the better the engraving will be.• Please keep in mind that because this is real wood, there may be some natural knots/marks on the piece. These may be more noticeable on the back of the wood than on the front, as there is no photo to cover them.HOW TO PLACE AN ORDER:1. Purchase this wood photo listing along with any upgrades that you'd like from the drop-down menus.2. Send us a high-quality digital photo to use through Etsy messages by simply clicking the \"ask a question\" link or \"contact\" link on our shop. You can also click this link:https://www.etsy.com/messages/new?with_id=15274040&referring_id=9226174&referring_type=shop&recipient_id=15274040Attach your photo to the message by clicking on \"attach image\" or the camera button and selecting your desired photo.FULL PRODUCT LINE:View our complete line of products and size options at www.woodphotos.com",
    "reviews": [
      "My little boy loves his photo of getting his first deer on this wooden background. The picture quality turned out beautifully. Very happy with the end result.",
      "Excellent quality, exactly as described and super quick shipping!",
      "I gave this to my friend for a birthday gift & she loved it! It came out beautiful 💕"
    ]
  },
  {
    "productId": "lkVJqhigsm",
    "url": "https://www.etsy.com/listing/399982215/welcome-sign-welcome-door-sign-front?click_key=aed145ba62d6ef37d15043d150b5397c65932bfa%3A399982215&click_sum=ecbf9090&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-18&etp=1&sts=1",
    "title": "Welcome Sign | Welcome Door Sign | Front Door Sign | Personalized wedding Sign | Personalized Family Sign | Last Name Sign | Family sign",
    "description": "Welcome Wood Door Sign Personalized with Last name hanging with jute twine(Wreath & Hanger not included)•   Handmade, painted wood sign. Lettering is painted on.(No vinyl or stickers on sign whatsoever)•   Measure approximately 5\" x 16\" (can vary up to 1/2\")•   Made with new solid wood.•   Dark Walnut Stain BackgroundIf you'd like another stain color listed in sample pictures, let me know in the NOTE TO SELLER section at checkout.•   Lettering - White paint (See pictures for font options)•   Back is unsanded but stained, Stamped with our logo.•   Poly Sealant added for extra protection•  Recommended use under Covered Area/Porch.•   Twine attached for easy hanging.IMPORTANT ***Let me know the last name EXACTLY how you would like it to read on the sign in the Note to seller section at checkout.You can add the words 'The' or 'Family' or a Phrase, etc.I will make is exactly as you list it. At this time, I cannot change the sign format.I do not accept returns/exchanges on customized/personalized signs.Disclaimer:Please note that all signs are made of wood which is natural. I do apply 3 coats of polyurethane to protect the paint for outdoor use. I cannot guarantee that extreme temperatures will not cause damage to the letters and paint. Please use your best judgment in cold temperatures and extreme hot weather and bring your signs indoors in such cases. The wood comes from nature however the paint does not & can crack or start peeling in extreme cold or heat.  I cannot predict that no damage to the lettering will occur in extreme elements. Please use at your discretion in harsh weather.Also, wood knots can sometimes cause a yellow discoloration with the white paint, please be aware that can happen. Unfortunately, It’s the wood that does that.*Pictures are property of The Wood Grain Home. Please do not copy my pictures/designs without my permission.******************************************************************************************************************************************************************• Make sure your Etsy account information and address are up to date. If you need to send it as a gift, make sure to change the ship to address because shipping charges vary from location to location.•  Please note that wood/new wood has natural imperfections such as knots, cracks which make each sign unique and different. This gives the sign a vintage worn look. Sign colors may also differ due to lighting, screen resolutions and wood.  No two signs will/can ever be identical.•  Please read all Shop policies before placing an order.*********************************************************************************Thank you for checking out my shop! Let me know if you have additional questions.",
    "reviews": [
      "Love it! Good quality.  Very pretty",
      "Thank you!!",
      "So beautiful!  My Sister In Law will love it in her new entryway!  Thank you!",
      "Thank you!!",
      "This sign is exactly as I expected. The stain is very warm and quality feels great!",
      "Thank you!",
      "The sign is exactly the way I wanted",
      "Thank you!"
    ]
  },
  {
    "productId": "ZczSUfmwiq",
    "url": "https://www.etsy.com/listing/498315936/latitude-longitude-sign-gps-sign?click_key=f455010c6c70f67ba7c7766aaef31d9050e1ba9c%3A498315936&click_sum=5210e9da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-19&pro=1&frs=1&sts=1",
    "title": "latitude longitude sign | GPS sign | coordinates sign | address plaque | custom coordinates | wedding shower gift | GPS coordinates sign",
    "description": "latitude longitude sign | GPS sign | coordinates sign | address signLook no further! THIS sign is perfect  a one-of-a-kind wedding or bridal shower gift. Easy to order & shipped directly to you.What more could you need?Each sign is truly is a meaningful piece of art that would be a beautiful home decoration after the wedding!➽More GPS signs here:http://etsy.me/2l4ApIT➽Back to main shop:http://etsy.me/1KwLKUl::SIZE::➽ Choice: 20\" long x 6\" tall -OR- 30\" long x 12\" tall::INCLUDED::➽ Stained Wooden Sign, professionally printed directly onto the wood with state-of-the-art processes➽ Available in brown stained wood (white letters), grey stained wood (white letters), or white painted textured faux wood (provides a more crisp white sign) (dark grey letters)- (see photos)➽ Back of sign is finished➽ Sign personalized with your information➽ All signs include a hanger + felt pads on the back::PROCESSING + SHIPPING::➽Normal processing + shipping: item created in 5-7 business days (not incl. holidays + weekends) + shipping days➽1st in Line + Free Shipping: item created during dedicated bonus time (average 3 business days) + Free USPS Priority Mail shipping + Free Tissue Paper Wrapping + Gift message card/envelope with ribbon/bow (if gift message is left at checkout) - ready for gift giving::Photo props not included::::NEED to KNOW::Each sign is expertly handcrafted and fashioned from solid wood. Letters are professionally & permanently printed (no stickers or stencils). This sign will not match the pictures above exactly because they are each handmade. This is not a flaw, but rather the promise that your rustic home décor will feature unique designs and intricacies.Back to SpangGangDesign's Etsy shop:http://etsy.me/1KwLKUl| more reasons WHY to CHOOSE Spang Gang Designs OVER OTHER SHOPS |https://www.etsy.com/shop/SpangGangDesigns/about?ref=announce| Check out our awesome feedback from our awesome customers|https://www.etsy.com/your/shops/SpangGangDesigns/reviews?ref=shop_infoAll images & designs are property of ©Spang Gang Designs, LLC. 2012- present. All rights reserved. Please do not use designs, photos or listings without prior consent. Spang Gang Designs LLC reserves the right to enforce any and all infringement.",
    "reviews": [
      "Perfect Wedding gift, beautiful craftsmanship.  Highly recommended ❤️🙌",
      "My great niece and her boyfriend loved it 🥰",
      "I ordered this sign as a Christmas gift.  The recipient's loved the \"personalized\" location of their home.  It was crafted very nicely and packaged with care.  VF",
      "My parents absolutely loved their sign-looks amazing in their living room. Thank you for getting it here in time for Christmas!"
    ]
  },
  {
    "productId": "XIsAmjjycr",
    "url": "https://www.etsy.com/listing/493349587/family-gift-reclaimed-wood-custom-family?click_key=a2a7115e9ecc995ed3e946692b5629ddd63fbe0d%3A493349587&click_sum=9fdccfcd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-20&frs=1&etp=1",
    "title": "Family Gift Reclaimed Wood Custom Family Name Signs Anniversary Gift for Her Gift for Parents Gift for Mom Personalized Valentines Day Gifts",
    "description": "Made from hand-picked, reclaimed wood with a touch of rustic charm.>> Top board measures approximately 15x5 inches and can be personalized with your chosen last name or couple's names, along with an established date>> Smaller kids boards (7x3 inches) can be personalized with first names and birth dates>>Hangers on the back for easy installation, twine included>> Signs are 100% wood with knots and imperfections, adding to their unique beauty>> Handcrafted with care in our shopOrder now and add a touch of LoveBuiltShop to your home!>> GRANDPARENTS VERSION Here!https://www.etsy.com/listing/1113385039>> Have a growing family and need more kids boards or pet boards?  Free shipping!https://www.etsy.com/LoveBuiltShop/listing/533693831To order, please provide the following info:1. Provide the last name OR couples names you'd like on the top sign. (or put mom & dad, nana & papa, etc. in place of names)2. Wedding date or established year.3. Provide first names and birth date for kids boards. Please keep in mind that kids names will be significantly smaller if middle names are included.Our cool new Family Names Sign is here:https://www.etsy.com/listing/476724892/last-name-sign-family-name-wood-sign?ref=listing-shop-header-2For a simple, elegant last name sign, check this out!https://www.etsy.com/listing/460129030/last-name-sign-family-name-wood-sign?ref=shop_home_active_17Here is our Mr. & Mrs. sign for those looking for another option!https://www.etsy.com/listing/290112925/last-name-wedding-sign-wedding-giftOur signs are 100% wood and may have knots and imperfections. We believe this adds to the unique beauty of your sign. Each sign is carefully made by hand and size may vary within an inch or two.Please remember that colors may vary due to differences in computer monitor displays.Copyright © Love Built Shop",
    "reviews": [
      "Excellent experience!\nBeautifully made and shipped quickly! Highly recommend!",
      "N/A was what was expected",
      "The item is great. Customer service is awesome. We had a bit of an issue with USPS. I was told it was their issue, and the help from the seller was great. I only took off points because my item was about 3 weeks late and missed the date I was giving the gift.",
      "Great quality, solid wood. Everything came out better than expected."
    ]
  },
  {
    "productId": "nEeugJDulU",
    "url": "https://www.etsy.com/listing/525919176/mountain-shelf-geometric-shelf-triangle?click_key=4a9c7796399074825f9ac5532eb379f72af44274%3A525919176&click_sum=841d77c1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-21&frs=1&etp=1",
    "title": "Mountain Shelf / geometric shelf, triangle shelf, essential oil shelf, mountain wall art, crystal shelf, nature wall art, adventure, travel",
    "description": "Inspired by my travels, the Mountain Shelf was created to display trinkets and items found out in nature. It is the perfect way to bring a bit of the outdoors in and a great gift for the nature lover in your life. This shelf also works well for a woodland themed nursery, a summer cabin getaway, and just a unique addition to your home.Each shelf is built from pine and finished in the stain of your choice. The one in the photo is special walnut.+ This shelf is approximately 21\" wide, 12.5\" at the highest peak, and 3.5\" deep. It weighs about 2 pounds.+ Note: this shelf does NOT include hanging materials. The best way to hang from two nails at each peak.+ See additional shelves here:https://www.etsy.com/shop/infiniteabyss?ref=hdr_shop_menu%C2%A7ion_id§ion_id=19147837- - - - - -PLEASE NOTE:Cancellations are NOT accepted past 24 hours after ordering. There is enough information on the listings regarding shipping time to make an informed purchase. Please message me with any questions you have before ordering.Also, please message BEFORE you order with any questions regarding custom sizes, different paint colors, etc., to avoid delays in production due to an additional charge.Double check your address before purchasing.Due to the characteristics of the wood, yours might not match the photo exactly.",
    "reviews": [
      "Very nice quality!! Stain doesn’t match what I expected BUT that could’ve been user error! Overall, very well made!",
      "So obsessed with this shelf! It’s the perfect crystal docking station!",
      "Beautiful product, thanks so much",
      "Beautiful wood and design, look forward to hanging. It didn't come with any hanging hardware but should be easy to either add one or hang from the mountain peaks."
    ]
  },
  {
    "productId": "oOBocmJubk",
    "url": "https://www.etsy.com/listing/519055208/home-sweet-home-sign-above-couch-sign?click_key=e84133c1f62fe8fd59c1c670820d0b6dec895f3d%3A519055208&click_sum=5279f7d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-22&pro=1&frs=1&sts=1",
    "title": "Home Sweet Home Sign | Above Couch Sign | Living Room Signs | Home Sweet Home Wood Sign | Family Room Signs | Mothers Day Gift | 008",
    "description": "Home Sweet Home Sign, Living Room SignsWANT A COMPLETELY CUSTOM SIGN? Click the link below to view our customizable listing!https://www.etsy.com/listing/1278969903/customized-wood-sign-custom-sign-for?\"Home Sweet Home\" framed wood sign💵 Save 25%  WHEN YOU BUY MORE THAN ONE ITEM! WE HAVE OVER 300 ITEMS LISTED FOR SALE, Click our shop name or the link below to view them all 🤩https://www.etsy.com/shop/rootedngroundedhome?________________________________________________________________________________________________________________________________Dimensions--8x22 inches-10x28 inches-12x32 inches-14x38 inches-16x44 inches-18x47 inches(can vary by a 1/2 inch)________________________________________________________________________________________________________________________________Hanging-We have made hanging very safe and easy. The sign has a hanging system built into the frame and comes with hanging instructions. Only screws or nails are needed to hang.________________________________________________________________________________________________________________________________Shipping and Turn Around Time-Please view turn around time at checkout. Etsy will tell you our estimated processing time before you purchase an item. We typically ship on a 2-5 business day turnaround, though that may be longer during the holiday season. The estimated processing time at checkout is always the most reliable estimation.We use Fedex Home Delivery or Fedex SmartPost to ship, depending on which is more cost effective. If you purchase the shipping upgrade, we will always send it the fastest method, Fedex Home Delivery.________________________________________________________________________________________________________________________________Please note-These are handmade and both the frame and the sign itself are wood. Due to the character of wood, sometimes small knots or natural imperfections are present. We always pick out the best looking pieces of wood, but also feel that slight imperfections help add to the character of our handmade signs. Back of sign is sanded but unpainted.________________________________________________________________________________________________________________________________Why choose Rooted and Grounded?We love what we do and love the idea that what we are making helps you add your personality and character to your home. We are very particular about our product. We take pride in making our signs and make sure we are happy with every piece before we send it out. If for any reason you are not happy with your sign, please let us know and we will work with you and do our best to fix it.________________________________________________________________________________________________________________________________Custom OrdersWould you like a custom order??? We love to do custom orders! We can change any of our current sign or design a new sign for you. Just send us an etsy conversation and we can discuss what you are wanting. We will create a custom listing with your name on it for purchase. Also check out our shop policies for custom signs.***check out our similar signs below***rootedandgroundedhome [!at] etsy.com",
    "reviews": [
      "Was perfect for my need.",
      "Thank you, this is actually my second one, first one was a gift, amazing quality!",
      "Arrived on time, as per usual. Very happy with this store. I will continue to buy from them."
    ]
  },
  {
    "productId": "IVmcCroMFn",
    "url": "https://www.etsy.com/listing/385709588/third-anniversary-gift-for-him?click_key=e39202eef3dd3efa5b07f04ce22ab4575b65d95b%3A385709588&click_sum=250a5b9f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-23&pro=1&frs=1",
    "title": "Third Anniversary Gift For Him - Personalized Leather Tray with Date and Initials",
    "description": "Leather is the traditional gift for a third anniversary. I think this is fitting. In a young marriage you've only just begun to see the challenges, the ups and down. Good leather like this can take a beating and and keep on going.Like a good partner -  this tray will be one of the last things they see every night before bed, one of the first in the morning, and it will be with them for life.Sizing Notes:All photos show valet sized trays. Font size is does not change between tray sizes.All measurements describe the usable internal area of the tray.Available Sizes:____________________________________________Keys/Change - 4\"x4\"Pens and Pencils 4\" x 8\"Everyday Valet - 6\"x8\"Large Valet - 8\"x10\"US Letter Paper - 9\" x 11.5\"All measurements describe the usable internal area of the tray.____________________________________________Personalization:Only the displayed format of initials and a date are covered under the cost of this item. Longer requests are possible but will required individual attention that will incur additional cost and delay production. Please contact me for a quote.Please take a moment to review my shop policies before purchasing. They can be found below the reviews section further down on this page.",
    "reviews": [
      "Great product and a wonderful gift!",
      "Really nice quality for the price, was exactly what I was expecting",
      "I really like this.\nGood quality"
    ]
  },
  {
    "productId": "VOkaJWEHQw",
    "url": "https://www.etsy.com/listing/192707281/extra-large-farmhouse-window-pane-mirror?click_key=ccc7c59364b411307eb131b905d7ef0fa52aa7a6%3A192707281&click_sum=d12a04d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-24&pro=1&frs=1&sts=1",
    "title": "Extra Large Farmhouse Window Pane Mirror- 46\"X36\"- Rustic Old Barnwood Decorative Living Room, Overmantle, Bedroom Wooden Country Wall Decor",
    "description": "This Super Extra Large Farmhouse Reclaimed Wood Window Pane Mirror is constructed with butt joints and features a combination of 2.5\" & 3.25\" wide molding on the outside, 1\" dividers and 12 --10\" Square Panes, this barnwood window pane mirror is the perfect addition to your rustic or farmhouse decor.  This reclaimed barnwood mirror is available in Natural Barnwood* (this is real aged/weathered wood and colors and textures vary, from browns to grays), Reclaimed Natural (reclaimed wood sanded and sealed to a light brown natural color) any of the painted wellworn color finishes as shown and includes frame, mirror, solid hardboard backing and wire/hangers for hanging the mirror.SHUTTERS SOLD SEPARATELY . Check them out at:https://www.etsy.com/listing/201635725NOW AVAILABLE in horizontal orientation with the handles on the long side (46 wide X 36 tall) or Vertical orientation (36 wide X 46 tall) with the handles on the shorter side.Compare similar products at $299+-Since we send these out with hanging wire installed and hook hardware included, this windowpane mirror is easy to hang.-Includes: mirror, pull handles (optional), card board backing and sawtooth picture hangers.-Choose between natural/unpainted wood for a more primitive decor or have it painted to give your decor a pop of color.* (If you would prefer a frame more gray or brown just add a note when checking out or send us an email). They will also have knots, nail holes, weathered cracks and other characteristics adding to its rustic beauty.*If you enjoy this product, check out our Etsy shop for more rustic barn wood decor.https://www.etsy.com/shop/ABWframes***SHARE THE LOVE...click on the pinterest \"pin it\" button just under the \"Add to Cart\" button***",
    "reviews": [
      "It is looks great and is exactly what I wanted.",
      "Exactly what I expected.  Great quality and carefully shipped.  It’s beautiful in my space and just what this wall needed.",
      "Absolutely love this mirror. Very high quality"
    ]
  },
  {
    "productId": "OygyzhswUm",
    "url": "https://www.etsy.com/listing/249386293/library-card-pillows-librarian-gift?click_key=b9797f48ad7a118ae12c46c095403f87965448f4%3A249386293&click_sum=bd57a2b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-25&etp=1",
    "title": "Library Card Pillows // Librarian Gift // Reading // Book Lover // Bookish // Bibliophile // Reader // Bookworm // Best Selling Item",
    "description": "Library Card Pillows // Librarian // Reading // Book Lover // Library Science // Card Catalog // Bibliophile // Reader // Book WormThese library card pillows with have you waxing nostalgic for the days when the librarian would flip to the back of the book and hand stamp the due date.  Each is screen printed by hand on cotton canvas.  Both front and back look like a classic library checkout card.  Pillows measure approximately 12\" x 16\", poly-fil insert with zipper closure along bottom.",
    "reviews": [
      "A super fun pillow for our reading space!",
      "This was exactly what I expected it to be!!",
      "Awesome gift for my wife",
      "Perfect gift! Quick delivery, nice quality."
    ]
  },
  {
    "productId": "FhTysC5GZy",
    "url": "https://www.etsy.com/listing/244235802/silkscreen-sleeping-cat-pillow?click_key=5de11d9e74ee0dbb20ca3e365d4128d12624fa1a%3A244235802&click_sum=12360200&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-26&etp=1&sts=1",
    "title": "Silkscreen Sleeping Cat Pillow",
    "description": "Meow! This one color silkscreen pillow is perfect for the cat lover in your life.Pillow measures 16\"x7\"Looking to get a custom cat pillow? Check out our custom pet pillows here:https://www.etsy.com/listing/95995567/custom-silkscreen-pet-pillowMaterials: All pillows have been silkscreened with non-toxic water based acrylic paint. They are printed on muslin fabric and stuffed with 100% poly-fil.",
    "reviews": [
      "I sent this as a gift for my brother, in remembrance of a beloved pet, but when his wife saw it, she stated enthusiastically \"This must be for ME!\"  And so it was.  A beloved addition to lovely home.",
      "I got this for my grandma, who has always been a cat lover. She can no longer take care of a cat due to poor health and dementia. I read that people who have dementia enjoy dolls and stuffed animals so I thought the pillow that looks similar to a cat she used to have might be a comfort to her. She absolutely loves it! I'm so glad I found this shop. I highly recommend it.",
      "Bought a as a gift for a cat-loving 4 year-old. Looks like a real cat is sleeping in her bed. She loves it.",
      "This was a gift for my daughter. She is so pleased with the cat pillow. Thank you."
    ]
  },
  {
    "productId": "NxlctYgjBV",
    "url": "https://www.etsy.com/listing/517695044/metal-bookend-home-office-bookend-simple?click_key=b991ec797e8f7c0af27965262b18e4cd8d3e9595%3A517695044&click_sum=78736773&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-27&frs=1&etp=1&sts=1",
    "title": "Metal Bookend  |  home office bookend simple bookshelf organizer reading nook farmhouse decor housewarming gift organized home",
    "description": "These modern bookends are perfect for any shelf!\"L\"-shape holder measures 5\" long on the bottom, 6\" tall, and 3.5\" wide.This item is sold individually; please select quantity 2 for a set.Your item is plasma cut using 16 gauge steel, approximately the thickness of a quarter coin, for a durable yet lightweight piece. The metal is left untreated to maintain its natural finish so it is best kept dry. Because of this, each item may vary slightly in coloration and markings, having it's own unique characteristics.OUR PROCESSFor each piece, designer and shop-owner Stephanie creates a unique design that will only be found in this shop.  She sends that art over to her dad, Steve, who operates their CNC (Computer Numeric Control) Plasma Cutter.  This machine is driven by Stephanie's design to create her art with precision using a plasma (think liquid fire) torch.  Steve then buffs off any rough edges giving you a smooth finish.  Stephanie and her assistant then inspect each piece, give it a good cleaning, and pack it up for you to enjoy!____________________________Highland Ridge gives back!  We give back 10% of our profit to partners with our sister brand, Jubilee Trading Co.  Jubilee employs artisans in Morocco to create dignified jobs with fair wages. Our donations go to a trusted non-profit partner to serve their community through projects like water well building, mending houses, or aiding with medical bills.Here, everyone is family.Read our blog post to learn more: https://highlandridgedecor.com/blogs/blog/highland-ridge-gives-backLearn more about Jubilee Trading Co. here: https://jubileetradingco.com",
    "reviews": [
      "Simple yet stylish. Definitely minimalistic. Super sturdy. I love them",
      "Thanks a lot - great handmade product, fast shipping!",
      "I love these simple metal bookends. Sturdy and just what I was looking for. I had an issue with shipping initially but when I reached out to the seller they immediately shipped me a replacement. I appreciated the quick response and care to resolve the issue.",
      "Really great seller to work with. Item came very quickly and is great quality highly recommend."
    ]
  },
  {
    "productId": "tUpHaojhoY",
    "url": "https://www.etsy.com/listing/185365138/18-marquee-letters-light-up-letter?click_key=d1789ea0c07ee1a1b5cec75518d96bee45aa4991%3A185365138&click_sum=5eea0ca7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-28&frs=1&etp=1&sts=1",
    "title": "18\" Marquee Letters, Light Up Letter, Marquee Letters",
    "description": "Marquee Letters | 18\"ITEM DETAILS- Materials: Steel and light bulbs. Some variation in appearance is expected from posted image(s) as each item is custom made.- Available Colors: Standard brown patina finish (see ABC picture) or see \"Customization\" section to select distress or no distress custom finish. Please note the \"no distress\" option may add an extra week of processing time. There will be an upcharge if multiple colors are selected.- Dimensions: 18\" tall; width varies depending on the letter (see picture of widths).- Images: Images included reflect 12\", 18\", 24\" and 36\" sized letters for reference.- Installation: This item made to hang on the wall. If you need these marquees to stand on their own, please specify in customer notes when ordering. The marquee has an open back.- Power: This item includes a clear seven-foot power cord, an inline on/off rotary switch (may not be included based on custom wiring options) and is intended for indoor use (contact us for outdoor options). Power is 110v manufactured to US standards. May require converter for use internationally.- Cord: Standard cord placement is out the lower right corner of each letter unless multiple letters are purchased. For orders with multiple letters, we will contact you to confirm optimal wiring, but will proceed with our standard if we do not receive a reply within 2 days.- Light Bulbs: E12 base G type bulbs are included with each order. Spare bulbs are included in case of damage during shipping.-Non-lit - Our marquees are available in non-lit options. Contact us for pricing.- Pricing - Please note that the price listed is per letter.- Shipping - Processing time is 3-5 days for most orders. Some exclusions may apply.CUSTOMIZATIONWe are able to customize your order. To choose a color/finish not listed, please select a distressed or clean (no distress) finish. In the notes section at checkout, please include the desired finish and we will color match to the best of our ability (include Pantone number if available).ADDITIONAL INFORMATIONThe illuminated item(s) created by Saw & Steel, LLC use UL, CE or ETL electrical components. However, the illuminated item(s) as a whole are not listed. We attempt to make our illuminated products in accordance with best practices and standards, but you are responsible for determining that the item(s) purchased are suitable and/or safe for your intended use.**Free shipping only includes the contiguous United States. Please contact us for shipping to Hawaii, Alaska or International.***Photo courtesy of Jade Scott (@jscott24) and @look54berlin.",
    "reviews": [
      "I own an event company and have been purchasing letters from Saw and Steel for years. We keep coming back for more as our clients continue to want to spell fun words to light up their events.",
      "Letter is fantastic and looks great on the wall, however the main reason for my review is the customer service. They go above and beyond!! Reached out to see if we needed expedited shipping. We didn’t, however, order was still shipped and received very quickly. Item received with 1 light bulb missing and 1 broke in transit, leaving us 2 light bulbs short. I reached out to seller asking what brand/style/type of light bulb they sent so we could buy matching, and seller had replacement bulbs + extras shipped quickly. Would absolutely recommend without hesitation!",
      "Love these letters! so responsive!"
    ]
  },
  {
    "productId": "izesyNeWFa",
    "url": "https://www.etsy.com/listing/230729594/cactus-marquee-36-cactus-wall-decor?click_key=39324cb987b698c701a0a0a20a9637a738c6c638%3A230729594&click_sum=83a4ebbc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-29&frs=1&etp=1&sts=1",
    "title": "Cactus Marquee 36\", Cactus Wall Decor, Light Up Cactus",
    "description": "Cactus Marquee Light | 36\"ITEM DETAILS- Materials: Steel and light bulbs. Some variation in appearance is expected from posted image(s) as each item is custom made.- Available Colors: Standard green, brown patina, gold, turquoise and lime green.- Installation: This item made to hang on the wall (d-ring on back). The marquee has an open back.- Power: This item includes a clear seven-foot power cord, an inline on/off rotary switch and is intended for indoor use (contact us for outdoor options). Power is 110v manufactured to US standards. May require converter for use internationally.- Light Bulbs: E12 base G type bulbs are included with each order. Spare bulbs are included in case of damage during shipping.-Non-lit - Our marquees are available in non-lit options. Contact us for pricing.CUSTOMIZATIONWe are able to customize your order. Contact us for custom color or other size options.ADDITIONAL INFORMATIONThe illuminated item(s) created by Saw & Steel, LLC use UL, CE or ETL electrical components. However, the illuminated item(s) as a whole are not listed. We attempt to make our illuminated products in accordance with best practices and standards, but you are responsible for determining that the item(s) purchased are suitable and/or safe for your intended use.**Free shipping only includes the contiguous United States. Please contact us for shipping to Hawaii, Alaska or International.",
    "reviews": [
      "Who knew you could love a light up cactus, but I do! It makes me smile when I see it. It matches the description and photos. The sellers are amazing and shipping was quick. I wanted to buy something from this shop for awhile and had a hard time deciding what to get but I’m happy I did.",
      "I absolutely love my cactus light.  It is very unique & adds character to my decor.  Far exceeded my expectations.  Great purchase!",
      "Exactly what I was looking for and beautifully made!"
    ]
  },
  {
    "productId": "OtdzjUHRBK",
    "url": "https://www.etsy.com/listing/503197798/burlap-bunny-easter-basket?click_key=96eea06389b792a35f62672689e23f3e77c08f40%3A503197798&click_sum=5876a4b7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-30&frs=1&etp=1",
    "title": "Burlap Bunny Easter Basket",
    "description": "Basket is made from high quality, natural burlap. Lined with natural 100% cotton. All seams are professionally sewn. Expect high quality.NEW! A sweet little pom pom tail is attached to the back of the basket.Shown is size medium with carnation (pale pink) embroidery in Times New Roman. This size will work well for most people! Size small is made for tiny toddler hands & holds just a handful of Easter treats. Size up to large if you like to fill with lots of toys and goodies.This basket is sturdy, but not rigid. Ships folded. A steamy iron will easily remove any wrinkling due to shipping.Recommended laundering: spot clean only please.Handmade in the USA.",
    "reviews": [
      "Beautiful Easter baskets, can't wait to use them year after year\n!",
      "Baskets are beautiful. Great quality and Shipped fast. Highly recommend!!",
      "Baskets are beautiful. Great quality and Shipped fast. Highly recommend!!",
      "These Easter baskets are just beautiful. I bought three and all are perfect! Better than the pictures. Such great quality and fast shipping. Highly recommend!!"
    ]
  },
  {
    "productId": "JM3FaINzNd",
    "url": "https://www.etsy.com/listing/201614691/suncatcher-irish-gift-crystal-wood-moon?click_key=4cdc97a32c15f56e59a786e57e4b8a16c39ae087%3A201614691&click_sum=d4245a5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-31&frs=1&etp=1&sts=1",
    "title": "Suncatcher - Irish Gift - Crystal + Wood Moon - Thank you gift - Window Hanging - Rainbow Maker SMALL VERSION",
    "description": "When hung in a window, these beautiful suncatchers will catch the sunlight and create dazzling rainbows around your room.Ideal for home, bedrooms, sunroom, office, yoga studio, mindfulness space....We dispatch orders in 1-2 working days.Unique Suncatcher. Made in IrelandThis is the small version.For Medium and large versions please view my other listings here:https://www.etsy.com/ie/shop/ArtwoodIreland?ref=seller-platform-mcnavWe also offer personalised options where you can have a special message engraved into wood. Please go here to see your options:https://www.etsy.com/ie/shop/ArtwoodIreland?ref=seller-platform-mcnav&section_id=18941405These delightful window creations are made from a variety of woods such as Beech, Spalted Beech, Oak, Olive Ash or Elm. We use high-quality Asfour glass crystals.Crystal Angel: 20mm(3/4 inch) diameter Asfour crystal body with Tibetan silver wings and 10mm(1/4 inch) Asfour crystal head with a Preciosa crystal crownCrystal Sphere: 20mm (3/4 inch) diameterWood: 90mm(3.5 inches) at its longest point.Hanging string length: approx 300mm (12 inches) - please let us know if you would like this longer or shorter for your particular requirements.The above image is a sample. The characteristics of each piece of wood will vary slightly. We are very conscious of making sure that each and every piece is of equal natural beauty.-Each piece is finished with danish oil to what we believe is the perfect sheen.-It is hung with a high quality braided Dyneema fishing line which does not degrade in sunlight like many other common threads. This line allows for exceptional free-flowing spinning of the moon and the crystal within the moon.-Wood is sourced locally in the West of Ireland.-They come carefully packaged in an environmentally responsible plastic-free gift box.- We will gladly include a gift note for you so that the recipient knows who sent their special gift. Printed on recycled Kraft paper. An option for your gift note will come up in the checkout process.This is a unique and ideal gift for many occasions such as birthdays, new babies, \"thank you\" gifts and \"thinking of you\" gifts.Please note that these suncatchers are designed for indoor use and have not been tested outdoors.",
    "reviews": [
      "I received a first like this years ago so bought for a friend recently the light through the crystal reflects rainbows all over my lounge. Just lovely",
      "Beautiful piece, a gift to my mother. Shipping good too.",
      "Small, delicate, high-quality and beautiful"
    ]
  },
  {
    "productId": "mlqlduZfMA",
    "url": "https://www.etsy.com/listing/223829168/custom-portrait-from-photo-cartoon?click_key=75bb34fac8aa1b2bb2aa0159139485af8cabab42%3A223829168&click_sum=2c2dbf68&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-32&pro=1&frs=1&sts=1",
    "title": "Custom Portrait from Photo, Cartoon Portrait, Printed Family Illustration, Custom Portrait Personalized Print, Gift for Him, Custom Drawing",
    "description": "Looking for a quick and unique printed gift? My whimsical, bespoke hand-drawn portraits are made to order & ready for proof review in just 2-3 days after payment and photo submission!_____________How to Order:☻ Pick subjects and size & delivery type above.☻ Send photos to  discoveringyou.prints [!at] gmail.com.☻ Include details like family name, outfit details, hairstyles if desired. Outfits can be \"casual\" if you don't have a preference!☻ I'll send a proof in 2-3 days for your review and offer UNLIMITED edits until approved. Don’t be afraid to ask for changes :) Changes take approx. 1-2 days.Shipping/Printing:* Free print and ship within the USA via USPS First Class Mail (5-7 days).* International shipping available (2-3 weeks) at additional cost.OR* Pick Self-print from your digital file._______________Printed Orders:Choose from sizes: 8″x10″, 8.5″x8.5″, 6″x6″ or 11x17\". Contact me for special sizes! Printed on high quality 110lb matte cardstock. Frame not included.Digital Files:All portraits are high resolution (over 300 dpi) for premium image clarity. You'll receive a free digital file with every order.Additional Info:The final design is yours to keep but not for resale. Custom backgrounds available for purchase. Reach out for assistance!Why Choose Discovering You?Unlike many shops, I provide personalized, hand-drawn portraits, not outsourced replicas. Support authentic artistry!Copyright: All works, characters, and backgrounds are protected. Seen on the Skimm & the Giftler. Winner of the 2023 Albie Original Concept Design Award.",
    "reviews": [
      "The portrait of my kids turned out so well! I love how she took the extra time to make it special!",
      "The item was perfect, exactly as ordered met my expectations completely thank you!!",
      "Very unique piece of artwork. Very whimsical. My son will love it! Turn around time was quick and shipping was prompt.,awesome communication."
    ]
  },
  {
    "productId": "iEoCGzQzXE",
    "url": "https://www.etsy.com/listing/187929337/anatomical-heart-vase-pewter-finish?click_key=c9e38660b0a661cf6d80b331d339f92e10d69c65%3A187929337&click_sum=52bad1fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-33&etp=1",
    "title": "Anatomical Heart Vase, Pewter Finish",
    "description": "Sculpture of an anatomical human heart, cast in resin and hand painted.9.75\" tall",
    "reviews": [
      "I’ve had my eye on this for awhile but decided my friend deserved it for her new home and after doing a check to make sure nothing was broken in shipping (which it wasn’t) I’m so glad I got it for her! Stunning!",
      "Beautiful product and very quick response.",
      "It’s the perfect compliment to our upcoming macabre bridal shower"
    ]
  },
  {
    "productId": "3vKHgHcQti",
    "url": "https://www.etsy.com/listing/211991005/personalized-gymnastics-medal-holder?click_key=299f83646479afbab5a241de226b449ffec80958%3A211991005&click_sum=adf8b266&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-34&frs=1&etp=1",
    "title": "Personalized Gymnastics Medal Holder Display-  12 or 20 inch",
    "description": "This personalized gymnastics medal holder is the best way to display all that bling your kid has been collecting from the championship circuit.  Whether they are 1st place or participation medals, the medal holder doesn't judge.- 12\" Holder is is 12\" wide (30 cm) and approximately 5\" high (13 cm) with 5 posts- 20\" Holder is 20\" (50 cm) wide and approximately 6\" high (15 cm) with 10 posts- Made from select pine and 1/8\" thick baltic birch plywood- Stain options include kona, walnut, gray, clear (first photo is walnut, 2nd is gray)- Name insert available in 11 standard colors (pictured in pink)- Custom colors are $5 extra. Add this listing to your cart to purchase:https://www.etsy.com/listing/262635749/five-dollar-custom-charge?- Nature made each piece of wood special so slight variations will exist- Easy to hang with keyholes on back- Ships USPS- Comes gift wrapped at no extra charge upon requestWe will do our best to ship within 10 business days. Any changes to the normal 10 business day schedule will be posted on the shop announcement at etsy.com/shop/pineconehome. If you need it sooner, we may be able to accommodate you. Please send a convo to check.Boy Gymnast?http://etsy.me/1yLL8ncNot a gymnast? Other medal holders available here:http://etsy.me/1srSoRyFacebook.com/PineconeHomePinterest.com/PineconeHomeInstagram.com/PineconeHome",
    "reviews": [
      "My daughter was so excited to have a personalized place to hang and show off her medals.",
      "Everything about it was simple and easy. Shipped and delivered in a reasonable amount of time.",
      "Product is beautiful and arrived so quickly!"
    ]
  },
  {
    "productId": "JQcDbwkwOO",
    "url": "https://www.etsy.com/listing/481627726/large-velvet-pumpkins-set-of-3-taupe?click_key=effbe8d293fa844d0b9af9f5c5ecec83b94d9c4b%3A481627726&click_sum=353a405c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-35&frs=1&etp=1&sts=1",
    "title": "LARGE velvet pumpkins set of 3, taupe decor, elegant fall centerpiece for wedding, gray pumpkin arrangement, neutral farmhouse decor, white",
    "description": "This bestselling set of 3 Large hand made fabric pumpkins adds charm to your home décor!  This set includes 3 large pumpkins made in luxurious velvets:  1 Gray, 1 Ivory, and 1 Taupe. This set creates an instant table centerpiece and adds wonderful texture to rustic, farmhouse and traditional décor.All of our Velvet Pumpkins are carefully hand cut, stitched, and finished in our small workshop in Madison, Wisconsin, USA. Our velvet Pumpkins are also one of our best sellers - they've been featured in publications like Elle, Town and Country, Huffington Post, Refinery29, and Polyvore.Each pumpkin measures approximately 6.25\" wide x 3.25\" tall, PLUS the 4.375\" tall stem. The resin stem is realistic, and very durable. Actual colors will vary due to individual computer screens and fabric dye lots.This set looks great on its own, but you can also purchase multiple colors to round out your mix! You can do this by color, or check out our \"Create Your Own\" listing:https://www.etsy.com/listing/606985784/large-velvet-pumpkins-create-your-own. Because of these options, we do not do substitutions on our curated sets.Velvet pumpkins make lovely party favors, wedding décor and centerpieces. Check out the Wholesale listing to order 24 or more pumpkins in your choice of colors at discounted pricing:https://www.etsy.com/shop/YourHeartsContent?ref=seller-platform-mcnav&search_query=wholesale+pumpkinsLooking for the perfect way to display your pumpkins? We have a carefully selected group of accessories that you can use with you pumpkins! Just navigate to the \"accessories\" section of our shop and browse to find that perfect piece to round out your velvet décor.",
    "reviews": [
      "Quick and easy to order from.",
      "As always, beautifully crafted in luscious colors.",
      "Elegant and beautiful! Great quality as well.",
      "Love these pumpkins!  Look great, shipped and arrived quickly."
    ]
  },
  {
    "productId": "S2DSytUPvF",
    "url": "https://www.etsy.com/listing/231262085/front-door-wreaths-best-selling-wreath?click_key=bb49e796a1f4423e15a44882f0e221807b346911%3A231262085&click_sum=5ec5a683&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-36&frs=1&etp=1&sts=1",
    "title": "Front Door Wreaths, Best Selling Wreath, Burgundy Red, Green, and Cream Hydrangea Wreath, Year Round Wreath, Winter Wreath",
    "description": "This hydrangea wreath is perfect for a variety of door colors and is one of our top-selling designs. It catches the eye without being overwhelming and features artificial hydrangeas in shades of burgundy red, olive green, and cream. It's a beautiful and durable wreath that can be enjoyed for years to come.𝐖𝐫𝐞𝐚𝐭𝐡 𝐒𝐢𝐳𝐞𝐬• Small 15-16\" overall diameter and 5\" deep.• Medium 19-20\" overall diameter and 5\" deep.• Large 22-24\" overall diameter and 5\" deep.• X Large 26-28\" overall diameter and 5\" deep.Helpful information• Ribbon is included with the wreath.• Display the wreath in covered areas outdoors or indoors as a year-round wreath.Also, see photos for:• How to measure your wreath.• How to hang your wreath.• Picture of free wreath hanger - black color finishHomeHearthGarden.Etsy.Com© 𝐇𝐇𝐆𝐃𝐞𝐜𝐨𝐫",
    "reviews": [
      "The wreath is even better than the picture.    So well put together!",
      "Not enough stars for this absolutely,gorgeous, and outstanding wreath!!!!!  Definitely Recommend!!!! Mary",
      "It is a beautiful quality wreath",
      "Great! Looks just like the picture ❤"
    ]
  },
  {
    "productId": "QEjORwrpJa",
    "url": "https://www.etsy.com/listing/484180211/metal-bookend-shaped-as-falling-books?click_key=d383198bc3d263b19934d68d94ac827a59b6e28b%3A484180211&click_sum=8366727a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-37&etp=1",
    "title": "Metal Bookend // shaped as Falling Books // Bookends // Metal Book Accessories // Unique Gift // \"Falling bookend\" by ArtoriDesign",
    "description": "Falling bookend supports the books at a surprising, not straight angle. The bookend stands out on the shelf and creates interest and humor.The bookend is inserted in a concealed manner within the cover of the first book to be supported (a hardcover book is recommended). Then, few additional books can be leaned on it.This creates a feeling that the books are about to fall on the man's figure, who is stretching its arms towards them in a defensive position.Important Note: intended for a limited amount of books.Made of metal, painted black.Length: 18 cm, Height: 11.5 cm, Width: 12cm (7.08'' x 4.52'' x 4.72'')Weight: 380 gr. (13.4 oz.)https://www.youtube.com/watch?v=FSfU8PMV4Vs",
    "reviews": [
      "Love it!so cool and fun",
      "Fantastic bookend. Looks great on the bookshelf.",
      "Quick shipping and good quality",
      "Such a cute book end!"
    ]
  },
  {
    "productId": "yHbWWhxNzX",
    "url": "https://www.etsy.com/listing/271070195/compass-wall-decor-nautical-compasswall?click_key=f7e1517b6ef374bca0fbb9f8bc1192b00fc9218f%3A271070195&click_sum=71e5f5a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-38&pro=1&frs=1&sts=1",
    "title": "Compass Wall Decor, Nautical Compass,Wall Art, Nautical Metal Wall Art, Nautical Rose, Outdoor Metal Art, Compass Wall Hanging, Beach Decor",
    "description": "Compass Wall Decor, Nautical Compass,Wall Art, Nautical Metal Wall Art, Nautical Rose, Outdoor Metal Art, Compass Wall Hanging, Beach DecorCompass Rose Nautical Metal Wall Art  - 12\", 14\", 16\", 18\" , 20\" , 22\", 24\", 26\" 30\" or 36\"  tip  to tip outside measurements.. This makes a great piece for any Nautical or Beach themed room. Great for a Man Cave or Office! Beautiful piece to be decorate the pool area or a back deck. Makes a great entry way piece or under the stairs.With this piece you will always be headed in the right direction!____________________Offered in over 100 Color Choices and Sizes from 12\" to 36\"   Customize this to fit your decor!  Great indoors or outdoors!▬▬▬▬▬▬▬ DIMENSIONS ▬▬▬▬▬▬▬Multiple Sizes Available:Diameter:• 12\"• 14\"• 16\"• 18\"• 20\"• 24\"• 30\"• 36\"All dimensions are measured from the outer part of the N to the outer part of the S▬▬▬▬▬▬▬ ITEM DETAILS ▬▬▬▬▬▬▬• 16 Gauge Steel• Item weight 5 lbs -15 Lbs depending on size• We only use the highest grade of UV powder coat to ensure longevity of the finish. Powder coating typically last 6x's longer than paint and has high resistance to scratching, chipping and marking. Powder coating is used on outdoor furniture, automobile parts, tire rims, bicycles and appliances to name a few.• Triple sanded for a high quality, smooth finish that is safe for any surface.• For indoor and outdoor use▬▬▬▬▬▬▬COLOR CHOICES ▬▬▬▬▬▬▬We stock over 100 POWDER COAT COLORS :All of our colors are in stock and are available for use. If you do not see the color you would like listed in the drop-down box, please SELECT “Other” or “To Be Noted” from the drop-down box, and then TYPE the name of your color selection in the “Notes to Seller” box located in checkout.See our IN STOCK COLOR CHART here: https://housesensationsmetalart.com/pages/color-charts• BRIGHT RED • DEEP RED • RUBY RED • CRIMSON • CANDY APPLE RED • MAROON • GARNET• CORAL RED • RASPBERRY RED • IVORY RIVER • MERCEDES BLUE • LIGHT BLUE • PRINCESS BLUE• TARHEEL BLUE • PANTHER BLUE • DENIM BLUE • OCEAN BLUE • CAPRI BLUE • PERFECT TEAL• ROYAL BLUE • TIFFANY BLUE • ARIZONA TURQUOISE • TURQUOISE • TEAL • CANDY TEAL• PASTEL GREEN • SAGE GREEN • OLIVE GREEN • AVOCADO • ANODIZED LIME • LIME GREEN• EMERALD GREEN • EGGPLANT • FROSTY PURPLE • LILAC • MAUVE • ANODIZED GRAPE• GATOR ORANGE • TIGER ORANGE • TENNESSEE ORANGE • CANDY RASPBERRY • LIPSTICK PINK• PASSION PINK • SASSY PINK • MAGENTA • BARBIE PINK • LIGHT PINK • CORAL PINK • SALMON• PEACH • IVORY • BUTTER YELLOW • SPRING YELLOW • POPPY YELLOW • GOLDEN YELLOW• NEON YELLOW • CREAM • PEARL WHITE • SKY WHITE • TEXTURED SAND • MIDNIGHT BLUE• PIGEON BLUE • COBALT CANDY BLUE • BRIGHT BLUE • OXFORD BLUE • NAVY BLUE• TEXTURED NAVY • CHARCOAL TEXTURED • DARK SMOKE GREY • LIGHT GREY • SATIN SILVER• SILVER NICKEL TEXTURED • STAINLESS • SATIN TITANIUM • SILVER VEIN TEXTURED• HAMMERED GREY • POLISHED CHROME • CANCY COPPER • TUSCAN COPPER • CLAY• TEXTURED RUST • TEXTURED COPPER • PENNY VEIN TEXTURED • SPLATTERD COPPER• HAMMERED BRONZE TEXTUED • OIL RUBBED BRONZE TEXTUED • SPECKLED BRONZE • BRONZE• ESPRESSO • TRANSPARENT GOLD • METALLIC GOLD • SLEET GOLD • ROSE GOLD• GRECIAN GOLD VEIN TEXTURED • BLACK BRONZE • FLAT BLACK • TEXTURED BLACK • GLOSS BLACK• SATIN BLACK • BLACK CHROME • BURNT BRONZE • SEAFOAM PEARL TEXTURED▬▬▬▬▬▬▬ MOUNTING OPTIONS ▬▬▬▬▬▬▬This item comes standard with two  1/4\" screw holes for mounting.▬▬▬▬▬▬▬ PROCESSING TIME ▬▬▬▬▬▬▬ALL ITEMS ARE CUSTOM-MADE AT THE TIME OF ORDER. PROCESSING TIMES VARY FROM ITEM TO ITEM. PROCESSING TIMES ARE LOCATED UNDER THE SHIPPING TAB OF EACH LISTING. EXACT SHIP DATES ARE LOCATED ON YOUR SHIPPING CONFIRMATION FOLLOWING PURCHASE.▬▬▬▬▬▬▬ SHIPPING ▬▬▬▬▬▬▬• United States - All packages will ship via Ground Shipping unless Rush or Priority Shipping is purchased. Packages generally deliver within 3-5 business days, but please allow up to 7 days in case of delay.• We ONLY SHIP TO THE ADDRESS ON THE ORDER - Because of sales tax and Credit card/ Paypal protection. Orders with the wrong address will need to be reprocessed.ADVERTISED SHIPPING CHARGES APPLY TO THE 48 CONTINENTAL U.S. STATES ONLY- FOR SHIPPING COSTS TO HAWAII, ALASKA, APO ADDRESSES OR OTHER, PLEASE CONTACT US FOR CURRENT RATES.▬▬▬▬▬▬▬ ORDER CONFIRMATION & SHOP COMMUNICATION ▬▬▬▬▬▬▬• An order confirmation is sent immediately after purchase from Etsy to the email address used at checkout. (Please be sure to read the SCHEDULED SHIP DATE and “Notes from Seller” information on the order confirmation)• We will send all communications via ETSY message or to the email address on file if you checkout as a guest.Thank you for considering HOUSESENSATIONS Metal Art!All items are made in the USA by HousesensationsArthttps://www.etsy.com/shop/housesensationsartEvery item in our store is Handmade in the USA",
    "reviews": [
      "Arrived quickly and looks great on my wall along with our travel posters.",
      "Exactly what I hoped it would be.  Good quality; the metal has a good weigh to it.  Final nautical touch to a bathroom remodel!",
      "The compass is perfect. Good quality, thick metal. Great customer service as well!"
    ]
  },
  {
    "productId": "gTEOZpggHL",
    "url": "https://www.etsy.com/listing/66042419/baptism-gift-girl-gift-from-godmother?click_key=9d5206ca635a5e29cb224bdb33f1dff473fdbc00%3A66042419&click_sum=8c698085&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-39&pro=1&frs=1&sts=1",
    "title": "Baptism Gift Girl, Gift from Godmother, Baptism Gift for Goddaughter, Christening Gift, Ceramic Baptism Water Bowl for Ceremony",
    "description": "Our customers sum it up better than we ever could:\"The most meaningful baptism gift you can give.\"\"Even though I couldn't attend,  I was still able to be a part of the baptism!\"\"The priest said he wished all parents had this at every baptism!\"Made entirely be hand in our faith-filled studio.   This stately little bowl (about 4.5\" wide) has a hand-pulled spout - designed to pour the baptismal waters during the ceremony.    Pretty enough to display afterwards or tuck away with the christening gown.  We hope it will be cherished and used for generations to come.† TO ORDER:Each bowl comes with the verse shown.  Once you've \"added to cart\" simply leave the child's name as you would like it to appear and baptism date in the pull down menu box.    Make sure to triple check your spellings and date!    We will personalize your bowl exactly as you tell us.   If you do not provide a date, none will be added to your bowl.Your bowl will arrive in our signature gift box with bow.  If you are sending it as a gift make sure they know it is from you -- we're happy to include a gift card at no additional charge.  Just tell us what to say and we'll do the rest.† CRAFTING TIME:Most orders ship in about 10 business days.   If you need it sooner please send me a note before ordering - we'll try to help.   All items are shipped via First Class mail.   Expedited shipping is available at checkout -- this shortens the shipping time only -- NOT the time it takes for us to make it.(Rosary, candle, and cute baby shown in photos not include with bowl purchase.  :)** all designs, written copy and images  © copyrighted 2009 - 2019 Clarey Clayworks.  Please don't copy our designs -  it's mean and costs a lot in legal bills.**Return to shophttp://www.etsy.com/shop/clareyclayworks",
    "reviews": [
      "My bowl arrived in record time and was wrapped so beautifully. Personalizing my item was easy and Communication with artist was stellar. The bowl itself is truly a lovely piece of art, a precious gift to be treasured and a forever keepsake.",
      "I’ve purchased four of these baptism bowls now - for my kids and as a gift. We always get compliments including from the priest. The seller is responsive and helpful. These are so special and will last a lifetime!",
      "I absolutely love this shop. Most recently bought two baptism bowls for a family baptism and it makes the day so special, as well as provides a lasting gift to cherish."
    ]
  },
  {
    "productId": "VuNLjhCIlP",
    "url": "https://www.etsy.com/listing/477563341/5th-anniversary-gift-for-him-soundwave?click_key=bda223b39b67d4f23de4e6d69e2f625949cad621%3A477563341&click_sum=42d1ef68&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-40&frs=1&etp=1",
    "title": "5th Anniversary Gift for Him | Soundwave Art | Wood Anniversary | Voice Recording Gift",
    "description": "A creative traditional 5 year anniversary gift printed on wood. Use a voice recording or a favorite song to create a unique and memorable soundwave art gift for your 5th anniversary or any occasion for your husband or wife. They can scan the optional QR code to play the voice message or song. This personalized gift will bring back memories for years to come.We take your recording and turn it into a piece of art that visually captures the details of your voice, a song, or any sound.See what our customers had to say about our products and customer service:https://judge.me/reviews/artsy-voiceprint.myshopify.com★ WOOD PRINT• Printed directly on 3/4\" thick premium baltic birch wood, each wood print will vary in wood grain• Comes ready to hang• Specialized printing process which prints directly on wood resulting in super vibrant colors, retaining high quality without sacrificing clarity.• Protected against moisture & heat to give you a print that will last for years to come.• Easy to clean. Simply take a take a sponge or rag with water and wipe off without fear of smearing.• Sizes up to 11\"x14\" include a stand.★ HOW TO CUSTOMIZEPlease refer to the \"Add your personalization\" section above to see what we need to create your custom print and enter your information in the text box provided.CUSTOMIZE WITH A SONG - In most cases, we only need a link to the song on YouTube. If you have an MP3 file of the song, please email it to [support@artsyvoiceprint.com] with your order number and last name in the subject line.CUSTOMIZE WITH A VOICE MESSAGE  - You can easily record a voice message on your mobile phone using your Voice Memos or Voice Recorder app. You can also use the video recording feature if it's easier. Please email the file to [support@artsyvoiceprint.com] Please email the file to [support@artsyvoiceprint.com] with your order number and last name in the subject line. Please email the file to [support@artsyvoiceprint.com] with your order number and last name in the subject line.★ SCAN QR CODE TO PLAY RECORDING• A small card with the QR code printed on it is included with your order. We can print an optional gift message on the card. The QR code will play the recording for your order when scanned with your phone's camera.• You can also request to have the QR code printed on the art itself.★ FREE PROOF - You can choose to preview the art, but please note it adds 1-3 business days to the processing time. We will send a digital proof to your email for approval. If we don't hear back after 2 attempts, we will send the art to print in order not to delay your order.★ SHIPPING & TURNAROUND TIMES• Wood prints usually ship in 3 business days and arrive in 2-5 business days depending on your location in the US and your order size.• International orders take 6-10 business days, or longer if held in customs. International shipments may be subject to import taxes. It is the customer's responsibility to pay for these taxes.• Expedited shipping is available as an upgrade at check out, but please take note that it only expedites shipping, not production time.• Ships from California, USA★ HAVE A QUESTION?• We're happy to help, send us a message via Etsy Conversation by clicking \"Message the Seller\" below.★ WHY BUY FROM ARTSY VOICEPRINT?We specialize in sound wave art and have been customizing meaningful gifts since 2013. We are fortunate to have taken part in over 45,000 memories and special celebrations in the US & worldwide and are proud of the 5 star reviews we've received from over 7,000 satisfied customers.See what they had to say about our products and customer service:https://judge.me/reviews/artsy-voiceprint.myshopify.com• Shop our entire collection -https://www.etsy.com/shop/artsyvoiceprint5th Anniversary Gift for Him | Sound Wave Art QR Code | Wood Anniversary Voice Recording",
    "reviews": [
      "Perfect gift...wife loved it.  thanks again!",
      "Extremely pleased with what I received! It’s beautiful, sturdy, and exactly how I envisioned it. The process was really quick and I was sent a proof 2 days after I ordered it. My husband absolutely loves it!",
      "This turned out better than I could have imagine!  Great quality and communication!",
      "This gift blew me and my wife away. I had no idea after putting all the information in the boxes how the overall product would turn out! The soundwave was cool, the feel of the board was bery nice and the QR code she scanned worked instantly. We sat and listed to our wedding somg as we exchanged gifts. \n\nAlso, my wife was a huge fan of whatever that wrapping paper was! \n\n\nA plus all around."
    ]
  },
  {
    "productId": "qLLaHWQiYm",
    "url": "https://www.etsy.com/listing/461000746/gps-coordinates-longitude-latitude-sign?click_key=51fd9ccab446f761df29b3c8452f7d15b98c099b%3A461000746&click_sum=0a611d43&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-41&frs=1&etp=1&sts=1",
    "title": "GPS Coordinates Longitude Latitude Sign, Realtor Closing Gift, Housewarming Gift, Christmas Gift, Coordinates Sign, Memorial Sign",
    "description": "ABOUT THIS WOOD SIGN:• Made to order• approx. 8\" x 12\" w/ hanging hardware• Displays ONE (1) Coordinate• Pick from Dark Walnut, Briarsmoke, or Early American• Coordinates will be converted to the style that is pictured• Hand painted (NO DECALS)• back of sign is stained and stamped with my logoABOUT SHIPPING:• Please see \"estimated shipment date\" prior to purchasing• Handmade in the order in which received• \"In stock quantity\" is so that multiple people can purchase at one time• Cancellations are not accepted• Mailed USPS Ground Advantage 2-4 day; mail delays are out of my controlIMPORTANT: Please leave your coordinates in the personalization or note to seller section if you're using an older version of the Etsy Mobile App. If you're not sure how to find the coordinates to your special location, feel free to leave a note with the address and I'll get it for you.MUST READ:ALL COORDINATES WILL BE CONVERTED TO THE STYLE THAT IS PICTURED00°00'00\"N00°00'00\"WBecome a Bluebird Watcher: mailchi.mp/0d4232f1d64f/welcomeSubscribe and get 15% off your next order. Be the first to know about new products, sales, and giveaways each weekAll items found in this shop are made from natural material such as wood and grapevine. Signs and trays are made of real wood and are either stained and/or painted (no vinyl here). Due to the nature of wood, knots and grains will vary from sign/tray to sign/tray. These are meant to look rustic and may have varying imperfections including (but not limited to): dents and cracks. Napkin rings use natural grapevine forms and faux floral/greenery. Due to the natural of wood not all forms are perfectly round. We do our best at picking wood and/or wreath rounds that are as perfect as possible. Everything in this shop is made to order and due to the nature of The Mountain Bluebird Co, we do not accept returns.  Please note that all sizes are approximate and may vary up to an inch.Copyright © the Mountain Bluebird Co. 2015-present",
    "reviews": [
      "I purchased this as a gift, and they loved it.",
      "Thanks for shopping TMBC. I’m so happy your gift was a hit. I look forward to creating for you again in the future.",
      "Before I ordered, I had questions which were answered quickly. This was a gift so I did not see the final product. Recipient seemed happy.",
      "Mary,\nThank you for shopping The Mountain Bluebird Co. I'm so happy you're overall experience with my shop went so well. I'm even more happy the gift was well received. I look forward to creating for you again sometime soon.",
      "This is my third purchase with this shop. Quality work! Thank you!",
      "Kimberly,\nThank you for your continued support with The Mountain Bluebird Co. I'm so happy you continue to love the coordinates sign. I look forward to creating for you again sometime soon.",
      "The sign exceeded my expectations! Amazing quality and the seller is exceptionally helpful and easy to work with!!!"
    ]
  },
  {
    "productId": "bDTyrWwOeq",
    "url": "https://www.etsy.com/listing/247240515/personalized-kitchen-signs-gifts-decor?click_key=d1f3cfcba1b1825b78e6599c54b1aa66764e0eae%3A247240515&click_sum=2aad58c7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-42&frs=1&etp=1",
    "title": "Personalized kitchen signs-gifts-decor-items-kitchen decor-art-gift for mom birthday-wall decor-gift for cook-chef-custom kitchen sign gift-",
    "description": "►ABOUT THIS SIGN *** This sign has been painted matte WHITE.* BLACK precise ink lettering.* Available in 6\" x 18\", 9\" x 24\", 12\" x 36\" & 16\" x 48\"* Mitered corners* The frame is 1\" thick, made from pine wood.* Display frame is stained walnut color* Background is 1/4\" thick* Saw-tooth hanger installed on back for easy hanging* Your choice of frame stain options",
    "reviews": [
      "Excellent product, it came so quick and looks awesome in my space",
      "Loved this gift! It was made well and looked great!",
      "Very nice work , I love it."
    ]
  },
  {
    "productId": "BZwphvpqAS",
    "url": "https://www.etsy.com/listing/219370277/4-coasters-wood-slices-wood-coasters?click_key=f3e532fb270fe37a08466f06d52024304f450d39%3A219370277&click_sum=97538070&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-43&etp=1&sts=1",
    "title": "4 coasters, wood slices, wood coasters, reclaimed willow wood coasters, set of 4 coasters",
    "description": "4 decorative natural wood coasters, made from reclaimed willow wood. Wood is a natural product and varies in appearance. These would be great at place settings or for decoration around the house. We're happy to do larger quantities, please message us for availability!  These coasters come tied with twine and are ready for gifting.Each coaster measures approximately 3 - 4  inches in diameter and are about a 3/8 of an inch thick.If you would like to send these as a gift let us know and we can include a personalized card.This natural wood product will need air and should not be left wrapped up.For other kinds of wood, coasters check out my shop athttps://www.etsy.com/shop/susieswoodshophttps://www.etsy.com/listing/234428862/set-of-4-aspen-coasters-reclaimed-aspen?ref=shop_home_active_3https://www.etsy.com/listing/234686122/4-coasters-wood-slices-wood-coasters?ref=shop_home_active_8https://www.etsy.com/listing/263041065/wood-coasters-set-of-4-reclaimed-wood?ref=shop_home_active_12https://www.etsy.com/listing/263122769/4-coasters-wood-slices-wood-coasters?ref=shop_home_active_13*VARIATIONSNatural: Lightly sanded to retain natural textureLacquered: Sanded smooth and lacquered for a smooth satin finish.",
    "reviews": [
      "These pieces of wood are great , just what I was looking for.",
      "Perfect! Items arrived as described and great quality. My husband loved them!  Thank you! :)",
      "I love the natural look of these coasters"
    ]
  },
  {
    "productId": "EGTjVaVZiD",
    "url": "https://www.etsy.com/listing/267098338/pineapple-front-door-wreath-front-door?click_key=bc41c6d74221f56a0e72055954ca658dc5a53ad3%3A267098338&click_sum=cd761cf5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-44&pro=1&frs=1&sts=1",
    "title": "Pineapple, Front Door Wreath, Front Door Decor, Pineapple Decor, Door Hangers, Elegant Door Wreath, Door Decorations, outdoor wreath",
    "description": "🌻 Add a touch of charm and cheer,  while giving your home a warm and inviting atmosphere with this Pineapple Door Hanger. This wreath is full and created with love using a  high-quality steel, then powder -coated with a beautiful long-lasting UV finish with the intention of lasting longer than the average wreath in an outdoor setting. This wreath is a classic and will compliment any decor.▬▬▬▬▬▬▬ WHATS INCLUDED ▬▬▬▬▬▬▬*1 EA ( Personalized metal sign like the example photo )**Mounting hardware is NOT included▬▬▬▬▬▬▬ SIZES AVAILABLE ▬▬▬▬▬▬▬• 20\" Tall x 10\" Wide (seen in photo 1&2- color metallic gold)• 26\" Tall x 13\" Wide (seen in photo 3- color golden yellow)Available with or without an over-the-door hook for easy hanging.Over-the-door hook dimensions are1\" wide x 16\" Long🔆FEATURES & DETAILS🔆• Made of Heavy-Duty, American-Sourced, Cold-Rolled Carbon Steel• Each sign is hand-designed and laser cut using top-of-the-line laser technology, which produces superior cuts & and precise edges• Triple sanded for a high-quality, smooth finish so it won't damage your door• Weights approximately- 12\" -2lbs , 18\" - 4lbs , 24\" -6lbs, 30\" -10-12lbs.•Professionally powder coated on both sides for indoor or outdoor use.• Fade & Rust Resistant• All text will be showcased in uppercase lettering like the listing photo.🔆EASY ORDERING INSTRUCTIONS🔆1. Select your preferred SIZE and add-on options. from the first drop-down menu (All sizes are shown in inches.2. Select your POWDER COAT COLOR selection from the second drop-down menu (If your preferred color is not listed in the dropdown menu, please select “Other”, then type the name of your color selection in the “Add Your Personalization” box at the bottom of the form)3. Enter your personalization details if required - see the instructions above the personalization box section. Please be sure to include all personalization that is required.4. Add an item to your cart and proceed through checkout. Add any special notes in the “Notes to Seller” box at checkout.🔆OTHER DETAILS 🔆• Each sign is custom-made to order.• All items are intended for decoration purposes only, not intended for use by children, please handle them with care.•We Proudly offer Free shipping to the Contiguous United States for this item on orders over $35.For shipping to Alaska, Hawaii, and Puerto Rico, please contact us for a shipping quote• We welcome custom orders, contact us with your ideas for a quotation.•If you have any questions or concerns, please contact us! We are always happy to assist.Be Happy and blessed!The HouseSensationsArt Team▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬***Please see store announcements, store policies, and FAQs for additional details.▬▬▬▬▬▬▬ CONTINUE SHOPPING ▬▬▬▬▬▬▬Find our other great home décor items here:https://www.etsy.com/shop/housesensationsartThank you for considering HOUSESENSATIONS Metal Art!▬▬▬▬▬▬▬ LISTING PHOTO DETAILS ▬▬▬▬▬▬▬PHOTO COLOR:  Metallic Gold 20\" tall    Thank you for shopping with HouseSensationsArt",
    "reviews": [
      "Beautiful, love everything about it.",
      "This is a beautiful door hanger. The quality is excellent.",
      "It’s way more pretty in person!",
      "Got this as a gift for son and his fiancé.  He loves it, and she likes it and likes it more because he loves it.  Very pleased with the speed it was sent and based on the reviews from son and fiancé, it was worth it."
    ]
  },
  {
    "productId": "noiwiLcOnm",
    "url": "https://www.etsy.com/listing/226585297/suncatcher-crystal-moon-wooden-gift?click_key=0b51d37a975bc7ca21599e0ae803b65d1b08ec25%3A226585297&click_sum=7958e09f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-45&frs=1&etp=1&sts=1",
    "title": "Suncatcher Crystal - Moon - Wooden Gift - Memorial Gift - Housewarming Gift - Birthday - Special Friend MEDIUM VERSION",
    "description": "When hung in a window, these beautiful suncatchers will catch the sunlight and create dazzling rainbows around your room.Ideal gift for birthdays, special friends, remembrance gifts, housewarming and much more. The suncatchers will brighten up any home, yoga studio, workspace.Made in IrelandWe dispatch orders in 1-2 working days.These hand-crafted crystal window creations are made from a variety of Irish woods such as Beech, Oak, Olive Ash, Spalted Beech, Elm and Walnut.Crystal Angel = 20mm(3/4 inch) diameter Asfour crystal body with 2 x 14mm Asfour Crystal octagons, 2 x 18mm Asfour Crystal octagons and 10mm(1/4 inch) Asfour crystal head with Preciosa crownCrystal Sphere = 30mm(1 1/4 inch) diameter Asfour crystalCrystal Sun = 40mm (1 1/2 inch) diameter Asfour crystalWood Dimensions: Approx 130mm (5 inches) at its longest point.Hanging string length: approx 300mm (12 inches) - please let us know if you would like this longer or shorter for your particular requirements.This moon is medium sized. For small and large versions please view my other listings here:https://www.etsy.com/ie/shop/ArtwoodIreland?ref=seller-platform-mcnavWe also offer personalised options where you can have a special message engraved into the wood. Please go here to see your options:https://www.etsy.com/ie/shop/ArtwoodIreland?ref=seller-platform-mcnav&section_id=18941405The above image is a sample. The characteristics of each piece of wood will vary slightly. We are very conscious of making sure that each and every piece is of equal natural beauty.-Each piece is finished with danish oil to what we believe is the perfect sheen.-It is hung with a high quality braided Dyneema fishing line which does not degrade in light like many other common threads. This line allows for exceptional free flowing spinning of the moon and the crystal within the moon.-Wood is sourced locally in the west of Ireland-They come carefully packaged in an environmentally responsible plastic-free gift box.- We will gladly include a gift note for you so that the recipient knows who sent their special gift. Printed on recycled Kraft paper. An option for your gift note will come up in the checkout process.Dispatched same or next working dayPlease note that these suncatchers are designed for indoor use and have not been tested outdoors.",
    "reviews": [
      "Amazing beautiful gave one to each of my sisters and got one for myself as well",
      "The wood that I chose was stunning. Loved that there were so many options to choose from. Excellent quality and appearance. The recipient loved the gift.",
      "It’s really a gorgeous piece!"
    ]
  },
  {
    "productId": "uOEMmOGvjr",
    "url": "https://www.etsy.com/listing/246131668/vintage-tropical-botanical-print-set-no?click_key=b11205daac1af18ffa5a83786da26bfd21f6d555%3A246131668&click_sum=22ed5a6a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-46&frs=1&etp=1&sts=1",
    "title": "Vintage Tropical Botanical Print Set No. 1, Giclee Prints, Pineapple, Art, Beach Decor, Coastal Art, Botanical Print Set, Poster, Palm Trees",
    "description": "***We Now Offer a Gallery Wrapped Canvas option for all of our prints and sets. This option is available in the \"Art on Canvas\" Category in the shop. ***Vintage Tropical Botanical Print Set No. 1 - Fine Art Giclee Print SetThis set features a set of 4 hand colored etchings from the 1770's by noted botanical illustrator George Ehret. Each illustration has been digitally enhanced and added to a lightly tinted background which enhances its vintage charm.***Frames are for display purposes and are not included.SIZES-----------------------------Available sizes & prices are displayed in the drop down menuBACKGROUNDS-------------------------------A picture of the background used with each print or set is also shown in the description photos.ARCHIVAL PAPER-------------------------------We have 2 premium archival options to choose from.Archival Canvas Textured Paper – an acid-free, PH-neutral Archival paper that has a beautiful matte, textured finish.Archival Smooth Matte – a substantial weight, acid-free, PH-neutral Archival paper that has a beautiful matte finish.PROCESS--------------------------------We use professional wide format Fine-Art Giclee Epson printers and Epson archival quality pigment based inks, which provide the most beautiful color gamut. The depth and clarity of color is truly impressive.Our prints arrive ready to frame and are sized to fit “off the shelf” standard retail frames.* Please be aware that actual colors may vary slightly from those shown due to the nature of handmade products in addition to how colors are displayed by individual computer monitor settings.OUR THANKS TO YOU----------------------------------Thank you for visiting Belle Mer Graphics and please don’t hesitate to contact us with any questions!Please visit our other Etsy shops for more vintage inspired art:Belle Botanica – Vintage Garden & Nature Inspired Fine Art Giclee Printswww.bellebotanica.etsy.comwww.bellebotanica.comBelle Maison Art – An eclectic mix of Natural History, Decorative Arts and Botanical Fine Art Giclee Prints.www.bellemaisonart.etsy.comwww.bellemaisonart.comBelle Mer Graphics – Vintage Fine Art Giclee Prints Inspired by the Seawww.bellemergraphics.etsy.comBelle Art Prints - DIY Printable Art for the Homewww.BelleArtPrints.etsy.com",
    "reviews": [
      "I purchased this as a gift for my sister-in-law, and she loved them! Quality shipping and paper.",
      "Great prints! Shipped quick and packaged well.",
      "Very beautiful prints. I hung them in my salon suite and I receive many compliments on them. 10/10"
    ]
  },
  {
    "productId": "xoAJY5SnBd",
    "url": "https://www.etsy.com/listing/247020065/watercolor-seascape-painting-archival?click_key=ddac94d9996bccd0dd8c5ff7ac3385b0dcad45fa%3A247020065&click_sum=e2adab18&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-47&frs=1&etp=1&sts=1",
    "title": "Watercolor seascape painting, Archival Print from original painting, Maine, Rowboat Alone at sea, serene moody landscape, coastal art",
    "description": "This is a giclee print of my own original watercolor painting. Printed with colorfast ink on premium archival fine art paper. Prints are signed in the back and have a white border for easy framing.I live on the wild and beautiful coast of Downeast Maine. We moved to an old, old house with a small farm in the forest, near the water. There is nothing I love more than taking quiet time for myself out on the water.Printed on Epson Velvet Fine Art Paper because it is very similar to the original paper these were painted on. Options for paper size are:8.5 X 11 inches  $5013X19 inches     $7017 X 22 inches   $85Not all images fit standard paper sizes and may need custom frames.Most images can be custom printed larger on paper or canvas, just go to \"custom\" or convo me with you wish and I will do everything to make it happen.Each print is packaged in a  protective, acid-free sleeve and shipped in a flat cardboard mailer. I usually ship the print by regular mail the day after I receive the order. I am very happy to accommodate special orders like larger prints or portraits. Prices do apply.Please feel free to convo me with any questions or requests. I love comments and convos from people around the world!",
    "reviews": [
      "Such a beautiful piece! The quality and detail is outstanding.  Will be visiting your shop often! Thank you!!",
      "Very nice- item as pictured",
      "Beautiful print!"
    ]
  },
  {
    "productId": "PszRZxYXks",
    "url": "https://www.etsy.com/listing/564113725/wooden-bottle-opener-personalized-wall?click_key=1d4cad9253f353d3d3d0d67a1e383a832ba18876%3A564113725&click_sum=4b78ef9e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-48&pro=1&frs=1&sts=1",
    "title": "Wooden bottle opener, personalized wall bottle opener,  magnet bottle opener",
    "description": "Wooden bottle opener, personalized wall bottle opener, magnet bottle openerWooden bottle opener - wall bottle opener🍺  Custom design / personalized wall bottle opener with a hidden magnet on the top !✔️ handcrafted , hand painted🍺  Product Dimensions -    : approx  11.81\" / approx 30 cm🍺  Material :  18mm Plywood🍺  Design : ✔️We Love  HANDMADEmagnet bottle openerAre you looking for a Personalized Bottle opener ?Our  wall wooden beer openers are easy to mount on every wall .The beer bottle Opener is laser engraved and a great gift for every occasion !No more hustle about bottle caps scattering on the floors .The hidden magnet opener collects your cap, it catches the bottle caps as they fall !***************************Back to my Shop :https://www.etsy.com/shop/HappyWeddingArt?ref=hdr_shop_menu***************Please make sure that you see our policies before purchasing !https://www.etsy.com/shop/HappyWeddingArt/policy?ref=shopinfo_policies_leftnavThank you ! @ikiWooden bottle opener, personalized wall bottle opener, magnet bottle opener",
    "reviews": [
      "Product as expected and delivered in time.",
      "Wonderful quality and looked fantastic.",
      "loved this great quality - perfect gift",
      "It was exactly as advertised-No surprises\nRecipient was very pleased!!"
    ]
  }
]
