[{"productId": "eBgpVcdSZz", "url": "https://www.etsy.com/il-en/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=e8d950f3575e7464c59ce61d372d7a06ba4195a9%3A724851215&click_sum=991964c2&ref=stl_listing-1", "title": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Unique Light Fixture", "description": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Clay-light Artwork, Unique Light Fixture  Art Creation , Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by past traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for the sense of belonging through the local material culture.Color: Forest green,  white, Mint, burgundy, orangeMeasurements:Height\t17.7 inchDiameter 7.9 inch", "reviews": ["Great lamps! I enjoy looking at them every day!", "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!", "Amazing product! Really good quality !", "Beautifully made. Packaged with care. Arrived as scheduled."]}, {"productId": "ZenEryHWMK", "url": "https://www.etsy.com/il-en/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=29f6da8860044924d2ab0296c3e8e4d09491e7cd%3A654638870&click_sum=68951a9a&ref=stl_listing-2", "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift", "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch", "reviews": ["Amazing, delicate yet sturdy. Beautiful craftsmanship.", "Great item and customer service", "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."]}, {"productId": "lovroqskeB", "url": "https://www.etsy.com/il-en/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=a20f3e45be89a11d1583bfae28fe0ece4b815ae3%3A776223242&click_sum=6d4dc964&ref=stl_listing-3", "title": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture", "description": "Give your home a boost of warmth and a homely feel with a delicate natural terracotta lamp.Made by hand in a small boutique studio in Tel AvivAll necessary fitting parts are included.Technical:Lamp holder: E27Transparent cable : 150 cm / 60 inchesCeiling rose: 10 cm / 4 inchesEnergy-saving LED light bulbs are recommended. We prefer the Edison Vintage style Bulb.Voltage 110V-250V | 25 to 40W maxThis piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless of creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.Please note that this object is handmade, and each piece is unique.This object can be ordered in various colors and prints, talk to us for more info.You can see similar models here:https://www.etsy.com/il-en/listing/776245646/ceiling-lamp-pendant-terra-cotta-lamphttps://www.etsy.com/il-en/listing/776221084/hanging-terracotta-ceramic-lamp-colorfu", "reviews": ["Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!", "Amazing product! Really good quality !"]}, {"productId": "F2MwHrFyVp", "url": "https://www.etsy.com/il-en/listing/712573399/vintage-armchair-from-mid-century?click_key=3c8b1287bffc912bfed8d1f2ae564fab0026818b%3A712573399&click_sum=e62ab1c0&ref=stl_listing-1", "title": "Vintage Armchair from Mid Century, Mustard, Restored", "description": "Attention! Please contact us before order the chair if you are customer from United Kingdom - regarding to the Brexit.Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standardThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.Wood has been sanded and secured with high quality oil to expose the beautiful wood grains.The shape has been preserved in every detail as original.Dimensions:Width - 22.8 in, 58 cmHeight - 31.4 in, 80 cmDepth - 24.8 in, 63 cmSeat Width - 18.1 in, 46 cmSeat Height - 14.2 in, 36 cm", "reviews": ["Beautiful chair with crafted wood finish. Slightly firmer than expected but very comfortable. Gorgeous colour.", "Item quality is excellent, however I find the chair a little small. There was a problem with delivery, but the seller was as helpful as he could be on the matter."]}, {"productId": "aEtTDoeHlw", "url": "https://www.etsy.com/il-en/listing/649720699/completely-restored-black-and-white?click_key=c5b31fa1f1cf1c531ec6f1ca843212ca0ab2c0c7%3A649720699&click_sum=d495f956&ref=stl_listing-2", "title": "Completely restored Black and White cocktail chair from 1970's", "description": "Dimensions in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in------------------------------------------------------------------------------------------The mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white colored upholstery fabric for the refurbishment.Our manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.", "reviews": ["Very beautiful cocktail chairs, they arrived well packed. I’m very happy with this purchase!", "this is the second chair I buy. they are wonderful.", "It's reallly a beautiful and comfortable cocktail chair, looks like shown on the pictures and came quickly and safely packed. Thank you very much!"]}, {"productId": "UaLDZSMpoA", "url": "https://www.etsy.com/il-en/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=1d3bb7ec649af46bf155dbd8bfd53e69697096a5%3A1110352719&click_sum=a8d6977d&ref=stl_listing-3", "title": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade Sherpa chair mid century set, small comfy armchair for living room", "description": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade furniture Sherpa chair  bring a 60's Furniture feel into your home with this solid wood Mid century Armchair Upholstered in boucle teddy soft fabricOur Mid century armchair is made from solid wood and upholstered with brown faux leather.⚒ All furniture is handmade in our shop!Armchairs can be upholstered in another fabric or stained in another color, contact me for more info➤ **note for NON-EU buyers - please be aware of possible import fees and taxes, these are calculated additionally when the items are sent and these fees are collected by the delivery company and paid on your behalf to your government. The amount of these fees varies in every non-EU country.*** We are sending from Croatia which is a part of the EU - for EU buyers there are no additional fees *➤ Check out my shop for more Mid Century Vintage Furniture ➤https://www.etsy.com/shop/RetroDesignCRODimensions:• Overall height: 74 Centimeters / 29.6 inches• Overall width: 63 Centimeters / 25.2 inches• Overall depth: 70 Centimeters / 28 inches• Seat height: 40 Centimeters / 16 inches• Seat width: 50 Centimeters / 20 inches• Seat depth: 50 Centimeters / 20 inchesMaterials:• Stained Solid Beech Wood• Boucle teddy fabric• High quality furniture foam density 30*simple assembly required instructions included", "reviews": ["Lovely chair, exactly what we wanted", "Very good quality armchair that meets our expectations.\nThe follow-up is top notch: thank you Marija!", "Very nice armchair! Comfortable and very pretty", "The armchair is beautiful, completely in line with the photos and our expectations. The curls are very soft and the seat is comfortable, especially with the footrest.\nVery good responsiveness of the saleswoman and good follow-up. The delays were a little long to receive it, but everything was in accordance with what had been announced."]}, {"productId": "X3HWQPrUgE", "url": "https://www.etsy.com/il-en/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=9435afe93b99d6620ded8489deb8c67d305d1615%3A903050205&click_sum=511eb3e5&ref=stl_listing-1", "title": "Large Vegan Suede Yellow Desert Knot Floor Cushion ,suede ottoman, Knot Floor Pillow, Modern pouf, ottoman cushion, pouf ottoman, suede pouf", "description": "Soft, cozy with beautiful earthy tones. We can't get enough of the new vegan suede collection!  The vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. These floor cushions are beautiful and functional. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner.Size: 75X75 cm / 30X30 inchHeight: 35 cm / 14 inchMaterials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric.Care: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean.Production and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase.Custom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout.Please Read about our shipping, refunds and exchanges policies.For any thoughts or questions please send us a Message and We'll be happy to answer ASAP.Buyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs.", "reviews": ["Love, love, love this stool.!  So unique and adds a touch of elegance and unexpected whimsy to my vanity.", "She is great to deal with. Very responsive. It’s exactly as beautiful as the photos! It’s very well built, strong and sturdy. A work of art. Love it!", "I love how it turns out.", "Better than expected. Absolutely gorgeous and super quick communication."]}, {"productId": "GaRSmDPmoE", "url": "https://www.etsy.com/il-en/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=ace767681c81a9b0823f6106c91ad8dc0598b77b%3A904960951&click_sum=cb1cb2aa&ref=stl_listing-2", "title": "Floor Pillow | Meditation Cushion | Floor Cushion | Floor Pouf | Floor Seating | Round Floor Pillow | Square Floor Pillow | Teal Home Decor", "description": "Get ready to get comfy with my new floor pillows!Imagine moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. With my new floor pillows those dreams are now realities!The original print for this floor pillow was created in my design studio in Maine & the floor pillow is made to order thanks to the help of my fabulous sewing partner.Two different shapes-the circle and the square-plus two different sizes... All those choices equals soft, comfy, and oh-so-pretty floor pillows that are great on their own, or stacked for even more comfort. Let's be honest-chairs are so last year.••• PLEASE NOTE •••The pillows have a small \"X\" stitch detail in the center of the pillow... tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time... keeping your pillow plump and comfy sit after sit after sit :)PRODUCT DIMENSIONS(Please note there is a 1\"-2\" tolerance on all printed textile products)23\" Round : 23\" x 7\" Tall26\" Round : 26\" x 7\" Tall23\" Square : 23\" x 23\" x 7\" Tall26\" Square : 26\" x 26\" x 7\" TallPRODUCT DETAILS100% woven polyester printed fabricSewn closed with premium poly fillCARE INSTRUCTIONSSpot clean onlyPRODUCTIONPlease allow up to 5 - 10 business days for production of your custom made item.• PLEASE NOTE •I am currently unable to deliver to PO Boxes. Please provide a physical mailing address with your order. Thanks!RETURN POLICY FOR THIS PRODUCTYour floor pillow is custom made just for you and as a result I am unable to offer returns/exchanges unless your item arrives damaged or defective.", "reviews": ["Beautiful cutting board, just as pictured.", "Beautiful original art made into fabric! Artist was very responsive!", "This is a beautiful comforter and arrived just in time for my birthday thanks to the excellent customer service!  Thanks so much!!"]}, {"productId": "weRAFgqsRw", "url": "https://www.etsy.com/il-en/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=8404afd2483f5f2eebf83b627975eba358957490%3A266515154&click_sum=3eeb33f5&ref=stl_listing-3&sts=1", "title": "Kids Knitted Footstool, Crochet Pouf Ottoman, Grey Knitted Pouf Kids, Knitted Pouffe Ottoman, Nursery Pouf Ottoman, Scandinavian Decor", "description": "Welcome to Zuri House!Children just love to play and explore new objects and textures. They are sure to love this cozy knitted pouffe to sit, play, climb and rest. You will love it too! This pouffe is a beautiful addition to any nursery or young child's room.This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.ABOUT THIS POUFFEMaterial:-fabric inner bag filled with polystyrene beads-knitted cover made with chunky cotton cordColour: LIGHT GREYSizes:SMALL:Diameter: Approximately 45cm (18”)Height: Approximately 30cm (12”)MEDIUM:Diameter: Approximately 50cm (20”)Height: Approximately 40cm (16”)Care:-the knitted cover can be removed for washing (it can be washed in 30 degrees in the washing machine)-the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.MORE OF OUR KNITTED POUFFESIN SMALL SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332437IN MEDIUM SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27316506IN LARGE SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332459PLEASE NOTEI always try to describe my items as accurate as possible. I provide detailed information about used materials and the product dimensions. Please make sure that the item you would like to order meets your expectations. I always try to show the actual colours of my products but please remember that they may slightly vary from the colour on your screen due to monitor colour restrictions.FOLLOW ME!www.facebook.com/nebozuri/www.instagram.com/zuri_house/www.pinterest.com/zurihouse/www.zurihouse.comQUESTIONS?If you have a question about this pouffe or would like it in another size or color, please use the Message Seller button below and I’ll get right back to you!Thank you for shopping at Zuri House!", "reviews": ["Absolutely lovely item beautifully made and packaged. Very quick and helpful communication. LOVE it !", "Thank you!:)", "Such a nice addition to my son's room, he loves it and so do I. Purchased a medium too!", "Amazing quality, just what I wanted to finish off my nursery", "High quality product and super soft. Just like the photos on the sellers page. Love it!"]}, {"productId": "KWdRTDYsHS", "url": "https://www.etsy.com/il-en/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=6139e75747e462cf794becc15163216d9209e37d%3A811521978&click_sum=9c8db571&ref=stl_listing-1&sts=1", "title": "Illustrated Parian Porcelain Vase - Stroke / Brushstroke", "description": "With it’s assured, bold brushstrokes against a bright white base the Stroke Long Vase is a declaration of a love of pattern and bold design. Perfect as a stand out piece for a mantlepiece, sideboard, or as a centre piece for your dining table. Ideal for holding bundles of your favourite blooms and leafy bouquets, the Stroke Long Vase will be sure to make an impact with or without foliage.Slipcast in Parian porcelain, the Big Pot is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent. Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with.From start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.Material: Parian porcelainFinish: Matte outside, glossy insideSize: 21.5cm x 9cm (ø)", "reviews": ["Exactly as described and such a beautiful piece. Love the matt exterior and the glazed interior as well as the semi-translucent nature of the material. The perfectly positioned hand painted strokes show the care and thought that went into producing it.", "I love this mug! It is so beautiful. It was very well packaged too!", "I only wish it came in a larger version too! Love it!", "Very well made sturdy little ceramic cup!"]}, {"productId": "QqnqhOlKQE", "url": "https://www.etsy.com/il-en/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=fc56957f9f9a6b9b4682e8ccefface2f70dd7ed1%3A986518800&click_sum=e9e548bd&ref=stl_listing-2", "title": "Small amphora vase, old Greek pottery inspired vase, handmade ceramic vase", "description": "A beautiful hand-built small amphora vase with black and white triangle pattern.It works great as a decorative item or can carry beautifully a bouquet of small flowers/a little tree branch...It was made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white upon which it was fired to cone 8 (1250C) in an electric kiln. The base was left unglazed and is impressed with my maker's mark.DIMENSIONS & MATERIALS:~ speckled stoneware clay, non toxic glossy white glaze~ app. 13.5cm high and 9cm wide (5.3\" x 3.5\")Dishwasher safe.CONDITION OF THE PRODUCTSBecause all our pieces are handcrafted, there may be minor variations form item to item.SHIPPING INFORMATION:All orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days.All EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of Slovenia. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days.There is a shipping upgrade option to Express DHL for European orders. Please see listing \"Shipping Upgrade\" for further details.", "reviews": ["The quality is excellent and the shipping was fast.", "The quality is excellent and the shipping was fast.", "The quality is excellent and the shipping was fast.", "Very happy with my bowl. So beautiful and good quality."]}, {"productId": "QDoAnXGQdh", "url": "https://www.etsy.com/il-en/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=ec2db49f5e91c6658f23a654932d737ae2da260c%3A908084516&click_sum=9adac0a8&ref=stl_listing-3", "title": "Burlap Jute Glass Vase, Hand Painted, Black and White, Home Decor Art, Unique Gifts", "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.- Handcrafted with jute, burlap fabric, and glass bottle.- Dimensions - 5\" tall; base 5.5\" wide.- Beautiful addition to your home or office decor.- Indoor use only.", "reviews": ["love these vases I have 4 now and I love them, True ART!", "Unlike any vase I've seen. DenzCrafts has a unique style and aesthetic. I will be adding to my collection :)", "These are So Gorgeous. Truly works of art. Very unique and looks so high end!"]}, {"productId": "Ry7DRAMIzW", "url": "https://www.etsy.com/il-en/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=bfc12b64e7f792985c5dce93adb9029eb02cb148%3A1206357075&click_sum=a191fb9c&ref=stl_listing-1", "title": "Cushion covers - Exclusive pattern - Unique design - Handmade - Decorative cushion - Cushion cover - Handmade - Exclusive pattern", "description": "🔵 CUSHION COVER 🟧💻 Exclusive pattern digitally designed - Exclusive pattern digitally designed🖨 Printed in the South of France - Printed in South of France✂ Handcrafted in my workshop - Handcrafted in my workshop⚡ Creation in limited series - Limited edition designMAIN FEATURES :- Wallet closure- Face fabric = Water-repellent and UV-resistant fabric- Back fabric = Heavy duty 100% cotton twill- Slightly textured print quality- Fully overlocked on the reverse🧼 MAINTENANCE:Wash at 30°C. Natural drying. Do not wring. Iron at low temperature.📮 Shipments by post with tracking", "reviews": ["Deliciously retro but with shimmering colors", "Seller was super helpful and very responsive in helping me track the package", "Amazing colors and design!! Gifted for a friend and wishing I had one :)", "Stunning! The hat is even cuter in person, and the seller was wonderful to work with. Highly recommend!"]}, {"productId": "NVMUmhSvtH", "url": "https://www.etsy.com/il-en/listing/566822148/color-therapy-pillowcolorful?click_key=a252dd4962fe140754267de9799abb7333578c78%3A566822148&click_sum=853cd7b0&ref=stl_listing-2", "title": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow", "description": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow-------------------------------Let sparks of happiness fly with this gem of a pillow! We dare you to find something happier than this line-up of colorful stripes. We believe that lovely things and bright colors can give hope during difficult times and joy on gloomy winter days—especially when they come to us with an inspiring origin story. This cloth is made by an indigenous family who came to Cuenca to sell their handiwork, the colorful stripes are woven on an antique loom and take weeks to make. Of course, the pattern caught our eye from a mile away and while there are many stripe options available, this is our favorite. When you see this pillow in your home, imagine the women and girls of this community who wear this cloth as a skirt, and remember that we are all connected to each other in a sisterhood of love and empowerment.-------------------------------Striped Fabric: 100% hand-loomed cotton.Size: 19\" x 19\"**Stripes vary slightly in each one**-------------------------------Very soft to the touch. Hidden zipper at bottom. Pillow insert not included. For a fuller look, get a pillow an inch or two larger. Sewn for About Love by an interior design studio in Ecuador.-------------------------------Notes from Other Women:\"This pillow is even better in person!\"", "reviews": ["This sweater is soooo soft and warm!  It is a tiny bit tight around the armpit, but other than that, it is as beautiful as in the photos!  It also stretches and conforms to my body!  I love it!  And because it is wool, it will be easy to clean.  This was the best present my hubby could have given me.  Thank you to A Shop About Love", "Love my new sweater! I have wanted a nice white sweater for dress up or dress down and this is it.", "This is an incredibly cozy sweater,  made of the softest wool ever (think cashmere); 10 stars for that!  I purchased size XL, looking for relaxed fit - I am usually a size 12 and could have probably gone with a size L.  Wouldn't have been much of an issue except that with the XL, the pockets come down almost mid-thigh, and I am not petite (5'8\").  Last and not least, for the cost, my sweater came with several loose ends, that I will take care of to ensure no unraveling of stitches in the future.  Overall a great purchase - thank you!", "Hello, Tutti! Thanks so much for sharing about the sweater. So glad you’re enjoying the coziness. And so sorry about the yarn ends. We work with many knitters in villages in the Andes and I’m sorry this slipped through our own quality checks. But thank you for mentioning it and we’ll work to improve that detail on our end!", "This sweater matched the photo description perfectly! In fact, it is better in real life. The quality is everything we hoped for. I use the \"editorial we\" here, but in point of fact                                                     I purchased this as a gift for my wife, who is ecstatic about\nthe fit, the  feel, the comfort, and how far her expectations\nwere surpassed. I'll be back!     Alvin Cooper RN"]}, {"productId": "ECAmrDgJWu", "url": "https://www.etsy.com/il-en/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=f6fa54914ce2a267b976bdca39d580019cadcff0%3A1168874671&click_sum=e53672d3&ref=stl_listing-3", "title": "Throw Pillow • Parquet Design • modern mid century mod red orange stripe gift design couch living room colorful party cotton pillow cover", "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.100% cotton with zipper closing16\" squareDesigned in Canada • Made in IndiaPillow form not included.", "reviews": ["Love this calendar, I was looking for a smaller one and this one is perfect!", "I’ve ordered a calendar two years in a row now and I don’t plan on stopping for 2025. They’re on gorgeous paper, the designs themselves are great and it’s the perfect size to not take up too much space on my wall.\n\nLove it!", "love the designs and looks great on my wall :)", "Great quality, looks exactly like the picture! Colours really pop, I love it"]}, {"productId": "DjOOXbsDyd", "url": "https://www.etsy.com/il-en/listing/790049531/address-sign-modern-house-numbers-house?click_key=e5152cb0468b7ecd159695725d3bad845c96d6a7%3A790049531&click_sum=fea5fd98&ref=stl_listing-1&sts=1", "title": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign", "description": "Wood Address Sign-Note in the personalization area your address. If your address is not obvious with only numbers and a street name please specify which goes on the top of the graphic bar and which goes on the bottom.FINISHESThese will come painted with black exterior grade paint if ordering painted unless otherwise specified (See our color chart). Unpainted comes sanded and ready to be finished at home. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.MEASUREMENTSThe sign is 14.5\" wide and the height will vary depending on the length of the address.MATERIALWe use a high-quality cabinet grade 1/4\" thick baltic birch wood.HANGINGThese come with two drill holes in the graphic bar. Be careful not to drill too far and crack the wood when installing.All designs and photos owned by Michael Miles Creations: © Copyright 2017-present | All Rights Reserved --------We have SOLE OWNERSHIP of any and all designs we create. We do not give anyone permission to copy our designs.FINISH OPTIONSIf you order painted and do not note a color in the personalization area, your cutout will automatically be painted black.Unfinished means your order comes sanded and ready to be painted or stained at home.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.", "reviews": ["Love it. It matches my house trim perfectly.", "Perfect. Exactly what we expected.\nImpressive communicationskills from Supplier.", "Exactly as expected. It’s best house number display in the neighborhood 😊", "Very happy with purchase.. Fast shipping....Thanks"]}, {"productId": "mpGMuvizsd", "url": "https://www.etsy.com/il-en/listing/1439690652/round-address-sign-geometric-address?click_key=e2c7e9246b2b0ad15099d291426b648b2f195a1b%3A1439690652&click_sum=e307a39c&ref=stl_listing-2&sts=1", "title": "Round Address Sign, Geometric Address Sign, Round House Numbers, Modern Address Plaque, Custom Address Sign, House Number Plaque", "description": "Geometric carved design with acrylic house numbers - the perfect modern piece for your home address sign. These are great housewarming gifts, realtor closing gifts or just to spruce up your front porch or door decor.HOW TO ORDER- Choose Your Size- Note Your Text Color- Note your background paint or stain color choice in the personalization area.They come with a sawtooth hanger to hang.", "reviews": ["Absolutely love it.  Looks amazing in my sons room.", "Beautiful item! True to size. Makes a great mantle piece!", "Wishing I ordered the bigger size it is absolutely perfect!!", "Thank you!", "Very pleased with the quality and design. It arrived with no damage and was easy to mount. Highly recommend. I will purchase from here again.", "Thank you so much!"]}, {"productId": "XxDKSfYwnX", "url": "https://www.etsy.com/il-en/listing/1453867189/herringbone-address-sign-modern-house?click_key=42837fe32ba489b314764b3f974779b31603037d%3A1453867189&click_sum=6c71488a&ref=stl_listing-3&sts=1", "title": "Herringbone Address Sign, Modern House Number Sign, House Numbers, Address Plaque, Realtor Closing Gift, Personalized Housewarming Gift", "description": "Modern Herringbone House Number Sign - UnframedThe perfect address sign for your modern home exterior. The backer is made out of wood and the numbers are acrylic - the wood is sealed with an exterior grade sealer to help preserve the life. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.HOW TO ORDER- The backer can be any stain or paint color shown on our color charts -  note in the personalizationarea what paint or stain you would like.-  The text can only be black or white-  Select if you want it vertical or horizontalThe numbers will be made to fit the sign regardless of how many numbers you order. Less numbers will be taller and centered on the sign. If you need a custom size please reach out and I would be happy to help.MEASUREMENTSThe sign is 7\" x 21\" shown with early american stain. Keep in mind all wood will stain differently.MATERIALWe use a high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted.HANGINGThese come with either a sawtooth hanger on the back or a d-ring.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.", "reviews": ["Absolutely love it.  Looks amazing in my sons room.", "Beautiful item! True to size. Makes a great mantle piece!", "Wishing I ordered the bigger size it is absolutely perfect!!", "Thank you!", "Very pleased with the quality and design. It arrived with no damage and was easy to mount. Highly recommend. I will purchase from here again.", "Thank you so much!"]}, {"productId": "QGvOwZV9TF", "url": "https://www.etsy.com/il-en/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=e43336b32cd1dc1d2a922a44fe9588eea079d7b2%3A630678328&click_sum=c083685c&ref=stl_listing-1", "title": "Faux olive wreath , Every Day Wreath", "description": "Hooray!! This wreath was picked by the ETSY Design team for 2019 Holiday Advertisement!Watch on YouTube link:https://www.youtube.com/watch?v=trS4fmZ3puQWhat a great piece for your rustic home decoration!This wreath is made to order.This wreath is made on a rustic grapevine base with artificial olives and leaves.This beautiful olive wreath is the perfect accent to your home or gift to your friends.The grapevines wreath is natural so all the grapevines are different.And it's great for double doors. Just add 2 in the cart. This wreath is ideal for inside or outside.Made from 14\", 18\" and 24\" natural rustic grapevines.Size approx: 18\". 22\"and 28\" (tip to tip)If you are sending this as a gift, please write the message in the notes area on check out and let me know if the item is being shipped to the person directly.I would write your gift message on a  pretty card and would not add any receipt.This wreath is great for indoor or outdoor use, but a covered or sheltered area is recommended.  Direct sunlight and rain will fade your wreath over time.Please feel free to contact me with any questions or to request a custom order!Thank you so much.", "reviews": ["Love the wreath!!! Very well made. It’s exactly what I wanted for my front door. Thanks Jim!!!", "Beautiful, a little squished in shipping but simply beautiful, thank you so much.\nEnjoy a Blessed, Happy and Holy Christmas.🙏🌲", "Looks terrific. I even placed a ribbon on it for Christmas.", "Absolutely beautiful!! Looks just as it’s pictured."]}, {"productId": "cfyedWuvnc", "url": "https://www.etsy.com/il-en/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=1789ed78e9695b61514b95b508a849c00fe8c007%3A962426777&click_sum=349bf9e1&ref=stl_listing-2&sts=1", "title": "Lavender Hoop Wreath,Modern Summer Lavender Wreath,Spring Lambs Ear Wreath,Farmhouse Front Door Decor,Simple Eucalyptus Door Wreath,Mom Gift", "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.𝗪𝗿𝗲𝗮𝘁𝗵 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Arrives ready to display• Made on an 12\" 14\" 16\" or 18\" wooden or gold metal ring• Hand designed using premium materials• Wreath is sprayed with a UV protectant𝗪𝗿𝗲𝗮𝘁𝗵 𝗖𝗮𝗿𝗲• Indoor/Outdoor covered use only• This wreath cannot be directly exposed to moisture𝗜𝘁𝗲𝗺 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Some greenery may vary slightly• I do hand pick each wreath and take great care in finding quality grapevine.• Do to the nature of the grapevine wreath, I cannot guarantee a perfectly round wreath, or exact measurement(within 1-2 inches)𝗦𝘁𝗮𝘆 𝗜𝗻 𝗧𝗼𝘂𝗰𝗵Instagram.com/twistedpine.wreaths/pinterest.com/twistedpinewreaths/View our Entire Collection of Wreaths:www.etsy.com/shop/twistedpinewreathsTHE FRAUDULENT WEBSITE WREATHFALL /FACEBOOK HAS COPIED SEVERAL OF MINE & OTHER ETSY SELLERS ORIGINAL IMAGES.. PLEASE DO NOT BUY FROM THAT SITE. THEY ARE NOT ORIGINAL PRODUCTS", "reviews": ["I love this wreath and have had several comments of how nice it looks.", "This item is very high quality and matched the description exactly. The seller was very communicative, reaching out when she could not obtain a hoop and offering alternatives. I would definitely recommend and buy again.", "This is my second wreath I’ve gotten from Twisted Pines and they do not disappoint. I love them. Well made and a beautiful designs.", "Seller was very communicative, which was greatly appreciated."]}, {"productId": "jlpBJZRXbO", "url": "https://www.etsy.com/il-en/listing/1223343994/farmhouse-wreath-for-front-door?click_key=6fd6c2e5fa8892af1e1a085e5f3ee1bfb9eb0c70%3A1223343994&click_sum=3282ef57&ref=stl_listing-3&sts=1", "title": "Farmhouse wreath for front door, Eucalyptus wreath, Greenery decor, French country decor, Farmhouse kitchen, Year round wreath", "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\" Can be enjoyed inside or outside year round for curb appeal!Handmade in Northern, Virginia with love. This item is made to order.View my other wreaths here:https://www.etsy.com/shop/NovaWreathsVisit me on Instagram @NovaWreaths: https://www.instagram.com/novawreaths© 2023, Lauren Cleary", "reviews": ["Look even nicer in person! Beautiful wreath", "This wreath is exactly as pictured and absolutely beautiful. It’s exactly what I wanted for my front door!", "Very unique piece high quality"]}, {"productId": "weKXNUDVIl", "url": "https://www.etsy.com/il-en/listing/1168985443/last-name-doormat-housewarming-gift?click_key=8c2231bc66a91438e8d81b66f49ddbae88ffa6d9%3A1168985443&click_sum=2cd40184&ref=stl_listing-1&bes=1&sts=1", "title": "Last Name Doormat, Housewarming Gift, Wedding Gift, Closing Gift, Custom Personalized Doormat, Welcome Doormat, Front Door Mat, Monogram Rug", "description": "Our high-quality doormats are made from all-natural coir fibers, making them eco-friendly. They feature a vinyl back for durability and sturdiness.____________________CARE INSTRUCTIONSWe recommend that coir doormats be used in a covered area to be sheltered from the elements. When coir doormats get wet and cannot dry properly, the fibers can soak up the water. The water then pushes the natural coconut oil to the surface of the fibers giving it a darker and stained appearance. This can also deteriorate the design causing it to fade quickly.Shedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help. All rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers. All mats are hand cut, so please allow for a 1 inch +/- variance in length. If you are needing an exact measurement, please reach out to us so we can verify that we can provide one that fits your needs. Doormats are .5 to .75 inches thick.____________________CUSTOM DESIGN OR PERSONALIZATION ADD-ONThis listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing. If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below. Please note that we DO NOT offer proofs for pre-designed items unless specifically requested. All custom orders will get a proof, including orders with personalization add-ons. No proofs will be provided until after purchase.PERSONALIZATION ADD-ON: https://bit.ly/PersonalizedAddOnCUSTOM DESIGN LISTING: https://bit.ly/CustomDesignDoormatIf you have questions regarding proofs, personalizations, or custom options, please feel free to send us a message. We would be glad to answer them for you.____________________BLEMISHED OPTIONSometimes we get mats with dark spots or other stains and blemishes beyond the natural ones mentioned above. However, they do not inhibit the actual function of the doormat. As a company, we try to be mindful of our waste and genuinely hate the thought of throwing them in a landfill; therefore, we choose to offer them at cost. Please note that we do not provide photos of our blemished doormats because our items are made to order, and we cannot guarantee which one you will receive.We usually have at least a few blemished items in stock. If you are interested in purchasing the blemished option, please let us know, and we will be glad to add one if available to the listing inventory. There is a limit of 1 per customer per purchase. By buying a blemished mat, you agree to its flaws, and all sales are final.____________________RESOURCESSHOP HOME PAGE:https://www.etsy.com/shop/hamlinrowshopMORE PERSONALIZED DOORMATS: https://bit.ly/PersonalizeDoormats", "reviews": ["Item was perfect! There was minimal shedding. It made the perfect engagement gift.", "Great, showed up sooner then expected and good quality .", "Love item. Great quality and size for front door"]}, {"productId": "tInHKQpGsg", "url": "https://www.etsy.com/il-en/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=98f0ec7fb98f4b3bdc463530fe396aca341855ab%3A612462127&click_sum=3e4cddc2&ref=stl_listing-2&sts=1", "title": "pizza doormat . welcome mat . gift for her . coir mat . custom door mat . cute doormat . housewarming gift . bridesmaid gift . wedding gift", "description": "Charm every pizza loving guest by adding this hand painted pizza doormat to your front step! Or give this coir welcome mat as a housewarming gift or wedding gift to your loved ones.Each welcome mat is made from a durable PVC back and a natural coir front that's perfect for the outdoors or inside. While coir doormats are extremely durable, they will last much longer if placed under an awning to protect them from the elements. Simply give your mat a good shake to clean!Looking for a custom doormat? I'd love to chat - send me a message!/ DETAILS∘ Doormat measurement: 18\" x 30\"∘ Materials: PVC backing, natural coir (coconut husk) front, acrylic paint∘ Care instructions: simply shake it or spot cleanHas your doormat design started to fade?Touching up a faded design is easy! Use black acrylic paint and a small firm bristle brush to trace the design and bring new life to a mat that is getting worn out.Thank you for choosing Grateful Paper Co.!✚ View all doormats:https://etsy.me/3yn6A8H✚ View all mini mats:https://etsy.me/2Vp6eQn✚ Need a custom doormat?Custom full size mat:https://etsy.me/3xhZxgdCustom mini mat:https://etsy.me/3C8AEqYCustom doormat dimensions:https://etsy.me/3lFMfbjLove the designs you're seeing in the shop? Join our mailing list and get a bundle of 3 wall art printables absolutely free! Sign up here: https://bit.ly/3Gx6fot", "reviews": ["This doormat is the perfect housewarming gift! It is very well made and matches the description perfectly.  The mat arrived quickly and exceeded my expectations. I would definitely order from this seller again.", "I love this doormat so much. ❤️ It’s sturdy, high quality, and most importantly, fun and unique! My husband and I bought this for our new home in Colorado, and it was one of the first things I unpacked. 😊", "Amazing doormat but even better customer service! Heather is the sweetest and got the item out to me TWO DAYS after I ordered it! I needed the item within 7 days and she got it to me in two… I couldn’t believe it when I saw the package today! The quality of the doormat is exceptional too.", "Quick shipping! Bought this as a housewarming gift, and she absolutely loved it!"]}, {"productId": "bBGVWtDGUv", "url": "https://www.etsy.com/il-en/listing/1183106995/custom-last-name-retro-doormat-home?click_key=01442b7aea5c3b298b09c6ee2a49af66d7c856cf%3A1183106995&click_sum=a684a2d7&ref=stl_listing-3&sts=1", "title": "Custom Last Name Retro Doormat, home decor, custom doormat, welcome mat, housewarming, front door mat, welcome doormat, closing gift", "description": "Personalized Welcome DoormatPLEASE READ, IMPORTANT INFORMATION ABOUT PERSONALIZATIONWe will copy and paste the personalization exactly as you type it into the personalization box for the last name on this design. \"THE\" is automatically applied to the top of the doormat (just like the listing photo) UNLESS you specifically ask us to leave it off in the personalization box. If you do not give us an EST. date, we will automatically leave that off. We can also put anything else on this design besides a last name, PLEASE make sure that you are very clear in your description when placing your order. If you have any questions, please send us a message and we'd be happy to help!Our doormats are high quality 100% coir. They are hand painted by me with outdoor industrial paint that has a built in UV protection to help protect the design from wear and fading. Each mat is backed with a slip-resistant sturdy PVC rubber backing. We offer a variety of sizes and all of our mats are 1 inch thick.The mats are best placed under a covered area such as a porch, we do not recommend placing mat in areas of direct sunlight, rain, or snow.CARE: clean by giving the mat a good shake. Best to keep in a dry area such as a covered entryway, we DO NOT recommend direct sunlight, rain or snow as that will fade & cause wear to your doormat!Due to the nature of our product, RETURNS WILL NOT BE ACCEPTED DUE TO WEAR OR FADING. Doormats will not be refunded or replaced from wear.*FLAWED DOORMATS: When we order our doormats, some come with slight imperfections such as dark spots, slight staining, small chipped corner or a small hole on the back of the mat not visible from the front of the doormat. If you are interested in a flawed doormat please send us a message and we will let you know if we have any in stock. If we do have any available, we will send you a photo of the doormat for you to approve before moving forward on the order. PLEASE NOTE, all flawed doormats are sold at a HUGE discounted price and all sales are FINAL. You are agreeing to the flaws during messaging and finalize the sale when you purchase the doormat.We suggest replacing your doormat every few months as doormats tend to be a seasonal item. We are always adding more items so be sure to check back here for our new designs :)Each mat is unique. Some may be darker or lighter than the photo, coir is made from the husks of coconuts and some fibers might be thicker or thinner than others. There may also be chunks of the husks in the fibers.We love CUSTOM ORDERS! Message us and let us know what you have in mind and we'll make it happen", "reviews": ["So so so cute! I love it", "so cute & exactly what i wanted!", "Love our doormat so cute great quality", "Exactly as pictured. Very happy!"]}, {"productId": "2RKSAXFe4K", "url": "https://www.etsy.com/il-en/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=ba5ff5568050c8dbfea90ccb565cc8fd35bc4dee%3A775841802&click_sum=32b7c1c4&ref=stl_listing-1&bes=1&sts=1", "title": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign", "description": "Welcome sign for front porchThis adorable WELCOME sign will add a colorful touch to your front door is our latest design, capturing the trendy floral designs so prevalent in today's decor. The sign is made of solid wood with painted on letters.✔HAND PAINTED on letters, NOT VINYL STICKERS SO LETTERS WILL NOT CURL WITH AGE and NOT SPRAY PAINTED SO YOU DON'T GET THE FUZZY EDGES✔SPACING & CENTERING ACCURACY: NEW AND IMPROVED!✔Distressed look✔CAN BE HUNG ON A WALL (SEE \"CUSTOM OPTIONS\" SECTION BELOW)✔GREAT AS A GIFT! We're happy to insert a card with a personal note from you. Just let us know what you would like it to say!✔MADE IN USA✔CUSTOM ORDERS ACCEPTED!⭐️⭐️⭐️⭐️⭐️ 5 STAR RATINGS! People say: \"Love it\", \"Beautiful\", \"Very well done\", \"Just like the pictures\", \"She loves it!\"✎ADDITIONAL DETAILS:PRODUCT DESCRIPTIONThis adorably delightful WELCOME sign will add a charming touch to your front door. The sign is made of solid wood with painted on letters, highly durable and it looks great! Our top seller is our 5' x 10\" sign. Check out our reviews! We stain and then give it a distressed and rustic look. Please note, these signs are indeed RUSTIC, and are made one-by-one to that effect which means that each piece has some variation. The distressed look means that the painted letters are given an \"aged\" look. Please review all of the photos and note that parts of the letters have \"aged\" away giving a partly \"erased\" or \"smudged\" look, perhaps even creating some asymmetry in the letters, as well as some color variation in the stain. Given that distressing is done on each piece individually each piece is unique, so expect some slight variation from the model pictured. ✔CHECK OUT THE PHOTOS TO SEE MORE DETAILS.SPACING & CENTERING ACCURACY: We've made & sold over 15,000 Welcome Signs and one of the things we've been striving for is more precision in the spacing and centering of the letters on our signs. We've invested in new technology and tools that allow us to finely tune the spacing and centering of the letters on our signs so you can be sure that when you receive one of our signs it doesn't look off center or have spacing errors between the letters.SIZESRead our sizes as Height x Width. So if it is a 5' x 10\" sign when reading the measurements the first figure is the height, so 5 feet, and the second number is the width, so 10 inches (technically 9 1/4\" in lumber measurements).  This WELCOME sign comes in 4 sizes!  5 feet x 9 1/4\" , 4 feet by 6 1/2\", 3 feet by 5.5\" inches, and 2 feet by 5.5 inches wide.HOW TO USE ITYour new solid wood welcome sign can be placed anywhere you like by simply resting it back against something as pictured  (For a long life we keep it in a covered location such as a porch with an awning, etc.). Most folks place them near their front door, on a porch, a patio, a deck, walkway or even in a guest room.  If you would like a freestanding sign it is possible to attach a stake on the back and stake it into the ground.PRODUCT CAREWe use one of the most expensive and most durable paints available. This ensures the durability of your sign.  However, like anything exposed to the natural elements (sun, wind, water, etc.) it will wear. We recommend that you place this sign in a covered location, such as a covered porch area.***WHEN YOU PLACE YOUR ORDER PLEASE DOUBLE CHECK YOUR ADDRESS AND THE COLOR & SIZE YOU SELECTED IN YOUR ORDER. THIS IS IMPORTANT AND WILL HELP YOU AVOID UNNECESSARY SHIPPING CHARGES.BROWSE OUR SHOPSee our other stuff:https://www.etsy.com/shop/NativeRange*Native Range, LLC", "reviews": ["This sign is exactly what we needed for our front door. Very well made too!", "Looks great and is great quality!", "Loved the rustic look of the welcome sign!", "Just what I was looking for and absolutely love it"]}, {"productId": "rfLbsFhHzy", "url": "https://www.etsy.com/il-en/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=714f8188a6a2790dc4d0bb3e1fa44637cecdcbb7%3A511215666&click_sum=6167b4ac&ref=stl_listing-2&sts=1", "title": "large wooden porch vases, welcome sign, reclaimed wood, rustic, floor vases, farmhouse decor, large floor vase,  porch decor, set of 2", "description": "This set of 2 large wooden porch vases will add a little rustic charm to your porch or living room! A welcome sign and rustic vases all in one! Unique farmhouse and  porch decor will welcome your guests to your home! Fill with large stems or branches and you will have a beautiful eye-catching entry. The large vase measures 24\" x 6 and the smaller one measures 18\" x 6\".  These vases are made form reclaimed wood that has been sanded and stained gray.", "reviews": ["So fun! Look great! Love!", "I absolutely love these! They are adorable on my front porch thank you", "Super cute!! Had them put my house number on the second one. Sometimes delivery people mistakes my unit between my neighbor so hopefully this will also help them! Recommended!"]}, {"productId": "afacfmgQNK", "url": "https://www.etsy.com/il-en/listing/1095987590/family-gift-family-name-welcome-sign?click_key=d15102ece968aaea01b80f0919cbf4dd8fee803b%3A1095987590&click_sum=aefdca22&ref=stl_listing-3", "title": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming Gift", "description": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming GiftElevate your home decor with a beautiful metal sign. Made with 18 guage steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. Add a touch of elegance to your home on the inside, outside, or both!Each sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.• 18 Gauge Steel• 5 Color Options (Black, Red, White, Copper, Silver)• 6 Sizes - 36\", 30\", 24\", 18\", 14\", 12\" *Selected size is based on the maximum height or width of the sign depending on physical orientation• Mounting Hardware Not IncludedHave another design in mind? We'd love to help your vision come to life. (Additional design fee may apply.)", "reviews": ["loved it! It’s the perfect gift!", "Great quality, fast shipping! Will order again :)"]}, {"productId": "ts3ALdWwSw", "url": "https://www.etsy.com/il-en/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=d25d37112bff2e520fe7adbe58d4a085568cee4f%3A615762911&click_sum=77d614d2&ref=stl_listing-1&sts=1", "title": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911", "description": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911This utility style sconce is perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.The sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.FINISH OPTIONS-----------------------• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 10\"Width: 10\"Depth: 12.5\"ShadeHeight: 3.25\"Width: 10\"5\" Wall CanopyClearance From Wall: 2\"This light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Turns on and off at socket.Installation: Direct Wired into wall (Installation Hardware Included)If you would like to make this light a plug-in fixture:Please visit our Add Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!", "reviews": ["Love, looks great in my room.", "Nice !  Seller was helpful with issue ! Thank you Donna", "Item as described, highly recommend this Etsy Shop.", "Exactly as shown.  Works great!"]}, {"productId": "Sb5CqiOiKV", "url": "https://www.etsy.com/il-en/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=65b26d2a093df0f1b704a9e082ab40603d91df8c%3A1165269880&click_sum=382cf4c6&ref=stl_listing-2&sts=1", "title": "Outdoor Modern Wall Lantern With Integrated LED's and Unique Reflective Center Cone - Farmhouse Design", "description": "19703 Lantern-Modern Unique Design: Contemporary and Minimalist European Lantern design with sleek integrated LED that provides an ample amount of light. This wall sconce creates a distinct yet tasteful appearance wherever you choose to install.-Excellent Quality: All ECD Lighting Fixtures are made of sturdy die-caste aluminum and sealed with a weather-proof coating that will ensure the longevity of your fixtures.-ETL Certified: All ECD Lighting fixtures have ETL certifications for the driver and fixture. This fixture is suitable for wet locations and all climates.-Energy Efficient: Integrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours and putting an end to the constant need to change burnt out bulbs. SAVE THOUSANDS on bulbs!!-Variety of Use: Perfect for residential spaces such as exterior entrances, garage, patio, porch, etc.. Additionally a great fixture for commercial use in restaurants, common buildings, office spaces, and multi-use buildings.Easy InstallationAll ECD Lighting fixtures include our patented easy installation hardware!No electrician required and every fixture can be installed with 3 steps in less than 10 minutes.ALWAYS make sure your power is turned off before installation*1. Attach the back plate to the junction box.2. Connect the corresponding wires with the screw caps provided.3. Secure the fixture to the junction box with the provided screws.The ECD WayFrom the moment you switch these lights on, they will improve the look of your home and your quality of living. Choose ECD to light the way for you!", "reviews": ["Beautiful light. Makes our outdated kitchen look so much better until we can do some more remodel projects.", "Love this fixture. It fits perfectly in our midcentury home. Simple, yet elegant and modern. We paired it with a warm Edison-type bulb that really complements the glass and design.", "These are stunning and exactly as described.  The seller was very accommodating and jumped through hoops to get these delivered - thank you", "Light fixture is beautiful, exactly as pictured. Casts the most amazing light / shadows on the wall due to the blown glass formations! A note to buyer though; 25 watts is very low. This is more of a night light."]}, {"productId": "bcubfagXQI", "url": "https://www.etsy.com/il-en/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=150046f5d5665198a6301e8ebab2f8fa92378b45%3A1051791566&click_sum=e9bbeca7&ref=stl_listing-3&sts=1", "title": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748", "description": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade.FINISH OPTIONS-----------------------• Our Raw Brass finish features solid unfinished brass that is hand cleaned before leaving our shop. The brass will age and patina over time giving the finish a soft natural look.Please wear gloves while installing all fixtures. Touching raw brass with bare hands will tarnish the brass.If you would like the brass to be sealed:Please purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section.• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Polished Nickel - Mirror like metallic finish with a warm feel• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 9\"Width: 7\"Depth: 10\"Shade:Height: 4.25\"Width: 7\"Clearance from Wall: 2.55\" Wall CanopyThis light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Controlled from light switchInstallation: Direct Wired into Wall  (Installation Hardware Included)If you would like to add an On/Off switch or make this light a plug-in fixture:Please visit our Add-Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts.In order to keep the lamp temperature cool, please use LED bulbs only.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!", "reviews": ["Love the style of the lamps", "Beautiful brass lighting piece! Love it! Well crafted!! Only difference from picture is the dome piece is more black sheen than the brushed iron look.", "Beautiful! Just got it today and it's now installed. Wow. I love it!"]}, {"productId": "GrwVBgLUWh", "url": "https://www.etsy.com/il-en/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=82599848f6d1ec778b0c9fc8d62a92ee12c6c143%3A1316603667&click_sum=ea928fad&ref=stl_listing-1", "title": "Linen bedding set, Double king duvet cover and pillows in Green color, 100% natural flax sheets set custom sizes", "description": "Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.Here at SOUTH, we don't do shortcuts. We are crazy about effortless luxury, comfort, sustainability, and quality. That means we use only top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home - the more you use it, the more fabulous, soft, and YOURS it will become!WHY OUR LINEN IS SO AMAZING?Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. Also, we use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.🎁 READY AS A GIFTA linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.randed card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Green;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUS CA King + Standard pillowcasesDuvet 104x94” / 264x239cm, pillowcases\t20x26” / 51x66cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cmCUSTOM SIZES:If your comforters are a different size than our standards - no worries, just message us with your measurements and we will make you your perfect bedding set. No extra charge💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems", "reviews": ["Beautiful bedding, color quality is perfect.  Delivery without problems.  I recommend", "Great custom bedding, easy communication!", "Great custom bedding, easy communication!"]}, {"productId": "mDfUXokPhb", "url": "https://www.etsy.com/il-en/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=1fe6c855481dba8714725bbdb24775154d679f1f%3A1295727796&click_sum=e12514f2&ref=stl_listing-2", "title": "Linen Pillowcase. Linen Pure Pillowcase. Linen Pillow Cover King, Queen, Standard, Euro sizes. Cappuccino linen pillowcover", "description": "Pure 100% Linen pillow cover will provide you maximum comfort.Because of linen's natural qualities, you will feel better and sleep deeper.- Price includes 1 Pillowcase- Pillowcase closure type - envelope;- Color: Almon- 100%  Extra Soft Linen ;- Fabric is: Oeko Tex 100 certified;- Made in Lithuania;Match it with almond sheets:https://www.etsy.com/listing/1110228783/linen-sheet-set-2-pillows-in-white-color?click_key=2a2aec771cf355711397c8539c706045b93a164a%3A1110228783&click_sum=fab2cb5a&ga_search_query=sheet%2Bset&ref=shop_items_search_10&frs=1&crt=1&variation1=2319224371And Beige duvet cover:https://www.etsy.com/listing/1071423946/linen-duvet-cover-in-beige-washed-linen?click_key=b88991db21dcd007eb5748e547ab74cc709bf561%3A1071423946&click_sum=5503be5b&ref=shop_home_active_10&frs=1💌SIZE CHART:US Standard 20x26\"US Queen 20x30\"US King 20x36\"US Body 20x54\"US Boudoir 12x16\"US Deco 18x18\"EU Deco Small 30x40 cmEU Deco Square 40x40 cmEU Standard 50x70 cmEU IKEA 50x60 cmEU Square 65x65 cmUK Standard 20x30\"UK Large Square 26x26\"DE Standard 40x80 cmDE King 80x80 cmCustom sizes available - write us a message to find out more.The actual colours may vary slightly because every computer monitor has a different capability to display colours.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: this shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems.", "reviews": ["Great custom bedding, easy communication!", "Great custom bedding, easy communication!", "Great custom bedding, easy communication!", "Great custom bedding, easy communication!"]}, {"productId": "MZJmXuNYFe", "url": "https://www.etsy.com/il-en/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=6a4a655323104dfea52e89f717dab89790454005%3A1066602418&click_sum=b85378a9&ref=stl_listing-3", "title": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes", "description": "Airy and lightweight, SAUTHS linen bedding is all about the effortless luxury we love to embrace. Our OEKO-TEX certified linen( this means that it is made free of harmful chemicals and is safe for human use) duvet covers are also incredibly durable, and their texture – can you believe it? – only improves with time.Top-quality European linen outperforms all other materials and makes all our products naturally strong, lustrous, and durable. Our products are organic and fully biodegradable.The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance.Pre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting.We accept CUSTOM ORDERS, so if you haven't found the size needed, let us know!🎁 Linen bedding can be the perfect gift for your beloved one and we will beautifully pack it for you, just give it as a note. Personalized Gift messages are available on our branded card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Cinnamon;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have a pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems", "reviews": ["Great quality and color, feels incredible.  Thank you!", "Great custom bedding, easy communication!"]}, {"productId": "bvKUM6tTfz", "url": "https://www.etsy.com/il-en/listing/576508683/wall-art-decor-print-interior-decor?click_key=281fe8a2374c090601a06131fe0eba88dd7bc76f%3A576508683&click_sum=2da75830&ref=stl_listing-1", "title": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - INTERIOR II -", "description": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life.- INTERIOR II -This print is available in three optional sizes:A4 - 9” x 12” (21 x 29.7 cm)A3 - 11.7\" x 16.5\" (29.7 x 42 cm)A2 - 16.5\" x 23.4\" (42 x 59.4 cm)Each print is signed and including a white border for framing.Important note: The frame is not includedThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.", "reviews": ["Im Happy\nAnd very good", "Love this print, so happy I was able to find it again!", "Gorgeous necklace and beautiful packaging. Delivery was speedy! Thank you.", "Good design! Even the box was cute!!"]}, {"productId": "ZTtCnodJOZ", "url": "https://www.etsy.com/il-en/listing/834853057/emerald-green-painting-abstract-art?click_key=f05c882cc7de602b4c1f01acfad1e0b06c2b413b%3A834853057&click_sum=7a8778a6&ref=stl_listing-2&sts=1", "title": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable", "description": "Mid Century Modern, Fine Art Prints, Contemporary Art Prints, Abstract Art Style, Mid Century Poster, Midcentury Art Print, Abstract Print File, Fine Art Print For Sale Online, Entrance Wall Art, Apartment Wall Decor, Printable Guest Room, Printable Women Gift, Downloadable Art Prints._________________________________________________________THIS IS A DIGITAL DOWNLOAD, originated from Kala's original painting. Perfect for your home or office decor. Instant download and easy to print, without paying the shipping fee.Your order will consist of TWO high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7.This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.Upon purchase of this listing, Etsy will immediately provide you with a link to your download. Click on the link to download the file and save it to your computer! It’s that simple! You can print the artwork at your local printing center or by using online printing services.KINDLY NOTE:No physical product will be shipped and the frame is not included. Colors may vary slightly due to different color monitors and/or your printer or printing company's settings.TERMS & CONDITIONS:The images that are being provided to you are licensed copies for any reasonable PERSONAL PURPOSES, including but not limited to: printing, copying, emailing, and web publishing.Your license does not include use that results in financial gain, including but not limited to: advertising, stock photography, print sale profits, or resale of any nature.IMPORTANT:- Please do not! Share or sell digital files or printed versions via any online or physical channel.- I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.For a much bigger size than this, I only sell the limited edition original painting, both on high-quality paper (Fedrigoni Paper or Hahnemuehle Paper) or on canvas, and the size is according to your preference. To discuss for a custom abstract original painting like this, please contact me through email:  kalamasa.gallery [!at] gmail.comThank you for your purchase, It will surely help me as a small artist to keep creating and growing.CLICK here for similar individual art print:https://www.etsy.com/listing/833978801/abstract-green-prints-minimalist?ref=shop_home_active_16https://www.etsy.com/listing/833958685/abstract-emerald-green-prints-emerald?ref=shop_home_active_15https://www.etsy.com/listing/833971655/abstract-green-prints-emerald-green?ref=shop_home_active_14https://www.etsy.com/listing/833944255/abstract-botanical-prints-emerald-green?ref=shop_home_active_13CLICK here for the similar set of 2 prints option:https://www.etsy.com/listing/834855825/emerald-green-print-set-abstract-art?ref=shop_home_active_19&crt=1CLICK here for the similar set of 3 prints option:https://www.etsy.com/listing/830353484/emerald-green-wall-art-set-of-3-prints?ref=shop_home_active_4Please visit my main SHOP to see what is new and exciting!https://www.etsy.com/shop/KALAMASArtgallery", "reviews": ["love em, they're lovely, thanks", "thank you for your support. Glad you like my Abstract mountain art print. Happy decorating!", "Beautiful digital download!  I printed and framed mine and they’re perfect for my living room!", "Thank you for purchasing my Abstract Landscape National Park Print. Glad you really like it. Thanks for the support! 🫶🏽", "I haven’t opened it yet.", "thank you for the support Bailey. Much appreciated"]}, {"productId": "zRWTQWPVOM", "url": "https://www.etsy.com/il-en/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=4e6e6321824bde681fc65066c3e85d6c71d7dc5e%3A991191051&click_sum=8daa42df&ref=stl_listing-3", "title": "Dip dye tapestry, Ombre wall art, Macrame dip dye, Dip dye decor, Dip dye wall hanging, Green wall hanging, Green Décor, Boho wall hanging", "description": "ALL  A B O U T ...This is a made-to-order tapestry, please allow 2-3 weeks for it to be made and shipped.This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel.•\tThis piece is a made to order item, so feel free to contact me if you would like to order this piece in a different size or colour.•\tEach wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.•\tPlease note slight colour variations may occur.D I M E N S I O N S…Height 120cmWidth 90cmF O L L O W  U S  O N   S O C I A L   M E D I A…https://www.instagram.com/bourneandthread/https://www.pinterest.co.uk/bourneandthread/https://www.etsy.com/uk/shop/bourneandthreadA N D  F I N A L L Y…If you have any questions about the item, just click the 'Ask a question' button next to the price and I will get right back to you.I hope you love your wall hanging as much as I love making it for you.From my loving home to yours …Much Love xThis is an original design © bourneandthread 2019. All rights reserved.", "reviews": ["I am so happy with my purchase, perfect addition to my tall ceilings in the living room! Shipping to the US was a breeze and arrived earlier than anticipated.", "I looked everywhere for something that would fit on one of the walls in my bedroom. After a year of searching, I finally found it. It is more beautiful in person. It goes really well with the green wall on the other side. I just love it. The whole experience was great. Thank you!", "Haven’t yet been able to hang it, but it looks like the photo and is solid quality.", "I haven’t had the chance to hang it yet but it’s a beautiful work of art! Great quality!"]}, {"productId": "UXXRVFGTle", "url": "https://www.etsy.com/il-en/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=26be8555fd4d96c66b0f5f8624cd0811ec522f6c%3A774551709&click_sum=1c053c21&ref=stl_listing-1&sts=1", "title": "Bubble Cube Shaped Candle, Home Decor, Custom candle, Soy Beeswax, Housewarming gift, Air freshener, Handmade Gift, Mother's Day Gift", "description": "HANDMADE! MADE TO ORDER!❤REMINDER❤Do you like a \"Bubble Cup\" in the video?  It is beautiful because of its specialty, that's why it needs your more careful treatment. The correct burning way can bring you a wonderful burning experience! An inappropriate burning way may cause a large amount of wax to flow out.  PLEASE READ THE BURNING TIPS BELOW, or you can find them on the Thank You card in your package.❤THE CORRECT WAY TO BURN YOUR \"BUBBLE\" TO AVOID MESS!!!❤❤ Keep away from drafty areas.❤ Always keep your \"Bubble\" on a dish.❤ Before lighting, please trim the wick to 1/8\"-1/4\" and center it.❤ ❤ ❤VERY IMPORTANT: DO NOT BURN IT FOR MORE THAN 2 HOURS AT A TIME!!!❤❤❤Material: Natural Soy Wax, Pure White Beeswax, Candle Dyed, Cotton WickColor: Ivory (undyed), Gray, Dark Gray, Light Brown, Dusty RoseScent: Unscented, High Tide, Pink Sugar Crystals, Magnolia Peony, Pine ForestDimension: 2 3/8\" H,  2 3/8\" WMade in the USAThe super unique bubble-shaped candle is perfect for home decor, gifts! Light up your life and warm the people you love！We use high-quality, pure soy wax and blended it with white beeswax. When it is burning, the aroma released is healthy and environmentally friendly.  We offer different scents for you. Hope the following scents introduction below can help you to choose your favorite scent. Each one is hand-poured the moment you place your order.***Scent***❤High Tide❤Immerse yourself in the aromas of waves crashing onto a rocky coastline with a storm brewing in the distance. The churn of the sea, wrapping the water, sand, and salt together into a clean and ozonic scent. Top notes of lemon, orange, and fresh ozone give way to a heart of briny sea salt and a hint of jasmine. Powder and light musk balance the woody violet and cedar in the base. It is infused with natural essential oils, including cedarwood, orange, and elemi.Top: Ozone, CitrusMiddle: Sea Salt, JasmineBase: Violet, Cedar, Powder, Light Musk❤Pink Sugar Crystals❤A sweetly sophisticated take on a cotton candy fragrance. This sugary scent is enhanced by fruity notes of strawberry, raspberry, and black currant, while base notes of tonka, vanilla, and a hint of light musk keep this ultra-sweet scent grounded.Top: Black Currant, Strawberry, RaspberryMiddle: Sugar, FreesiaBase: Tonka, Vanilla, Light Musk❤Magnolia Peony❤Top: Cherry blossom, BergamotMiddle: Magnolia, Peony, Green Leaves, FreesiaBase: Amber, Powder❤Pine Forest❤Top: Eucalyptus, MintMiddle: Cypress, PineBase: Smoke, Tonka Bean❤Moonflower❤Top: Agave, PearMiddle: Cherry Blossom, Rose, MarineBase: Amber, Dark Musk, Powder***NOTICE***Each one is handmade and wrapped by hand, and due to the nature of this, they may vary slightly, some small imperfections may be present, which does not affect the use.***ABOUT SHIPPING***Made just for you. Candles take 3-5 business days to make. Ready to ship in 1 week.***BURNING INSTRUCTIONS***1. THE MOST IMPORTANT TIP: ALWAYS KEEP IT AWAY FROM DRAFTY AREAS & ALWAYS STAY STRAIGHT!2. WICK CARE: Before lighting, please trim the wick to 1/8\"-1/4\" and center it. Once the wick is too long or not centered during burning, please extinguish the flame in time, trim the wick, and center it.3. BURNING TIME: For regular candles, do not burn them for more than 4 hours at a time. For irregular candles, we recommend not burning more than 2 hours at a time.4. FOR SAFETY: Always keep the candle on a heat-safe plate or a candle holder. Keep away from combustible materials/things. Do not leave lighted candles in unattended places and out of the reach of pets or children.***ABOUT BULK PURCHASE***Wholesale quantities and prices are also available on request. If you have any questions feel free to contact me.Thank you!", "reviews": ["These candies are very pretty and unique. The case well-packaged. No imperfections in the wax. They’re exactly what I wanted.", "Have bought from this shop multiple times now. Quality product, beautiful packaging, brand is on point. I highly recommend!", "Great quality! Super cute and smells wonderful!"]}, {"productId": "RlDJfwDMjJ", "url": "https://www.etsy.com/il-en/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=194a5ddba80989f53c4e1abac69c7a15a37dbfb7%3A785763623&click_sum=fdc72a94&ref=stl_listing-2", "title": "PALO SANTO - 8 oz Soy Candle - Hand-Poured - Candlefolk", "description": "PALO SANTOPeruvian palo santo wood blended with top notes of neroli and saffron - this rich and woody scent also has hints of cedarwood, amber, and moss.Top: Neroli, SaffronMiddle: Cedarwood, Palo SantoBase: Amber, MossABOUT OUR SOY CANDLESHand-poured in small batches, made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks.All of our candles are made, packaged, and shipped from our New York Studio.BURN TIMEThis candle will burn for approximately 45-50 hours.CANDLE CAREOn the first burn, allow the melt pool to reach the edges of the metal tin.This will help to prevent tunneling and give your candle a nice even burn. Trim the wick to about 1/4\" before each use.---------------------------------------------------------------------------------------------------------CONNECT WITH USInstagram: www.instagram.com/candlefolkcoFacebook: CandlefolkTwitter: @candlefolkco", "reviews": ["I use these candles on a warmer plate instead of burning, and they last a long time. This one smells very earthy and masculine without being overpowering.", "Wonderful customer service and my candles smell amazing! Thank you!", "Fast shipping.  Nice quality candle. Smells terrific!"]}, {"productId": "ULEEZbFafW", "url": "https://www.etsy.com/il-en/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=e58d82bccd57e526a531391738afdff212f4aff1%3A879866486&click_sum=f6b559dd&ref=stl_listing-3&sts=1", "title": "HINOKI Essential Oil Candle ///  Grapefruit, Hinoki, Cypress", "description": "HINOKI :  100% Natural Soy + Essential Oil CandleCypress / Hinoki / GrapefruitThe scent of fresh mountain air.A cloud of cool mist, rolling through old-growth forests.The clean aroma of Japanese Cypress and dry Cedar,washed clean in a bath of sparkling Pink Grapefruit,create an atmosphere of clarity and tranquility.Use for:  Clarity and Awareness ( see below )+ 100% Natural+ Scented exclusively with essential oils+ 8 oz  /  up to 50 hr+ Vegan+ USA Made Vessel+ Hand-poured in Rhode Island+ 3.5\" high x 2.5\" wide---- Folklore ----The Tree of PurityOnce worshiped as a symbol of the sun goddess, The Hinoki tree has been revered as sacred in Japan for centuries. An emblem of purity and grace, the timber of the fragrant wood has been a traditionally used to build the most sacred of places; shrines and temples.Still used in many Shinto ceremonies today, Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.Uniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.", "reviews": ["Always a pleasure doing business with this shop..\nThey are truly amazing on all counts!\nLove & Light…", "This candle scents the upstairs & downstairs at the same time & smells amazing ~ thank you!", "Excellent, as described and love the scent! Looking forward to purchasing more in the near future,", "I am a huge fan of Muzi brand!\nHighest quality, excellent service, I can not say enough about the care and love that goes into each product..\n\nGrateful…\nPeace Profound,\nDenise"]}, {"productId": "NCOZWvGigI", "url": "https://www.etsy.com/il-en/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=0ce9341871b025abc2fc073f6101f28b78ac753d%3A570862928&click_sum=ca696b28&ref=stl_listing-1&sts=1", "title": "Small Wooden Stool, Scandinavian decor side table Short Wooden Stool, Scandinavian Stool, Wood Plant Stool, Walnut stool,Midcentury home", "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.STOOL DETAILS⚬ COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or BlackWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.⚬ Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.⚬ Finished with a natural hard wax oil.⚬ Weight limit is 120kg⚬ You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.⚬ Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.⚬ Easy to assemble in 5 minutes.STOOL DIMENSIONS⚬ Seat diameter: 32 cm (12.59\")⚬ Height: 41 cm (16.14\")IMPORTANTYou have three way to see our stains:⚬ Third photo shows our samples of colors⚬ When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option⚬ You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want", "reviews": ["LOVE this stool! Solid quality and gorgeous stain", "Simple, well made, nice finish, stylish and solid, and it arrived with home made fudge, too. Easy to assemble, arrived in perfect condition, too. Great product, great value.", "really nice stool, shipped on time!", "Very cute, exactly as pictured."]}, {"productId": "rCvwmTnxSK", "url": "https://www.etsy.com/il-en/listing/793579884/cork-stools-home-living-bedroom-living?click_key=64f32cddd3971733b5f34ffe672896b93df313ab%3A793579884&click_sum=ecb110f6&ref=stl_listing-2", "title": "Cork Stools, Home & Living, Bedroom, Living room, Eco-friendly, Home Decor", "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.The stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.This collection combines the use of a natural material and simple forms.Collection: Furniture CollectionMaterial: Natural CorkDimensions:Cork stool #1 - Ø 30 x H 39 cmCork stool #2 - Ø 32 x H 45 cmYear: 2020Care instructionsYou should:> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;You should not:>clean it with any type of chemical and abrasive product;> place hot or sharp objects on the surfaces;> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years;", "reviews": ["Perfect for my Eames lounge", "Great product, great design, great customer service\nThank you Mariana", "The cutest bowl!! So beautifully made & adds the perfect touch to my kitchen! Will be buying again from this shop!", "Exactly as described and pictured!"]}, {"productId": "TiDuwHPaDI", "url": "https://www.etsy.com/il-en/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=3888af3b62a03fe5809cd820a07dbac86ebbb690%3A1198929077&click_sum=f3c75c88&ref=stl_listing-3", "title": "Bonnet Wood Stool (Golden Yellow) | Scandinavian Design | Excellent for Plants and Seating", "description": "The Bonnet Stool is a hardy, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand and will look dynamite in combination with just about any thoughtfully decorated space.  It is Handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels.  The Bonnet Stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow.  It's available in two sizes and a variety of colors.  Also, feel free to reach out for custom colors and sizes either through our Etsy store or through email at  info [!at] whalecreek.co.", "reviews": ["This is the second one of these I purchased. I really like the look and feel of this item and would highly recommend it.", "Good quality and attractive design", "Set of 3, custom sizes and a custom color. PERFECT. Super sturdy, well finished… even the packaging was perfect - brown paper padding. The cardboard box was extra heavy and wisely taped so it arrived without a scratch. With all my customizations they were delivered in just a couple of weeks. Highly recommend!"]}, {"productId": "rLuvxEMUhd", "url": "https://www.etsy.com/il-en/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=db275bc61e378780e4de0413330d573d73b0c61a%3A865339439&click_sum=19a22b52&ref=stl_listing-1&sts=1", "title": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter", "description": "The Coiled was designed to dress your plants in style, just like the owner! Our planters will modernize and bring out the beauty of your plants. \"The Coiled\" exudes a bauhaus/Japanese cool!They all come with a drainage hole and 3 little \"feet\". If you prefer not to have the hole or feet, please leave me a note.Sizes (Inside diameter and all measurements are approximate):2.5\" diameter x 2.25\" tall (6.4 cm x 5.7 cm) (fits standard 2 inch pots)4.18\" diameter x 3.75\" tall (10.6 cm x 9.5 cm) (fits standard 4 inch pots) (video shown in this size)6.18\" diameter x 5.4\" tall (15.7 cm x 13.7 cm) (fits standard 6 inch pots)The colors come in a matte or sheen finish. This listing is for the matte finish colors only. You can find the sheen finish colors in my other listings. I have 2 blacks: the matte black is a soft non-reflective finish while the sheen black has a slight shine to it and a darker black finish. The white and light grey is a sheen finish but appears matte.All products are 3D printed out of a plant based bioplastic eco-friendly material. The natural wood and black wood matte finish is mixed with real recycled wood. They're all lightweight, durable and won't break if you accidentally drop them!*Free domestic shipping on orders $35 and more.*International customers contact us for a $20 discount code on orders over $150!*3D printed, sustainable and eco-friendly.*Design is original to Morse Studio Co.*Follow us on Instagram @morsestudioco for all the latest news and specials!", "reviews": ["This was a gift and she loved it!", "Small planter, but cute and nice", "I purchased this as a gift for a friend and she loved it! It arrived really quickly, too."]}, {"productId": "nzGjjoCoxy", "url": "https://www.etsy.com/il-en/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=811d62354e4e3beaa09e2d115ea22934d75b44b3%3A728731403&click_sum=9f21c88b&ref=stl_listing-2", "title": "Nude Pink and Brass Metal Floor Planter / Metal Plant Pot / Brass Planter Stand / Gold and Pink", "description": "MATERIALS: Brass, Aluminium with Static PaintCOLOR: Nude PinkDIMENSIONS:Pot Diameter: 20cm ,  Height (total): 30cm,  Brass Stand Height: 18cmGlobe Planter is now suitable for all house plants with its maxi size! Especially for the ones who like facing the sun... As being able to rotate to any direction on its brass stand, Globe Planter lets you to adjust your plants position easily. And it can now be placed on the floor with longer and spreading plants.With the perforated seperator inside, excessive water is collected at the bottom not to harm the roots. Plants can also be placed with their pots inside Globe Planter. In that case the seperator functions as a platform for your your pot.* The plants in photographs are for visual. They're not included in the product.--SHIPPING:We only ship with Express Shipping worldwide. Please check the dates with us if you are shopping for an anniversary or a special date and we’ll make sure that your shipment arrives timely.IMPORT FEES:*USA orders are free of import charges up to 800$ total of purchase.*For EU orders, VAT is collected at checkout by ETSY and no import charges apply at delivery below 150€.Please beware that import fees may occur on international shipments according to your government's customs regulations. Buyers are responsible for local taxes and customs fees that may apply.--", "reviews": ["Customer service and delivery was quick.", "Such a sweet planter! Make sure to check the dimensions. I thought it would be larger but I had miscalculated the dimensions. It is really more for table top than floor.", "Really cute! I like that you can adjust the pot on the base and LOVE that it has a drain insert.", "Arrived quickly and is super cute. Got it for my sister and she loves it."]}, {"productId": "9wrPDbtMwg", "url": "https://www.etsy.com/il-en/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=f2f9a17a3d3a9cf5251ca92fcf423d046c7ac34f%3A1435558019&click_sum=35ba8a96&ref=stl_listing-3", "title": "Tile Pattern Ceramic Planter / Small Indoor Planter / Cactus Plant Pot / Succulent Plant Pot", "description": "THIS PIECE IS MADE TO ORDER AND WILL SHIP IN 2-3 WEEKS.Stoneware planter with hand carved details in a bright red and pink combo. Perfect size for a small cactus or succulent.  Small hole in bottom of pot for water drainage.Approx 2.5” height x 3” diameter", "reviews": ["Arrived SO fast (thank you for saving Christmas lol) and was packaged beautifully. My best friend loved it, and it has a place of honour in her flat now. :)", "This is my favourite mug. I use it everyday! It is the perfect size, the handle is really comfortable, and it's so pretty!!", "Love the mug it's very well made"]}, {"productId": "hWrdPpISyE", "url": "https://www.etsy.com/il-en/listing/1657888576/art-print-4-x-6?click_key=239009c8fbd5c04a2cccf1fbece1315330114ecc%3A1657888576&click_sum=e4c270e8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-1", "title": "Art print 4\" x 6\"", "description": "• unframed• matte• 4\"x6\"• 200g/m2!! 𝗜𝗠𝗣𝗢𝗥𝗧𝗔𝗡𝗧 𝗦𝗛𝗜𝗣𝗣𝗜𝗡𝗚 𝗜𝗡𝗙𝗢 !!Every order comes with standard shipping. It is 𝘂𝗻𝗿𝗲𝗴𝗶𝘀𝘁𝗲𝗿𝗲𝗱 - without a tracking number. EU delivery estimated to around 2 weeks, 6 weeks to arrive anywhere outside of EU.There are two upgrades available:• 𝗥𝗲𝗴𝗶𝘀𝘁𝗲𝗿𝗲𝗱 𝘀𝗵𝗶𝗽𝗽𝗶𝗻𝗴 𝘂𝗽𝗴𝗿𝗮𝗱𝗲: Package will require to be signed upon delivery and will give you a tracking number within EU.• 𝗥𝗲𝗴𝗶𝘀𝘁𝗲𝗿𝗲𝗱, 𝗴𝗹𝗼𝗯𝗮𝗹 𝘁𝗿𝗮𝗰𝗸𝗶𝗻𝗴 𝘀𝗵𝗶𝗽𝗽𝗶𝗻𝗴 𝘂𝗽𝗴𝗿𝗮𝗱𝗲: Is the fastest and safest way to ship your order from Europe to America. It provides you a tracking number that works worldwide.", "reviews": ["Good pin. It even came with a freebie sticker too (besides the boot sticker) 🥺💖"]}, {"productId": "YUsyUvYc8y", "url": "https://www.etsy.com/il-en/listing/1521258520/infinity-symbol-svg-infinity-png-bundle?click_key=4ec8fed791a62ac7d0ad20f7956cf2330a84679f%3A1521258520&click_sum=708a6ad9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-2&bes=1&dd=1", "title": "Infinity Symbol SVG, Infinity PNG Bundle, Infinity Clipart, Infinity SVG Cut Files for Cricut, Infinity Silhouette, Infinity Heart Svg", "description": "Infinity Symbol SVG, Infinity PNG Bundle, Infinity Clipart, Infinity SVG Cut Files for Cricut, Infinity Silhouette, Infinity Heart Svg❀ This file will be available to you immediately after purchase.Feel free to message me if you need any modifications regarding this Product I'll be happy to help.⚠️ Please read before purchasing:This is a digital file and no physical items will be shipped. The file comes as a digital download only.❀ This listing includes 2 zipped file the following high-quality files:⤿ 📂 +230 SVG files Includes All + Separate⤿ 📂 1 EPS files Includes All⤿ 📂 +230 PDF files Includes All + Separate⤿ 📂+230 PNG files Includes All + Separate➥ Instant download.❀ Perfect for Cricut or Silhouette projects to make t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, print n’ cuts & more!⚠️ HOW TO DOWNLOAD:Once your order is completed you will automatically be emailed a link to an Etsy download page where you can download your digital file(s). The email will be sent to the email address registered to your Etsy account.Thank you so much for visiting, and feel free to contact me with any questions.Happy crafting!", "reviews": ["awesome product love the files", "Thank you oh so much. Just perfect!", "So many items so be sure you have enough soace to download the items"]}, {"productId": "pQ3Vm9FYXf", "url": "https://www.etsy.com/il-en/listing/1581333291/super-mario-svg-bundle-for-cricut-and?click_key=53b019aebd273e0441c5d544c424d41fd6878df9%3A1581333291&click_sum=f1359119&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-3&pro=1&sts=1&dd=1", "title": "Super Mario SVG Bundle for Cricut and Sublimation, Mario Cut Files, Mario Clipart, Super Mario Font, Mario PNG", "description": "Please be sure to check out our Mega SVG Bundle here:https://www.etsy.com/listing/1650603379/mega-svg-bundle-svg-files-for-cricut?click_key=13bb139414fd829c458c1a386073fe1c8bb05329%3A1650603379&click_sum=ad0c2def&ref=shop_home_active_8&pro=1&sts=1★★★ INSTANT DOWNLOAD ★★★★ Here's what to expect from this DIGITAL DELIVERY:-----------------------Super Mario Bros Bundle in the following formats:SVG - PNG - JPG - FONT★ IMPORTANT-----------------------» The link is stored on the pdf file which will direct you to Google Drive where all your files are stored. You do NOT need a Google account to access your purchase!★ How to Download-----------------------1 - After purchasing, select \"Purchases\" from your Profile settings2 - Select \"Download Files\" for this purchase★ How to Use:-----------------------» Please have some experience if you plan on using these images for Cricut or sublimation. I will try to assist you if have any questions!★ CAN I SELL ITEMS I CREATE FROM THIS FILE?-----------------------Absolutely! You have full permission to sell physical items created from this file for personal and small commercial purposes, including shirts, tumblers, signs, cards, blankets, and more! However, it is prohibited to share or resell this design.★ Shop Policy-----------------------This file is intended for personal use only. You may not forward, share, sell or distribute this file.★ Refund Policy-----------------------Due to the digital nature of this product, we are unable to offer any refunds. Please get in touch prior to making a purchase if you have any questions ❤️*********************Please let us know if you have any problems and we'll be more than happy to help 😊VISIT OUR SHOP FOR MORE TUMBLER DESIGNS!!!♥♥♥ We would love to see your finished product. Please add your unique photos to your reviews! ♥♥♥", "reviews": ["Great files thank you again", "Thank you for the item.", "Matched description, perfect for my kids", "Some many different options and great quality!"]}, {"productId": "s4LHMNqmqi", "url": "https://www.etsy.com/il-en/listing/1648658969/amor-tumbado-svg-ct-svg-cut-files-for?click_key=2ec7ca8947051a8ee280245ef9d3b3b71a984ade%3A1648658969&click_sum=75a0188d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-4&bes=1&dd=1", "title": "Amor tumbado Svg, CT Svg, Cut Files for Cricut & Silhouette, Svg, Png, Dxf", "description": "MaterialsSVG File, PNG File, DXF File,  Print and Cut File, Vector, digital fileThis is a digital download of several files in zip archive.Inside zip archive you will find:5 X SVG for Cricut Design Space5 X PNG - 300 dpi with transparent background5 X DXF - for Silhouette Studio Basic EditionDue to the nature of instant downloads, we do not offer refunds. Therefore please make sure that you check the type of file you need before making your purchase.Reselling or sharing these files is strictly prohibited, in any digital format.PLEASE NOTE:If the download link does not appear, please feel free to contact me directly within Etsy.Thank you so much for your purchase", "reviews": ["All good all good good", "I don't meet my expectations", "All my favorite characters in the file! Love it.", "Exactly what I needed for my project."]}, {"productId": "COuyQrOpys", "url": "https://www.etsy.com/il-en/listing/773250221/amazing-watercolor-painting-kit-for?click_key=a61341489f4a02c1537626638f274ff320baa260%3A773250221&click_sum=9845ab7d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-5&bes=1&dd=1", "title": "Amazing Watercolor Painting kit for Procreate 2023", "description": "***This is a Digital Product! No physical item will be mailed to you. In order to use this digital product it is required that you have an iPad, an Apple Pencil (gen 1 or 2), and the Procreate app.PLEASE READ: After your purchase, you will instantly be able to download an instruction pdf. This pdf has highspeed Mediafire/Google Drive options where you can download the latest product files. You can find the PDF download available in the your account under 'purchases and review'. Customer Support 12 hours a day, 7 days a week. Please message me if you need a refund oranything and I will get back to you immediately. Returns and refunds are usually accepted unless the purchase is from a long time ago. You can even refund the kit if you don't like it after a few days.________________Over 200 tutorial videos and counting! Check it out the channel: https://www.youtube.com/playlist?list=PLh7C-U3ntymR9lx4mjeX4Zof56cuRpPZeI have a tutorial that explains the basics and will help you get started painting with this kit for the first time. You can watch it here: https://youtu.be/NxyVZ_GLuzM________________Just a few easy to use brushes are all you need to paint anything - over 25 brushes are actually included, but not all of them are needed for most projects. I spent weeks developing each brush so you can use them without having to switch back and forth between tons of brushes. Watercolor is my passion and I created this addon so the results look authentic and the process is intuitive. You can even use this addon and follow traditional watercolor tutorials on youtube and Pinterest!Blending: This addon features an incredible blending brush that will let you mix any colors together. It creates a realistic spidery water pattern, or a smooth ombre style blend. It’s up to you! This is the only watercolor system for procreate that captures the spontaneous textures and colors mixing that you see in real watercolor. Watch the video, you cannot believe how realistic it looks!________________What's included in this product:- Over 25 brushes (However, you don't have to use them all to paint something)- Regular Watercolor Paper Texture- over 100 Tutorials videos and customer support 12/7Commercial Use License:This product is suitable for unlimited commercial use! The kit is available on several different website, but this is the only shop that offers an unlimited commercial use license at no extra charge.________________Procreate Compatibility: You WILL need to update iOS to get the latest Procreate. Check on the App Store to make sure you haven't missed Procreate 5.3. It will only be visible if the iPad is updated.iPad Compatibility: All models that can run the Procreate appThis addon will work with any version of the iPad that can run Procreate 5.3 or higher. Currently, this is every iPad that is compatible with any version of the Apple Pencil.If you have any trouble with the addon, please message me on Etsy. Below this description, there is a button that says 'Message Calvin'. I am available 12 hours a day, 7 days a week and I'd love to help you :}________________VideosThe list of tutorials was getting too long, so I made a youtube playlist instead:https://www.youtube.com/playlist?list=PLh7C-U3ntymR9lx4mjeX4Zof56cuRpPZeMain Updated Tutorial: https://youtu.be/NxyVZ_GLuzM________________*Please make sure you have Procreate Version 5.3 or newer. You may need to check on the App Store and make sure you updated Procreate recently. If procreate is not showing an update but you are still running an older version, you will need to update the iPad. Sometimes the App Store will hide new versions of procreate if you haven't updated the iPad for awhile.", "reviews": ["It was exactly what I was looking for! The brushes are now the only ones I use! When I had trouble downloading them, the seller responded within minutes and the brushes were downloaded immediately!", "Very useful, great product! Very inspiring tool", "the brushes all good love it!"]}, {"productId": "vNUxG4qt0G", "url": "https://www.etsy.com/il-en/listing/1458050784/455-unique-project-proposal-presentation?click_key=41c958069769dfac8637b2f7e20b0efb0d5f8857%3A1458050784&click_sum=ed04c105&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-6&bes=1&dd=1", "title": "455 Unique Project Proposal Presentation Templates 60 color themes 4000 unique icons", "description": "There are 455 unique slides, 4000 unique icons and 60 color themes in this package.Our templates are fully customizable, allowing you to easily add your own content and tailor the presentation to your specific needs. Plus, our templates are compatible with all major presentation software, so you can use them with your preferred platform.Choose from a variety of templates that include cover slides, project timelines, team introductions, budget breakdowns, and much more. Our templates will help you organize your ideas and present them in a clear and concise manner, making it easy for your audience to understand your vision and get excited about your project.", "reviews": ["Great service, great product!  thank you!", "great item, exactly as described", "Nice templates, ready to use"]}, {"productId": "bJmDSWwmxm", "url": "https://www.etsy.com/il-en/listing/1665889182/wonka-tshirtmovie-shirtwilly-wonkawonka?click_key=8da8e08d5953684f85938483bd124a9e13be1d0c%3A1665889182&click_sum=802ad04d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-7&sts=1&dd=1", "title": "Wonka Tshirt,Movie Shirt,Willy Wonka,Wonka Factory Top,Golden Ticket,Wonka Logo,charlie svg,wonka png,Wonka Chocolate Factory", "description": "Wonka Tshirt,Movie Shirt,Willy Wonka,Wonka Factory Top,Golden Ticket,Wonka Logo,charlie svg,wonka png,Wonka Chocolate FactoryRefunds are not offered for any reason, because the files are digitalThis listing includes 4 files. INSTANT DIGITAL DOWNLOAD!You will receive files that includes:• SVG file• PNG file• JPG file•PNG 2 filePRODUCT DETAILSThese are digital designs; NO physical items will be shipped. You will receive your files as soon as you place your order.This is a great file for heat transferring vinyl to a shirt, cutting vinyl into suitable materials, or making cards. Use your imagination and create as you wish!Thank you for your purchase!", "reviews": ["GREAT WORK thanks so much ...", "These SVGs worked out great for my Wonka teacher shirt. Thanks!", "Easy to download. Cool design", "Exactly what I was looking for. Can't wait to start project"]}, {"productId": "PUklwOKb8E", "url": "https://www.etsy.com/il-en/listing/1676983339/easter-laser-cut-mega-bundle-248-easter?click_key=cb2e3041b4e17ce8b9ccc9afe57ddb4cccb8dc17%3A1676983339&click_sum=f54b38f9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-8&pro=1&dd=1", "title": "Easter Laser cut Mega Bundle, 248 Easter lasercut deisgns, 3D Happy Easter laser cut SVG, pop up card, wooden lanterns, ornament, stands svg", "description": "By purchasing this product you receive 2 zip folders with 248 Easter designs in SVG and DXF formats and a Catalog inside + PDF file with the link to the download of designs in all formats.NOTE: To download designs in all 6 formats (PDF, SVG, PNG, JPEG, DXF, EPS) open the \"Mega bundle Easter laser cut Download link\" PDF file which is included in your download.Designs included in the MEGA bundle are:3D Easter lantern (10)Easter box (10)Easter decor stands (10)Easter Doh holders (15)Easter egg basket (5)Easter gift card holder (10)Easter round sign (10)Easter stand (10)3D easter eggs (10)Alphabet Easter Signs (26)Easter keychains (10)Easter ornaments (15)Easter pop up cards (10)Easter single egg holder (10)Easter single egg holder 2 (5)Easter single egg holder 3 (5)Easter tray Laser cut (5)Easter directional sign (10)3D Round Easter egg basket (5)Easter gnomes (10)Easter letter keychains (26)Easter money holder (10)Egg holders (10)Interchangeable rabbit stand (1)---------------WHAT YOU RECEIVEPLEASE NOTE: This is a DIGITAL product. No physical product will be sent! Photos are for inspiration purposes only.This is a digital file for Cutting Machines.HOW TO DOWNLOADAfter purchasing this digital product, you will be able to access and download it from your Completed Orders page. As soon as your payment is done you will also receive a link to your instant download in your email which is linked to your Etsy account.Your file will be downloaded in a zip file so you will need to extract the files from the zip folder before use.Feel free to send me a message if you have any difficulties or have any questions left! I’m always happy to help and will respond to messages as soon as possible!Thank you for supporting DeisgnIdea!You can continue shopping onhttps://www.etsy.com/shop/2DigitalIdea---------------TERMS OF USEYou are allowed to use any files purchased in my shop for personal purposes or your small business. Designs can ONLY be used to create physical finished-end products such as home decor items, shirt prints, decoration on mugs and bags etc.You can NOT make my images available for digital download, resell or share them as is or modified, in digital form. You can NOT upload files or elements from them on \"print-on-demand\" websites.You can NOT create any physical intermediate products such as vinyl, embroidery design, etc. for sale which are used to create finished end products.By purchasing this item, you have agreed to the full terms of use listed in my shop policies above.", "reviews": ["Nice file with lots of details to cut. I love it.Thank you very much", "Have not cut them out yet but look very good", "Love these super cute keychains cut perfectly - great price"]}, {"productId": "B5xjDoLSjn", "url": "https://www.etsy.com/il-en/listing/1674604893/kawaii-digital-paper-set-s-anrio-digital?click_key=3a899ef97929e9a64ee3fb68e92113fbba4fee21%3A1674604893&click_sum=1bb22140&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-9&pro=1&dd=1", "title": "Kawaii Digital Paper Set, S-anrio Digital Paper Set, Cute K-uromi, My m-elody, H-ello Kitty, Digital Art, Digital Printable Papers", "description": "Digital downloadDigital file type(s):  1 PDF:･ﾟ✧ *:･ﾟ✧ *:･ﾟ✧ cute s-anrio Digital Papers🎀*:･ﾟ.✧:･ﾟ.✧ *:･.┊　　┊　　┊　　┊┊　　┊　　┊　　❀ PDF┊　　┊　　✧ high quality┊　　❀ 2000x2000 px.✧ 20 pcs PNGHow to download? :Etsy > Your account > Purchases and Reviews🔎REFUND, EXCHANGE or CANCELLATIONDue to the digital nature of this product refunds, exchanges and cancellations WILL NOT be issued. Please make sure the formats provided are compatible with your machine BEFORE purchasing.Please make sure you know at least one of the file types, including opening and using the files. Make sure your machine and software are compatible before purchasing.If you have a problem with the product, please contact me first.i am ready to help", "reviews": ["Fast response and very helpful and considerate."]}, {"productId": "fIkNxcpYUE", "url": "https://www.etsy.com/il-en/listing/1658192125/couple-wooden-state-sign-two-states-love?click_key=ad0995a1a9bfb3527f364c4850a86ec31b24fe07%3A1658192125&click_sum=270d7045&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-10&pro=1", "title": "Couple Wooden State Sign, Two States Love, Couple Valentine, Gift For Him, Wedding Decor, Valentines Day, Anniversary Gift E30", "description": "Introducing our Couple State Sign—a heartfelt expression of long-distance love and cherished memories. Commemorate the place you met or your destination wedding with this personalized gift. Our state to state sign, featuring custom location art, is the perfect couples gift for anniversaries, Valentine's Day, or any special occasion.These Wooden Sign are 100% handmade with High Quality Plywood.DETAIL:Dimensions:+6\"W x 6\"H ~ 15cmW x 15cmH+8\"W x 8\"H ~ 20cmW x 20cmH+10\"W x 10\"H ~ 25cmW x 25cmHPlease note at Personalization Area:+ The State name- The product will come with a standNOTE:- The item is made to order, the listing photos are examples and the detail of actual products may vary a little bit due to the characteristics of handcrafted products.- The color may vary a little bit due to screen settings.- The size may vary slightly due to the nature of individually handmade products.Should you need any further information or assistance, custom the desired products, do not hesitate to let us know, we are more than happy to support you!Thank you and happy shopping <3", "reviews": ["Perfect quality and the seller was super communicative and great in tailoring the dog ear shadow to the dog I wanted it made for.\nLoved the product - great quality :)", "Took a long time to get here, but worth the wait", "It's really beautiful, even better as it is in the picture ❤️\nThank you 🫶🏻", "Really sweet and great quality"]}, {"productId": "yGkdYdMyAk", "url": "https://www.etsy.com/il-en/listing/1430086177/pink-and-gold-marble-background-pink?click_key=a1e68c1d3ec413468b6ca7230e65a06244365c25%3A1430086177&click_sum=f07f285e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-11&dd=1", "title": "Pink and Gold Marble Background, Pink Marble Digital Paper, Rose Gold Marble Texture, Digital Scrapbook Paper, Photoshop Backgrounds", "description": "A pack of 20 beautiful white pink and gold marble digital papers: 20 Rose Gold Marble Backgrounds.Use them for your creative digital designs - websites, business cards, invitations, scrapbooking. They are perfect marble textures for Photoshop use.You will get:An archive with 20 jpg files of high quality, horizontal format (5000 x 3334).Please note: This is a digital product, no physical items will be shipped. Do not redistribute, resell, share or copy. Purchase does not transfer copyright.---------------DOWNLOAD DETAILS---------------Make a purchase and you will receive the link to download the file. You will get a pdf file with the link to Google Drive Folder and instructions. You don't need to register, you will be able to download the full folder or each file separately.Let me know if you have any questions, I will reply as soon as possible.------------------------------", "reviews": ["great item thank you very much", "These backgounds are very beautifull in full version, \nQuality is perfect! Thanks!!!", "nice colors and shades, I'm satisfied", "I love these textures and the quality they have"]}, {"productId": "fSjerdcjlp", "url": "https://www.etsy.com/il-en/listing/1523224267/paw-print-svg-bundle-paw-heart-svg-dog?click_key=f0c8360f3f26c91a6a4f86dfcb2830d8762f44b1%3A1523224267&click_sum=178a28ea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-12&bes=1&dd=1", "title": "Paw Print Svg Bundle, Paw Heart Svg, Dog paw svg, Paw Svg, Dog Mom Svg, Dog Lover Svg, Paw Print Clipart Silhouette, Animal Paw Svg.", "description": "Paw Print Svg Bundle, Paw Heart Svg, Dog paw svg, Paw Svg, Dog Mom Svg, Dog Lover Svg, Paw Print Clipart Silhouette, Animal Paw Svg.❀ This file will be available to you immediately after purchase.Feel free to message me if you need any modifications regarding this Product I'll be happy to help.⚠️ Please read before purchasing:This is a digital file and no physical items will be shipped. The file comes as a digital download only.❀ This listing includes 1 zipped file the following high-quality files:⤿ 📂 +120 SVG files Includes All + Separate⤿ 📂 1 EPS files Includes All⤿ 📂 +120 PDF files Includes All + Separate⤿ 📂 +120 PNG files Includes All + Separate➥ Instant download.❀ Perfect for Cricut or Silhouette projects to make t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, print n’ cuts & more!⚠️ HOW TO DOWNLOAD:Once your order is completed you will automatically be emailed a link to an Etsy download page where you can download your digital file(s). The email will be sent to the email address registered to your Etsy account.Thank you so much for visiting, and feel free to contact me with any questions.Happy crafting!", "reviews": ["I can't wait to make stickers to decorate all my stuff!", "Great purchase.  Lots of choice.", "So many to choose from.", "Very pleased with this purchase!"]}, {"productId": "NhhdBuwOrh", "url": "https://www.etsy.com/il-en/listing/1649559018/canva-editable-valentines-day-calendar?click_key=c93572ea163081871975d8f23f202ea0a1b796c2%3A1649559018&click_sum=c890a0a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-13&dd=1", "title": "Canva Editable, Valentine's Day Calendar Print, Wedding Date Keepsake, Anniversary Gifts for Him or Her, Canva Template, Special Date", "description": "The ideal and personalized gift for your partner on celebrations such as your anniversary, Valentine's Day or other special occasions.✿HOW IT WORKS1. Purchase the digital product on Etsy and download the attached PDF files from the purchases and reviews section located below your profile photo. Open the downloaded PDF file and click the links provided to access your template in Canva.2. If you don't already have a free Canva account, sign up and start editing the template in your browser or in the Canva app. You can customize the text, change fonts, colors and backgrounds, as well as add or remove elements. Additionally, you have the option to copy as many pages as you need, and all your changes will be saved automatically.3. Download the edited template in the format that best suits your needs, whether PNG, JPEG or PDF.4. Use your digital product digitally or print it according to your preferences. Enjoy the final result!✿Need a different size or help with the design? Let us know, we are open to helping you with that. Message us via Etsy messaging.✿ Thank you for visiting us and have a nice day!", "reviews": ["Excellent customer service. I was having trouble finding the file and she helped me find it and maintained professionalism throughout the transaction. Quick turn around time , too! will be buying again!"]}, {"productId": "gaXnjJYwoN", "url": "https://www.etsy.com/il-en/listing/1494919926/custom-order?click_key=355217b3f77fac22476b29c8b7097973cf0b6c71%3A1494919926&click_sum=d1d3abad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-14&pro=1&sts=1&dd=1", "title": "Custom order", "description": "Please do not buy before contacting", "reviews": ["Sample color and quality all good. Great service.", "Thanks soo much Dasha. 🥰🥰", "This seller went out of her way to make sure a mistake i made on a custom order was corrected. I was VERY grateful. I will definitely purchase again!", "Thanks soo much Lisa.  🥰🥰 customer satisfaction is my priority", "Fast delivery and good quality sample because it was large and easy to view in the room.", "Thank you", "One of my panels tore.  They sent me a new one.  That is amazing customer service !", "Thanks soo much Jennifer. 🥰🥰"]}, {"productId": "MCgTKUqfFw", "url": "https://www.etsy.com/il-en/listing/1665630928/taylor-swift-the-eras-tour-2023-bundle?click_key=aba077c86afba935573d4f5874422158510167a1%3A1665630928&click_sum=7567a403&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-15&pro=1&sts=1&dd=1", "title": "Taylor Swift The Eras Tour 2023 Bundle Png, Taylor Swift Png, TS Swiftie Concert Png, Taylor Swiftie Png, Taylor Swiftie Eras PNG, Bundle", "description": "Welcome to HappyNewsCrafts, where you'll discover an exceptional selection of SVG and PNG files for your crafting needs! Our collection offers a diverse range of designs that are compatible with Cricut machines and other crafting tools.♡ What's Included:♡ PNG File: These high-resolution raster images provide vibrant graphics, ideal for incorporating photographs, artwork, and detailed designs into your projects.♡ How to Download:You will receive an email from Etsy with a link to your downloads immediately after purchase. This will be sent to your Etsy account email. You should receive the email for a few minutes. If not, please check in your spam folder. All of the listing downloads will also be available in your purchase history. Files can be downloaded instantly. Please make sure the files listed above will work with your machine and software before purchase.♡ Terms Of Use:- Unlimited Personal use.- Not to be resold as any type of digital download.♡ If you want to physically sell the product, you must get my commercial license from below link;https://www.etsy.com/listing/1524642586/commercial-license-for-all-designs-whole♡ Don't forget to check out the whole store package from below link to get all my products in my store and all my future products;https://www.etsy.com/listing/1538813669/happynewscrafts-whole-entire-shop-svg?We're dedicated to providing a seamless experience, so if you have any questions or need assistance, please don't hesitate to reach out. Start exploring our collection now and let your imagination soar with our versatile SVG and PNG files!Taylor Swift The Eras Tour 2023 Png | Taylor Swift Png | TS Swiftie Concert Png | Taylor Swiftie Png | Taylor Swiftie Eras PNGswiftie png,taylor lover pne,taylor swiftie eras,taylor png,the eras tour png,taylorswiftpng,the eras tour 2023,the eras tour,taylor swift png,swiftie concert,taylor swiftie png,taylor fan gift,taylor fan png", "reviews": ["Such a super cute design!!!", "Met expectations. Quality was perfect for the project I used it for", "Love it! Love it! Love it!", "Awesome price and great quality"]}, {"productId": "eUrLzhLxqM", "url": "https://www.etsy.com/il-en/listing/1588333929/the-lakes-poster-printable-wall-art?click_key=25ce33b4b9b627e746a946cc20296dbdbb8dbd8e%3A1588333929&click_sum=6c2d9b3e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-16&bes=1&sts=1&dd=1", "title": "The Lakes Poster | Printable Wall Art | Digital Download Print at Home | Subtle Swiftie Aesthetic Home Decor", "description": "THIS IS A DIGITAL DOWNLOAD, A PHYSICAL COPY WILL NOT BE SENT TO YOU.Customers are responsible for the printing of their item in the size of their choice.————WHAT YOU WILL RECEIVE————Instant high-resolution ZIP file download containing JPGs.You will receive 6 versions of the same print, each a different size that correlates with your preferred printing size. Along with the 6 prints, you will receive a ‘How To Print’ document that will go into the sizing and printing process in more detail.Each Ratio is compatible with a number of different size print options: (“=inch)4:5 Ratio - 4”x5”, 8”x10”, 12”x15”, 16”x20”3:4 Ratio - 6”x8”, 9”x12”, 12”x16”, 15”x20”, 18”x24”2:3 Ratio - 4”x6”, 8”x12”, 12”x18”, 16”x24”, 20”x30”, 24”x36”5”x7” = 5”x7”11”x14” = 11”x14”ISO = A1, A2, A3, A4, A5, A6 Poster SizesCustomer is responsible for the printing of their digital download.It is HIGHLY recommended that for the best results you print your poster professionally. Home printing is possible, but please be aware that the quality will not be as good.Some professional online printing suggestions: Snapfish, Vistaprint, Photobox, Shutterfly - My personal favourite is Snapfish.UK Stores that commonly offer professional printing: Boots, ASDA, Tesco.USA Stores that commonly offer professional printing: Walmart, Walgreens, CVS.You can also save file to USB and take into your local printing store.Please be aware that colour can vary once the product is printed depending on the monitor/printer/paper used.————HOW TO DOWNLOAD YOUR DIGITAL FILE————1. Log in to your Etsy account2. Purchase Digital Download3. Click on “You” (top right)4. Choose “Purchases and reviews”5. Find the order. Click on “Download Files” (to the right of the order)6. The file will go to your “Downloads” folders on your device and will appear as a zipped folder.7. Unzip the folder to reveal your 6 print ratios/sizes and How To Print document.8. Follow instructions on How To Print Document and print poster at the size of your choice from home or using your favourite print store.This purchase is for personal use only.Please don’t hesitate to contact Sweet Thing Designs with any questions, queries or problems regarding this product.There are no returns when purchasing a digital download.If you like the style of Sweet Thing Designs, but would like a design in a custom size, please get in contact.Thank you for choosing Sweet Thing Designs! xo", "reviews": ["such great quality ! Can't wait to see it framed on my wall!", "The printing instructions were easy to follow, and everything turned out great!", "LOVE this print, it’s so beautiful and captures the song perfectly", "Thank you so much! 🥹💕", "Awesome TS wall art. Subtle and beautiful!"]}, {"productId": "auPRBbZLas", "url": "https://www.etsy.com/il-en/listing/1145828694/jesus-leaves-the-99-digital-print-jesus?click_key=b810f9fd0320197d9b5e228368aa052e5c117d99%3A1145828694&click_sum=a6298279&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-17&pro=1&sts=1&dd=1", "title": "Jesus Leaves the 99, DIGITAL PRINT!, Jesus Art, Bible Art, Jesus Good Shepherd, WALL Art, Rejoices over One Lost Sheep", "description": "::::::::::::::::::::::::::::::::::::::::::::::::::::::::::PLEASE READ DESCRIPTION CAREFULLY BEFORE PURCHASE. THIS IS AN INSTANT DOWNLOAD. NOTHING WILL BE MAILED. [Copyright © 2022 Micah Martin]::::::::::::::::::::::::::::::::::::::::::::::::::::::::::Hand drawn sketch of Jesus as the Shepherd leaving the 99 other sheep to save the one wandering sheep. There are two passages in mind here, Matthew 18:12-14, and Luke 15:4-7. Also, check out Jesus as the Good Shepherd in John 10. I hope this drawing reminds you of scripture and the rejoicing in heaven over one sinner who repents. Fun Fact - This was drawn while I watched \"The Most Reluctant Convert,\" about C.S. Lewis.Bring a modern, boho, and minimalist style to your home décor with this premiere Bible art. Drawn by a graphic artist trained in architecture, who also has a supreme love for scripture.Waiting for shipping can be a drag – my artwork is ready to download immediately! This listing is for DIGITAL DOWNLOADS ONLY. Nothing physical will be mailed. What’s so wonderful about digital prints? There’s no need to wait days for the mail to come – all files are available once your payment has cleared. That means you save time and money on shipping!:::::::::::::::::::::::::::::::::::::::::WHAT YOU’LL RECEIVE -- [NOTE: WE ARE UNABLE TO OFFER CUSTOM SIZING OR BACKGROUND CHANGES]:::::::::::::::::::::::::::::::::::::::::This listing includes four zip files, with two files in each (a CMYK JPEG and a RGB JPEG). In total there's eight (8) instantly printable downloadable digital files (without framed background)! Your order will include the following:2x3 RATIO FILES FOR PRINTING: 20\"x30\" (Can also be printed at 6\"x9\", 8\"x12\", 10\"x15\" or 12\"x18\" if you resize document, or change page sizing in printing preferences.)3x4 RATIO FILES FOR PRINTING: 18”x24” (Can also be printed at 6\"x8\", 9\"x12\", or 12\"x16\" if you resize document, or change page sizing in printing preferences.)4x5 RATIO FILES FOR PRINTING: 16\"x20\" (Can also be printed at 4\"x5\" or 8\"x10\" if you resize document, or change page sizing in printing preferences.)11x14 RATIO FILES FOR PRINTING: 11”x14”We are UNABLE to do custom sizing or background changes due to time constraints. To maintain unpixellated clarity for your print, stick to the sizes (in inches) that are listed.::::::::::::::::::::::::::::::::WHERE AND HOW TO PRINT [**IMPORTANT**]::::::::::::::::::::::::::::::::Upon purchase, your files are immediately accessible and downloadable on your laptop or computer using this link:www.etsy.com/your/purchasesPrints can be downloaded directly from Etsy, so if you provide the wrong email address, no need to worry! Please keep in mind that you cannot download the prints on your mobile device.For all listings we provide two color variations (CMYK and RGB) for you to upload to third party websites. If the listing has a ZIP folder, download it to your computer, and double-click to open it, or you can extract the JPEG files by right clicking the ZIP file and selecting “extract,” or, “open.” Most websites will accept either color variation, however Walgreens will only accept RGB files.As far as where to print, the options are endless! Customers have printed through Mixtiles, SimplyFramed, Mpix, Shutterfly, local print shops, etc. However, most customers have had the best results printing through Staples using the “poster” format.::::::::::::::::::::::::COPYRIGHT INFO::::::::::::::::::::::::Copyright © 2022 Micah MartinOur artwork/prints are copyrighted and may not be redistributed, resold, or regifted without clear written consent. Offenders will be tracked down as we scan the internet regularly.Customers may print the file for themselves. Each purchase is considered one finished product for one person. If you want to ‘gift’ a previously purchased print, you must purchase it again.Please message us for information on how to buy large quantities of the same print, for a group of people.::::::::::::::::::::::::LAST NOTES::::::::::::::::::::::::No physical products will be shipped. This listing is for an INSTANT DOWNLOAD only.COLORS may vary slightly from how they appear in person or how they display from one viewing device to another due to the color calibration of your device or monitor. Also be aware that there are color variations on different screens. Colors seen on your screen here may vary slightly. We DO NOT offer custom resizing or custom background changes. NOTE: All prints include a textured background to achieve a vellum/parchment appearance.FINAL PRODUCT of the artwork will be determined by the quality of the printer and either the paper or card stock that you choose. For the most visually stunning final results we recommend printing the designs using high-quality paper that is white and matte.ONCE PAYMENT is cleared, Etsy will notify you that your downloads are available. If you have any questions about the download process, please visit Etsy’s help center:https://www.etsy.com/help/article/3949NOTICE: BibleSketches retains the rights for the use of these files.Please remember:- All prints are for PERSONAL use ONLY. These are not to be used for any commercial purposes.- You cannot share or resell any files- You cannot use these files in any promotional materials- Please, please, please, leave a five-star review! It helps so much!", "reviews": ["Absolutely beautiful piece of art.", "Easy to download and print, unique gift!", "Beautiful art.   Easy to download and print.", "Beautiful work of art, thankyou"]}, {"productId": "txsVQrxgUv", "url": "https://www.etsy.com/il-en/listing/1585218956/envato-elements-download-service-1-month?click_key=5508c66542ff44a2688b57e570e49ae1539d4d6f%3A1585218956&click_sum=8db48212&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-18&bes=1&sts=1&dd=1", "title": "Envato Elements Download Service, 1 Month Package, Fast Download, No Waiting in Line", "description": "🚀 Envato Elements Download Package - Fast and Licensed Downloads 🚀✨ Welcome! Step into the world of the Envato Elements Download Package and unleash your creativity without limits. ✨🔹 Speed and Convenience: Download the creative content you need instantly! No waiting in line, enjoy downloads within seconds.🔹 Full License Access: Licenses for the downloaded files are included! Use them in your projects without worries.🌟 Package Options:👉 1-Month Package👉 30 Days Usage Period👉 50 Downloads per Day👉 750 Downloads in Total.🎨 What Types of Content Are Included?🎥 Video Templates🎨 Graphic Designs📸 Stock Photos🎶 Music and Sound Effects📝 Web Templates, and More📦 Buy Now: Get acquainted with the Envato Elements Download Package, inspiring your creativity. Elevate your projects to the next level. Savor the taste of limitless creativity!📩 If you have any questions, feel free to send us a message. We're here for you!Discover the Envato Elements Download Package to accelerate your creative projects in the digital content world. Unleash your creativity! 💡", "reviews": ["Works! Not sure how but i got what i needed lol", "Thank you for your shopping. We are always here for you", "everything is perfect, it is exactly what they offer and the assistance is perfect and fast, although on top of that it was due to my mistake, they fixed everything for me, very well", "Thank you for your shopping. We are always here for you", "Great purchase! Works really well.", "Thank you for your shopping. We are always here for you"]}, {"productId": "OvmwxQbpPn", "url": "https://www.etsy.com/il-en/listing/1670924087/clean-1989-poster-printable-wall-art?click_key=4577f2183b61325188fe3149ae31541412be9255%3A1670924087&click_sum=671012e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-19&bes=1&sts=1&dd=1", "title": "Clean 1989 Poster | Printable Wall Art | Digital Download Print at Home | Subtle Swiftie Aesthetic Home Decor", "description": "THIS IS A DIGITAL DOWNLOAD, A PHYSICAL COPY WILL NOT BE SENT TO YOU.Customers are responsible for the printing of their item in the size of their choice.————WHAT YOU WILL RECEIVE————Instant high-resolution ZIP file download containing JPGs.You will receive 6 versions of the same print, each a different size that correlates with your preferred printing size. Along with the 6 prints, you will receive a ‘How To Print’ document that will go into the sizing and printing process in more detail.Each Ratio is compatible with a number of different size print options: (“=inch)4:5 Ratio - 4”x5”, 8”x10”, 12”x15”, 16”x20”3:4 Ratio - 6”x8”, 9”x12”, 12”x16”, 15”x20”, 18”x24”2:3 Ratio - 4”x6”, 8”x12”, 12”x18”, 16”x24”, 20”x30”, 24”x36”5”x7” = 5”x7”11”x14” = 11”x14”ISO = A1, A2, A3, A4, A5, A6 Poster SizesCustomer is responsible for the printing of their digital download.It is HIGHLY recommended that for the best results you print your poster professionally. Home printing is possible, but please be aware that the quality will not be as good.Some professional online printing suggestions: Snapfish, Vistaprint, Photobox, Shutterfly - My personal favourite is Snapfish.UK Stores that commonly offer professional printing: Boots, ASDA, Tesco.USA Stores that commonly offer professional printing: Walmart, Walgreens, CVS.You can also save file to USB and take into your local printing store.Please be aware that colour can vary once the product is printed depending on the monitor/printer/paper used.————HOW TO DOWNLOAD YOUR DIGITAL FILE————1. Log in to your Etsy account2. Purchase Digital Download3. Click on “You” (top right)4. Choose “Purchases and reviews”5. Find the order. Click on “Download Files” (to the right of the order)6. The file will go to your “Downloads” folders on your device and will appear as a zipped folder.7. Unzip the folder to reveal your 6 print ratios/sizes and How To Print document.8. Follow instructions on How To Print Document and print poster at the size of your choice from home or using your favourite print store.This purchase is for personal use only.Please don’t hesitate to contact Sweet Thing Designs with any questions, queries or problems regarding this product.There are no returns when purchasing a digital download.If you like the style of Sweet Thing Designs, but would like a design in a custom size, please get in contact.Thank you for choosing Sweet Thing Designs! xo", "reviews": ["such great quality ! I can't wait to see it framed on my wall !", "Beautiful downloads, looking forward to printing them!", "Awesome TS wall art. Subtle and beautiful!", "Thank you so much!! 💕💕"]}, {"productId": "mPGvmExUNH", "url": "https://www.etsy.com/il-en/listing/1400320341/loving-them-with-you-poem-for-your?click_key=d95eef46db594194270a955345a34338650edc6f%3A1400320341&click_sum=7bb33dd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-20&bes=1&sts=1&dd=1", "title": "Loving Them With You Poem for your partner (different versions available incl Him/ Her)", "description": "Appreciation piece for your partner when you're in the trenches. (versions mother & father, two mothers & him / her within the one download) *please respect my work by not forwarding it onto friends for multiple uses xThis poem is 8 by 10 inch.These are not to be onsold and are copyrighted as my words.Digital high resolution download will not have watermark. See your emails for your pdf download.Keep a look out for more poems and extracts added weekly.Poetry books and Greeting Cards sold here: www.jessicaurlichs.com* I charge a one off small fee for commercial use of my Etsy Prints per poem, please email me on  jess [!at] jessicaurlichs.com to find out more.", "reviews": ["Such a beautiful poem. My husband loved it.", "I love your poems", "Beautiful words! Going to frame for my husband as VDay present!"]}, {"productId": "DZvew8HEVa", "url": "https://www.etsy.com/il-en/listing/1394859964/clown-chocolate-lollipop-template?click_key=afe4597881c4e8d0a735c9290762383dc19c4113%3A1394859964&click_sum=26e86dad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-21&bes=1&dd=1", "title": "Clown Chocolate Lollipop Template", "description": "Hello! Thank you for your interest in our products, we recommend that you read the information before placing your order.Clown Chocolate Palette Box TemplateIn its mini versionIncludes• Template in AI, BMP, DXF, JPG, PNG, SVG format• Gift Design in letter size PNG format.Ready to customize and print.You can do the cutting on a plotter and/or also by hand!IMPORTANT• This file is digital so you will not receive any physical product.• No full or partial refund of the cost of the file is made because it is digital.• Resale of this digital file is prohibited.• Sharing and copying this digital file is prohibited.• Does not include advice.Create your own designs and share us on our networks, we would love to see them!", "reviews": ["Great item, very useful. The item matched the description.", "excellent and very practical and super fast shipping", "Good file and very useful"]}, {"productId": "FNgfhikapb", "url": "https://www.etsy.com/il-en/listing/1583085373/150-boho-floral-digital-backdrops-for?click_key=78ef0984d2fe77cbee1ea309a7850f643b688a12%3A1583085373&click_sum=7c2b4605&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-22&bes=1&dd=1", "title": "150 Boho Floral Digital Backdrops for Composite Photography, Wedding Backdrop, Maternity Backdrop Overlays, Chiara Arch Backdrops", "description": "Elevate your photography with our exquisite collection of 150 Boho Floral Digital Backdrops, specially designed for composite photography. These backdrops infuse a touch of bohemian charm, providing a captivating and artistic ambiance to your photos.**Product Features:**- **Versatile Selection:** This collection comprises 150 digital backdrops featuring boho floral themes, adding a delightful touch of nature to your images.- **High-Quality Images:** Each backdrop boasts a resolution of 5300 x 3500 pixels, ensuring excellent image quality.- **File Format:** All files are provided in high-quality JPG format for your convenience.- **Instant Download:** Gain immediate access to your digital backdrop collection and start enhancing your photos effortlessly.- **Perfect for Various Occasions:** Ideal for composite photography, including weddings, maternity sessions, and artistic overlays.**Compatibility and Usage:**- **Software Compatibility:** These digital backdrops are compatible with software like Photoshop, enabling seamless integration into your creative projects.- **Creative Freedom:** Use these backdrops for a wide range of creative purposes, from enhancing your wedding photos to adding a touch of nature to your maternity sessions.**Terms and Disclaimer:**1. **Basic Software Knowledge:** A basic understanding of photo editing software, like Photoshop, is recommended for optimal results.2. **Immediate Digital Access:** Your purchase grants you instant access to the digital product; no physical items will be shipped.3. **No Refunds:** Due to the nature of instant downloads, refunds are not available.4. **Respect Copyright:** Please refrain from reselling, gifting, or redistributing this product in any form to uphold copyright integrity.5. **Intended for Personal Use:** This product is designed for personal photography client use and non-commercial activities.6. **Commercial Limitations:** These backdrops are not suitable for products intended for sale, online or offline businesses, paid advertisements (physical or digital), apps, or games. For commercial use needs (e.g., large brands and companies), kindly reach out to us.Transform your photography into a boho-inspired masterpiece with these Boho Floral Digital Backdrops. Enhance your images with the beauty of nature and experience the artistic allure they bring to your photos. Embrace the enchanting world of bohemian photography and elevate your creative projects with these captivating backdrops.", "reviews": ["Nice collection of overlays would recommend", "The best website for all otems", "They gave me very good results in my photos"]}, {"productId": "CaRBkYvJVS", "url": "https://www.etsy.com/il-en/listing/1638060836/metaphoric-associative-cards-coaching?click_key=b2f81b2197b23a00a27a7f150ee3da89ea62cb0f%3A1638060836&click_sum=592485ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-23&dd=1", "title": "Metaphoric Associative Cards, Coaching and Therapy Tool, Metaphor insights. Printable PDF + PNG.", "description": "Associative Cards will help you be more creative, gain deep insights, and think in new ways. These cards are useful for therapists, counselors, designers, teachers, team leaders, and anyone seeking innovative problem-solving methods. They provide new ways to analyze and solve problems.How to Use:- Select a Metaphor: Choose a card that resonates with your focus, challenge, or session objective.- Explore Connections: Delve into the metaphor's associations and encourage participants or clients to reflect on its relevance.- Spark Insights: Watch as fresh insights, unique viewpoints, and innovative ideas emerge, transforming your approach and leading to new experiences.- Figurative Language: These cards like 'creative' button. They help you break free from the usual thought patterns and explore fresh ideas.Why Choose Metaphorical Associative Cards:- Engagement and Interaction: People actively participate in the exploration of metaphors, resulting in more dynamic and insightful discussions.- Breakthroughs and Transformations: Associative thinking can lead to breakthrough moments, helping overcome obstacles and progress in personal and emotional development.- Digital Convenience: Access these cards digitally, making them a versatile tool you can incorporate into both in-person and virtual sessions.What does it include:- Deck of 65 Metaphorical Associative Cards \"Dreams\" in digital PNG format. Card Size digital PNG 7x12 Ratio; Printable version in PDF 7X11 cmFollow us on Instagram @mac_insights for MAC practice ideas.Please keep in mind that this is a DIGITAL PRODUCT. No physical cards will be shipped. However, you can easily print and cut them out to use.𝐀𝐅𝐓𝐄𝐑 𝐏𝐔𝐑𝐂𝐇𝐀𝐒𝐄After payment has been processed, you may immediately view and download your files by going to your Etsy Profile > Purchases.If you register as a 'Guest', Etsy will send you an email with your download links. Please check your spam folder as well as the social/promotions tabs.Please keep in mind that the Etsy mobile app does not support downloading. To download a digital asset on a mobile device, sign into Etsy.com using your mobile browser.-------------------------------------These files are for personal use only. You can not distribute them in any way. You agree to these terms and conditions by making a purchase from us.", "reviews": ["I’m absolutely amazed with these cards. Definitely recommend it", "All was good and Iam happy about it", "thank you so much for your feedback!", "Thank you very much! These cards are amazing, I will use them in coaching sessions.", "Appreciate your feedback, thank you!", "These cards are just amazing. I love them so much!", "Thank you so much for your feedback!"]}, {"productId": "nEWpjdvpVi", "url": "https://www.etsy.com/il-en/listing/1665392439/pnk-lyric-album-song-doodle-art-logo-png?click_key=0fa2b42741a81f06ec429743eed29320b43dbd6e%3A1665392439&click_sum=e9f76cf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-24&bes=1&dd=1", "title": "P!nk Lyric Album Song Doodle Art Logo PNG Bundle, This PNG for Shirt, Sublimation Download, Digital Instant, Printable File", "description": "| About This Product |*This is a DIGITAL file of a printable PNG download - no physical product will be shipped!*PNG's are 300dpi and are sent as finished files and are not for editing.*This is not an SVG file and cannot be used as one.*This PNG is great for creating sublimation products, invitations, framed art, pillows and so much more![Important Note: Please make sure you have the required software and knowledge to use this graphic before making you purchase. We do not offer refunds for digital downloads.]| What You Will Receive |*You will receive a digital download in PNG format. It will be compressed into a ZIP file.*No watermark will be on your download.*300 DPI resolution*Transparent background*Please note that every effort has been made to represent the true colors of this file. However, resolution and final colors may vary from screen to screen and printer to printer.*Upon purchase your file(s) are sent to you via Etsy's \"\"instant delivery\"\" system. Once your payment has processed, your downloads will be available under You>Purchases and Reviews.| Additional Important Information - Please Read |-This digital download is for personal and small business use only. Commercial and mass production is not allowed.-Please remember to credit Illustrendy somewhere in your listing or on your item description or website.-You are not allowed to sell transfers without the purchase of a commercial license. If you would like to sell transfers please message me!All of the designs we create are original, one of a kind pieces of art. They are protected by copyright upon creation.Please Do Not:*Change or alter the design in any way.*Claim our design as your own.*Gift, share, or sell the digital file. Each person using this design must have their own receipt of purchase.*Upload the digital file to any sharing site.*Copy or create items which look very similar to this design in order to get around these policies.*Outsource your items to be created using the design such as through a print on demand company. All products must be created in house.*Sell printed transfers without a commercial license.[If you would like to sell printed transfers you must purchase our commercial license. Please message us for this information.]We do not offer refunds for digital downloads.", "reviews": ["Brilliant, looked amazing on black tshirt", "Excellent would use again . Thank you", "thank you just what I was looking for", "Thank you very much for your design."]}, {"productId": "mFUqZKsXNB", "url": "https://www.etsy.com/il-en/listing/1678789453/my-varnished-feet-in-pretty-black-heeled?click_key=c9247aba3abdbb0240243f1865bb05c3d63e8918%3A1678789453&click_sum=e2d18195&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-25&dd=1", "title": "My varnished feet in pretty black heeled sandals", "description": "Here's a collection of photos of my feet wearing pretty black heeled sandals 🖤There are 5 high-quality photos, including the one on the cover, which should catch the eye of any foot lover 🦶🏻They will be delivered to you directly after purchase.You won't be disappointed!*** CAUTION ⚠️ ***This content is intended for adults only, although there is no nudity. By accepting this order, you certify that you are over 18 years of age or have reached the legal age of majority in your country. The seller cannot be held responsible for any failure to comply with this condition.", "reviews": []}, {"productId": "tVXeDWGAcy", "url": "https://www.etsy.com/il-en/listing/1457663223/fleabag-priest-quote-poster-typography?click_key=cea504ce9966f89ecde420081b98d4902f016a83%3A1457663223&click_sum=043fe4bf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-26&pro=1&sts=1&dd=1", "title": "Fleabag Priest Quote Poster, Typography Art Print, Monochrome Print, Aesthetic Retro TV Wall Art,  Instant Digital Download Print PNG", "description": "High Quality + Can be printed in any size! Original Size: A2Artwork hand-drawn and designed by me!INSTANT DOWNLOAD- This listing is for a digital download only. No physical product will be included.- You will receive 1 PNG file.Upon purchase you will receive a link to download the design file/page!---- File is for personal use only.- Commercial use and distributing/sharing is prohibited.---", "reviews": ["Blows up well, perfect for the girls", "Picture is amazing. Fantastic quality and went above expectations.", "First print didnt came out in the best quality, i'll try it again. But overal great art and I'm satisfied ❤️", "Simple and easy thank you!"]}, {"productId": "EyumFJmvn8", "url": "https://www.etsy.com/il-en/listing/1647343870/custom-movie-poster-template-for-canva?click_key=0f6011c5e1dcdfcba7a4e69c86083b5937f48911%3A1647343870&click_sum=485c52f1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-27&pro=1&dd=1", "title": "Custom Movie Poster Template for Canva, Personalized poster, Valentines Day, Couple Gift, Anniversary Gift, Digital download", "description": "Unleash your inner movie star! 🌟Create your own movie poster with our fun Canva template. It's easy, customizable, and perfect for any event!🔰 Free Canva Version Friendly: No pro account? No problem! Edit with ease.🎨 Totally Customizable: Play with text, colors, and graphics. Make it yours!🎁 Unique Gift: Delight friends and family with this creative, personalized present.1️⃣ Digital Download: Get your template instantly, no waiting for shipping.2️⃣ What You Get: Links to various editable poster styles. Choose and create! ✅3️⃣ Any Size You Need: Just tell us in the personalization box or message. 👍⚠️ Remember:Best on Canva's Desktop version.For personal use only. Please don't resell or redistribute.Canva Movie Poster Template, Editable template, Couple, Wedding, Custom Gift, quick edit", "reviews": ["Easy to use and matched description", "great, easy to personalize and fun", "Easy to edit and looks very nice", "Gracias!", "I'm super happy with this digital download, I bought it because it also includes the chest measurement which I did not see on any others. I want my customers to have ALL the information they need without having to look any further, this reduces the chance that their t-shirt will not fit. Thank you!"]}, {"productId": "byFwiUZIXF", "url": "https://www.etsy.com/il-en/listing/1505793415/paper-cup-wrapper-template-bundle-5?click_key=bd3764c127e6547d400fd384b96172311a3ee919%3A1505793415&click_sum=dea4be34&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-28&bes=1&dd=1", "title": "Paper Cup Wrapper Template Bundle, 5 Sizes Paper Cup Wrapper SVG, Paper Coffee Cup Template, 4oz - 8oz - 9oz - 12oz - 16oz | Instant", "description": "This listing includes of:4, 8, 9, 12, 16 Paper Cup Wrapper Template SVG File4, 8, 9, 12, 16 Paper Cup Wrapper Template PNG File (300 DPI High Resolution)4, 8, 9, 12, 16 Paper Cup Wrapper Template EPS File4, 8, 9, 12, 16 Paper Cup Wrapper Template PDF File4, 8, 9, 12, 16 Paper Cup Wrapper TemplateDXF File4, 8, 9, 12, 16 Paper Cup Wrapper Template PSD File* SVG files are vector file and can be resized larger or smaller without losing it's quality.Introducing our latest product, the 5 Size Paper Cup Wrapper Template! Enhance your creativity and customize your own cup wrappers effortlessly with this versatile set. Whether you're a cricut, canva, or silhouette user, these templates are fully compatible, ensuring a seamless design experience.Each template in this package is meticulously crafted to fit the following cup sizes:4oz Paper Cup Wrapper Template8oz Paper Cup Wrapper Template9oz Paper Cup Wrapper Template12oz Paper Cup Wrapper Template16oz Paper Cup Wrapper TemplateRest assured that all dimensions are clearly outlined in the package, allowing you to create precise and professional cup wrappers.We understand the importance of file compatibility, which is why we've included various file formats for your convenience. Each template is provided in the following formats:SVG (Scalable Vector Graphics)PNG (Portable Network Graphics)DXF (Drawing Exchange Format)EPS (Encapsulated PostScript)PSD (Adobe Photoshop Document)PDF (Portable Document Format)With these diverse file extensions at your disposal, you can effortlessly work with the software of your choice and achieve outstanding results.Unleash your imagination and personalize your cup wrappers like never before with our 5 Size Paper Cup Wrapper Template. Start creating eye-catching designs and add a unique touch to any occasion. Get your hands on this essential tool today and elevate your digital drawing experience to new heights!---- HOW TO DOWNLOAD ----Once the payment process is completed your files will be available. You can access your files via your 'Purchases & Reviews' which you will find above in your 'You' menu.If you download from the mobile app please open your purchases on a browser to download the files.FOR PERSONAL AND SMALL BUSINESS USE ONLY. These digital files may not be shared or resold!Thank you for visiting my shop! In case of any questions, Please feel free to write to me any time using Etsy messages.", "reviews": ["I like it ( :", "Great product! the cups were perfectly sized and accurate. Would definitely recommend.", "The file worked just as I needed it to!", "easy to use simple no issues"]}, {"productId": "sHiSDAeTeJ", "url": "https://www.etsy.com/il-en/listing/1481418611/gaming-png-bundle-roblocks-clipart?click_key=cebf98dbd54590e9dbc6c98c20d739b4349e5a90%3A1481418611&click_sum=cb955612&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-29&bes=1&dd=1", "title": "Gaming PNG Bundle, Roblocks clipart bundle, Font, digital paper, PNG, files with transparent background", "description": "Please note that this listing is for a DIGITAL file of a printable PNG download, which is suitable for use in sublimation or graphic design. No physical product will be shipped to you.This design is a high-resolution PNG file with 300 DPI, which can be easily resized to fit whatever project you require it for. It is not limited to just skinny tumblers, and can be used for a variety of items.If this listing displays a name, please note that this is for display purposes only and the name will not appear on your file. You will need to add the name yourself using your own image editing software or with vinyl decals, etc.Please ensure that you have prior knowledge of sublimation and all the necessary software and equipment before purchasing this listing, as I am unable to offer support on any processes other than my own files if there is an issue.It is important to note that this file is for personal use only, and you are not permitted to forward, share, sell or distribute the file.🛑 All copyrighted and trademarked characters and marks belong to their respective copyright and trademark holders.Due to the digital nature of this product, I cannot offer refunds once the file has been downloaded. However, please don't hesitate to contact me if you have any questions or concerns about your purchase.Thank you for considering this listing, and I hope you enjoy using this beautiful sublimation design!", "reviews": ["Very good quality images and excellent selection", "Amazing! So Easy to use!", "Excellent quality! recommended store...! No problem", "Loved how clear these printed on my cookies! Definitely will come back!"]}, {"productId": "sqmGFYQcCE", "url": "https://www.etsy.com/il-en/listing/1002593529/130-instagram-story-stickers-xxl-edition?click_key=b78f5b0b9de97688d8743d191bee34d023eb4184%3A1002593529&click_sum=10d54563&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-30&bes=1&sts=1&dd=1", "title": "130+ Instagram Story Stickers xxl Edition Mixed Basic Daily Mix Bundle Elements Lettering Storysticker family love png", "description": "❗️As a small business owner according to § 19 paragraph 1 UStG, no sales tax is charged. Stated prices are total prices. As a reseller, Etsy adds sales tax.Instagram Story Sticker Mixed IX Weekend Spring Capture the moments happy dayIncluded are 136 digital hand-drawn stickers for your Instagram Story for Android and IOS.Characteristics:✓ high quality✓ easy to use✓ Sizes scalable✓ versatileCan be used in a variety of ways in your Instagram story - whether as a video or photo.Download directly after purchase and add to your Instagram story!Instructions for installing and using the stickers are available as a link after purchase.Feel free to write to me if you have any questions or suggestions.#Instasticker #Storysticker #Instagram #Elements #Frames # Brushstrokes #Fashion #Pets #sticker #food #travel", "reviews": ["Wow 🤩 nice nice nice", "Everything was great, gladly again.", "As always, great stickers! Thank you very much!", "Everything worked out as always"]}, {"productId": "PnmnPfdZve", "url": "https://www.etsy.com/il-en/listing/1653702262/400-add-your-own-photo-tumbler-wrap?click_key=90dcc37a6823fe4ec49b0147405d64d8596461d2%3A1653702262&click_sum=2bed3b51&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-31&pro=1&dd=1", "title": "400+ Add Your Own Photo Tumbler Wrap Bundle, Own Photo Collage, 20 oz Add Your Photo Sublimation, Canva Editable, Photo Self Editable Wrap.", "description": "400+ Add Your Own Photo Tumbler Wrap Bundle, Own Photo Collage, 20 oz Add Your Photo Sublimation, Canva Editable, Photo Self Editable Wrap.Welcome to StonCreations !What's included in your purchase ?After your purchase you will get PDF file with a link to Google Drive to download your items.> Straight PNG> Each file is high resolution PNG (300 dpi)> The design is in 9.3” x 8.2”❤ For more similar items, please visit our shop ❤https://www.etsy.com/se-en/shop/StonCreationsNote:This 20 OZ Tumbler Wrap is digital download, no physical product will be shipped to you. You will receive a Straight Sublimation Wrap Design with your purchase. Prior knowledge of sublimation is needed to use this file, please ensure you have all the needed software and equipment before purchasing as I cannot offer support on any processes, I can only offer support on my files if there is an issue!Terms of use:This file is for personal use only. You can make your creations and sell them but do not forward, share, sell or distribute the file.Refunds, Returns and Exchanges:For digital downloads, you get the final product and It’s not possible to cancel, return, or exchange.StonCreations", "reviews": ["recommended, product received immediately and easy to use, very pretty too", "Great item very happy with product", "Beautiful images provided by this seller.", "Beautiful graphics, well created art."]}, {"productId": "ITAhrxjZue", "url": "https://www.etsy.com/il-en/listing/1680045651/cartoon-easter-glass-can-easter-libbey?click_key=f223965cadc707e3a2e5f5d5d2a191e5a2f28cc5%3A1680045651&click_sum=d2abd5c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-32&pro=1&sts=1&dd=1", "title": "Cartoon Easter Glass Can, Easter Libbey 16oz, Retro Flower Libbey Glass Can 16oz, Retro Easter Egg Tumbler Wrap 16oz, Digital Download", "description": "WELCOME TO MY STORETHIS IS A DIGITAL PRODUCT.NO PHYSICAL PRODUCT WILL BE MAILED.➥ HOW TO UNZIP YOUR FILE1. To unzip the folder, press and hold (or right-click) the folder, select EXTRACT ALL, and follow the instructions.2. To unzip a single file or folder, open the zipped folder, then drag the file to a new location.-------------------------➥HOW TO OPEN A PDF FILEFor some files with large quantities, we will place them in a PDF file that contains a link to the download folder for that file.You can open the PDF file in a web browser and click the \"download\" button to redirect to the folder containing the file.At this point, you can choose to download it or copy the link below the \"download\" button and access it directly.-------------------------REFUNDS/ISSUESAs this is a digital download, we do not offer refunds for this product. However, if you encounter any issues with your download, please inform us, and we will make every effort to help you resolve the problem.-------------------------➥ CONTACT USIf you have any problems or questions, contact us through the Etsy message system and We will be ready to help!", "reviews": ["Great item. Love this company and supplies.", "Perfect design and easy to download", "Would purchase from this seller again. Sublimated beautifully!", "Excellent, easy to use and good quality"]}, {"productId": "OFflqNg7eh", "url": "https://www.etsy.com/il-en/listing/1677120753/book-valet-tray-digital-file-wooden-book?click_key=40eab798572add23161479c7232617cc760a30f7%3A1677120753&click_sum=faabc290&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-33&pro=1&dd=1", "title": "Book Valet Tray Digital file, Wooden Book Tray, Book Lover Gift, Book Valet Svg", "description": "Our \"Well Read Woman\" book Stand digital file is perfect to add to your laser shop or for your personal use.  The file is easy to use, cut, stain and prepare for your customers. This is truly a unique item for all book lovers.The finished product measures 10.5 x 8 x 5.5. Slots and design are made for 3mm material.Files includedAISVGPNGThis is a digital item. No physical product will be shipped. Due to this being a digital product, no refunds will be given. If you have any questions or problems please reach out to me. We would love to make sure you are happy with your product.If you would like the physical product, we also carry that in our shop under the gift section.", "reviews": ["Can't wait to cut this out today!!  Looks like an amazing file", "Thank you! I would love to see pictures!", "I loved the file. There were a few spots that didn’t line up completely but it it fine and could have been user error.", "That looks beautiful! Great job!", "Beautiful craftsmanship. Teachers loved their presents!", "The quality and craftsmanship are amazing!!"]}, {"productId": "cORPrQWbAx", "url": "https://www.etsy.com/il-en/listing/1601945751/manana-sera-mas-bonito-karol-g-svg-png?click_key=604b550a3fa60ddbdecae8a73c4208d0cfe733e0%3A1601945751&click_sum=439c049c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-34&bes=1&dd=1", "title": "Manana sera mas bonito KAROL G svg png", "description": "**PLEASE NOTE**It is the responsibility of the purchaser to make sure they have the knowledge and the right machines, equipment and software to use this format.This is an INSTANT DIGITAL DOWNLOAD. No physical products will be shipped to the purchaser.NO PHYSICAL ITEMS OR PRODUCT WILL BE DELIVERED.NO REFUNDS WILL BE GIVEN.ONCE YOU PURCHASE ITEM IT WILL AUTOMATICALLY BE DELIVERED TO YOUR EMAIL.If you do not receive email delivery, go to your profile and scroll down to purchase, select item you want to see and click on it, you will have the option to download again.", "reviews": ["This was a great item I made a shirt with!", "The letters were perfect thanks", "love it! going to use it for my birthdayyy", "The file was good quality"]}, {"productId": "YMVdAjVXBS", "url": "https://www.etsy.com/il-en/listing/1664696422/set-of-3-bauhaus-minimalistic-art-boho?click_key=812c72359a4aa4909887ca6650296e9932c8dd37%3A1664696422&click_sum=5d2fdb27&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-35&pro=1&dd=1", "title": "set of 3 Bauhaus minimalistic art, boho style printable, boho wall decor, line abstract art, cozy color relaxing wall print, soft colors", "description": "Upon completing your purchase, you'll be sent a download link via an Etsy notification email. Additionally, you can access your files through Etsy by following these steps: Go to \"Your Account,\" then select \"Purchases,\" and locate your order at this link:https://www.etsy.com/your/purchases.Printing Instructions:This digital product supports printing in five key aspect ratios, enabling compatibility with a wide range of frame sizes. Below are the recommended print sizes for each ratio, provided in both inches and centimeters:2:3 Ratio:4x6 inches (10.16x15.24 cm)8x12 inches (20.32x30.48 cm)12x18 inches (30.48x45.72 cm)16x24 inches (40.64x60.96 cm)20x30 inches (50.8x76.2 cm)24x36 inches (60.96x91.44 cm)3:4 Ratio:6x8 inches (15.24x20.32 cm)9x12 inches (22.86x30.48 cm)12x16 inches (30.48x40.64 cm)15x20 inches (38.1x50.8 cm)18x24 inches (45.72x60.96 cm)4:5 Ratio:8x10 inches (20.32x25.4 cm)16x20 inches (40.64x50.8 cm)24x30 inches (60.96x76.2 cm)11:14 Ratio:11x14 inches (27.94x35.56 cm)22x28 inches (55.88x71.12 cm)ISO (International Standard Sizes) Ratio:A5 (14.8x21 cm)A4 (21x29.7 cm)A3 (29.7x42 cm)A2 (42x59.4 cm)A1 (59.4x84.1 cm)With your purchase, you'll receive 5 Files within every file there is three high-resolution JPEGs (300 x 300 dpi) with 5 different ratios, allowing for high-quality prints either at home or through esteemed printing services such as Costco, Walmart, Walgreens, Shutterfly, Staples, Office Depot, CVS, and more, offering both convenience and rapid service.Additional Information:This item is available as an instant download; no physical items will be dispatched. The artwork provided in this design has been created personal use only; it cannot be utilized for commercial purposes.Should you require a custom-sized file, please don't hesitate to get in touch with the me.", "reviews": ["Great print! It was even better than I expected. Really good quality and arrived fast. The seller was awesome to work with. Definitely recommend to everyone.", "The prints came quickly and they're gorgeous! They fit my living room perfectly. The seller's communication was excellent. Thanks a lot! I definitely recommend them."]}, {"productId": "AlDhZPWtiL", "url": "https://www.etsy.com/il-en/listing/1668562675/border-terrier-wall-art-funny-bathroom?click_key=bc019f935b71495a5b7463050e4c3f994ebf836a%3A1668562675&click_sum=b7abe037&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-36&pro=1&sts=1&dd=1", "title": "Border Terrier Wall Art, Funny Bathroom Decor, Dog in Toilet, Animal in toilet, Petshop Art, Terrier Gift, Printable Digital Download", "description": "Explore the whimsical charm of a Border Terrier indulging in a moment of solitude, catching up on the latest news in a bathroom. This digital artwork, rendered in a captivating wall art style, is a delightful addition to any dog lover's collection.Thank you for selecting our products!Once your payment has cleared, you will receive a confirmation email from Etsy with a link to download your files.The Etsy app on mobile devices will not enable you to download your files. Please usehttp://www.etsy.com/your/purchasesin your device's browser and you will be able to download your files.The following digital print sizes will be sent to your registered email address upon purchasing:High-resolution (300 dpi)Print in multiple sizes effortlessly:• 2x3 ratio: 4\"x6\", 6\"x9\", 8\"x12\", 10\"x15\", 12\"x18\", 16\"x24\", 20\"x30\", 24\"x36\"• 3x4 ratio: 6\"x8\", 9\"x12\", 12\"x16\", 18\"x24\", 30\"x40\",• 4x5 ratio: 4\"x5\", 8\"x10\", 16\"x20\", 40x50cm• 5x7 ratio: 5\"x7\", A5, A4, A3, A2, A1, A0, 50x70cm• A file for printing 11\"x14\".You can adjust the print dimensions as needed when printing.COPYRIGHT NOTICEPlease note that these files are intended for PERSONAL USE only. It is strictly prohibited to sell the files as is or with minor modifications. Additionally, sharing, copying, mass production, or redistribution of the files without obtaining explicit permission from the copyright holder is strictly prohibited.Check out my home page for more printable art at :https://www.etsy.com/shop/MrWallArts68-- IMPORTANT NOTES --For optimal printing results, please avoid using glossy paper. We recommend using matte or satin paper for the best outcome and to ensure the true beauty of the artwork is captured.Please note that this listing is for a digital product only. No physical product will be shipped to you. The files will be available for download once your purchase is complete.For more information about digital downloads, please refer to this helpful article:https://www.etsy.com/help/article/3949We appreciate your attention to these notes and your understanding. Should you have any further questions or require additional assistance, feel free to reach out. Thank you for choosing our digital products!", "reviews": ["So cute; can't wait to give to my dad.", "The digital picture came out lovely when I had it printed", "This is going to look amazing in my guest bathroom"]}, {"productId": "oopZtObICP", "url": "https://www.etsy.com/il-en/listing/1680220207/4-png-stitch-splash-and-watercolor?click_key=503b9dcfd835ec1cdd7d52d29ee507c114d5c460%3A1680220207&click_sum=678bf2ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-37&pro=1&dd=1", "title": "4 PNG Stitch Splash and Watercolor Digital design PNG file for sublimation - High Resolution -Instant Digital PNG Download", "description": "❤️💕WELLCOME DigitalprintPNG 💖🥰😍🤗Stitch watercolor and splash 4 PNG - Stitch Clipart - Digital Downloadpopular shirt png Christmas -Valentine PNG, Christmas -Sublimaton, Shirt Design popular png for shirts👉 Resolution : 4096 × 4096 px and Print size : 13.65 × 13.65″ inches (34.7 × 34.7 cm) · 300 DPI Transparent High quality 4png .------------------------------------------------------------------------------------👉IMPORTANT NOTE: YOU WILL RECEIVE 4 TRANSPARENT PNG DESIGNS👉THIS IS A DIGITAL PRODUCT- Remember that when you purchase this product you are buying electronic files, no physical product will be sent. All digital products purchased must be downloaded separately, after payment is complete.———————————1) Payment confirmed by Etsy2) Receive a link to your email address with the final files3) You can also download them from the Etsy order section.Your downloads will always be accessible by visiting your Etsy profile > Purchases and reviews.———————————• You may not resell digital assets.• Since our products are digital products, returns cannot be made.• Feel free to contact me if there are any problems with the files. I always want to ensure a happy customer.--------------------------------------------", "reviews": ["Beautiful designs! Made a Stitch Girl super happy!", "Images were beautiful and perfect for what I needed!", "Thank you \nLove the designs."]}, {"productId": "VelyMJfXIG", "url": "https://www.etsy.com/il-en/listing/1591684384/animated-black-and-white-stream-overlays?click_key=c4186f5d088bf79f59d294f3950f9dabdb18bf10%3A1591684384&click_sum=15a10b76&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-38&pro=1&sts=1&dd=1", "title": "Animated Black and White Stream overlays package for Twitch, Youtube, OBS, Streamlabs in topographic dark style", "description": "Animated Black and White Twitch Overlay Package with futuristic lines animation. Black and white Aesthetically pleasing stream package.You will get a txt/pdf file with link inside for a google drive folder, where you can download the package.Package includes:✔ 4 Intermission Screens 16:9, 1920x1080:Just chatting, 16x9 webcam, 4x3 webcam, and one 1920x1080px fullscreen overlay for 21:9 screen.✔ Animated waiting screens:-STARTING (animated + static)-PAUSE (animated + static)-ENDING (animated + static)-OFFLINE (animated + static)✔ Animated + Static alerts (12+ files):- donation- Bits- New sub- New follower- Raid- Resub- Merch- Gifted sub- Host- New cheer-Tips- Prime sub✔ Twitch Panels (50+):- About- Commands- Devices- Discord- Donate- Facebook- Instagram- Links- Music- Partners- PC specs- Rules- Schedule-Subscribe- Tiktok- Top donate- Twitter- Youtube- [blank]End more panels✔ Separate elements to specify your scenes in obs✔ 1,3,5 minute timers to add them on screens if you need it✔ Stream labels, link bars, frames✔ 2 Stinger Transitions (webm)A-Z AvatarsProfile banner (psd+png blank)Youtube banner (psd+png blank)Text emotes packChannel points iconsFeel free to ask me to add something to this package if something is missing here for your stream.I can also add a translation, if you need, write to me.VIDEO TUTORIAL HOW TO GET ACCESS AND DOWNLOAD FILES:https://youtu.be/Wp-NcSrww7kPlease note:You add your nickname and links to the screens in obs using the text tool.Icons and text bar are included in the package.The package is suitable for OBS STUDIO and STREAMLABS OBS.TWITCH STUDIO is still in beta, the possibility of files not working.This is a premade files package.Package does not include source files. No PSD no AE files.These files are for personal use only.Files may not be edited and redistributed.If you need something added to the package, let me know.Color and font changes are not accepted.", "reviews": ["Amazing overlays, these are very good for the price I recommend these!", "Thank you", "Really cool, would buy again", "Thank you!", "fast and simple , fast delivery", "Thank you", "product was very good i liked it a lot .", "Thank you"]}, {"productId": "JxpqYZJGGi", "url": "https://www.etsy.com/il-en/listing/1618172074/corridos-tumbados-svg-ct-svg-amor?click_key=396b6b92d1d9ad8dbb5ce51c4fb7bea639378139%3A1618172074&click_sum=5cf0d2e9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-39&bes=1&dd=1", "title": "Corridos Tumbados SVG, CT Svg, Amor Tumbado Png, Svg, dxf, Cut files for Cricut and Silhouette, instant download, COD026", "description": "Visit my shop for more awesome designs!INSTANT DOWNLOAD.:: YOU WILL RECEIVE ::4 SVG File - for Cricut Design Space4 DXF File - for Silhouette Studio Basic Edition4 PNG file - high resolution and transparent background✪ NOTE:This is a digital download item. Please note this is a digital product.No physical item will be shipped.Please make sure to unzip/extract your downloads first to use all the files in them.As this is a digital product, no physical item will be sent to you and no refund will be offered once the download is confirmed. If after purchasing the product you cannot access the download, please contact me or please message me on Etsy and I will be happy to help!Thank you for visiting my shop!", "reviews": ["great quality, printed image and its very clear", "excellent product very easy to work with", "Excellent design. Easy to work with. Thank you."]}, {"productId": "LVlKdvNTcu", "url": "https://www.etsy.com/il-en/listing/1483196909/printable-templates-for-knitted-wire?click_key=8cfa1e544069228e488cff8192087824697932ba%3A1483196909&click_sum=9e7a2cc4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-40&bes=1&dd=1", "title": "Printable Templates for Knitted Wire | Tricotin | Flowers | Spring | Butterflies | Digital Download", "description": "These printable templates are to help you get a more consistent form with your wire bending process.If you’d like to buy more templates, please see the “Template Bundle” listing.**THIS IS NOT A PHYSICAL PRODUCT. DIGITAL DOWNLOAD ONLY**Printer friendly.No refunds.Follow me on IG: @isla.sierra_co", "reviews": ["Easy to follow the instructions and diagram.", "Amazing templates i have been looking for this butterfly everywhere and finally found it", "Designs are lovely and easy to follow"]}, {"productId": "dEJGTNCnbk", "url": "https://www.etsy.com/il-en/listing/1564876011/6-digital-templates-printable-light?click_key=7091ac57051afc6343c8ec90f18f5e98074fbc41%3A1564876011&click_sum=64f40ae9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-41&dd=1", "title": "6 Digital Templates Printable Light Templates Download LED Shade Framed templates Bedside Picture 6 DIY Paper Cut Templates for lighting box", "description": "6 Digital Templates for lighting box Printable Digital Light Templates Download LED Shade Framed 6 different template Bedside Picture-----Includes 6 different scenic digital templates-----This is a digital template for printing light painting or shadow painting. Take note that there is NO PHYSICAL ITEM offered.-----Get the freedom to choose your own frame, led strip lights, and digital templates in our collection of digital light painting templates. Feel the art of adding light to a minimalist interior design line style to enjoy your indoor environment especially at dark moments.-----SIZES AVAILABLE2:3 RATIO20x10 inches16x24 inches12x18 inches8x12 inches5x7 inches4x6 inches3:4 RATIO18x24 inches15x20 inches12x16 inches9x12 inches6x8 inches3x4 inches-----INSTRUCTIONS1. Download the PDF file to access the download link.2. Open the link in the PDF file.3. Select the aspect ratio.4. Select the size.5. Select your layer 3.a. layer-03.png - This should be printed in a solid white paper and the patterns here should be cut as that's where the light will enter.b. layer-03-film.png - No need to cut but this should be printed in a transparent film paper.6. Gather all materials.a. Led strip lights.b. Picture frame that can accommodate clearance between the light and the prints.c. Printed copies of all layers.7. Combine the materials.8. Enjoy your stylish and beautiful indoor light painting that will light up your dark moments!-----Digital downloadDigital file type(s): 1 PDFWidth: 24 inchesHeight: 18 inches-----If you have any questions and concerns, feel free to message me .!", "reviews": ["Very beautiful pattern, I love it.", "Recommend this seller to others", "Straight forward easy to do project. Would buy again.", "Will order more soon. Thank You!"]}, {"productId": "bxvWoqUYxH", "url": "https://www.etsy.com/il-en/listing/1490636900/ywmn-dygytly-lhmh-yy?click_key=e179bb18e22bb85e0ae4b06da57bd574b9c97614%3A1490636900&click_sum=60b2190a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-42&dd=1", "title": "יומן דיגיטלי להתאמה אישית", "description": "יומן דיגיטלי להתאמה אישית.תוכלו להשלים את שמות החודשים כך שיתאים לצרכים שלכםהחודשים ריקיםיש בו הצגה חודשית והצגה יומית", "reviews": []}, {"productId": "vaDTCHTebF", "url": "https://www.etsy.com/il-en/listing/1476479848/credit-card-skin-template-credit-card?click_key=e049875033438931f434aa70efa904a95acb49db%3A1476479848&click_sum=3c94f341&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-43&bes=1&dd=1", "title": "credit card skin template, credit card skin svg, credit card template, ebt card cover,  card cover svg for cricut, Instant Download", "description": "This listing includes of:- Credit Card Template SVG file (for InkScape/ Corel Draw/ Cricut)- Credit Card Template PNG file- Credit Card Template DXF file- Credit Card Template EPS file- Credit Card Template AI file- Credit Card Template PDF file- Credit Card Template JPG file* SVG files are vector file and can be resized larger or smaller without losing it's quality.Step into a world of personalized style and protection with our Credit Card Skin Templates. Our package includes versatile SVG, PNG, EPS, DXF, AI, and PDF file formats, providing you with the tools to create custom skins for your credit cards.Imagine the possibilities as you transform your credit cards into unique works of art. With our credit card skin templates, you have the freedom to express your individuality and protect your cards in style. From vibrant patterns and striking designs to elegant motifs, our templates offer something for every taste.Each template is carefully crafted to fit various credit card sizes and designs. Our easy-to-use files allow you to create your own custom skins effortlessly. Whether you're a seasoned crafter or new to DIY projects, our templates are designed to make the process enjoyable and accessible to everyone.Protecting your cards has never been more fashionable. Our credit card skin templates not only add a personal touch to your daily essentials but also serve as a shield against wear and tear. Keep your cards looking pristine and showcase your unique style with every swipe.Unleash your creativity and let your cards tell your story. Make a statement, express your passions, or simply add a touch of beauty to your wallet. With our credit card skin templates, you have the power to transform your cards into something truly extraordinary.Download our templates instantly and embark on a journey of self-expression and protection. Elevate your style and make every transaction a reflection of your unique personality. Get started today and redefine the way you carry your cards with our Credit Card Skin Templates.---- HOW TO DOWNLOAD ----Once the payment process is completed your files will be available. You can access your files via your 'Purchases & Reviews' which you will find above in your 'You' menu.If you download from the mobile app please open your purchases on a browser to download the files.FOR PERSONAL AND SMALL BUSINESS USE ONLY. These digital files may not be shared or resold!Thank you for visiting my shop! In case of any questions, Please feel free to write to me any time using Etsy messages.", "reviews": ["Fast and easy download. Transferred files to Silhouette design software without issues.", "perfect exactly what i wanted and needed", "Items was easy to download", "Great design. Very versatile and great seller"]}, {"productId": "srRDQmFjtI", "url": "https://www.etsy.com/il-en/listing/1611318362/onlyfans-sexting-script-ppv-content?click_key=6cb9fffb56d4cd25b6e1410252435c1a6a656bf1%3A1611318362&click_sum=ae1b3e2b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-44&pro=1&dd=1", "title": "Onlyfans Sexting Script | PPV content pricing and ideas", "description": "With this sexting script you can easily earn $50 from each fan through sexting.It includes instructions for models on how to create content (pics and vids)Specific price for each PPV content sent.Spice up your relationship with fans, use this sexting script to easily copy/paste the phrases.", "reviews": ["perfect for simple responses when your brain isn't working", "glad it helps! 🥰 happy earnings!", "The best sexting script! I like how is everything structured", "❤️❤️❤️ thank you", "I love it! Thank you! ❤️", "You are welcome! ❤", "So vague & basic, not detailed at all, barely any words", "Hello Gracie. Thank you very much for your feedback. These sexting scripts are being applied by our OnlyFans agency and it works really good. Besides the script you also find content ideas and strategy plan to monetize each content you send using this script. We will refund you the money. Thank you."]}, {"productId": "FzXkaqGHPE", "url": "https://www.etsy.com/il-en/listing/1565906548/bleach-effect-distressed-edge-canva?click_key=c0545dfe35a53aa7a23ccb7ca3459cda12f971ec%3A1565906548&click_sum=e6a1641f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-45&pro=1&dd=1", "title": "Bleach Effect Distressed Edge Canva Frames. 20 Frames. Fill Your Own Design In Canva. Editable Drag and Drop Frames. Create Your Own Designs", "description": "60% discount for all listings in February!If you like my style, you can buy all of my past and future frames for a heavily discounted price. I add new frame sets every week.See the listing here:https://www.etsy.com/nz/listing/1588175020/A handy set of bleach effect/distressed edge frames that you can easily edit in Canva to contain the patterns, textures or photos that you want.My most popular listing! You get 20 frame shapes.30 more distressed edge frame shapes available here -https://www.etsy.com/nz/listing/1566748746The Canva frames are a fantastic way of upgrading the look of your designs. You are no longer restricted to the plain old font colors and shapes for your backgrounds.Create unique designs that you can use in so many ways - you are only limited by your creativity!Saves a lot of time when designing t-shirts, mug wraps, Png and other digital items. Combine with other clip art elements to make your fabulous creations.A Canva account is required to use Canva frames. The free version is fine, although some options will not be available to you. Canva offers a free trial of one month for new users.You will receive a pdf page to download. This page will contain the link to your new template.Please note that no refunds are available for digital items. This is a Canva template that you must edit within Canva.I am happy to help new Canva users, so please contact me with any questions, problems or requests.", "reviews": ["Can't wait to use them", "These were so easy to use.  They made a difference in how my products looked.", "The files were perfect for the design class I was a part of!!", "I was in class at Blanks Galore and they recommended this, the instructor was using it and made it look so easy", "Thank you for taking time to leave me a review 😀"]}, {"productId": "lxjCyfWLdr", "url": "https://www.etsy.com/il-en/listing/1562491365/550-stitch-svg-stitch-bundle-stitch?click_key=3e42af9b5607feee322d3db80cfc38932e0b9527%3A1562491365&click_sum=0703ad0a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-46&pro=1&dd=1", "title": "550 stitch svg, stitch bundle, stitch clipart, stitch png, lilo and stitch svg, cricut svg, silhouette svg, stitch layered", "description": "Welcome VectorDesignUSprint550 stitch svg, stitch bundle, stitch clipart, stitch png, lilo and stitch svg, cricut svg, silhouette svg, stitch layeredCopyright©VectorDesignUSprint All rights reserved.You'll Receive110 SVG file110 PNG file110 EPS file110 DXF file110 PDF file\"If you have any problems using this file please contact me and I will help you out.\"-NOTE-*This is an instant download, and you will NOT receive any physical items.*Files will be available to download once payment is received.*You will receive SVG, DXF, PDF, PNG , EPS files.*Colors may vary slightly depending on your monitor, screen, and printer.- Reselling, Sharing, and Redistributing is Not Allowed.These files are compatible with all major cutting machines like Cricut, Silhouette Cameo, and other cutting machines.Please make sure you know at least one of the file types, including opening and using the files. Make sure your machine and software are compatible before purchasing.stitch svg,stitch cricut,stitch svg bundle,stitch png,stitch clipart,lilo svg,stitch vector,stitch layered,stitch birthday,stitch svg cricut,stitch,stitch svg files,stitch shirt,", "reviews": ["Easy to download the images", "loved all the images to this one", "brilliant file, grandaughter is Stitch daft so plenty options for making lots of different things for her"]}, {"productId": "BLMIRaauan", "url": "https://www.etsy.com/il-en/listing/1588077600/baby-money-box-piggy-banks-toddler-gifts?click_key=c87f5bd6ff28376962cc44083b8361a2a8cdb141%3A1588077600&click_sum=0bf35f50&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-47&pro=1", "title": "Baby Money Box, Piggy Banks, Toddler Gifts, Kids Bank, Gifts For Kids, Piggy Bank With Name, Wooden Piggy Bank, Custom Money Box E05", "description": "Discover our \"Personalized Money Box,\" a delightful birthday present and first Christmas gift. This custom wood piggy bank is perfect for nursery decor and makes a charming addition to your child's room. A thoughtful and personalized gift idea for boys and girls alike.These Piggy Bank are 100% handmade with High Quality Plywood and ArcylicFor Safety, we will delivery your piggy bank with flat package and you can easily assemble it. This is instruction for piggy bank: https://youtube.com/shorts/38Thvu1UwzADETAIL:Dimension:Size S: 6.6\"W x 3.9\"H x   2.5\"D ~ 17cmW x 10cmH x 6.5cmDSize M: 9.2\"W x 5.3\"H x 3.5\"D ~ 23cmW x 13.5cmH x 9cmDSize L: 11\"W x 6.2\"H x 4.1\"D ~ 28cmW x 16cmH x 10.5cmDPlease note the Name, Font and Name’s Color you want to put on the box in the Personalization Area.The default color for the Name is White, and if you do not specify a color for the Name, the default color will be used.If you desire the engraving on the back, please note at the Personalization Area.NOTE:- The item is made to order, the listing photos are examples and the detail of actual products may vary a little bit due to the characteristics of handcrafted products.- The color may vary a little bit due to screen settings.- The size may vary slightly due to the nature of individually handmade products.Should you need any further information or assistance, custom the desired products, do not hesitate to let us know, we are more than happy to support you!Thank you and happy shopping <3", "reviews": ["We received our order, great craftsmanship. We can’t wait to finally give our goddaughter her first bank!", "Hi Kimberly,  your review means a lot to us, and we are grateful for your kind words. At our shop, we strive to provide the best possible service and make every customer feel valued and appreciated. Your review serves as a great encouragement to our team, and we are honored that you chose us. We look forward to seeing you again soon and wish you a blessed day. Yours sincerely, Phong.", "Awesome work! Love it so much 🥰", "Hi Cara,  your review means a lot to us, and we are grateful for your kind words. At our shop, we strive to provide the best possible service and make every customer feel valued and appreciated. Your review serves as a great encouragement to our team, and we are honored that you chose us. We look forward to seeing you again soon and wish you a blessed day. Yours sincerely, Phong.", "My niece and nephews loved these", "Hi Erica,  your review means a lot to us, and we are grateful for your kind words. At our shop, we strive to provide the best possible service and make every customer feel valued and appreciated. Your review serves as a great encouragement to our team, and we are honored that you chose us. We look forward to seeing you again soon and wish you a blessed day. Yours sincerely, Phong.", "My niece and nephews loved these", "Hi Erica,  your review means a lot to us, and we are grateful for your kind words. At our shop, we strive to provide the best possible service and make every customer feel valued and appreciated. Your review serves as a great encouragement to our team, and we are honored that you chose us. We look forward to seeing you again soon and wish you a blessed day. Yours sincerely, Phong."]}, {"productId": "aoKqlhOgSY", "url": "https://www.etsy.com/il-en/listing/1572791979/animated-dark-retro-twitch-overlay?click_key=ac18752ae0a6f953cf722879d22e2f95706cdf06%3A1572791979&click_sum=5d72098d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-48&pro=1&sts=1&dd=1", "title": "Animated DARK RETRO Twitch OVERLAY Package - Minimal Dark Twitch Theme | Retro Stream Overlay Pack", "description": "Animated Retro Dark Twitch Overlay Package with futuristic geometry animation. Dark Aesthetically pleasing stream package.More than 1.5GB of files!You will get a txt/pdf file with link inside for a google drive folder, where you can download the package.Package includes:✔ 3 Intermission Screens 16:9, 1920x1080:Just chatting, 16x9 webcam, 4x3 webcam.✔ Animated waiting screens:-stream starting soon (animated + static)-be right back (animated + static)-stream ending (animated + static)-stream offline (animated + static)✔ Animated + Static alerts (12+ files):- donation- Bits- New sub- New follower- Raid- Resub- Merch- Gifted sub- Host- New cheer-Tips- Prime sub✔ Twitch Panels 2 versions. V1(50+) V2(50+):- About- Commands- Devices- Discord- Donate- Facebook- Instagram- Links- Music- Partners- PC specs- Rules- Schedule-Subscribe- Tiktok- Top donate- Twitter- Vkontakte- Youtube- [blank]End more panels✔ Separate elements to specify your scenes in obs✔ 1,3,5 minute timers to add them on screens if you need it✔ Stream labels, link bars, frames✔ 2 Stinger Transitions (webm)A-Z AvatarsProfile banner (psd+png blank)Youtube banner (psd+png blank)Sub badges packText emotes packChannel points iconsCustom css for streamlabs chat widgetFeel free to ask me to add something to this package if something is missing here for your stream.I can also add a translation, if you need, write to me.VIDEO TUTORIAL HOW TO GET ACCESS AND DOWNLOAD FILES:https://youtu.be/Wp-NcSrww7kPlease note:The package is suitable for OBS STUDIO and STREAMLABS OBS.TWITCH STUDIO is still in beta, the possibility of files not working.This is a premade files package.Package does not include source files. No PSD no AE files.These files are for personal use only.Files may not be edited and redistributed.If you need something added to the package, let me know.Color and font changes are not accepted.", "reviews": ["very easy to use, high quality videos. It was perfect for my stream.", "Thank you", "q w e r t", "brilliant quality items for the price.", "Thank you", "extremely high quality package, and very easy to add and use!", "Thank you!"]}]