[
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "Handmade ceramic hanging ceiling lamp with a unique printed decoration of green leaves. The lamp is part of the Apilar collection, inspired by Spanish ceramics. It features a clay-light artwork design and is suitable for living rooms and offices. The lamp is available in forest green, white, mint, burgundy, and orange and measures 17.7 inches in height and 7.9 inches in diameter.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in unique and handmade home decor",
          "useCase": "Adding a touch of artistic flair to their living spaces"
        },
        {
          "targetAudience": "Interior designers seeking unconventional and eye-catching lighting fixtures",
          "useCase": "Creating visually striking focal points in residential and commercial spaces"
        },
        {
          "targetAudience": "Art collectors with an appreciation for contemporary ceramics",
          "useCase": "Displaying the lamp as a functional piece of artwork in their homes or galleries"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=67f57a62ec1a949149def95cbcf0496c570b5f06%3A724851215&click_sum=1fc9d423&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:14:16.042387",
      "productId": "eTAPaFXniC"
    }
  },
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "This handmade ceramic lamp is a unique piece of contemporary artwork. It is part of the Apilar collection, which is inspired by traditional Spanish ceramics. The lamp has a height of 5.9 inches and a diameter of 5.5 inches. It is available in a variety of colors, including green, pink, and teal. The lamp is perfect for adding a touch of style to any room.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers",
          "useCase": "Unique and artistic lighting fixtures for residential and commercial spaces."
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Collectible and decorative pieces that enhance the aesthetic value of a space."
        },
        {
          "targetAudience": "Homeowners with eclectic or contemporary taste",
          "useCase": "Stylish and eye-catching lighting fixtures that add personality and character to their living spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=807a87aee657465efb1475fac7fafd6d22e268db%3A654638870&click_sum=14d67385&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:14:23.133174",
      "productId": "KLOUePsDoj"
    }
  },
  {
    "data": {
      "product": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture",
      "description": "Handmade in Tel Aviv, this delicate natural terracotta lamp adds warmth and a homely feel to any space. It includes all necessary fitting parts, such as a 150 cm transparent cable and a 10 cm ceiling rose. Energy-saving LED light bulbs, particularly the Edison Vintage style, are recommended for this lamp with a voltage of 110V-250V and a maximum wattage of 25 to 40W. As part of the Apilar collection, this unique piece is available in various colors and prints upon request. Please note that each handmade piece is unique, and similar models can be found on Etsy.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking to enhance their living space with a touch of warmth and homeliness.",
          "useCase": "Adding a decorative element to living rooms, bedrooms, or other living areas to create a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Interior decorators and designers looking for unique and handcrafted lighting fixtures.",
          "useCase": "Incorporating the lamp into various interior design styles to create a distinctive and stylish ambiance."
        },
        {
          "targetAudience": "Collectors of handmade and artisanal home decor.",
          "useCase": "Displaying the lamp as a cherished piece in their collection, appreciating its craftsmanship and aesthetic appeal."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=2caf231bffea39981ef480a7e7ed0c2cada2b28a%3A776223242&click_sum=89f01e98&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:14:33.655338",
      "productId": "tRCNgJwRaz"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair from Mid Century",
      "description": "This unique armchair from the 1960s has been professionally reupholstered to a high standard, giving it a new and fresh look. The original frame has been retouched, and the wood has been sanded and secured with high-quality oil to expose its beautiful grains. The shape has been preserved in every detail, ensuring its authenticity. With dimensions of 22.8\" in width, 31.4\" in height, and 24.8\" in depth, it offers a comfortable seat width of 18.1\" and a seat height of 14.2\". While some customers have found the chair slightly firmer than expected, others appreciate its excellent item quality. Overall, this vintage armchair combines style and comfort, making it a great addition to any home.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking vintage and unique furniture pieces for their homes",
          "useCase": "Enhancing home decor with a stylish and timeless accent piece"
        },
        {
          "targetAudience": "Collectors of mid-century modern furniture",
          "useCase": "Adding to their collection of iconic design pieces"
        },
        {
          "targetAudience": "Interior designers and home stagers",
          "useCase": "Incorporating a statement piece into interior design projects or creating a vintage aesthetic"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=c903d4709c2a290e39b383e19a5cd37ef31291cb%3A712573399&click_sum=c114cf45&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:14:50.497003",
      "productId": "qOcRzPgyex"
    }
  },
  {
    "data": {
      "product": "Completely restored Black and White cocktail chair",
      "description": "Dimensions in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in------------------------------------------------------------------------------------------The mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white colored upholstery fabric for the refurbishment.Our manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in mid century modern furniture",
          "useCase": "Use as a statement piece in a living room or office"
        },
        {
          "targetAudience": "Collectors of vintage furniture",
          "useCase": "Add to a collection of mid century modern furniture"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Use in a commercial or residential project to add a touch of mid century style"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=e874f60bcc20bd611e385662577ef6ac65190383%3A649720699&click_sum=5493a154&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:15:08.275152",
      "productId": "IQmtAXaEdn"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set",
      "description": "This Vintage Boucle armchair and ottoman set is a mid-century modern piece that will add a touch of style to any home. The armchair is upholstered in a soft, teddy-like fabric and features a solid wood frame. The ottoman is the perfect place to put your feet up and relax. This set is handmade in Croatia and is available in a variety of colors and fabrics. It is also easy to assemble and comes with instructions. Note that for non-EU buyers, there may be additional import fees and taxes. Dimensions: Overall height: 74 Centimeters / 29.6 inches Overall width: 63 Centimeters / 25.2 inches Overall depth: 70 Centimeters / 28 inches Seat height: 40 Centimeters / 16 inches Seat width: 50 Centimeters / 20 inches Seat depth: 50 Centimeters / 20 inches Materials: Stained Solid Beech Wood Boucle teddy fabric High quality furniture foam density 30",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking for mid-century modern furniture with a vintage aesthetic",
          "useCase": "Furnishing a living room or bedroom with a retro or eclectic style"
        },
        {
          "targetAudience": "Interior designers and home decorators seeking unique and stylish pieces",
          "useCase": "Creating a focal point in a room or adding a touch of vintage charm to a contemporary space"
        },
        {
          "targetAudience": "Collectors of vintage furniture and enthusiasts of mid-century design",
          "useCase": "Adding to their collection or using it as a statement piece in their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=66c15e91dbfce836081f10f3a7c38d9a102302c2%3A1110352719&click_sum=017c5f85&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:15:21.577473",
      "productId": "ynHqNRdRso"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion",
      "description": "This floor cushion is made of vegan suede fabric, which is soft, cozy, and easy to clean. It is also durable and vegan friendly. The cushion is filled with stiff foam and has wooden rings that tie it together. The wooden rings are handmade and can be stained to walnut or black. The cushion is 75X75 cm / 30X30 inch and 35 cm / 14 inch high. It is made to order and takes 10-15 business days to make and ship.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who value style and functionality",
          "useCase": "Adding a touch of elegance and unexpected whimsy to a vanity or living room"
        },
        {
          "targetAudience": "Individuals seeking unique and eco-friendly home decor",
          "useCase": "Creating a cozy and inviting atmosphere in a modern or bohemian-inspired space"
        },
        {
          "targetAudience": "Artists and designers looking for inspiration",
          "useCase": "Drawing inspiration from the product's beautiful design and craftsmanship"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=e98dfa13c5c2c7d3b6a8b1dc7b6df3b21f97a151%3A903050205&click_sum=f789a129&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:15:30.627249",
      "productId": "iCrbiqYPwK"
    }
  },
  {
    "data": {
      "product": "Floor Pillow",
      "description": "These floor pillows are a great way to add comfort and style to your home. They are made with 100% woven polyester printed fabric and are sewn closed with premium poly fill. The pillows have a small \"X\" stitch detail in the center to help secure the filling and keep the pillow plump. They are available in two shapes (round and square) and two sizes (23\" and 26\"). The pillows are spot clean only and are custom made to order, so please allow up to 5 - 10 business days for production.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value comfort and style in their home décor",
          "useCase": "Using the floor pillows for relaxation, meditation, or as additional seating during social gatherings"
        },
        {
          "targetAudience": "Parents looking for comfortable and versatile seating options for their children's playroom",
          "useCase": "Creating a cozy and inviting space for children to play, read, or nap on the floor pillows"
        },
        {
          "targetAudience": "Interior designers and home decorators seeking unique and eye-catching pieces for their clients' living spaces",
          "useCase": "Incorporating the floor pillows into design schemes to add texture, color, and a touch of bohemian flair"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=441db023f87a2992371d1aba4ad5d99d2602ed45%3A904960951&click_sum=b104d085&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:15:40.425311",
      "productId": "zYBcGMnWSw"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool",
      "description": "This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction.\n\nWould fit perfectly to any boys or girls bedroom.\n\nMaterial:\n- fabric inner bag filled with polystyrene beads\n- knitted cover made with chunky cotton cord\n\nColour: LIGHT GREY\n\nSizes:\nSMALL:\nDiameter: Approximately 45cm (18”)\nHeight: Approximately 30cm (12”)\n\nMEDIUM:\nDiameter: Approximately 50cm (20”)\nHeight: Approximately 40cm (16”)\n\nCare:\n- the knitted cover can be removed for washing (it can be washed in 30 degrees in the washing machine)\n- the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.",
      "targetAudience": [
        {
          "targetAudience": "Parents with young children",
          "useCase": "A comfortable and stylish seating option for their children's playroom or bedroom."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "A unique and eye-catching piece to add a touch of Scandinavian charm to a nursery or child's room."
        },
        {
          "targetAudience": "Teachers and caregivers",
          "useCase": "A soft and durable seating option for use in classrooms or daycare centers."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=347ea032b6e45a9812c0a59ad090931d3411e40f%3A266515154&click_sum=e1ec314e&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:15:52.340115",
      "productId": "SBhGqMqISI"
    }
  },
  {
    "data": {
      "product": "Illustrated Parian Porcelain Vase",
      "description": "The Stroke Long Vase is a unique piece of art, handmade and individually illustrated with bold brushstrokes against a bright white base. It is perfect as a standout piece for a mantlepiece, sideboard, or as a centerpiece for your dining table. Ideal for holding bundles of your favorite blooms and leafy bouquets, the Stroke Long Vase will be sure to make an impact with or without foliage. Made from Parian porcelain, it has a matte finish outside and a glossy finish inside, showcasing the material's marble-smooth and delicately translucent qualities. Each piece is polished by hand to create a silky smooth finish that is a joy to hold and interact with. Due to its handmade nature, each vase is unique, with subtle differences that make it one of a kind.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate bold and unique design",
          "useCase": "Using it as a statement piece on a mantlepiece or sideboard"
        },
        {
          "targetAudience": "People who love to entertain and want to impress their guests",
          "useCase": "Using it as a centerpiece on their dining table"
        },
        {
          "targetAudience": "People who are looking for a high-quality, handmade piece of art",
          "useCase": "Displaying it as a collectible or using it as a functional vase"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=545dacd438767645e5627d9f955fdcde22e978ec%3A811521978&click_sum=113247fe&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:16:00.881628",
      "productId": "GdxxhqlCQg"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "This handmade vase is made of speckled stoneware clay and handpainted with black underglaze. It is dipped in glossy white and fired to cone 8 (1250C) in an electric kiln. The base is left unglazed and is impressed with the maker's mark. It is approximately 13.5cm high and 9cm wide (5.3\" x 3.5\"). It is dishwasher safe. All pieces are handcrafted, so there may be minor variations from item to item. Orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days. All EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of Slovenia. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days. There is a shipping upgrade option to Express DHL for European orders.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the vase as a decorative item in their home or office"
        },
        {
          "targetAudience": "Florists and event planners",
          "useCase": "Using the vase to arrange small bouquets or table centerpieces for special occasions"
        },
        {
          "targetAudience": "Nature lovers and plant enthusiasts",
          "useCase": "Displaying a small tree branch or other plant cuttings in the vase to add a touch of greenery to their living space"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=7c16e5ec7caf40b7723317da85c35009836787a1%3A986518800&click_sum=d8b857d2&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:16:13.594871",
      "productId": "nSHsVHtjrt"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase",
      "description": "This hand painted burlap vase is a unique and stylish addition to any home or office. The abstract mosaic design in black, cream, and gold is sure to catch the eye, and the sturdy construction ensures that it will last for years to come. The vase is 5\" tall and has a 5.5\" wide base, making it the perfect size for displaying flowers or other small objects. It is also easy to clean, simply wipe it down with a damp cloth. Whether you are looking for a gift for a friend or family member, or simply want to add a touch of elegance to your own home, this burlap jute glass vase is the perfect choice.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts",
          "useCase": "Displaying the vase as a decorative piece in their homes or offices."
        },
        {
          "targetAudience": "Home decorators",
          "useCase": "Using the vase to add a unique and stylish touch to their interior design."
        },
        {
          "targetAudience": "Gift givers",
          "useCase": "Purchasing the vase as a thoughtful and unique gift for friends or family."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6f6b46634ccffd375e33cffc533d8b26c76e84dd%3A908084516&click_sum=5403d238&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:16:21.088469",
      "productId": "ZVCMIaRxsQ"
    }
  },
  {
    "data": {
      "product": "Handmade cushion covers",
      "description": "These cushion covers feature exclusive, digitally designed patterns and are handcrafted in a limited series. The face fabric is water-repellent and UV-resistant, while the back fabric is heavy-duty 100% cotton twill. They have a slightly textured print quality and are fully overlocked on the reverse for durability. Maintenance is easy, with machine washing at 30°C, natural drying, and low-temperature ironing recommended. Shipments are made by post with tracking.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate unique and exclusive designs",
          "useCase": "Decorating their homes with stylish and eye-catching cushion covers"
        },
        {
          "targetAudience": "Collectors of handmade and limited-edition items",
          "useCase": "Adding these cushion covers to their collection as a unique and valuable piece"
        },
        {
          "targetAudience": "People who are looking for high-quality and durable cushion covers",
          "useCase": "Protecting their cushions from wear and tear while adding a touch of style to their home décor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4269d007a8b91da4d418463e4aa4421f28672782%3A1206357075&click_sum=59533414&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:16:28.242272",
      "productId": "bP1qcBAhQC"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "This pillow is made from 100% hand-loomed cotton and features a colorful striped design. It is very soft to the touch and has a hidden zipper at the bottom. Pillow insert not included. The pillow is made by an indigenous family in Cuenca, Ecuador, and the colorful stripes are woven on an antique loom. The pattern is inspired by the traditional clothing worn by the women and girls of this community.",
      "targetAudience": [
        {
          "targetAudience": "LGBTQ individuals",
          "useCase": "A symbol of pride and support for the LGBTQ community."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "A unique and colorful addition to a modern or bohemian home decor."
        },
        {
          "targetAudience": "Individuals who appreciate handmade and ethically sourced products",
          "useCase": "A way to support indigenous artisans and connect with their culture."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=abdf7a6d3c6cc38b2c1c8cdd205803fc08ac9899%3A566822148&click_sum=7054d814&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:16:39.649064",
      "productId": "ChmVnHtFkl"
    }
  },
  {
    "data": {
      "product": "Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.\n100% cotton with zipper closing\n16\" square\nDesigned in Canada • Made in India\nPillow form not included.",
      "targetAudience": [
        {
          "targetAudience": "mid-century modern decor enthusiasts",
          "useCase": "add a touch of mid-century modern style to their living room or bedroom"
        },
        {
          "targetAudience": "people who love colorful and unique home decor",
          "useCase": "add a pop of color and personality to their home"
        },
        {
          "targetAudience": "people who are looking for a stylish and affordable way to update their home decor",
          "useCase": "add a new pillow to their couch or bed without breaking the bank"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=6e42447ac0e277837052252f5954af2c530a9185%3A1168874671&click_sum=344b8587&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:16:49.233596",
      "productId": "dSGniRkeSR"
    }
  },
  {
    "data": {
      "product": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign",
      "description": "This address sign is made of high-quality cabinet grade 1/4\" thick baltic birch wood. It is 14.5\" wide and the height will vary depending on the length of the address. The sign comes with two drill holes in the graphic bar for hanging. It is available in painted or unpainted finishes. Painted signs come with black exterior grade paint unless otherwise specified. Unpainted signs come sanded and ready to be finished at home. The sign is designed to be placed under a covered area to preserve and protect the wood.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to update the look of their house",
          "useCase": "To replace their old house number sign with a more modern one."
        },
        {
          "targetAudience": "People who are looking for a personalized gift for a homeowner",
          "useCase": "To give as a housewarming gift or a gift for a new home."
        },
        {
          "targetAudience": "People who are looking for a way to make their house stand out from the others in their neighborhood",
          "useCase": "To add a unique touch to their home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=4912c05687bdbc4f521c8fe1b5149d0528c33ae7%3A790049531&click_sum=934e8063&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:16:59.952600",
      "productId": "lRy74OowRa"
    }
  },
  {
    "data": {
      "product": "Round Address Sign",
      "description": "Modern address plaque with geometric carved design and acrylic house numbers. Perfect for housewarming gifts, realtor closing gifts, or to spruce up your front porch or door decor. Comes with a sawtooth hanger for easy hanging. Choose your size, text color, and background paint or stain color.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to upgrade their house's exterior decor",
          "useCase": "Display the house number prominently and stylishly on the front of their home"
        },
        {
          "targetAudience": "Realtors looking for unique and thoughtful closing gifts for their clients",
          "useCase": "Provide a personalized and practical gift that will be appreciated by new homeowners"
        },
        {
          "targetAudience": "Interior designers seeking modern and geometric accents for their clients' homes",
          "useCase": "Incorporate the sign into their clients' home decor as a stylish and functional piece"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=c4cc9807f50e04deb41e78c52803a20189f9a8b9%3A1439690652&click_sum=3b3bb46b&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:17:08.791315",
      "productId": "eQHEZvJlWQ"
    }
  },
  {
    "data": {
      "product": "Herringbone Address Sign",
      "description": "A modern address sign made of wood with acrylic numbers. The backer can be stained or painted in any color, and the numbers can be black or white. The sign is 7\" x 21\" and comes with a sawtooth hanger or a d-ring for hanging. It is made of high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to modernize the exterior of their home",
          "useCase": "Displaying the house number in a stylish and modern way"
        },
        {
          "targetAudience": "Real estate agents looking for a unique and personalized closing gift",
          "useCase": "Gifting a housewarming gift that is both practical and decorative"
        },
        {
          "targetAudience": "Individuals seeking a custom-made address sign",
          "useCase": "Creating a one-of-a-kind address sign that reflects their personal style"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=7f7a15cedfc7a173857a187a18e0c27c5e7c8a08%3A1453867189&click_sum=16aacf8f&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:17:18.117876",
      "productId": "xFiA0Rxqkh"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath",
      "description": "This wreath is made to order and is made on a rustic grapevine base with artificial olives and leaves. It is perfect for indoor or outdoor use, but a covered or sheltered area is recommended. Direct sunlight and rain will fade the wreath over time. The wreath is ideal for double doors and can be customized with a ribbon or other decorations. It is a great accent piece for your home or a gift for friends.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators with a rustic aesthetic",
          "useCase": "Adding a touch of nature and warmth to their living space"
        },
        {
          "targetAudience": "Individuals looking for a unique and thoughtful gift",
          "useCase": "Expressing appreciation or congratulations to a friend or family member"
        },
        {
          "targetAudience": "Business owners seeking to create a welcoming and inviting atmosphere",
          "useCase": "Enhancing the ambiance of their retail space or office"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=d5e8655c755670e2ac919ccf12cc7206f0041229%3A630678328&click_sum=ab6126fe&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:17:25.585999",
      "productId": "UZqJTOIcVI"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking for a stylish and modern wreath to add a touch of nature to their front door or interior",
          "useCase": "Decorating their front door or interior with a wreath that is both stylish and natural"
        },
        {
          "targetAudience": "People looking for a gift for a special occasion, such as Mother's Day",
          "useCase": "Giving the wreath as a gift to someone who loves nature and home décor"
        },
        {
          "targetAudience": "People who live in areas with mild climates and want to add a touch of greenery to their home",
          "useCase": "Hanging the wreath on their front door or in their home to enjoy the beauty of nature all year round"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=7d6362c9bc58ec5e8d77ba83185dade8751904c8%3A962426777&click_sum=17d67ad1&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:17:35.268885",
      "productId": "oUlpQFMjGh"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath for front door, Eaca;yptus wreath, Greenery decor, French country decor, Farmhouse kitchen, Year round wreath",
      "description": "This classic year-round green wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand-torn ribbon. The total diameter is ~20\" and can be enjoyed inside or outside year-round for curb appeal.It is handmade in Northern, Virginia with love. This item is made to order.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate rustic and natural aesthetics",
          "useCase": "Adding a touch of greenery and charm to their front door or interior decor"
        },
        {
          "targetAudience": "Individuals seeking unique and handmade pieces",
          "useCase": "Adding a one-of-a-kind accent to their home that reflects their personal style"
        },
        {
          "targetAudience": "People looking for year-round wreath options",
          "useCase": "Enjoying the wreath's lush greenery and versatile design throughout the year, regardless of the season"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=34cc7459f07d41c070678dd7b81aacf70124969e%3A1223343994&click_sum=aee66bab&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:17:46.681212",
      "productId": "eNKBewKyAg"
    }
  },
  {
    "data": {
      "product": "Last Name Doormat",
      "description": "This doormat is made from all-natural coir, which is eco-friendly. It features a vinyl back for durability and sturdiness. The doormat is personalized with the last name of your choice. It is a great gift for housewarming, weddings, or closing gifts. The doormat is custom made and hand cut, so please allow for a 1 inch +/- variance in length. It is .5 to .75 inches thick.",
      "targetAudience": [
        {
          "targetAudience": "Housewarming gift givers",
          "useCase": "Personalized welcome doormat for new homeowners"
        },
        {
          "targetAudience": "Wedding gift givers",
          "useCase": "Personalized welcome doormat for newlyweds"
        },
        {
          "targetAudience": "Closing gift givers",
          "useCase": "Personalized welcome doormat for new homeowners"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=56bd3983d7b112ddde7576eb0fac277991d59074%3A1168985443&click_sum=58c60869&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-19T06:17:54.667001",
      "productId": "oJXsqgRtXK"
    }
  },
  {
    "data": {
      "product": "pizza doormat",
      "description": "A hand-painted pizza-shaped doormat made from a durable PVC back and a natural coir front. The coir material is perfect for both indoor and outdoor use, and the doormat is easy to clean by simply shaking it. It is a unique and fun housewarming or wedding gift, and it is also a great way to add some personality to your front door.",
      "targetAudience": [
        {
          "targetAudience": "Pizza enthusiasts",
          "useCase": "Display their love of pizza on their doorstep"
        },
        {
          "targetAudience": "Homeowners looking for a unique and personalized housewarming gift",
          "useCase": "Welcome guests with a custom-made doormat that reflects their style"
        },
        {
          "targetAudience": "Brides and grooms seeking a thoughtful and practical wedding gift",
          "useCase": "Provide a stylish and functional addition to the couple's new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=14d89c34ddb06c462c87c67b586f70549c041501%3A612462127&click_sum=29f045a6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:18:07.648925",
      "productId": "mmymaGAGHR"
    }
  },
  {
    "data": {
      "product": "Custom Last Name Retro Doormat",
      "description": "Personalized welcome doormat made from 100% coir and hand-painted with outdoor industrial paint with built-in UV protection. It has a slip-resistant PVC rubber backing and is 1 inch thick. It is best placed under covered areas like porches and should be kept dry to prevent fading and wear. Returns are not accepted due to wear or fading. Slight imperfections may be present in some doormats, which are sold at a discounted price with final sales. Custom orders are welcomed.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a personal touch to their home",
          "useCase": "Welcome guests with a custom doormat that reflects their family name"
        },
        {
          "targetAudience": "Housewarming gift givers",
          "useCase": "Give a unique and practical gift that will be appreciated by new homeowners"
        },
        {
          "targetAudience": "Real estate agents",
          "useCase": "Give clients a closing gift that is both thoughtful and practical"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=93dfa958c2ac8975616bf0345db1c8abe3e3c9fe%3A1183106995&click_sum=f869a953&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:18:15.604411",
      "productId": "DYVabMzedc"
    }
  },
  {
    "data": {
      "product": "Welcome Sign",
      "description": "This adorable Welcome sign is made of solid wood with painted on letters, giving it a rustic look. It is highly durable and comes in four different sizes: 5 feet x 9 1/4 inches, 4 feet by 6 1/2 inches, 3 feet by 5.5 inches, and 2 feet by 5.5 inches wide. It can be hung on a wall or placed anywhere you like by simply resting it back against something. It is recommended to place it in a covered location, such as a covered porch area, to ensure its durability.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a touch of rustic charm to their front door",
          "useCase": "Welcome guests to their home with a stylish and durable sign"
        },
        {
          "targetAudience": "Businesses that want to create a welcoming atmosphere for their customers",
          "useCase": "Display the sign in a prominent location to greet visitors and make them feel at home"
        },
        {
          "targetAudience": "People who are looking for a unique and personalized gift",
          "useCase": "Give the sign as a housewarming or wedding gift, or use it to decorate a special space in their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=a67042db1104d8c98bfd27bb22d270150d95613e%3A775841802&click_sum=d86cbad9&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-19T06:18:24.160172",
      "productId": "oHUBYWLqqc"
    }
  },
  {
    "data": {
      "product": "large wooden porch vases",
      "description": "Set of 2 wooden porch vases with a welcome sign, great for farmhouse and porch decor. Dimensions: large vase: 24\" x 6\", smaller vase: 18\" x 6\". Made from reclaimed wood that has been sanded and stained gray. Can be filled with large stems or branches for a beautiful entryway display.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value rustic and farmhouse decor",
          "useCase": "Adding charm and character to their porch or living room through the use of unique and eye-catching wooden vases."
        },
        {
          "targetAudience": "Homeowners seeking to create a welcoming and inviting entryway",
          "useCase": "Utilizing the set of vases to hold large stems or branches, creating a beautiful and eye-catching focal point for guests."
        },
        {
          "targetAudience": "Individuals with a need for practical and stylish storage solutions",
          "useCase": "Storing and displaying items such as flowers, plants, or household objects in a visually appealing and functional manner."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=dd65e3e70696be2959630d1074532c825260baac%3A511215666&click_sum=9d60ca37&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:18:36.755358",
      "productId": "zfpqyGjyVc"
    }
  },
  {
    "data": {
      "product": "Family Name Welcome Sign",
      "description": "This metal wall art is a personalized metal sign that can be used as a family gift, welcome sign, wedding sign, or housewarming gift. It is made with 18 gauge steel and powder coated in your choice of 5 colors, making it durable and weather-resistant. The sign is designed by hand to accommodate personalization and ensure the best possible result. It is available in 6 sizes, ranging from 12\" to 36\", and mounting hardware is not included. Customers have praised the sign's quality and fast shipping.",
      "targetAudience": [
        {
          "targetAudience": "Families",
          "useCase": "Welcome sign for their home"
        },
        {
          "targetAudience": "Newlyweds",
          "useCase": "Wedding sign or decoration"
        },
        {
          "targetAudience": "Homeowners",
          "useCase": "Personalized wall art for their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=6edd23ea6f301dc8cad832d297185982e2c4704b%3A1095987590&click_sum=b89ba745&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:18:44.127584",
      "productId": "qoKeXWdXwb"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce",
      "description": "This utility style sconce is a perfect addition to any room. It features a gloss black finish 10-inch shade with a white interior. The sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees. It is UL listed and thoroughly tested before leaving the shop. The fixture is compatible with a dimmer switch and can be used with incandescent, LED, compact fluorescent, or any other standard E26 base bulb up to 60 watts.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to add a stylish and functional light fixture to their home",
          "useCase": "Bedside lighting, bathroom lighting, or general room lighting"
        },
        {
          "targetAudience": "Industrial designers and interior decorators seeking a versatile lighting solution",
          "useCase": "Creating a modern or industrial aesthetic in commercial or residential spaces"
        },
        {
          "targetAudience": "Businesses and organizations looking to enhance their lighting",
          "useCase": "Providing ambient lighting in offices, retail spaces, or hospitality venues"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=ed45cb5a553182b4c6340497e0801ff631cd0c5a%3A615762911&click_sum=418790d7&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:18:52.321318",
      "productId": "ZSvdyRbAGK"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern With Integrated LED's and Unique Reflective Center Cone - Farmhouse Design",
      "description": "This contemporary and minimalist European lantern design wall sconce features sleek integrated LED that provides ample light. Made of sturdy die-caste aluminum and sealed with a weather-proof coating, this ETL-certified fixture is suitable for wet locations and all climates. Its energy-efficient integrated LED lights last an average of 40,000 hours, reducing the need for bulb replacements and saving energy costs. The easy installation process includes attaching the back plate to the junction box, connecting the wires, and securing the fixture with screws, eliminating the need for an electrician. This versatile fixture is perfect for residential spaces like exterior entrances, garages, patios, and porches, as well as commercial use in restaurants, common buildings, office spaces, and multi-use buildings.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to update the exterior of their homes with a modern and stylish fixture",
          "useCase": "Installing the lantern to illuminate an entryway, patio, or porch"
        },
        {
          "targetAudience": "Commercial property owners seeking energy-efficient and durable lighting solutions",
          "useCase": "Utilizing the fixture in restaurants, office buildings, or multi-use spaces"
        },
        {
          "targetAudience": "Individuals interested in reducing their energy consumption and maintenance costs",
          "useCase": "Replacing traditional light fixtures with the integrated LED lanterns"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=1ab5cd8260668d31b14e204a74ed62a997aac30d%3A1165269880&click_sum=cffecdf3&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:19:01.228574",
      "productId": "FdhEWFHHmF"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce - Model No. 3748",
      "description": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade. It comes in various finishes, including raw brass, black, brushed nickel, polished nickel, and antique brass. The lamp is UL listed and thoroughly tested before leaving the shop. Bulbs are not included, and the recommended bulb is an LED Edison 7w (60w). The dimensions are as follows: height: 9\", width: 7\", depth: 10\", shade height: 4.25\", shade width: 7\", and clearance from wall: 2.55\". The light fixture is compatible with a dimmer switch and can be installed directly wired into the wall or customized with an on/off switch or plug-in fixture. It is compatible with incandescent, LED, compact fluorescent, or any other standard E26 base bulb up to 60 watts. LED bulbs are recommended to keep the lamp temperature cool. Free shipping is available for physical addresses, but additional charges may apply for shipping to a P.O. Box.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who are looking for a modern farmhouse style lighting fixture",
          "useCase": "To add a touch of style to their home décor"
        },
        {
          "targetAudience": "Interior designers who are looking for a unique and stylish lighting fixture for their clients",
          "useCase": "To create a warm and inviting atmosphere in their clients' homes"
        },
        {
          "targetAudience": "Businesses who are looking for a durable and stylish lighting fixture for their commercial space",
          "useCase": "To create a professional and welcoming environment for their customers"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=9a09e0ac67e351434f3536e3c99ab4fe77763d47%3A1051791566&click_sum=721a9894&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:19:11.357202",
      "productId": "jLkXKsTpxz"
    }
  },
  {
    "data": {
      "product": "Linen bedding set",
      "description": "This linen bedding set is made from 100% organic, enzyme-washed flax fabric that is durable, strong, and has antibacterial, antistatic, and hygroscopic properties. It is also thermoregulating, breathable, and hypoallergenic. The set includes one duvet cover and two pillowcases, and is available in a variety of sizes. Custom sizes are also available upon request. The bedding set is easy to care for and can be machine washed and dried. It is also lightweight and easy to pack, making it perfect for travel.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking luxurious and comfortable bedding",
          "useCase": "Enhancing their sleep experience with a soft, breathable, and durable linen bedding set."
        },
        {
          "targetAudience": "Environmentally conscious consumers",
          "useCase": "Choosing a sustainable and eco-friendly bedding option made from certified organic and enzyme-washed flax fabric."
        },
        {
          "targetAudience": "Those seeking personalized home décor",
          "useCase": "Customizing the bedding set to fit their unique bed sizes and preferences, creating a tailored and stylish sleep space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=6ad5a848c56f6ac47496babdc395645d4423f936%3A1316603667&click_sum=f49f0cc9&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:19:49.242058",
      "productId": "OybxtGOIgp"
    }
  },
  {
    "data": {
      "product": "Linen Pillowcase",
      "description": "This 100% pure linen pillowcase provides maximum comfort due to linen's natural qualities. It is available in various sizes (King, Queen, Standard, Euro) and colors (Cappuccino). The pillowcase features an envelope closure type and is made from Oeko Tex 100 certified, extra soft linen fabric. It is produced in Lithuania and can be paired with matching almond sheets or a beige duvet cover. Custom sizes are also available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking high-quality and sustainable bedding",
          "useCase": "Replacing existing pillowcases with natural and comfortable linen pillow covers"
        },
        {
          "targetAudience": "Design-conscious consumers",
          "useCase": "Adding a touch of elegance and sophistication to their bedroom decor with the Cappuccino linen color"
        },
        {
          "targetAudience": "Health-conscious individuals",
          "useCase": "Improving sleep quality and comfort with the breathable and hypoallergenic properties of linen"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=8671eb1b2fba806343de58869d4a196cc30d3d45%3A1295727796&click_sum=36fb03a9&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:19:57.690247",
      "productId": "Mrc8SjQAWA"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set in Cinnamon Color",
      "description": "Airy and light, SAUTHS linen bedding is all about the effortless style we love to embrace. Our OEKO-TEX® linen( this means that it is made free of harmful chemicals and is safe for human use) duvet covers are also wrinkle-resistant, and their texture – can you believe it? – only improves with time. Top-quality European linen outperforms all other materials and makes all our products durable, strong, lustrous, and breathable. Our products are organic and fully biodegradable. The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance. Pre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting. We accept CUSTOM ORDERS, so if you haven’t found the size needed, let us know! Linen bedding can be the perfect gift for your special one and we will beautifully pack it for you, just give it as a note. Personalized messages are available on our branded card. DETAILS: - one duvet cover + 2 pillowcases; - Composition: 100% linen; - Color: Cinnamon; - Duvet cover type - button; - Pillowcase type - envelope (contact us if you want to have a pillows with buttons); - Hypoallergenic, thermoregulating, breathable; - Ethically made in Lithuania; - Write in the comments if you need to attach ties to the corners of your duvet cover. SIZE CHART: UNITED STATES US Twin + Standard Duvet 66x86\" / 168x219cm, Pillowcases 20x26” / 51x66cm US Full + Standard Duvet 80x80” / 203x203cm, Pillowcases 20x26” / 51x66cm US Full + Queen Duvet 80x80” / 203x203cm, Pillowcases 20x30” / 51x76cm US Queen + Standard Duvet 90x88” / 229x224cm, Pillowcases 20x26” / 51x66cm US Queen + Queen Duvet 90x88” / 229x224cm, Pillowcases 20x30” / 51x76cm US Queen + King Duvet 90x88” / 229x224cm, Pillowcases 20x36” / 51x91cm US King + Standard Duvet 102x90” / 259x229cm, Pillowcases 20x26” / 51x66cm US King + Queen Duvet 102x90” / 259x229cm, Pillowcases 20x30” / 51x76cm US King + King Duvet 102x90” / 259x229cm, Pillowcases 20x36” / 51x91cm UK / EUROPE EU Single + Standard Duvet 55x79” / 140x200cm, Pillowcases 20x27” / 50x70cm EU Double + Standard Duvet 87x79” / 220x200cm, Pillowcases 20x27” / 50x70cm EU King + Standard Duvet 94x87” / 240x220cm, Pillowcases 20x27” / 50x70cm UK Single + Standard Duvet 59x79” / 150x200cm, Pillowcases 20x30” / 50x75cm UK Double + Standard Duvet 79x79” / 200x200cm, Pillowcases 20x30” / 50x75cm UK King + Standard Duvet 91x79” / 230x200cm, Pillowcases 20x30” / 50x75cm UK King + King Duvet 91x79” / 230x200cm, Pillowcases 20x36” / 50x90cm AUSTRALIA AU Queen + Standard Duvet 83x83” / 210x210cm, Pillowcases 20x27” / 50x70cm AU King + Standard Duvet -96x83” / 245x210cm, Pillowcases 20x27” / 50x70cm EFFICIENCY Our special softening techniques makes our products wrinkle–free and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space. CARE GUIDE: - Wash at or below 60 C/140F; - Do not bleach; - Tumble dry on low heat; - Iron on low heat; - Do not dry clean. SHIPPING: We ship: - Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to the rest of the world (USA, Australia, New Zealand). - Express shipping EMS. It takes 2-4 business days. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
      "targetAudience": [
        {
          "targetAudience": "Individuals who prioritize comfort and breathability in their bedding.",
          "useCase": "Enhance their sleep experience by regulating body temperature and providing a soft, cozy feel."
        },
        {
          "targetAudience": "Those seeking sustainable and eco-conscious home textiles.",
          "useCase": "Reduce their environmental impact with biodegradable and OEKO-TEX certified linen bedding."
        },
        {
          "targetAudience": "Interior design enthusiasts who value aesthetics and durability.",
          "useCase": "Elevate their bedroom decor with the effortlessly luxurious and long-lasting qualities of linen bedding."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=041b1eeb37ca60bce3ecf3d78aec7849ba6a2b92%3A1066602418&click_sum=bce63b15&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:20:28.129596",
      "productId": "BMpYyJGWDL"
    }
  },
  {
    "data": {
      "product": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration",
      "description": "Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life. Available in three sizes: A4, A3, and A2. Each print is signed and includes a white border for framing. Shipped in a sleeve in a fiberboard mailer with an extra cardboard inside (small prints) or in a tube (medium and large prints).",
      "targetAudience": [
        {
          "targetAudience": "Home decorators and art enthusiasts",
          "useCase": "Decorating their homes with unique and stylish artwork"
        },
        {
          "targetAudience": "Architects and interior designers",
          "useCase": "Using the prints as inspiration for their designs or as part of their clients' home decor"
        },
        {
          "targetAudience": "Gift givers",
          "useCase": "Purchasing the prints as thoughtful and unique gifts for friends and family who appreciate art and design"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=abbeeaf4547691a7b12d97527fa6a4c4e28ba8ec%3A576508683&click_sum=b59d1032&ref=stl_listing-1",
      "dateCreated": "2024-02-19T06:20:36.361510",
      "productId": "WhePxYivVy"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting",
      "description": "This is a digital download of a Mid Century Modern, Fine Art Print, Contemporary Art Print, Abstract Art Style, Mid Century Poster, Midcentury Art Print, Abstract Print File, Fine Art Print For Sale Online, Entrance Wall Art, Apartment Wall Decor, Printable Guest Room, Printable Women Gift, Downloadable Art Prints. It is perfect for your home or office decor. Instant download and easy to print, without paying the shipping fee. Your order will consist of TWO high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7. This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print. Upon purchase of this listing, Etsy will immediately provide you with a link to your download. Click on the link to download the file and save it to your computer! It’s that simple! You can print the artwork at your local printing center or by using online printing services.",
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Enhance the aesthetic appeal of their living spaces with stylish and modern artwork."
        },
        {
          "targetAudience": "Art Collectors",
          "useCase": "Add a unique and affordable piece of abstract art to their collection."
        },
        {
          "targetAudience": "Interior Designers",
          "useCase": "Create visually captivating spaces for their clients by incorporating this versatile artwork into their designs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=b77c2b021203282e61aa7da482fd23c44d2474ae%3A834853057&click_sum=13d42f25&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-19T06:20:56.582625",
      "productId": "Rfy5xMYnmF"
    }
  },
  {
    "data": {
      "product": "Dip dye tapestry",
      "description": "This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel. It is a made to order item, so feel free to contact the seller if you would like to order this piece in a different size or colour. Each wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style. Slight colour variations may occur.",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking to add a bohemian or eclectic touch to their home décor.",
          "useCase": "Using the tapestry as a wall hanging to create a focal point in a living room, bedroom, or other living space."
        },
        {
          "targetAudience": "Renters or individuals living in temporary spaces.",
          "useCase": "Utilizing the tapestry as a lightweight and portable way to add color and texture to their living environment without damaging walls."
        },
        {
          "targetAudience": "Artists or individuals seeking unique and handmade décor.",
          "useCase": "Displaying the tapestry as a statement piece that reflects their personal style and appreciation for handcrafted items."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=eb5939d95e32f05f68e2cec2307b349bc0612426%3A991191051&click_sum=e6c9e0a8&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:21:06.466018",
      "productId": "PcXoLJwIFf"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "This unique bubble-shaped candle is perfect for home decor or as a gift. It is made with high-quality, pure soy wax and blended with white beeswax, and is available in a variety of scents. Each candle is hand-poured and wrapped by hand, so there may be slight variations. The candle comes with a warning to keep it away from drafty areas and to always keep it upright to avoid a large amount of wax flowing out.",
      "targetAudience": [
        { "targetAudience": "Home decorators", "useCase": "Home decor" },
        {
          "targetAudience": "Gift givers",
          "useCase": "Housewarming gifts, Mother's Day gifts"
        },
        {
          "targetAudience": "People who enjoy stylish home scents",
          "useCase": "Air freshener"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=d3a35b8b2d891ee851c0518f9dd5fff6e1d3fb33%3A774551709&click_sum=f90d7739&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:21:22.132512",
      "productId": "NlvopbrUGm"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle - Hand-Poured - Candlefolk",
      "description": "This candle has a rich and woody scent with hints of cedarwood, amber, and moss. It is made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks. It has a burn time of approximately 45-50 hours.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy earthy and masculine scents",
          "useCase": "Creating a relaxing and inviting atmosphere in their homes"
        },
        {
          "targetAudience": "People who appreciate high-quality and handcrafted products",
          "useCase": "Using the candle as a decorative piece in their living spaces"
        },
        {
          "targetAudience": "Those who prefer eco-friendly and sustainable products",
          "useCase": "Using the candle as a natural and non-toxic way to freshen their homes"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=51b4f89df8e6d2a78eb916537a1e3256222e7f46%3A785763623&click_sum=a79f0bcc&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:21:36.094997",
      "productId": "YcikUxAkCk"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle",
      "description": "This 100% natural soy candle is scented with essential oils of cypress, hinoki, and grapefruit. It is hand-poured in Rhode Island and has a burn time of up to 50 hours. The scent is described as being clean and refreshing, with notes of Japanese cypress, cedar, and pink grapefruit. The candle is said to create an atmosphere of clarity and tranquility, and is recommended for use when seeking clarity and awareness. The hinoki tree is revered as sacred in Japan and is said to have a restorative atmosphere. The candle is made with vegan ingredients and is cruelty-free.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a natural and environmentally friendly home fragrance",
          "useCase": "Creating a relaxing and calming atmosphere in their living spaces"
        },
        {
          "targetAudience": "Practitioners of aromatherapy who value the therapeutic benefits of essential oils",
          "useCase": "Promoting clarity and awareness during meditation or yoga sessions"
        },
        {
          "targetAudience": "Fans of Japanese culture and aesthetics",
          "useCase": "Incorporating the serene scent of hinoki into their homes as a way to connect with their cultural heritage"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=81b508953ed1396f2b335765b5b23670e2430c13%3A879866486&click_sum=b9747b28&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-19T06:21:46.924220",
      "productId": "NIPFOICJKJ"
    }
  },
  {
    "data": {
      "product": "Small Wooden Stool",
      "description": "This Scandinavian-inspired stool is made of plywood and finished with a natural hard wax oil. It is available in a range of colors, including natural, walnut, oak, light oak, antic oak, teak, black, frozen green, and winter blush. The stool is 12.59\" in diameter and 16.14\" high, and can support up to 120kg. It is easy to assemble and comes with dismounted legs and a mounting kit.",
      "targetAudience": [
        {
          "targetAudience": "Minimalist home enthusiasts",
          "useCase": "Adding a touch of Scandinavian charm to their living space"
        },
        {
          "targetAudience": "Plant lovers",
          "useCase": "Displaying their favorite plants in a stylish and functional way"
        },
        {
          "targetAudience": "Apartment dwellers with limited space",
          "useCase": "Adding extra seating or storage without cluttering up their living area"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=debcf06eae27460f4bea1d37d952466d20200046%3A570862928&click_sum=05d1a16c&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:21:59.020530",
      "productId": "ZJmnpVFqRP"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "The Cork Stools collection is made from natural cork and features a simple, functional design. The stools are available in two sizes and have a recess around the perimeter for easy carrying and moving. The smooth texture of cork combined with the simple design makes the stools perfect for a wide range of public and private environments. The collection emphasizes the use of natural materials and simple forms.",
      "targetAudience": [
        {
          "targetAudience": "Design enthusiasts",
          "useCase": "Add a modern and eco-friendly accent to their living spaces."
        },
        {
          "targetAudience": "Homeowners looking for sustainable furniture",
          "useCase": "Furnish their homes with eco-friendly and durable pieces."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporate unique and natural elements into their design projects."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=5266896508acc642ec692ad9f5ad1d0bd8701906%3A793579884&click_sum=5ba03dbf&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:22:09.338558",
      "productId": "cfRhFIBgVj"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "The Bonnet Wood Stool is a handmade, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand.  It is handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels.  The Bonnet Stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow.  It's available in two sizes and a variety of colors.  Also, feel free to reach out for custom colors and sizes either through our Etsy store or through email at  info [!at] whalecreek.co.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters who are looking for a stylish and functional piece of furniture that can be used in a variety of ways.",
          "useCase": "The Bonnet Stool can be used as an end table, side table, stool, or plant stand."
        },
        {
          "targetAudience": "Interior designers who are looking for a unique and eye-catching piece of furniture to add to their clients' homes.",
          "useCase": "The Bonnet Stool can be used to add a touch of style to any room in the home."
        },
        {
          "targetAudience": "Businesses who are looking for a durable and stylish piece of furniture that can be used in a variety of commercial settings.",
          "useCase": "The Bonnet Stool can be used in waiting rooms, lobbies, or offices."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=2fec5f77b4c4a7e6ca5472d2d3996734a91ade55%3A1198929077&click_sum=2dbc375a&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:22:23.993288",
      "productId": "YEGMBhDOoU"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "The Coiled planter is designed to enhance the beauty of plants with its stylish design. It features a drainage hole and three small \"feet\" for stability. The planter is available in various sizes to accommodate different plant sizes. The matte finish colors provide a sophisticated look, while the sheen finish colors add a touch of shine. The planter is made of a plant-based bioplastic eco-friendly material, making it lightweight, durable, and sustainable. The design is original to Morse Studio Co.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts and collectors",
          "useCase": "Displaying their prized plants in a stylish and modern way"
        },
        {
          "targetAudience": "Home decorators with a minimalist or mid-century modern aesthetic",
          "useCase": "Adding a touch of natural beauty and organic form to their living spaces"
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Choosing a sustainable and environmentally friendly way to house their plants"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=20db6132ce587066f927ec161f2a0640b3600867%3A865339439&click_sum=448d152d&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-19T06:22:31.969382",
      "productId": "mMSgZqBiZY"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter",
      "description": "The Nude Pink and Brass Metal Floor Planter is a stylish and functional addition to any home. Made from brass and aluminium with a static paint finish, this planter is durable and easy to care for. The pot diameter is 20cm, the total height is 30cm, and the brass stand height is 18cm. The planter is suitable for all house plants, and it features a perforated separator inside to collect excess water and protect the roots. The planter can be placed on the floor or on a table, and it can be rotated to any direction on its brass stand for easy adjustment. Import fees may apply on international shipments according to your government's customs regulations.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators with a modern or minimalist style.",
          "useCase": "Display plants in a stylish and functional way."
        },
        {
          "targetAudience": "Plant enthusiasts who want to showcase their plants in a unique way.",
          "useCase": "Create a focal point in their living space with a statement planter."
        },
        {
          "targetAudience": "Individuals who are looking for a practical and aesthetically pleasing way to add greenery to their home.",
          "useCase": "Use the planter to brighten up a living room, bedroom, or office space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=dba9124b9326c2410de124fb9163129c5fbdcd16%3A728731403&click_sum=efc3b34f&ref=stl_listing-2",
      "dateCreated": "2024-02-19T06:22:41.493367",
      "productId": "PJjaDPjvww"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter",
      "description": "This small indoor planter is made of stoneware with hand carved details in a bright red and pink combo. It is the perfect size for a small cactus or succulent and has a small hole in the bottom for water drainage. This planter measures approximately 2.5\" in height and 3\" in diameter.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who enjoy displaying small cacti or succulents.",
          "useCase": "Using the planter to house their small plants and add a decorative touch to their indoor space."
        },
        {
          "targetAudience": "Individuals seeking unique and handmade home decor items.",
          "useCase": "Purchasing the planter as a decorative piece to enhance the aesthetics of their home."
        },
        {
          "targetAudience": "People looking for thoughtful and aesthetically pleasing gifts.",
          "useCase": "Gifting the planter to friends or family members who appreciate handmade crafts and unique homeware items."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=22aeb5126233a62a826206b384874a11d127d29a%3A1435558019&click_sum=73127900&ref=stl_listing-3",
      "dateCreated": "2024-02-19T06:22:49.547447",
      "productId": "XbNsqTPQku"
    }
  },
  {
    "data": {
      "product": "GPS Coordinates Longitude Latitude Sign",
      "description": "This custom-made wood sign is approximately 8\" x 12\" with hanging hardware. It displays one set of coordinates in a specific format. You can choose from three stain colors: Dark Walnut, Briarsmoke, or Early American. The back of the sign is stained and stamped with the shop's logo. The sign is hand-painted, with no decals used. The shop converts all coordinates to the style pictured on the product listing. The sign is made to order and ships via USPS Ground Advantage 2-4 day. The shop does not accept cancellations. It is important to leave your coordinates in the personalization or note to seller section when ordering. If you are unsure how to find the coordinates to your special location, you can leave a note with the address and the shop will get it for you. All coordinates will be converted to the style pictured on the product listing. The shop uses natural materials such as wood and grapevine in its products. Signs and trays are made of real wood and are either stained and/or painted. Due to the nature of wood, knots and grains will vary from sign/tray to sign/tray. Napkin rings use natural grapevine forms and faux floral/greenery. Due to the natural of wood not all forms are perfectly round. Everything in this shop is made to order and due to the nature of The Mountain Bluebird Co, the shop does not accept returns.  Please note that all sizes are approximate and may vary up to an inch.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners",
          "useCase": "Displaying the coordinates of their home as a sentimental decoration"
        },
        {
          "targetAudience": "Realtors",
          "useCase": "Giving the sign as a closing gift to clients to commemorate the purchase of their new home"
        },
        {
          "targetAudience": "Friends and family members of homeowners",
          "useCase": "Gifting the sign as a housewarming present or a way to mark a special occasion"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/461000746/gps-coordinates-longitude-latitude-sign?click_key=fe40dc38affe3a6dd6efc9a6b99610d94bcd72ea%3A461000746&click_sum=6d1dc457&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-1&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:23:02.689911",
      "productId": "jKqoYIayKW"
    }
  },
  {
    "data": {
      "product": "Congrats on your Happy New Home Candle Gift",
      "description": "The Congrats on your Happy New Home Candle Gift is a soy candle that is made with 100% American grown, eco-friendly soy wax. It is scented with clean burning fragrance and essential oils and is free of dyes, harsh chemicals, and pollutants. The candle is hand poured in Laguna Hills, California. It comes in a 4 oz, 9 oz, or 16 oz size and arrives perfectly packaged in a signature gift box, complete with complimentary Hello You matches. You can also add a custom message to the back of your candle for no additional charge. The candle is available in a variety of scents, including vanilla, lavender, champagne, roses, wedding cake, spiced honey, beach day, spa day, great outdoors, blue sky, healing wood, sunshine citrus, herb garden, happy hour, enchanted forest, strong coffee, and birthday cake.",
      "targetAudience": [
        {
          "targetAudience": "People who are moving into a new home",
          "useCase": "Housewarming gift"
        },
        {
          "targetAudience": "People who are relocating to a new area",
          "useCase": "Welcome gift"
        },
        {
          "targetAudience": "People who are having a party to celebrate their new home",
          "useCase": "Party decoration"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/483839218/congrats-on-your-happy-new-home-candle?click_key=1879dee9c82d41a389b8a9dcb742296a26223f67%3A483839218&click_sum=b92cbce3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-2&pro=1",
      "dateCreated": "2024-02-19T06:23:12.111336",
      "productId": "hATbNjdcpS"
    }
  },
  {
    "data": {
      "product": "Engraved Compass",
      "description": "This custom engraved compass is made from top quality solid brass and is durable for outdoor use. It has a diameter of 1.96 inches and comes with a chain. You can engrave up to 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side. We can engrave whatever you want and we can use every font that you want. This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their first Christmas as husband and wife",
          "useCase": "A unique and sentimental gift to commemorate a special occasion"
        },
        {
          "targetAudience": "Men who appreciate unique and personalized accessories",
          "useCase": "A stylish and functional accessory that can be engraved with a special message or design"
        },
        {
          "targetAudience": "People looking for a thoughtful and meaningful gift for a husband, boyfriend, or father",
          "useCase": "A personalized gift that shows how much you care and that will be cherished for years to come"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=55a03a92b413873a3e2502f75ae4641ed322c0e1%3A214526797&click_sum=73e99195&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-3&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:23:22.555340",
      "productId": "PAynpxweXb"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift, Photo on Wood",
      "description": "A custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life.",
      "targetAudience": [
        {
          "targetAudience": "A couple celebrating their 5th wedding anniversary",
          "useCase": "A gift to commemorate the occasion"
        },
        {
          "targetAudience": "Someone looking for a unique and personalized gift",
          "useCase": "A gift for a friend or family member"
        },
        {
          "targetAudience": "Someone looking for a rustic and natural home décor item",
          "useCase": "A decoration for their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=48b495f8d0902e70e3224ad6dd54d7a4492de568%3A207134258&click_sum=92c4ed42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-4&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:23:31.979721",
      "productId": "RMczClQZz9"
    }
  },
  {
    "data": {
      "product": "Acorn Doorstops",
      "description": "These wooden door stops are perfect for keeping doors open, even in windy conditions. They're made from red oak, which is a provincial tree and a symbol of good luck and safety. The door stops are turned and nicely finished, and they come in a set of two. They're also a great gift for someone who travels, as they can add extra security to a hotel room door.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners with doors that do not stay open",
          "useCase": "Keeping doors open for ventilation or preventing them from slamming shut"
        },
        {
          "targetAudience": "People who travel and need extra security for their hotel room doors",
          "useCase": "Providing an additional layer of security to hotel room doors"
        },
        {
          "targetAudience": "People looking for unique and thoughtful gifts",
          "useCase": "Giving as a gift for housewarmings, hostess events, or stocking stuffers"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/96383212/acorn-doorstops-set-of-2-door-wedges?click_key=a7527abae260e322672a4bc64a6f4ef01d54555f%3A96383212&click_sum=02a87555&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-5&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:23:39.147543",
      "productId": "YxCyiZcqTQ"
    }
  },
  {
    "data": {
      "product": "Mailed Print / Custom Quote / Custom Quote Print / Personalized Quote Print / Custom Poster / Dorm Art",
      "description": "Customizable print with a quote of your choice, available in various sizes and with optional framing. Printed on acid-free paper with archival inks and mailed flat or rolled in a tube for protection. Perfect for dorm rooms or any space where you want to display inspirational words.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value meaningful quotes and seek to incorporate them into their living spaces.",
          "useCase": "Creating a personalized and inspiring home decor item that reflects their personal values or aspirations."
        },
        {
          "targetAudience": "Gift-givers looking for a thoughtful and meaningful present.",
          "useCase": "Commissioning a custom print with a special quote or message for a loved one, friend, or colleague."
        },
        {
          "targetAudience": "Artists and designers seeking unique and customizable artwork.",
          "useCase": "Utilizing the print as a component in their own creative projects or as a standalone piece in their portfolio."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/216584231/mailed-print-custom-quote-custom-quote?click_key=e5653ec5488164b95493fe4e3bc19e5affbcf665%3A216584231&click_sum=b53e518f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-6&etp=1",
      "dateCreated": "2024-02-19T06:23:56.849919",
      "productId": "VEufTheUgT"
    }
  },
  {
    "data": {
      "product": "Tree rings Print, Three Panel Wall Art",
      "description": "These tree ring prints are handmade by Erik Linton and each measures 24x36 inches. They are made from wood from previously fallen trees, so no trees were cut down to make them. The prints are signed by the artist and come in a set of three. They are made from 100lb acid free paper and are painted with high quality textured ink. They ship quickly in a sturdy tube. Customers love these prints, saying they are beautiful, clear, and great quality.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a unique and stylish touch to their living spaces",
          "useCase": "Wall art to enhance the aesthetic appeal of their homes"
        },
        {
          "targetAudience": "Art collectors interested in handmade and nature-inspired pieces",
          "useCase": "Adding to their collection of unique and meaningful artwork"
        },
        {
          "targetAudience": "Individuals seeking personalized and sentimental gifts",
          "useCase": "Customizing the prints with wood from a meaningful location or using it as a gift to commemorate a special occasion"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/536496958/tree-rings-print-three-panel-wall-art?click_key=38053f459fdc41218915569be5469b7ce7cc34b1%3A536496958&click_sum=3a15cdb5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-7&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:24:08.226887",
      "productId": "uBHjSlVKpB"
    }
  },
  {
    "data": {
      "product": "Watercolor seascape painting",
      "description": "This is a giclee print of an original watercolor painting. It is printed with colorfast ink on premium archival fine art paper. Prints are signed in the back and have a white border for easy framing. The painting depicts a rowboat alone at sea, in a serene and moody landscape. It is a beautiful piece of coastal art, perfect for any home. The print is available in three sizes: 8.5 X 11 inches, 13X19 inches, and 17 X 22 inches. It is packaged in a protective, acid-free sleeve and shipped in a flat cardboard mailer.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate watercolor seascape paintings",
          "useCase": "Display the print in their home or office as a decorative piece"
        },
        {
          "targetAudience": "People who live in or have a connection to Maine",
          "useCase": "Purchase the print as a souvenir or reminder of their time spent in the state"
        },
        {
          "targetAudience": "People who are interested in coastal art",
          "useCase": "Add the print to their collection of coastal-themed artwork"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/247020065/watercolor-seascape-painting-archival?click_key=8b011e8989f1d734565eb9b844b2caacc6a2a151%3A247020065&click_sum=14ed6aca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-8&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:24:20.925592",
      "productId": "IOb41hWaIJ"
    }
  },
  {
    "data": {
      "product": "Engraved Slate House Number",
      "description": "These attractive slate sign designs are carefully designed to give your house number a modern, clean look.\nYour chosen number is then classically hand engraved with deep \"V\" cut lettering, not sandblasted or laser engraved like most other numbers. This gives an attractive depth to each number, allowing the number to stand out against the natural slate.\nThe numbers are then given three layers of base paint, and a final layer of high gloss finish, this creates a brilliant white number. The slate is then waxed to bring out the natural colours of the slate and increase its durability and then finally it is carefully wrapped and packed.\nThe slate is beveled and drilled in order to create a softer appearance around the edges and allow it to be attached to a wall.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to update their house number",
          "useCase": "Replacing an existing house number with a more modern and stylish option"
        },
        {
          "targetAudience": "New homeowners who need a house number for their new home",
          "useCase": "Installing a house number that reflects their personal style and complements the exterior of their home"
        },
        {
          "targetAudience": "Businesses looking to update their signage",
          "useCase": "Replacing an existing business sign with a more professional and attractive option that includes their house number"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/175265406/engraved-slate-house-number?click_key=8f1eca1e7eeece662ce014f4aa58fedefd59786e%3A175265406&click_sum=cff13348&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-9&etp=1",
      "dateCreated": "2024-02-19T06:24:38.077225",
      "productId": "fRnWnhaPuW"
    }
  },
  {
    "data": {
      "product": "Personalized Zip Code Pillow",
      "description": "This personalized pillow is made from a soft linen blend fabric and features a hidden zipper. It is available in a variety of colors and sizes, and can be customized with any set of numbers. The pillow is perfect for dorm decor, monogrammed gifts, or rustic home decor.",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking for personalized home décor",
          "useCase": "Adding a sentimental touch to their living space by displaying a pillow featuring a special date or location"
        },
        {
          "targetAudience": "Those seeking unique dorm room décor",
          "useCase": "Creating a personalized and cozy atmosphere in their college dorm by displaying a pillow with their zip code or school mascot"
        },
        {
          "targetAudience": "People searching for thoughtful housewarming gifts",
          "useCase": "Gifting a personalized pillow with the recipient's address or a meaningful date to commemorate their new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/458504940/personalized-zip-code-pillow?click_key=e7d672b893f0c7b07483a67a84fa3ad6849ba513%3A458504940&click_sum=f6b6ea19&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-10&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:24:45.603708",
      "productId": "ElXpBrgusI"
    }
  },
  {
    "data": {
      "product": "Rainbow Candle",
      "description": "This is a colorful rainbow candle with six layers of scented soy wax. Each layer has a different scent, including Violet Lime, Sandalwood Vanilla, Carolina Sweetgrass, Apple Orchard, Mandarin Orange, and Vanilla Beans. It makes a great gift for a hostess, friend, or anyone who needs a little color in their life. The candle adds a pop of color to any decor, modern to rustic, and has an extra long burning time with a super scent throw. One mason jar will scent a large room and each candle will burn for over 64 hours, with eco-friendly paper and cotton wicks. All orders arrive in attractive wrapping, ready for gift-giving, and it is a great party host or hostess gift.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy home décor and adding unique and colorful elements to their living spaces.",
          "useCase": "Using the candle as a decorative piece to enhance the aesthetic appeal of their home."
        },
        {
          "targetAudience": "People looking for thoughtful and unique gifts for special occasions.",
          "useCase": "Purchasing the candle as a gift for friends, family, or loved ones to express appreciation or brighten their day."
        },
        {
          "targetAudience": "Those seeking a relaxing and fragrant ambiance in their home.",
          "useCase": "Lighting the candle to create a soothing and aromatic atmosphere, enhancing relaxation and well-being."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251774155/rainbow-candle-soy-candle-with-6?click_key=f51928538473c615ed8a71bd123a5814c1b5a60f%3A251774155&click_sum=3ad6169a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-11&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:24:55.744044",
      "productId": "JVDJPNoAXX"
    }
  },
  {
    "data": {
      "product": "Strong Coffee Scented Candle",
      "description": "The Strong Coffee Scented Candle is a handmade candle made with 100% American grown, eco-friendly soy wax and clean burning fragrance and essential oils. It is free of dyes, harsh chemicals and pollutants and is hand poured in Laguna Hills, California. The candle comes in three sizes: 4 oz, 9 oz, and 16 oz, and has a burn time of 20 hours, 40 hours, and 70 hours, respectively. The candle is available in a variety of scents, and can be personalized with a message printed on the back. It is a great gift for coffee lovers and makes a fun and unique addition to any home.",
      "targetAudience": [
        {
          "targetAudience": "Coffee lovers",
          "useCase": "Enjoy the rich, bold scent of coffee any time of day without the caffeine jitters."
        },
        {
          "targetAudience": "People who appreciate handmade and personalized gifts",
          "useCase": "Give a unique and thoughtful gift that is sure to be appreciated."
        },
        {
          "targetAudience": "People who are looking for a clean and eco-friendly candle",
          "useCase": "Enjoy a candle that is made with 100% American grown, eco-friendly soy wax, and clean burning fragrance and essential oils."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/291976457/strong-coffee-scented-candle-scented-soy?click_key=50e70c0816007373c6b691bacf1eeb4af4531c0d%3A291976457&click_sum=f87fd824&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-12&pro=1",
      "dateCreated": "2024-02-19T06:25:06.242891",
      "productId": "vryisVrjJF"
    }
  },
  {
    "data": {
      "product": "Decorative Easter Eggs",
      "description": "This product is a set of 12 hand-dyed and hand-speckled artificial plastic Easter eggs. They measure approximately 2 1/2 inches by 1 3/4 inches and are available in a variety of colors. These eggs are perfect for adding a touch of spring color to your home decor. You can use them to decorate an Easter egg tree, place them in a vase, or scatter them across your fireplace mantel. They are also great for making wreaths or swags.",
      "targetAudience": [
        {
          "targetAudience": "People who celebrate Easter",
          "useCase": "Decorating their homes for Easter"
        },
        {
          "targetAudience": "People who make Easter crafts",
          "useCase": "Using the eggs in their crafts"
        },
        {
          "targetAudience": "People who collect Easter eggs",
          "useCase": "Adding the eggs to their collection"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/267294526/decorative-easter-eggs-artifical-easter?click_key=be68c8e9f32112652986810bbef707f0b3c85f8a%3A267294526&click_sum=eadb8144&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-13&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:25:14.378496",
      "productId": "EVuXOpOkAO"
    }
  },
  {
    "data": {
      "product": "Pineapple, Front Door Wreath, Front Door Decor, Pineapple Decor, Door Hangers, Elegant Door Wreath, Door Decorations, outdoor wreath",
      "description": "This Pineapple Door Hanger is a classic and will compliment any decor, made of high-quality steel, then powder -coated with a beautiful long-lasting UV finish with the intention of lasting longer than the average wreath in an outdoor setting, available in sizes 20\" Tall x 10\" Wide and 26\" Tall x 13\" Wide with or without an over-the-door hook for easy hanging.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a touch of charm and cheer to their home",
          "useCase": "Hanging the wreath on their front door to give their home a warm and inviting atmosphere"
        },
        {
          "targetAudience": "People who are looking for a classic and elegant way to decorate their door",
          "useCase": "Using the wreath to compliment their existing decor and add a touch of sophistication to their home"
        },
        {
          "targetAudience": "People who want to give a thoughtful and unique gift to a friend or family member",
          "useCase": "Gifting the wreath to someone who loves to decorate their home or who has a special place in their heart for pineapples"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/267098338/pineapple-front-door-wreath-front-door?click_key=b80f13e1e72aa55039644205dbc9579293656d04%3A267098338&click_sum=3aca8d33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-14&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:25:29.842569",
      "productId": "odbooKpfeM"
    }
  },
  {
    "data": {
      "product": "Inspirational Wall Decals - You're Beautiful",
      "description": "These inspirational wall decals can be used as mirror decals for a daily dose of motivation. They are perfect for anyone who needs to be reminded that they are beautiful, including moms, women, girls, and kids. The decals can be applied to any smooth clean surface and have a matte surface with no backgrounds, so they will look like they were just painted on.",
      "targetAudience": [
        {
          "targetAudience": "Women with low self-esteem and poor body image",
          "useCase": "As a daily reminder of their beauty, to help them challenge negative thoughts and improve their self-perception."
        },
        {
          "targetAudience": "Mothers and caregivers",
          "useCase": "As a gift for their daughters or children, to instill positive body image and self-esteem from a young age."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "As a stylish and inspirational addition to bathroom or bedroom décor, creating a positive and uplifting atmosphere."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/110728100/inspirational-wall-decals-youre?click_key=14f503d33291fb7968fabbc164e5d30a8a424c1a%3A110728100&click_sum=cd348afe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-15&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:25:38.185265",
      "productId": "sAxNTudbJr"
    }
  },
  {
    "data": {
      "product": "Customizable 3D Last Name Wood Sign",
      "description": "These 3D Family signs are a stunning display piece in your home or will be a unique wedding or anniversary gift for the couple. The raised lettering creates an appealing 3D effect that adds depth and character to the piece. Made from 1/2\" Baltic Birch plywood and 1/4\" plywood for the letters and graphics, these signs are sturdy and durable. Choose from different background colors and provide your desired last name and establishment date for personalization. The signs come with a sawtooth hanger for easy hanging.",
      "targetAudience": [
        {
          "targetAudience": "Couples getting married",
          "useCase": "Personalized wedding gift"
        },
        {
          "targetAudience": "Couples celebrating an anniversary",
          "useCase": "Unique anniversary gift"
        },
        {
          "targetAudience": "Families looking for home decor",
          "useCase": "Custom home wall decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/568318925/last-name-established-sign-personalized?click_key=2a5753110508b8d56532f27c6c283d2d770f4b00%3A568318925&click_sum=b610a374&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-16&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:25:46.430062",
      "productId": "NScVeCuRFR"
    }
  },
  {
    "data": {
      "product": "Baby Mobile, Bird Mobile for Baby, Crib Mobile, Baby Shower Gift, Mobile for Nursery, Modern Mobile, Woodland Mobile, Ceiling Mobile Birds",
      "description": "This baby mobile is made from 100% merino wool felt and is available in 33 beautiful colors. It is 14 inches wide and 17 inches high, and the drop from the ceiling is 42 inches. A free ceiling hook is included with each purchase. The mobile is designed to hang from a standard 8 ft. ceiling height, but an extra piece of cord can be included to adjust the height for higher ceilings. This mobile is not a toy and should be kept completely out of reach of babies and young children.",
      "targetAudience": [
        {
          "targetAudience": "Parents of infants and young children",
          "useCase": "To entertain and soothe their babies in the crib or play area."
        },
        {
          "targetAudience": "Individuals looking for unique and modern nursery decor",
          "useCase": "To add a touch of style and sophistication to their nursery."
        },
        {
          "targetAudience": "Gift-givers looking for a special and meaningful present for a baby shower or new parent",
          "useCase": "To give a gift that will be both cherished and enjoyed by the recipient."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/175420905/baby-mobile-bird-mobile-for-baby-crib?click_key=d5adbf3929b84076c087fa58809d66de849dfca6%3A175420905&click_sum=c4f60c42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-17&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:25:58.644815",
      "productId": "NxvGzKHsky"
    }
  },
  {
    "data": {
      "product": "12 Inch Beeswax Candles - Tall Tapers",
      "description": "These beeswax candles are handmade in the Hudson Valley NY studio using wax sourced from the finest US east coast apiaries. They have a natural honey scent, burn longer and brighter than other types of wax candles, and are considered \"dripless\" if burned correctly. Each pair of 12 x 7/8\" tapers is approximately 6 oz and will fit most standard candle holders. The candles are made with 100% natural beeswax from established northeast US beekeepers and have an organic cotton wick. Each 12\" taper burns approximately 12-14 hours, depending on conditions in the environment. They are smokeless, relatively \"dripless\" when correctly burned, and non-allergenic. Handmade candles have naturally occurring imperfections that enhance their rustic loveliness, so please allow for some inconsistencies. Ivory and yellow candles are un-dyed, un-bleached, pure filtered beeswax. Colored candles are dyed with eco-friendly, non-toxic dyes. Note that colors may appear slightly different in person due to variations in computer monitors. Colors may also vary slightly from batch to batch.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate natural and sustainable products",
          "useCase": "Using the candles as decorative elements in their homes, creating a warm and inviting ambiance"
        },
        {
          "targetAudience": "Individuals seeking non-toxic and eco-friendly home products",
          "useCase": "Using the candles for their non-allergenic and smokeless properties, creating a healthier indoor environment"
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Using the candles as a raw material for candle-making projects, customizing them with different colors and scents"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/211997304/one-pair-of-12-inch-beeswax-candles-tall?click_key=fcdaf2377a9f2780abfc00c57a356e1a18429786%3A211997304&click_sum=f8888142&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-18&pro=1&sts=1",
      "dateCreated": "2024-02-19T06:26:15.465143",
      "productId": "bXWgBOkwBT"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift for Him | Sound Wave Art QR Code | Wood Anniversary Voice Recording",
      "description": "This product is a personalized wood print that can be customized with a voice recording or a favorite song. The print is made from 3/4\" thick premium baltic birch wood and is printed with a specialized process that results in super vibrant colors. The print is protected against moisture and heat to give you a print that will last for years to come. It is easy to clean and comes ready to hang. Sizes up to 11\"x14\" include a stand. A small card with the QR code printed on it is included with your order. The QR code will play the recording for your order when scanned with your phone's camera. You can also request to have the QR code printed on the art itself. A free proof is available upon request, but please note it adds 1-3 business days to the processing time.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "A unique and memorable gift that captures the special moments of their wedding day"
        },
        {
          "targetAudience": "Individuals looking for a personalized and meaningful gift for a loved one",
          "useCase": "A thoughtful and sentimental gift that expresses their love and appreciation"
        },
        {
          "targetAudience": "Families looking for a special way to commemorate a milestone or special occasion",
          "useCase": "A keepsake that can be cherished for years to come and shared with future generations"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/477563341/5th-anniversary-gift-for-him-soundwave?click_key=67a651609482da5ac55bd05fb4a81b48c867d341%3A477563341&click_sum=fe3f4d9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-19&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:26:25.958694",
      "productId": "PLniKXWRpU"
    }
  },
  {
    "data": {
      "product": "Mini Snowflake from Nestled Pines - Gift Box set of 15 . All New Designs",
      "description": "The gift box set features eight brand new designs in a variety of wood species including Black Cherry, Black Walnut, Red Oak, Maple, Aspen, and Red Cedar. Each ornament measures approximately 1 1/2\" in diameter and is finished with a non-toxic food safe oil to protect the wood and enhance its natural beauty. All of the materials used in the gift box are recycled, making it an eco-friendly choice. The set is perfect for holiday gifting and comes with free shipping in the USA for orders over $35.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate unique and handmade holiday decorations",
          "useCase": "Adorning Christmas trees or other holiday displays with intricate and charming snowflake ornaments"
        },
        {
          "targetAudience": "Those seeking small and thoughtful holiday gifts",
          "useCase": "Gifting the ornament set to friends, family, or loved ones as a festive and memorable present"
        },
        {
          "targetAudience": "Decor enthusiasts interested in sustainable and eco-friendly décor",
          "useCase": "Incorporating the ornaments into their holiday decorations while supporting a brand that prioritizes environmental responsibility"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/250419092/mini-snowflake-ornaments-from-nestled?click_key=cb5e9facfcb239e37e08e787d6b28019ec87e0dc%3A250419092&click_sum=8790376f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-20&etp=1",
      "dateCreated": "2024-02-19T06:26:34.620445",
      "productId": "CDlqTVAYoS"
    }
  },
  {
    "data": {
      "product": "Family Name Sign",
      "description": "This Family Name Sign is a perfect gift for weddings, housewarmings, Christmas, bridal showers, or simply as a way to add some personality to your home. It is made from high-quality wood and features a beautiful script font. The sign is available in a variety of sizes and can be customized with your family name and established date. It is easy to hang and comes with all the necessary hardware. It is a thoughtful and unique gift that will be treasured for years to come.",
      "targetAudience": [
        {
          "targetAudience": "Couples getting married",
          "useCase": "As a wedding gift to commemorate their special day"
        },
        {
          "targetAudience": "Families with a new home",
          "useCase": "As a housewarming gift to welcome them to their new space"
        },
        {
          "targetAudience": "Friends and family looking for a unique gift",
          "useCase": "As a Christmas gift or bridal shower gift to show their appreciation"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/541052534/family-name-sign-wedding-gift?click_key=62e6fea644458b293110b4fda3744db1288a0f10%3A541052534&click_sum=7e49fa27&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-21&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:26:41.829480",
      "productId": "dyDJdXYVFX"
    }
  },
  {
    "data": {
      "product": "Stained Glass Spider Web Corner",
      "description": "These Stained Glass Spiderweb corners truly make awesome magical & whimsical decor!Keep up all year or just for Fall & Halloween, This Handcrafted Piece is a showcase piece all in itself.Adorn in your window & room corners or for your outdoor decor!Each piece is hand crafted to order and will include a variety of different clear textures & types of glass, making each one individually special & unique JUST like a real spider web!To hang your Webbing just apply small screws to the eyelet holes attached to framingMeasuring 7 1/4 by 8 1/4 \"It has four eyelets.  Two on each side to Mount with small screws 💕***This is Authentic Stained Glass, Stained glass can have gorgeous ripples and bubbles in the glass from its creation making it unique. There is no film on my glass to give the iridized look. The iridization was fuzed into the glass when the glass was madeCompletely Authentic Stained Glass****",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate unique and whimsical pieces",
          "useCase": "Adding a touch of magic and whimsy to their home decor by hanging the spider web corner in a window or room corner"
        },
        {
          "targetAudience": "Garden enthusiasts who enjoy adding decorative elements to their outdoor spaces",
          "useCase": "Creating a focal point in their garden by mounting the spider web corner on a fence or trellis"
        },
        {
          "targetAudience": "Halloween enthusiasts who want to add a touch of spooky elegance to their holiday decor",
          "useCase": "Hanging the spider web corner in a window or on a door to create a festive atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/483162425/stained-glass-spider-web-cornerhome?click_key=23d1d626105c7aea76b58fbb70fac0a1913800d7%3A483162425&click_sum=90414d5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-22&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:26:57.292069",
      "productId": "CsfFhCwUCl"
    }
  },
  {
    "data": {
      "product": "Gather Sign",
      "description": "A wooden sign with the word \"Gather\" cut out in 1/2\" thick birch plywood. Offered in four stock sizes, ranging from 22\" x 5.75\" to 42\" x 11\". Painted in your choice of color, with an optional distressed finish. Comes with a key hole hanging option for easy mounting on wood or drywall, or can be hung using Command Strips, glue, or small nails. Made to order with a lead time of approximately 1-2 weeks after receiving payment.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for a unique and special way to decorate their home.",
          "useCase": "This product can be used to add a personal touch to any room in the house."
        },
        {
          "targetAudience": "People who are looking for a gift for a friend or family member.",
          "useCase": "This product can be given as a gift for any occasion."
        },
        {
          "targetAudience": "People who are looking for a way to add a touch of rustic charm to their home.",
          "useCase": "This product can be used to create a warm and inviting atmosphere in any room."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/530022913/gather-sign-up-to-42-color-options?click_key=4b0a922270dbdc6eb0de6c9b1d4512b04e13c673%3A530022913&click_sum=603000f8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-23&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:27:18.285165",
      "productId": "WnKpygwwCj"
    }
  },
  {
    "data": {
      "product": "Greyhound Dog Ornament with Heart made from Recycled Raw Steel Rustic Farmhouse Pet memorial Pet Loss Gift Dog Love Sustainable Christmas",
      "description": "This ornament is made from recycled raw steel and is personalized with the name of your favorite pooch or in remembrance of a beloved pet that has passed on. It is 1.25\" x 5.25\" and is made by Brandon and Erin Spangler in Northwest Georgia. The ornament is covered with a thin layer of black oxide, which gives it a dark gray/bluish tint. While this provides a level of protection against corrosion, a beautiful patina of rust can be brought out by a minimal amount of exposure to humidity. If the rust is unwelcome, you may rub grade 3 coarse steel wool over the top to remove any and/or all rust.",
      "targetAudience": [
        {
          "targetAudience": "Dog owners",
          "useCase": "Memorialize a beloved pet"
        },
        {
          "targetAudience": "Animal lovers",
          "useCase": "Show support for animal welfare organizations"
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Purchase a sustainable and eco-friendly product"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/260512255/greyhound-dog-ornament-with-heart-made?click_key=f61ea2b665a8a57adaf4835d6cf0a35c3c4bc91e%3A260512255&click_sum=c25a8d97&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-24&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:27:29.854841",
      "productId": "bN1iWUTcUK"
    }
  },
  {
    "data": {
      "product": "Wooden quote block",
      "description": "The wooden quote block is a small, free-standing sign with a funny quote on it. It is made from salvaged construction lumber and is available in two color options: distressed black and whitewash. The block is 3\" wide, 3\" high, and 1.5\" thick, making it the perfect size to add a touch of inspiration to any desk, dresser, shelf, or night table. It is also a great gift for anyone who needs a little bit of expert advice.",
      "targetAudience": [
        {
          "targetAudience": "Office workers",
          "useCase": "Add a touch of humor and inspiration to their workspace"
        },
        {
          "targetAudience": "People who enjoy funny and motivational quotes",
          "useCase": "Display the sign in a visible location to brighten their day"
        },
        {
          "targetAudience": "People looking for a unique and thoughtful gift",
          "useCase": "Give the sign to a friend, family member, or colleague who would appreciate the sentiment"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/226367204/small-desk-sign-office-decor-quote-block?click_key=e722d1fb502277da1d59e0cd670bbe1b0f51a189%3A226367204&click_sum=87612c10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-25&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:27:39.143744",
      "productId": "wBghmOwdXQ"
    }
  },
  {
    "data": {
      "product": "Moon Phases Wall Hanging Brass Moon Wall Decor Full Moon Wall Art -  Moon Mobile - Moon Child - Lunar",
      "description": "This unique moon phases brass wall hanging is shiny and vibrant and works with more classic decor as well as colorful decor. It looks beautiful hanging on a wall or on a cupboard.Each of the elements is hammered differently and the big full moon in the centreApproximate size:Length 22.6\"/57.5cmWide 2.6\"/ 6.6cmPlease note: My work is 100% handmade items that are unique and no two items are identical. That's the beauty of the product! Please allow for slight variations from what is shown in the made to order picture.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in celestial decor and wall art",
          "useCase": "Enhancing the aesthetic appeal of their home or workspace with a unique and eye-catching piece"
        },
        {
          "targetAudience": "People seeking meaningful and symbolic home decor",
          "useCase": "Expressing their connection to the moon and its phases through a visually stunning artwork"
        },
        {
          "targetAudience": "Those looking for a thoughtful and unique gift",
          "useCase": "Celebrating special occasions or expressing appreciation for a friend or loved one who appreciates celestial themes"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/281537172/moon-phases-wall-hanging-brass-moon-wall?click_key=db055ea411e6f9ff3102266afe591f85f205b03c%3A281537172&click_sum=a544b52f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-26&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:27:48.183777",
      "productId": "DmGGfqMkXx"
    }
  },
  {
    "data": {
      "product": "Ceramic Nativity",
      "description": "This handcrafted pottery nativity creche is a free-standing, one-piece manger scene. It is made of speckled buff and white clay, and each piece is rolled, textured, and assembled by hand. After the first firing, the bodies and manger are coated with peacock blue before being fired again at 2250 degrees. Back support brackets are then added for easy display. The piece measures 5” tall x 7” long x 2” deep. It is not recommended for young children due to its delicate nature. Slight variations in the glaze may occur as each piece is 100% handmade.",
      "targetAudience": [
        {
          "targetAudience": "Christians who celebrate Christmas",
          "useCase": "Display the nativity scene as a Christmas decoration"
        },
        {
          "targetAudience": "Collectors of ceramic art",
          "useCase": "Add the nativity scene to their collection"
        },
        {
          "targetAudience": "People looking for a unique and meaningful gift",
          "useCase": "Give the nativity scene as a gift to a friend, family member, or loved one"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/201547702/christmas-gift-christmas-nativity?click_key=a5f1ee6e2365d60d731dff1f3eca68182038ae2c%3A201547702&click_sum=db210ce5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-27&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:28:12.249912",
      "productId": "HEYwXGxhTZ"
    }
  },
  {
    "data": {
      "product": "Vintage Tropical Botanical Print Set No. 1",
      "description": "This set of 4 hand-colored etchings from the 1770s by noted botanical illustrator George Ehret is digitally enhanced and set on a lightly tinted background for vintage charm. Printed with professional wide-format Fine-Art Giclee Epson printers and archival quality pigment-based inks, these prints arrive ready to frame in standard retail frames. Choose from Archival Canvas Textured Paper with a matte, textured finish or Archival Smooth Matte with a matte finish. Please note that actual colors may vary slightly due to handmade nature of products and individual computer monitor settings.",
      "targetAudience": [
        {
          "targetAudience": "Individuals with an interest in vintage and botanical art",
          "useCase": "Displaying the prints in their homes or offices as a decorative element"
        },
        {
          "targetAudience": "Interior designers and decorators",
          "useCase": "Incorporating the prints into their clients' interior design projects to create a coastal or tropical atmosphere"
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Adding the prints to their collections of vintage botanical prints or other artwork"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/246131668/vintage-tropical-botanical-print-set-no?click_key=614601d5d77785858c3b4cd1e01a0981a4de34bb%3A246131668&click_sum=dfb8fef3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-28&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:28:23.351994",
      "productId": "VYAqOjWxEI"
    }
  },
  {
    "data": {
      "product": "Giclée art print of Abstract painting",
      "description": "This high quality giclee print is from an original oil painting by the artist. It is professionally printed with Epson Ultrachrome k3 ink, which lasts up to 200 years. It is printed on heavy weight, smooth and bright white matte paper, or ultra thick and textured fine art paper. The print is signed by the artist and comes protected in a protective clear sleeve. It is available in various sizes, and can be framed for a stunning addition to any room.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking to add a touch of abstract art to their space",
          "useCase": "Displaying the print in a frame to enhance the décor of a living room, bedroom, or office"
        },
        {
          "targetAudience": "Art collectors seeking unique and high-quality giclée prints",
          "useCase": "Adding the print to their collection and showcasing it as a valuable piece of artwork"
        },
        {
          "targetAudience": "Gift-givers searching for a thoughtful and artistic present",
          "useCase": "Presenting the print as a special gift to a friend, family member, or colleague who appreciates abstract art"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/157475413/giclee-art-print-of-abstract-painting?click_key=3e73d6198b9dbc85ed431386ce672009b3235a87%3A157475413&click_sum=c0f7240b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-29&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:28:32.319588",
      "productId": "VFYtsfKzmg"
    }
  },
  {
    "data": {
      "product": "Winter Wreath, Winter Decor, Summer Wreath, Summer Decor, Farmhouse Wreath, Farmhouse Decor,Front Door Wreath,Home Decor, Spring Wreath",
      "description": "This wreath is a perfect accent to any front door or empty wall space. The beautiful hints of green with the natural beauty of the white flowers and blue foliage will bring warmth and add charm to any front door or wall.  The wreath shown is 18 inches across, 22 inches in length and 4 inches deep.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to decorate their front door or empty wall space with a rustic and charming touch.",
          "useCase": "To add warmth and character to their home's exterior or interior."
        },
        {
          "targetAudience": "Individuals seeking a unique and handmade piece of decor for their home.",
          "useCase": "To express their personal style and create a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Event planners or party hosts looking to create a festive and welcoming ambiance.",
          "useCase": "To decorate for special occasions such as weddings, showers, or holiday gatherings."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/508901284/winter-wreath-winter-decor-summer-wreath?click_key=06838a584b24a5d5e06b024894435e6bd13ce9e0%3A508901284&click_sum=7742fa38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-30&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:28:41.434027",
      "productId": "tyVFQEYVji"
    }
  },
  {
    "data": {
      "product": "Custom House warming gift, Personalized house ornament, Christmas ornament, Wood burning, New home, New house gift, Real estate gift, Couple",
      "description": "This is a unique personalized house ornament, the wood burnt version of the picture attached by you to a message. In my work I use the ancient technique of Pyrography, slow burning, by hand, of the design with quite a few different hot pens. This 4\" ornament will YEAR-ROUND pleasantly surprise anybody who will receive it as a gift: new homeowner, couples or family. OCCASIONS: new home, wedding, birthday, Valentine's Day, first home, newlyweds, First Christmas, new house, Just Moved, etc. Also, this wood burnt ornament makes a unique housewarming gift from a Real estate agency for their customers. PERSONALIZATION: I can fit one short line of writing at the top, and the year or a short address at the bottom of the ornament. Upon checkout, please write your instructions in the \"note from buyer\": DIMENSIONS:  4\" plywood circle, 1/8\" thick",
      "targetAudience": [
        {
          "targetAudience": "New homeowners",
          "useCase": "A unique and personalized way to commemorate their new home."
        },
        {
          "targetAudience": "Real estate agents",
          "useCase": "A unique and thoughtful gift for their clients who are purchasing a new home."
        },
        {
          "targetAudience": "Couples or families",
          "useCase": "A special way to celebrate their home and family."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/170835267/custom-house-warming-gift-personalized?click_key=ba886c9a39f996703ea3754bf3e4179053043e62%3A170835267&click_sum=c1e47643&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-31&etp=1",
      "dateCreated": "2024-02-19T06:28:50.659980",
      "productId": "AGXXsPUepH"
    }
  },
  {
    "data": {
      "product": "Owl Art Print",
      "description": "This owl art print by Ashley Percival is a unique home decor piece that can add a touch of nature and whimsy to any living room, bedroom, or kitchen. It is signed on the front and printed on beautiful fine art paper 315gsm. The print is available in a variety of standard UK and US sizes, and all orders ship within 2 working days. UK orders are sent 1st class, while international orders are sent with tracking. For customers in the US, the prints are printed and shipped locally to avoid additional customs costs. The artist also offers a variety of other art prints in her Etsy shop.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts looking to add a unique and stylish touch to their living space",
          "useCase": "Decorating their living room or bedroom with a beautiful owl art print"
        },
        {
          "targetAudience": "People who appreciate nature and want to bring a touch of the outdoors into their home",
          "useCase": "Using the owl art print as a way to connect with nature and create a calming and serene atmosphere"
        },
        {
          "targetAudience": "Individuals looking for a thoughtful and unique gift for a housewarming or other special occasion",
          "useCase": "Gifting the owl art print to a friend or family member who loves owls or appreciates art"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/66281583/owl-art-print-unique-home-decor-for?click_key=80f5c67268dd3e2357c69192fd02a52db1c8bb28%3A66281583&click_sum=009cdba9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-32&pro=1&frs=1",
      "dateCreated": "2024-02-19T06:29:08.445183",
      "productId": "e1HaqNpjF8"
    }
  },
  {
    "data": {
      "product": "Pressed Mimosa - SMc. Originals",
      "description": "This watercolor art print is a reproduction of the original painting by SMc. Originals. It is printed on SAVOY 100% cotton paper and comes unframed. The print is available in various sizes, up to 30x40 inches. Custom framing and artist canvas options are also available. The print features a deckled edge, which is an additional charge. The seller offers custom work and has a website where customers can view their latest designs. Copyright SMc. Originals. All rights reserved.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts",
          "useCase": "Decorating their homes with original and stylish artwork"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporating unique and modern artwork into their design projects"
        },
        {
          "targetAudience": "Collectors",
          "useCase": "Adding to their collection of original watercolor paintings"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/499244464/pressed-mimosa-smc-originals-watercolor?click_key=5861acbf184a9ede905923f8299cbde30ac5f86e%3A499244464&click_sum=82cbfe4e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-33&etp=1",
      "dateCreated": "2024-02-19T06:29:17.992706",
      "productId": "sRAkDhwmxu"
    }
  },
  {
    "data": {
      "product": "Bohemian Yarn Tapestry, Yarn Wall Hanging",
      "description": "The Bohemian Yarn Tapestry is a handcrafted wall hanging made with various textures and sizes of yarn to create depth and dimension. It comes in a range of sizes, from small to extra extra large, with the length across or horizontal length being the length of the wooden stick and the height or vertical length measured from the wooden rod to the bottom of the yarn. The tapestry is available in a variety of color schemes, and custom orders are welcome. The proceeds from the sale of the tapestries go to a miniature horse rescue and a kids summer camp where they learn to care for mini horses.",
      "targetAudience": [
        {
          "targetAudience": "People who are interested in bohemian and rustic home decor",
          "useCase": "Decorating their homes with a unique and eye-catching wall hanging"
        },
        {
          "targetAudience": "People who are looking for a gift for someone who loves unique and handmade items",
          "useCase": "Purchasing the tapestry as a thoughtful and unique gift"
        },
        {
          "targetAudience": "People who are interested in supporting small businesses and handmade crafts",
          "useCase": "Purchasing the tapestry as a way to support the artist and the miniature horse rescue and kids summer camp"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/521660723/bohemian-yarn-tapestry-yarn-wall-hanging?click_key=3bb3dff4df6bca209f236a8bd2a1f54b6772a186%3A521660723&click_sum=57a39196&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-34&frs=1&etp=1",
      "dateCreated": "2024-02-19T06:29:31.098573",
      "productId": "xYndyHSkLI"
    }
  },
  {
    "data": {
      "product": "Personalized Candle Holder",
      "description": "A set of 3 log candle holders, hand-burned with initials, made from reclaimed wood. The middle holder has a heart shape burned into it. The candle holders are rough sanded and may have splits, pits, and groves. They are not completely smooth. Tealights/Votives are not included. The measurements are 3,4,5\" Height 3.5\" Diameter (each Log) Hand Burned Middle Heart Approx. 1 1/2\". Care instructions: Clean with a dry cloth or brush. Wet cleaners may cause Discolorations/Expansion of the Wood. This item is made from reclaimed wood and may have knots, grooves, or imperfections unique to the wood being used. This Simple rustic design is completely handcrafted from start to finish! Great for Wedding Centerpieces, Thanksgiving Tables, Holiday Coffee Tables, And much more! Safety instructions: These candleholders are wood. Faux flame candles are recommended. For real flame candles, Please exercise caution when using: If smoking occurs, extinguish the candle. Do not allow the flame to touch the side of the container. Never move your candle while it is burning or still hot. Never leave your candle unattended. Burn candles indoors, away from drafts, other heat sources, and any flammable objects or materials.",
      "targetAudience": [
        {
          "targetAudience": "Couples",
          "useCase": "Engagement or anniversary gift"
        },
        { "targetAudience": "Home decorators", "useCase": "Rustic home decor" },
        {
          "targetAudience": "People looking for personalized gifts",
          "useCase": "Personalized candle holder"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/205198072/personalized-candle-holder-rustic-home?click_key=25a92807da9c71e5a66e619285b7553c16850f0d%3A205198072&click_sum=19bb9e0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-35&pro=1",
      "dateCreated": "2024-02-19T06:29:41.850882",
      "productId": "rFGRYzlLWL"
    }
  },
  {
    "data": {
      "product": "Moon Wall Clock",
      "description": "The Moon Wall Clock is a beautiful and unique piece of art that is perfect for any home. It is made with high-quality materials and features a silent quartz movement. The clock also has a phosphorescent paint that glows in the dark for hours after being charged in a bright light. The Moon Wall Clock is available in four different sizes and comes with a heavy-duty metal hanger for easy hanging. It is also shipped via priority mail and arrives approximately within 1-2 weeks to USA and Europe, 2-3 weeks Canada, and 3-4 weeks to Australia & everywhere else.",
      "targetAudience": [
        {
          "targetAudience": "People who are interested in astrology and the zodiac sign Cancer.",
          "useCase": "They may use the clock to decorate their home or office and to keep track of time."
        },
        {
          "targetAudience": "People who are interested in astronomy and the moon.",
          "useCase": "They may use the clock to learn more about the moon and to track its phases."
        },
        {
          "targetAudience": "People who are looking for a unique and stylish wall clock.",
          "useCase": "They may use the clock to add a touch of personality to their home or office."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/517770482/moon-wall-clock-moon-glow-clock?click_key=ac30560cf6b2c86846ac245e6902e459fe33cf23%3A517770482&click_sum=32ed6886&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-36&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:29:52.090901",
      "productId": "LfQlrNvyCF"
    }
  },
  {
    "data": {
      "product": "Personalized Family Map Pillow",
      "description": "This meaningful family Holiday gift or for the Mom or Dad you love. Sweet for a birthday, or living room decor for your own home. Up to 20 locations, $1.00 for each additional location (a link will be sent after purchase to pay for those). Hawaii or Alaska can be included as well as a mini Country to the side to represent someone abroad.",
      "targetAudience": [
        {
          "targetAudience": "Parents with children who live in different locations",
          "useCase": "To have a personalized gift that represents their family's geographic spread"
        },
        {
          "targetAudience": "Grandparents who want to keep track of their grandchildren's locations",
          "useCase": "To have a visual representation of their family's locations"
        },
        {
          "targetAudience": "People who have moved away from their family and want to stay connected",
          "useCase": "To have a reminder of their family's locations and feel closer to them"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/505137090/personalized-family-map-pillow-gift-for?click_key=90c9c1676b134d3f06f88201038c56d86c0956da%3A505137090&click_sum=81312685&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-37&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-19T06:30:00.179696",
      "productId": "NgqBVmgpGx"
    }
  },
  {
    "data": {
      "product": "custom record ledge",
      "description": "This listing is for (1) ledge which can hold 1 record. Measures 14\" long, 1 1/2\" deep and 13/16\" thick, groove is 1/2\". Made in Ohio from solid wood.\n\nOur single record ledge is the perfect solution to displaying the record on your turntable.  Can accommodate thick double or triple gatefolds.  Purchase multiple to display your favorite albums around your living space.  Quantity can be adjusted at checkout.\n\nChoose your wood and finish combo: Oak, Cherry or Walnut in Clear, Stain A, B or C.  Maple in Clear or Whitewash ONLY.  All finishes are sealed with oil based or water based polyurethane to create a timeless finish.  Made to order; please allow 2-3 weeks for production until shipping.\n\nHardware and instructions (including QR code for detailed installation video) provided.  Hangs with two routed keyholes on the back of the ledge for invisible, floating effect.  Video provided here is shortened example of how to install.",
      "targetAudience": [
        {
          "targetAudience": "Vinyl record collectors and enthusiasts",
          "useCase": "Displaying their favorite records on turntables or around living spaces"
        },
        {
          "targetAudience": "Audiophiles and music lovers",
          "useCase": "Enhancing their listening experience by showcasing the album artwork and providing a dedicated space for records"
        },
        {
          "targetAudience": "Home decorators and interior design enthusiasts",
          "useCase": "Adding a unique and stylish touch to their living spaces while incorporating their passion for music"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/499400223/custom-record-ledge?click_key=d18a93200292eade3f51eec8b30f1757d5a408db%3A499400223&click_sum=f1abb780&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-38&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:30:10.932714",
      "productId": "KuzVFedOZt"
    }
  },
  {
    "data": {
      "product": "Personalized Latitude Longitude Sign",
      "description": "The personalized Latitude Longitude Sign is a unique and thoughtful gift for any occasion. It features the latitude and longitude coordinates of a special location, such as a home, wedding venue, or favorite vacation spot. The sign is printed on high quality watercolor paper and can be framed or left unframed. It is a great way to commemorate a special place or moment in time.",
      "targetAudience": [
        {
          "targetAudience": "New homeowners",
          "useCase": "Decorating their new home with a personalized and meaningful piece of art"
        },
        {
          "targetAudience": "Friends and family of new homeowners",
          "useCase": "Giving a thoughtful and unique housewarming gift"
        },
        {
          "targetAudience": "Couples celebrating a wedding or anniversary",
          "useCase": "Creating a custom piece of art that commemorates their special day"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/245914064/housewarming-gift-new-home-housewarming?click_key=2e4f48bc34bdba324a014c439621136c43fa5e18%3A245914064&click_sum=fb4da3c4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-39&pro=1&sts=1",
      "dateCreated": "2024-02-19T06:30:18.855461",
      "productId": "ChuPnRytUY"
    }
  },
  {
    "data": {
      "product": "Custom Constellation Map",
      "description": "The Custom Constellation Map is a personalized gift that features the unique night sky view from a specific date and location. It is perfect for any occasion, such as a wedding, anniversary, or baby shower. The map is created using professional, heavyweight matte paper and archival inks. It is available in a variety of sizes, with and without frames and mats. Customers can also choose from a variety of swatches and fonts to customize their map. The product is handmade in the USA and has over 10,000 5-star reviews.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating an anniversary",
          "useCase": "A custom constellation map of the night sky on their wedding day or another special date"
        },
        {
          "targetAudience": "New parents",
          "useCase": "A custom constellation map of the night sky on the day their baby was born"
        },
        {
          "targetAudience": "Individuals looking for a unique and personalized gift",
          "useCase": "A custom constellation map of a special location or a meaningful date"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/512439018/custom-constellation-map-star-map-print?click_key=4206efac581b7987c3403423d5c0b478e81498e8%3A512439018&click_sum=1c7660ac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-40&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:30:28.196960",
      "productId": "bcQiZN3UgI"
    }
  },
  {
    "data": {
      "product": "Dragon Hanging Stained Glass Sun Catcher",
      "description": "This hand-crafted dragon sun catcher features a metal body with double stained glass wings. It measures approximately 4 inches in length with a 6-inch wingspan and hangs from a 4-inch chain. Customers can choose from a variety of wing colors and black or silver body tones. Each piece is unique due to the hand-made nature and variations in the art glass used. The dragon takes about 4 weeks to \"housetrain\" before it can be shipped, but customers can opt for a rush option for faster delivery. The sun catcher is a perfect gift for dragon enthusiasts and can be used to decorate any indoor or outdoor space.",
      "targetAudience": [
        {
          "targetAudience": "People who like dragons",
          "useCase": "Decorative item for their home"
        },
        {
          "targetAudience": "People who like stained glass art",
          "useCase": "Decorative item for their home"
        },
        {
          "targetAudience": "People who like sun catchers",
          "useCase": "Decorative item for their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/226750008/dragon-hanging-stained-glass-sun-catcher?click_key=700d6075ec7c335c953a26d41243ef5a2d664ad4%3A226750008&click_sum=1496c0e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-41&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:30:36.633200",
      "productId": "AqQsqerVMr"
    }
  },
  {
    "data": {
      "product": "Deluxe Beer Styles Print",
      "description": "This 24” x 36” poster features 89 varieties of beer with over 200 representative quaffs, including glassware recommendations for each variety. It's printed on high-quality, eco-friendly, 100lb paper stock.",
      "targetAudience": [
        {
          "targetAudience": "Craft Brewers",
          "useCase": "Reference guide for beer varieties and glassware recommendations."
        },
        {
          "targetAudience": "Alcohol Lovers",
          "useCase": "Decorative wall art showcasing their passion for beer."
        },
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Unique and educational addition to their home décor, adding a touch of beer-themed sophistication."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/90334056/deluxe-beer-styles-print-poster-for-home?click_key=0ec5929f0d3ac2405404cd0b147e0878177b4be8%3A90334056&click_sum=49753a42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-42&etp=1",
      "dateCreated": "2024-02-19T06:30:43.153469",
      "productId": "GFhdIxFtdP"
    }
  },
  {
    "data": {
      "product": "Personalized Mother's Day Gift",
      "description": "This personalized print makes the perfect Mother's Day gift for a mom or grandma. It can be personalized with up to 6 names and dates, and is printed on high quality, textured watercolor paper. The print comes in an 11\"x14\" frame, and can be customized with a choice of black, classic, or simple barnwood frame. The barnwood frames are made from real salvaged barn wood and have the natural rustic elements intact, including knots, nail holes, and splintering. The colors of the barnwood frames vary from brown to grey, and each frame is unique.",
      "targetAudience": [
        {
          "targetAudience": "Mothers",
          "useCase": "A personalized gift from their daughter that can be used as a keepsake to commemorate a special occasion such as Mother's Day or a wedding."
        },
        {
          "targetAudience": "Daughters",
          "useCase": "A meaningful and thoughtful gift for their mother that can express their love and appreciation."
        },
        {
          "targetAudience": "Grandmothers",
          "useCase": "A personalized and sentimental gift from their granddaughter or grandson that can be cherished and displayed in their home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385197556/mother-day-gifts-for-wife-unique-mother?click_key=0908aed76e0b91c0524c76c004d76753066499bb%3A385197556&click_sum=f2c1ec3b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-43&pro=1&sts=1",
      "dateCreated": "2024-02-19T06:30:52.199672",
      "productId": "hPhGwbMaNv"
    }
  },
  {
    "data": {
      "product": "Rustic Christmas Mistletoe",
      "description": "This artificial mistletoe is perfect for Christmas party decorations, Shabby Chic Christmas decor, stocking stuffers, or hostess gifts. It is fashioned after the old vintage style and can be customized with a handmade frayed ribbon or a grosgrain bow. It can be left blank or stamped with your own words. It is ready to hang and waiting for you to pucker up underneath it! This mistletoe has been dusted in glitter. Sizes: Long & wispy: measures roughly between 7-9 inches long. Short & full: measures roughly between 5-7 inches long. Berry & pinecone placement will vary as each mistletoe is hand arranged & made to order just for you. To order: Choose bow ribbon type, color & to personalize or not. Word choice: plain (no words) or your words. If your words, we can stamp up to 25 characters including spaces. Please add your request to the personalization box or \"Add a Note\" box at checkout. Type \"BLANK\" if no words.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for Christmas decorations",
          "useCase": "Decorating their homes for the holidays"
        },
        {
          "targetAudience": "People who are looking for hostess gifts",
          "useCase": "Giving the mistletoe as a gift to someone who is hosting a Christmas party"
        },
        {
          "targetAudience": "People who are looking for stocking stuffers",
          "useCase": "Putting the mistletoe in a stocking as a gift for someone"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/85706663/rustic-christmas-mistletoe-mistletoe?click_key=29fc7b1620c914fc465ff1cc0c8fb870c11c7483%3A85706663&click_sum=d9a89805&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-44&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:31:01.927729",
      "productId": "tamFgSENxt"
    }
  },
  {
    "data": {
      "product": "French Bulldog Pillow",
      "description": "The French Bulldog Pillow is a decorative throw pillow cushion cover. The front of the cover is made from ticking fabric with horizontal stripes, while the back is made from taupe cotton. The pillow features a block print image of a black French Bulldog laying down in black fabric ink. It comes in three sizes: 14\"x14\", 16\" x 16\", or 18\" x 18\" and can be purchased as a cover only, with a poly fil pillow insert, or with a 95/5 goose down pillow insert. The print color can be customized upon request. The pillow is handmade and all block prints are carved by hand by Ecarlate Boutique.",
      "targetAudience": [
        {
          "targetAudience": "Dog owners",
          "useCase": "Decorate their homes with a pillow that represents their love for their French Bulldog."
        },
        {
          "targetAudience": "People who love French Bulldogs",
          "useCase": "Use the pillow as a gift for a friend or family member who also loves French Bulldogs."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Use the pillow to add a touch of personality to a room."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/280013394/french-bulldog-pillow-decorative-pillow?click_key=938c89213cd2072c43551efc23d712c460a8fdc1%3A280013394&click_sum=f90787e0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-45&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:31:17.591121",
      "productId": "QUZtohLbFv"
    }
  },
  {
    "data": {
      "product": "Personalized Home Ornament",
      "description": "This personalized home ornament is a thoughtful gift for new homeowners, realtors, or as a housewarming present. It features a lightweight metal key and a hand-stamped quatrefoil tag with the house number, street name, and year (default: 2024). The ornament comes packaged in an organza bag suitable for gifting.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who have recently purchased a new home",
          "useCase": "Commemorate their first holiday in their new home"
        },
        {
          "targetAudience": "Realtors who want to give a personalized gift to their clients",
          "useCase": "Celebrate the purchase of a new home"
        },
        {
          "targetAudience": "Friends and family members who want to give a thoughtful gift to someone who has recently purchased a new home",
          "useCase": "Celebrate the homeowner's new purchase and wish them well in their new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/253109971/new-home-gift-personalized-realtor-gift?click_key=a73d45e9a7b54fda1ef3f3b4dc65ef45ed70a44d%3A253109971&click_sum=8d59019e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-46&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:31:24.866246",
      "productId": "QcByAsmTaW"
    }
  },
  {
    "data": {
      "product": "YOUR CHOICE Set of Three 11x14 Literary Prints Wall Art, Living Room Art Print, Book Lover Gift for Bibliophile",
      "description": "This set of three 11x14 inch art prints is perfect for any book lover. The prints are inspired by popular authors such as Jane Austen, William Shakespeare, and Emily Dickinson, and feature bold, statement making illustrations. They are printed on premium, heavy archival paper with an elegant eggshell finish and come with a protective sleeve, backing board, and info sheet. They ship in a rigid, flat mailer, so there's no need to unroll them. They fit into standard 11x14 frames or a 16x20 frame matted to 11x14. To order your set of three prints, simply purchase this listing and indicate the author and quote for each print in the “notes” section at checkout. Some authors have multiple designs, so be sure to include the quotation to avoid delays in your order.",
      "targetAudience": [
        {
          "targetAudience": "Book lovers and bibliophiles",
          "useCase": "Decorating their homes with literary-themed artwork"
        },
        {
          "targetAudience": "Literary enthusiasts",
          "useCase": "Finding inspiration and motivation from the quotes and illustrations"
        },
        {
          "targetAudience": "People looking for unique and stylish wall art",
          "useCase": "Adding a touch of sophistication and personality to their living spaces"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/218888463/your-choice-set-of-three-11x14-literary?click_key=7c75eb4137b30e016be801ae943a2a043c04f94b%3A218888463&click_sum=874b0014&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-47&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-19T06:31:34.491243",
      "productId": "snsohxEfUa"
    }
  },
  {
    "data": {
      "product": "New home gift, Boho macrame decor, wall hanging tapestry",
      "description": "This diamond macrame design is a perfect one for all home decor styles. This lovely handmade wall hanging is a great gift idea, original and one of a kind. It is a great decor for your Living Room, Kids Room or your Bedroom. Good combination with all home decor styles retro, vintage, minimal...Width 11 inch (29cm)Height 25 inch (70cm)(70cm from the stick/dowel till the end of the fringes)Please NOTE, none of our items are coming with Dowels but you can get one from Home Depot like all our other customers. You can also try DIY stores. Express Shipping with Fedex.",
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Adding a bohemian touch to their living spaces, creating a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Gift Givers",
          "useCase": "Finding a unique and thoughtful present for housewarmings, birthdays, or special occasions."
        },
        {
          "targetAudience": "Boho-Chic Interior Designers",
          "useCase": "Incorporating the tapestry into their designs to create a warm and eclectic aesthetic."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/520013000/new-home-gift-boho-macrame-decor-wall?click_key=e64b7530ca887973ff4ae1f4891e5cfa3c717691%3A520013000&click_sum=49a04791&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-48&pro=1&sts=1",
      "dateCreated": "2024-02-19T06:31:45.446885",
      "productId": "cqFOBKbSIP"
    }
  }
]
