[
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "Handmade hanging ceiling lamp featuring a unique design with printed decoration of green leaves. Crafted from clay, this light fixture is a piece of art, suitable for living room centers and offices. The lamp comes in various colors and has a height of 17.7 inches and a diameter of 7.9 inches.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Adding a unique and stylish lighting fixture to a living room, office, or other space."
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Displaying the lamp as a piece of art in a home or gallery."
        },
        {
          "targetAudience": "People who appreciate handmade and unique items",
          "useCase": "Adding a touch of personality and style to their home with a one-of-a-kind lighting fixture."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=bbd6dcdb3b7f27cd427fa99cb073862a0ea919a0%3A724851215&click_sum=2ab64d42&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:31:55.943816",
      "productId": "EfJOyTJcIJ"
    }
  },
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "Handmade ceramic lamp with a unique design, inspired by Spanish ceramics. It features a stackable shape with ceramic prints inspired by different cultures, creating a contemporary cultural collage. The lamp is available in green, pink, and teal colors and measures 5.9 inches in height and 5.5 inches in diameter.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who appreciate unique and artistic lighting",
          "useCase": "Create a statement piece in their living room or entryway"
        },
        {
          "targetAudience": "Interior designers looking for unique and handmade pieces",
          "useCase": "Add a touch of personality and style to their client's homes"
        },
        {
          "targetAudience": "Art collectors who appreciate contemporary ceramic art",
          "useCase": "Display the lamp as a piece of art in their collection"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=8c44f5249a49cf18017d3e918affdf9f580901d4%3A654638870&click_sum=6d52ea73&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:32:03.058719",
      "productId": "HMxVfXrrfJ"
    }
  },
  {
    "data": {
      "product": "TerraCotta Lamp Hanging Light Fixture",
      "description": "Handmade terracotta lamp with natural warmth and homely feel. Includes all necessary fitting parts, E27 lamp holder, 150 cm transparent cable, 10 cm ceiling rose. Energy-saving LED light bulbs recommended, especially Edison Vintage style. Recommended voltage: 110V-250V, 25 to 40W max. Part of the Apilar collection, inspired by Spanish ceramics. Available in various colors and prints upon request. Similar models can be found on Etsy.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of warmth and hominess to their space",
          "useCase": "Using the lamp as a primary light source in a living room, dining room, or bedroom"
        },
        {
          "targetAudience": "Interior designers seeking unique and handmade lighting fixtures",
          "useCase": "Incorporating the lamp into a curated lighting scheme for a residential or commercial space"
        },
        {
          "targetAudience": "Collectors of handmade ceramics and art objects",
          "useCase": "Displaying the lamp as a decorative piece in a collection or as a statement piece in a home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=f2fd2b66ff35f26c21e9d47606dbb57170531e52%3A776223242&click_sum=e3d53b31&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:32:15.504950",
      "productId": "CdBdMLUjKt"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair",
      "description": "Unique armchair from the 1960s, professionally reupholstered with a mustard-colored fabric. Original frame has been retouched. Dimensions: Width - 22.8 in, Height - 31.4 in, Depth - 24.8 in, Seat Width - 18.1 in, Seat Height - 14.2 in. Sanded and oiled wood exposes beautiful wood grains. Vintage piece over 50 years old with preserved original shape.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers",
          "useCase": "Adding a vintage touch to their designs"
        },
        {
          "targetAudience": "Vintage furniture collectors",
          "useCase": "Adding to their collection of mid-century modern furniture"
        },
        {
          "targetAudience": "Homeowners with a mid-century modern style",
          "useCase": "Adding a comfortable and stylish seating option to their living room or den"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=4e43f9123749a3e38998c3a1b8a480f408c64374%3A712573399&click_sum=5d7eeab1&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:32:29.126326",
      "productId": "LYsvcZvAvl"
    }
  },
  {
    "data": {
      "product": "Black and White cocktail chair from the 1970's",
      "description": "This iconic piece is characteristic of the Mid-Century modern era. It has turned legs that are cone shape typically with a nude cherry finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. It is upholstered in high quality, black and white colored fabric.",
      "targetAudience": [
        {
          "targetAudience": "Mid-century modern furniture enthusiasts",
          "useCase": "Adding a touch of vintage style to their home decor"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Creating a unique and stylish space for their clients"
        },
        {
          "targetAudience": "Collectors of vintage furniture",
          "useCase": "Adding a valuable piece to their collection"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=5a0e17fcfc58963c7bd0d7ba29ab90177b224224%3A649720699&click_sum=4ec35c34&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:32:38.544987",
      "productId": "GukQUEKAhU"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade Sherpa chair mid century set, small comfy armchair for living room",
      "description": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade furniture Sherpa chair  bring a 60's Furniture feel into your home with this solid wood Mid century Armchair Upholstered in boucle teddy soft fabricOur Mid century armchair is made from solid wood and upholstered with brown faux leather.⚒ All furniture is handmade in our shop!Armchairs can be upholstered in another fabric or stained in another color, contact me for more info➤ **note for NON-EU buyers - please be aware of possible import fees and taxes, these are calculated additionally when the items are sent and these fees are collected by the delivery company and paid on your behalf to your government. The amount of these fees varies in every non-EU country.*** We are sending from Croatia which is a part of the EU - for EU buyers there are no additional fees *➤ Check out my shop for more Mid Century Vintage Furniture ➤https://www.etsy.com/shop/RetroDesignCRODimensions:• Overall height: 74 Centimeters / 29.6 inches• Overall width: 63 Centimeters / 25.2 inches• Overall depth: 70 Centimeters / 28 inches• Seat height: 40 Centimeters / 16 inches• Seat width: 50 Centimeters / 20 inches• Seat depth: 50 Centimeters / 20 inchesMaterials:• Stained Solid Beech Wood• Boucle teddy fabric• High quality furniture foam density 30*simple assembly required instructions included",
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate mid-century modern design.",
          "useCase": "Using it as a statement piece in their living room or bedroom."
        },
        {
          "targetAudience": "Interior designers looking for unique and stylish pieces to add to their clients' homes.",
          "useCase": "Incorporating it into a mid-century modern or eclectic design scheme."
        },
        {
          "targetAudience": "Collectors of vintage furniture.",
          "useCase": "Adding it to their collection of mid-century modern furniture."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=29ea2f3eae67b09122a034401ea20fc80201eb54%3A1110352719&click_sum=8bc487b3&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:32:52.060579",
      "productId": "cYSTkrHBDy"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion",
      "description": "Soft, cozy with beautiful earthy tones, the vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner. Size: 75X75 cm / 30X30 inch Height: 35 cm / 14 inch Materials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric. Care: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean. Production and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase. Custom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout. Please Read about our shipping, refunds and exchanges policies. For any thoughts or questions please send us a Message and We'll be happy to answer ASAP. Buyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value unique and stylish home decor",
          "useCase": "Using the floor cushion as a decorative piece to add a touch of elegance and whimsy to their living space."
        },
        {
          "targetAudience": "People who appreciate handmade and sustainable products",
          "useCase": "Using the ottoman as a functional piece of furniture while supporting sustainable practices."
        },
        {
          "targetAudience": "Those seeking comfort and functionality",
          "useCase": "Utilizing the pouf as a comfortable seating option for relaxation or as an ottoman for added support."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=d5c3bd0816cd3a8a7a292f62c0c157a8cf25137a%3A903050205&click_sum=485e6f41&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:33:01.684783",
      "productId": "qggHJzGbaC"
    }
  },
  {
    "data": {
      "product": "Floor Pillow | Meditation Cushion | Floor Cushion | Floor Pouf | Floor Seating | Round Floor Pillow | Square Floor Pillow | Teal Home Decor",
      "description": "These floor pillows are made with 100% woven polyester printed fabric and sewn closed with premium poly fill. They are available in two different shapes (circle and square) and two different sizes (23\" and 26\"). They are perfect for moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. They can be used on their own or stacked for even more comfort. The original print for this floor pillow was created in the design studio in Maine and the floor pillow is made to order. The pillows have a small \"X\" stitch detail in the center of the pillow, tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time, keeping your pillow plump and comfy sit after sit after sit.",
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Using the floor pillow as a decorative accent piece in their living room, bedroom, or playroom."
        },
        {
          "targetAudience": "Meditation Practitioners",
          "useCase": "Using the floor pillow as a comfortable and supportive cushion for meditation and relaxation."
        },
        {
          "targetAudience": "Families with Young Children",
          "useCase": "Using the floor pillow as a soft and safe seating option for children during play or reading activities."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=d8826a1660a44880cef0ef6eb575e9878cadf154%3A904960951&click_sum=bb8b70fe&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:33:16.433175",
      "productId": "rHWtdRfFXf"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool",
      "description": "This handmade footstool pouffe is made with durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. It is a beautiful addition to any nursery or young child's room. The knitted cover can be removed for washing and the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.",
      "targetAudience": [
        {
          "targetAudience": "Parents with young children",
          "useCase": "Provide a comfortable and stylish seating option for their child's playroom or bedroom"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Add a touch of Scandinavian style to a nursery or child's room"
        },
        {
          "targetAudience": "Families with pets",
          "useCase": "Provide a durable and easy-to-clean footstool that can withstand the wear and tear of pets"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=96112436a79e613f5d35b5d8a830e4571a7f5c18%3A266515154&click_sum=b2795a60&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:33:33.227995",
      "productId": "wPeKRitCSu"
    }
  },
  {
    "data": {
      "product": "Stroke / Brushstroke Illustrated Parian Porcelain Vase",
      "description": "This vase is perfect for displaying your favorite flowers and leafy bouquets. Its bold brushstrokes against a bright white base make it a statement piece for any room. The vase is made of Parian porcelain, which is marble smooth and delicately translucent. Each piece is polished by hand to create a silky smooth finish. The matte exterior and glossy interior add to its unique appeal. No two vases are exactly the same, as each one is handmade and individually illustrated.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts",
          "useCase": "Displaying the vase as a decorative piece in their home"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Using the vase to add a touch of elegance to a room"
        },
        {
          "targetAudience": "Florists",
          "useCase": "Using the vase to hold flowers and create beautiful arrangements"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=f454e980ef7a1727335e8ee9bf00b56c6e9d10f8%3A811521978&click_sum=aac3e77b&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:33:45.413431",
      "productId": "Simrnyrp9b"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "Handmade ceramic vase inspired by old Greek pottery, featuring a black and white triangle pattern. Made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white glaze. Fired to cone 8 (1250C) in an electric kiln. Dishwasher safe. Dimensions: 13.5cm high and 9cm wide (5.3\" x 3.5\").",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the vase as a decorative item in their homes or collections."
        },
        {
          "targetAudience": "Interior designers and decorators",
          "useCase": "Incorporating the vase into their clients' home designs to add an elegant and artistic touch."
        },
        {
          "targetAudience": "Florists and event planners",
          "useCase": "Using the vase to create unique and eye-catching floral arrangements for special occasions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=5e1754b324c28fdc06d0948aef3b9c2e3cda1157%3A986518800&click_sum=5a6fc16d&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:33:56.576263",
      "productId": "EpOXfkfJZs"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase",
      "description": "This hand-painted burlap vase is a unique and stylish addition to any home or office decor. Made with jute, burlap fabric, and a glass bottle, this vase features an abstract mosaic design in black, cream, and gold. Measuring 5\" tall with a base that is 5.5\" wide, this vase is perfect for displaying flowers or other small items. For indoor use only.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who enjoy unique and artistic home decor",
          "useCase": "Displaying the vase as a decorative piece in their living room, bedroom, or office"
        },
        {
          "targetAudience": "Art collectors who appreciate handmade and one-of-a-kind pieces",
          "useCase": "Adding the vase to their collection of unique and interesting artwork"
        },
        {
          "targetAudience": "Gift-givers who are looking for a special and meaningful present",
          "useCase": "Giving the vase as a gift to a friend, family member, or colleague who appreciates art and home decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6feda9640107085d2d4c8e6764845f9f8865a564%3A908084516&click_sum=877918f3&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:34:07.121607",
      "productId": "oPFcJQqdvs"
    }
  },
  {
    "data": {
      "product": "Cushion Covers",
      "description": "Exclusive pattern digitally designed and printed in the South of France. Handcrafted in a workshop with a limited edition design. Features a wallet closure, water-repellent and UV-resistant fabric on the face, heavy-duty 100% cotton twill on the back, slightly textured print quality, and fully overlocked on the reverse. Maintenance instructions include washing at 30°C, natural drying, no wringing, and ironing at low temperature. Shipments are by post with tracking.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate unique and exclusive home decor",
          "useCase": "Adding a touch of style and personality to their living space"
        },
        {
          "targetAudience": "People who are looking for high-quality handmade products",
          "useCase": "Supporting local artisans and adding a touch of craftsmanship to their home"
        },
        {
          "targetAudience": "People who are interested in retro or vintage-inspired design",
          "useCase": "Creating a nostalgic or eclectic atmosphere in their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4267fbc19523823bb00f050be5abbe67e613464e%3A1206357075&click_sum=e5181a2f&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:34:15.561231",
      "productId": "JQNAGuahkX"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "A vibrant and cheerful pillow featuring a colorful striped pattern woven on an antique loom by an indigenous family in Cuenca. Made from 100% hand-loomed cotton, this pillow is soft to the touch and features a hidden zipper at the bottom. Pillow insert is not included. This pillow is a reminder of the power of bright colors and inspiring stories, connecting us to a sisterhood of love and empowerment.",
      "targetAudience": [
        {
          "targetAudience": "LGBTQ individuals",
          "useCase": "To express their pride and support for the community."
        },
        {
          "targetAudience": "People who appreciate colorful and cheerful home decor",
          "useCase": "To add a touch of brightness and joy to their living space."
        },
        {
          "targetAudience": "Individuals who value handmade and ethically sourced products",
          "useCase": "To support local artisans and promote cultural heritage."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=c51efe61e21eb2ad687f6a114ebb8cac78abd714%3A566822148&click_sum=5c02316e&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:34:25.962686",
      "productId": "bvFxQnoRIE"
    }
  },
  {
    "data": {
      "product": "Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski. It's 16\" square, and is designed in Canada but made in India. Pillow form is not included.",
      "targetAudience": [
        {
          "targetAudience": "People who are interested in mid century modern design",
          "useCase": "Using this product to decorate their home with a mid century modern aesthetic"
        },
        {
          "targetAudience": "People who are looking for a colorful and stylish throw pillow",
          "useCase": "Using this product to add a pop of color and style to their couch or living room"
        },
        {
          "targetAudience": "People who are looking for a unique and thoughtful gift",
          "useCase": "Using this product as a gift for a friend or family member who loves mid century modern design or colorful home decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=a1fa1fe56d77ddc1d516a86e5352588bb16eb60c%3A1168874671&click_sum=a77e9ec2&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:34:33.335047",
      "productId": "RjCtcoCVpJ"
    }
  },
  {
    "data": {
      "product": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign",
      "description": "Customizable wooden address sign with a modern design. Available in painted or unpainted finishes. Made from high-quality baltic birch wood, the sign is durable and weather-resistant. Comes with pre-drilled holes for easy hanging. Can be personalized with your address and choice of finish color.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a modern touch to their home",
          "useCase": "Displaying the house number in a stylish and visible way"
        },
        {
          "targetAudience": "Businesses that want to improve their curb appeal",
          "useCase": "Displaying the business name and address in a professional and attractive way"
        },
        {
          "targetAudience": "People who are looking for a unique and personalized gift",
          "useCase": "Creating a custom address sign for a friend or family member"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=5ac3278d92b87e16842116bc79f6b985b171bc56%3A790049531&click_sum=d2fee15f&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:34:43.474077",
      "productId": "GXADDvEQkq"
    }
  },
  {
    "data": {
      "product": "Round Address Sign",
      "description": "The Round Address Sign is a geometrically carved design with acrylic house numbers. It is a perfect modern piece for your home address sign. These are great housewarming gifts, realtor closing gifts, or just to spruce up your front porch or door decor.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to update the appearance of their home's exterior",
          "useCase": "To replace an existing address sign or to add a new one to their home"
        },
        {
          "targetAudience": "People who are looking for a unique and stylish way to display their address",
          "useCase": "To purchase the sign as a gift for themselves or for someone else"
        },
        {
          "targetAudience": "Businesses that want to add a touch of style to their storefront or office building",
          "useCase": "To purchase the sign to use as a way to display their business's address"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=fb8d18c68750ed71292538b0a93dde2bb9aae0e2%3A1439690652&click_sum=a51df7b0&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:34:54.121230",
      "productId": "hWAnpPKhzO"
    }
  },
  {
    "data": {
      "product": "Modern Herringbone House Number Sign",
      "description": "This modern house number sign is made of high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted. The backer can be any stain or paint color shown on their color charts. The text can only be black or white. The numbers will be made to fit the sign regardless of how many numbers you order. Less numbers will be taller and centered on the sign. It comes with either a sawtooth hanger on the back or a d-ring. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a modern touch to their home exterior",
          "useCase": "Displaying their house number in a stylish and visible way"
        },
        {
          "targetAudience": "Realtors who want to give a closing gift to their clients",
          "useCase": "Providing a personalized and practical gift that adds value to the new home"
        },
        {
          "targetAudience": "People who are looking for a housewarming gift",
          "useCase": "Giving a thoughtful and unique gift that will be appreciated by the new homeowners"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=fb5a03ed64d65c1c157e136f113a148259ef280c%3A1453867189&click_sum=19c9d815&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:35:07.232077",
      "productId": "naMFfoOHmy"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath, Every Day Wreath",
      "description": "This wreath is made to order on a rustic grapevine base with artificial olives and leaves. It's perfect for double doors, and can be used indoors or outdoors in a covered or sheltered area. The wreath is approximately 18\", 22\", or 28\" (tip to tip) and is made from 14\", 18\", and 24\" natural rustic grapevines. It's great for a rustic home decoration or as a gift.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators",
          "useCase": "Adding a touch of nature and elegance to their living space"
        },
        {
          "targetAudience": "Gift givers",
          "useCase": "Expressing their appreciation for friends and family with a thoughtful and unique present"
        },
        {
          "targetAudience": "People living in areas with mild climates",
          "useCase": "Decorating their homes with a wreath that can withstand the elements both indoors and outdoors"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=3d5f8f3f04a6c494a8e02520a771904919581c03%3A630678328&click_sum=4b02089e&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:35:21.553492",
      "productId": "STNOskZfvq"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons. The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath. The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop. This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery. This wreath can be hung at any angle.",
      "targetAudience": [
        {
          "targetAudience": "A homeowner who enjoys decorating their home with natural elements and appreciates the beauty of lavender and eucalyptus.",
          "useCase": "To add a touch of rustic charm and natural beauty to their front door or porch."
        },
        {
          "targetAudience": "A gift giver who is looking for a unique and thoughtful present for a loved one who enjoys nature-inspired décor.",
          "useCase": "To give as a gift for a birthday, housewarming, or Mother's Day."
        },
        {
          "targetAudience": "A business owner who wants to create a welcoming and inviting atmosphere in their establishment.",
          "useCase": "To hang in the entryway or reception area of their shop, restaurant, or office."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=dcf3edfa922c2f66569b3c94abdff2cd9ac81022%3A962426777&click_sum=1a315c81&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:35:32.198010",
      "productId": "MfaFKvJeQM"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath",
      "description": "This classic lush year-round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand-torn ribbon. Total diameter is ~20.\"\nCan be enjoyed inside or outside year-round for curb appeal!\nHandmade in Northern, Virginia with love.\nThis item is made to order.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of rustic charm to their front door",
          "useCase": "Curb appeal and year-round decoration"
        },
        {
          "targetAudience": "Individuals who appreciate French country decor",
          "useCase": "Adding an elegant and timeless touch to their living space"
        },
        {
          "targetAudience": "Those seeking a unique and handmade piece for their home",
          "useCase": "Personalizing their living space and supporting local artisans"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=15133188b5a21788e5649f727e944a3b4e2fb9c6%3A1223343994&click_sum=b1ec6bd8&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:35:39.598563",
      "productId": "rLQKKmMaMU"
    }
  },
  {
    "data": {
      "product": "Last Name Doormat",
      "description": "The doormat is made from all-natural coir fibers, making it eco-friendly. It features a vinyl back for durability and sturdiness. It is recommended to be used in a covered area to be sheltered from the elements. Shedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help. All rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers. All mats are hand cut, so please allow for a 1 inch +/- variance in length. Doormats are .5 to .75 inches thick.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who are looking for a stylish and durable doormat",
          "useCase": "To welcome guests and protect their floors from dirt and debris"
        },
        {
          "targetAudience": "People who are looking for a personalized gift for a housewarming, wedding, or closing",
          "useCase": "To give as a thoughtful and unique gift that will be cherished for years to come"
        },
        {
          "targetAudience": "Businesses who are looking for a way to promote their brand or message",
          "useCase": "To use as a marketing tool to attract customers and create a positive impression"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=b1098f91a88060f62d43045a6b407a1bcf3ce19c%3A1168985443&click_sum=5605043b&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-18T22:35:51.097929",
      "productId": "FebdFaEKSZ"
    }
  },
  {
    "data": {
      "product": "pizza doormat",
      "description": "This hand-painted doormat is made from a durable PVC back and a natural coir front, making it perfect for both indoor and outdoor use. The coir material is extremely durable, but will last even longer if placed under an awning to protect it from the elements. Simply shake the mat to clean. The doormat measures 18\" x 30\" and is available in a variety of designs. Custom designs are also available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Pizza enthusiasts",
          "useCase": "Adding a whimsical touch to their doorstep and welcoming guests with a shared passion for pizza."
        },
        {
          "targetAudience": "Homeowners seeking unique housewarming gifts",
          "useCase": "Gifting a thoughtful and practical item that adds a touch of personality to a new home."
        },
        {
          "targetAudience": "Wedding planners and guests",
          "useCase": "Selecting a memorable and useful gift for the happy couple, symbolizing their shared love for pizza and creating a welcoming atmosphere in their new home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=b653ff16f1cf704c6711daa768004b22d5b98e33%3A612462127&click_sum=657a7a13&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:36:04.067002",
      "productId": "xklhLwMQOx"
    }
  },
  {
    "data": {
      "product": "Custom Last Name Retro Doormat",
      "description": "Personalized welcome doormat made of high quality 100% coir, hand-painted with outdoor industrial paint with UV protection, backed with a slip-resistant sturdy PVC rubber backing, available in various sizes, 1 inch thick, suitable for covered areas, requires minimal care, returns not accepted due to wear or fading, flawed doormats available at a discounted price with final sales, unique with potential variations in color and texture, custom orders welcome.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who own homes and are interested in personalizing their décor",
          "useCase": "Use the doormat to welcome guests and add a touch of personal style to their home"
        },
        {
          "targetAudience": "People who are looking for a unique and thoughtful housewarming gift",
          "useCase": "Gift the doormat to someone who has recently moved into a new home"
        },
        {
          "targetAudience": "Businesses that want to create a welcoming and branded environment for their customers",
          "useCase": "Place the doormat at the entrance of their business to create a positive first impression"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=7b62c1a9518ecbf5a51ab11b13e591e12439e35f%3A1183106995&click_sum=edea5b44&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:36:13.535673",
      "productId": "PhuVkQO3LG"
    }
  },
  {
    "data": {
      "product": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign",
      "description": "This adorable WELCOME sign will add a colorful touch to your front door is our latest design, capturing the trendy floral designs so prevalent in today's decor. The sign is made of solid wood with painted on letters.\n\n✔HAND PAINTED on letters, NOT VINYL STICKERS SO LETTERS WILL NOT CURL WITH AGE and NOT SPRAY PAINTED SO YOU DON'T GET THE FUZZY EDGES\n✔SPACING & CENTERING ACCURACY: NEW AND IMPROVED!\n✔Distressed look\n✔CAN BE HUNG ON A WALL (SEE \"CUSTOM OPTIONS\" SECTION BELOW)\n✔GREAT AS A GIFT! We're happy to insert a card with a personal note from you. Just let us know what you would like it to say!\n✔MADE IN USA\n✔CUSTOM ORDERS ACCEPTED!\n\n⭐️⭐️⭐️⭐️⭐️ 5 STAR RATINGS! People say: \"Love it\", \"Beautiful\", \"Very well done\", \"Just like the pictures\", \"She loves it!\"\n\n✎ADDITIONAL DETAILS:\nPRODUCT DESCRIPTION\nThis adorably delightful WELCOME sign will add a charming touch to your front door. The sign is made of solid wood with painted on letters, highly durable and it looks great! Our top seller is our 5' x 10\" sign. Check out our reviews! We stain and then give it a distressed and rustic look. Please note, these signs are indeed RUSTIC, and are made one-by-one to that effect which means that each piece has some variation. The distressed look means that the painted letters are given an \"aged\" look. Please review all of the photos and note that parts of the letters have \"aged\" away giving a partly \"erased\" or \"smudged\" look, perhaps even creating some asymmetry in the letters, as well as some color variation in the stain. Given that distressing is done on each piece individually each piece is unique, so expect some slight variation from the model pictured.\n\n✔CHECK OUT THE PHOTOS TO SEE MORE DETAILS.\n\nSPACING & CENTERING ACCURACY: We've made & sold over 15,000 Welcome Signs and one of the things we've been striving for is more precision in the spacing and centering of the letters on our signs. We've invested in new technology and tools that allow us to finely tune the spacing and centering of the letters on our signs so you can be sure that when you receive one of our signs it doesn't look off center or have spacing errors between the letters.\n\nSIZES\nRead our sizes as Height x Width. So if it is a 5' x 10\" sign when reading the measurements the first figure is the height, so 5 feet, and the second number is the width, so 10 inches (technically 9 1/4\" in lumber measurements).  This WELCOME sign comes in 4 sizes!  5 feet x 9 1/4\" , 4 feet by 6 1/2\", 3 feet by 5.5\" inches, and 2 feet by 5.5 inches wide.\n\nHOW TO USE IT\nYour new solid wood welcome sign can be placed anywhere you like by simply resting it back against something as pictured  (For a long life we keep it in a covered location such as a porch with an awning, etc.). Most folks place them near their front door, on a porch, a patio, a deck, walkway or even in a guest room.  If you would like a freestanding sign it is possible to attach a stake on the back and stake it into the ground.\n\nPRODUCT CARE\nWe use one of the most expensive and most durable paints available. This ensures the durability of your sign.  However, like anything exposed to the natural elements (sun, wind, water, etc.) it will wear. We recommend that you place this sign in a covered location, such as a covered porch area.\n\n***WHEN YOU PLACE YOUR ORDER PLEASE DOUBLE CHECK YOUR ADDRESS AND THE COLOR & SIZE YOU SELECTED IN YOUR ORDER. THIS IS IMPORTANT AND WILL HELP YOU AVOID UNNECESSARY SHIPPING CHARGES.\n\nBROWSE OUR SHOP\nSee our other stuff:\nhttps://www.etsy.com/shop/NativeRange\n*Native Range, LLC",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who value curb appeal and a welcoming atmosphere",
          "useCase": "Displaying the sign on their front porch or entryway to create a warm and inviting first impression for guests and visitors"
        },
        {
          "targetAudience": "Individuals seeking a rustic and decorative touch for their home décor",
          "useCase": "Incorporating the sign into their living room, dining room, or bedroom to add a touch of farmhouse charm and warmth"
        },
        {
          "targetAudience": "Business owners looking to enhance the ambiance of their establishment",
          "useCase": "Placing the sign near the entrance of their store, restaurant, or office to welcome customers and create a sense of belonging"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=950c45282fcb043b54892ca907f815fbc7d84844%3A775841802&click_sum=b51ef572&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-18T22:36:35.913608",
      "productId": "qwDfhIFpCE"
    }
  },
  {
    "data": {
      "product": "large wooden porch vases, welcome sign, reclaimed wood, rustic, floor vases, farmhouse decor, large floor vase,  porch decor, set of 2",
      "description": "This set of 2 large wooden porch vases is a unique farmhouse and porch decor that will welcome your guests to your home. It is made from reclaimed wood that has been sanded and stained gray, and it has a welcome sign and rustic vases all in one. The large vase measures 24\" x 6 and the smaller one measures 18\" x 6\". It is recommended to fill it with large stems or branches for a beautiful eye-catching entry.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a rustic touch to their porch or living room",
          "useCase": "Using the vases as a decorative accent to welcome guests and enhance the overall ambiance of their home"
        },
        {
          "targetAudience": "Individuals seeking unique and eye-catching entryway decor",
          "useCase": "Filling the vases with large stems or branches to create a visually appealing focal point at the entrance of their home"
        },
        {
          "targetAudience": "Homeowners with a farmhouse or rustic aesthetic",
          "useCase": "Incorporating the vases into their existing decor to complement the warm and inviting atmosphere of their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=7ad9a23df887e29d4d643325b5ee7a1285b6b7db%3A511215666&click_sum=70e7cf2c&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:36:45.437117",
      "productId": "CDSZPMggxc"
    }
  },
  {
    "data": {
      "product": "Family Name Welcome Sign",
      "description": "Made with 18 gauge steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. Add a touch of elegance to your home on the inside, outside, or both!Each sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.",
      "targetAudience": [
        {
          "targetAudience": "Newlyweds",
          "useCase": "Welcome sign for their new home"
        },
        {
          "targetAudience": "Families",
          "useCase": "Decorative sign for their home, displaying their family name"
        },
        {
          "targetAudience": "Housewarming gift givers",
          "useCase": "Personalized and meaningful gift for new homeowners"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=2975da989550db39ffbf25daa16b8f0caf0b64a6%3A1095987590&click_sum=80a6bef0&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:37:01.922059",
      "productId": "KYnRmugJgO"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911",
      "description": "The Black Shade Wall Sconce is a utility style sconce that is perfect for any room. It features a gloss black finish 10inch shade with a white interior and a key switch on the socket for easy on/off operation. The shade tilt is adjustable from 90 to 180 degrees. The sconce is UL listed and thoroughly tested before leaving the shop. It is compatible with a dimmer switch and can be installed directly into the wall or customized as a plug-in fixture. The recommended bulb is an LED Edison 7w (60w) and the sconce is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts. Dimensions: Height: 10\", Width: 10\", Depth: 12.5\", Shade Height: 3.25\", Shade Width: 10\", Wall Canopy: 5\", Clearance From Wall: 2\".",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking to add a stylish and functional lighting solution to their bedroom",
          "useCase": "Bedside lighting"
        },
        {
          "targetAudience": "Home decorators seeking to enhance the ambiance of a room",
          "useCase": "Accent lighting or wall decor"
        },
        {
          "targetAudience": "Professionals in need of durable and adjustable lighting for a workspace",
          "useCase": "Desk or reading light"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=f40e0d5e59fce4acbb85f4c063463934343eedb3%3A615762911&click_sum=4daef902&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:37:15.233928",
      "productId": "bpUPSihqNf"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern",
      "description": "The Outdoor Modern Wall Lantern is a contemporary and minimalist European lantern design with sleek integrated LED that provides an ample amount of light. This wall sconce creates a distinct yet tasteful appearance wherever you choose to install. It is made of sturdy die-cast aluminum and sealed with a weather-proof coating that will ensure the longevity of your fixtures. The fixture is suitable for wet locations and all climates. The integrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours. The fixture is easy to install and can be installed with 3 steps in less than 10 minutes.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who are looking for a modern and stylish way to update their exterior lighting.",
          "useCase": "Installing this wall lantern on the exterior of their home to provide ambient lighting and add a touch of sophistication to their curb appeal."
        },
        {
          "targetAudience": "Business owners who want to create a welcoming and inviting atmosphere for their customers and employees.",
          "useCase": "Installing this wall lantern in commercial spaces such as restaurants, office buildings, and multi-use buildings to provide functional illumination and enhance the overall ambiance."
        },
        {
          "targetAudience": "Architects and designers who are looking for a durable and energy-efficient lighting solution for their projects.",
          "useCase": "Specifying this wall lantern in new construction or renovation projects to meet the lighting needs of their clients while ensuring longevity and cost-effectiveness."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=a57f3ec672232f8b5fdf5046add089a76289575c%3A1165269880&click_sum=dc68bd1d&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:37:24.861596",
      "productId": "ChNFwufXKC"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce",
      "description": "The modern farmhouse wall sconce features a hand-spun matte finish porcelain enamel coated shade with multiple finish options. The raw brass finish features solid unfinished brass that will age and patina over time, giving it a soft natural look. Other finish options include black, brushed nickel, polished nickel, and antique brass. The lamp is UL listed and thoroughly tested before leaving the shop. It requires a standard medium base (e26/e27) bulb and is compatible with incandescent, LED, compact fluorescent, or any other standard E26 base bulb up to 60 watts. The dimensions are as follows: height 9\", width 7\", depth 10\", shade height 4.25\", shade width 7\", and clearance from wall 2.55\". The light fixture is compatible with a dimmer switch and can be customized with an on/off switch or made into a plug-in fixture. It is recommended to use LED bulbs only to keep the lamp temperature cool.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who are looking for a stylish and functional wall sconce for their home.",
          "useCase": "Using the sconce as a light source in a living room, bedroom, or hallway."
        },
        {
          "targetAudience": "Interior designers who are looking for a unique and eye-catching light fixture for their clients' homes.",
          "useCase": "Using the sconce as a decorative element in a living room, dining room, or bedroom."
        },
        {
          "targetAudience": "Businesses who are looking for a durable and stylish light fixture for their commercial space.",
          "useCase": "Using the sconce as a light source in a restaurant, retail store, or office."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=a52d9d3d166dfc474a9c68e330a061f6f665e7d9%3A1051791566&click_sum=f221e642&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:37:38.413858",
      "productId": "tuLqtXilcl"
    }
  },
  {
    "data": {
      "product": "Linen bedding set",
      "description": "The linen bedding set is made from 100% organic, enzyme-washed flax fabric. It is soft, durable, and has antibacterial, antistatic, and hygroscopic properties. The set includes one duvet cover and two pillowcases. It is available in a variety of sizes and colors. The set is also hypoallergenic, thermoregulating, and breathable. It is ethically made in Lithuania.",
      "targetAudience": [
        {
          "targetAudience": "People who value sustainability and quality",
          "useCase": "Replace their current bedding with a more eco-friendly and durable option."
        },
        {
          "targetAudience": "People who are looking for luxurious and comfortable bedding",
          "useCase": "Upgrade their sleep experience with high-quality linen bedding."
        },
        {
          "targetAudience": "People who want to add a touch of style to their bedroom",
          "useCase": "Incorporate the bedding into their home décor to create a more inviting and stylish space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=ebbf765b750b9cab1137733f9e17cdc6a4dac848%3A1316603667&click_sum=47137b9d&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:37:46.316990",
      "productId": "KgqWbdzGRn"
    }
  },
  {
    "data": {
      "product": "Linen Pillowcase",
      "description": "Pure 100% Linen pillow cover provides maximum comfort due to its natural qualities, promoting better sleep. It comes in various sizes (King, Queen, Standard, Euro), has an envelope closure type, and is available in Almon color. The extra soft linen fabric is Oeko Tex 100 certified and made in Lithuania. It can be paired with almond sheets and a beige duvet cover. Custom sizes are available upon request. The actual colors may vary slightly due to different monitor display capabilities. Care instructions include washing at or below 60 C/140F, avoiding bleach, tumble drying on low heat, ironing on low heat, and not dry cleaning. Worldwide shipping options are available, with standard shipping taking 5-15 business days to Europe and 9-21 business days overseas, and express shipping taking 2-4 business days worldwide (phone number required for express shipping). Overall, the linen pillowcase offers comfort, quality, and customization options, making it a desirable choice for a comfortable and stylish sleep experience.",
      "targetAudience": [
        {
          "targetAudience": "People who value comfort and quality sleep",
          "useCase": "Using the pillowcase to enhance their sleep experience and improve their overall well-being."
        },
        {
          "targetAudience": "Individuals who appreciate natural and sustainable materials",
          "useCase": "Incorporating the pillowcase into their bedding as a way to create a more eco-friendly and healthier sleep environment."
        },
        {
          "targetAudience": "Homeowners looking to add a touch of style and elegance to their bedrooms",
          "useCase": "Using the pillowcase as a decorative element to complement their existing decor and create a more inviting and stylish sleeping space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=2e8c84a390a3842e81021efb78371ec0a8a77302%3A1295727796&click_sum=abdbacf3&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:37:56.721025",
      "productId": "ZrURmqgcqX"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes",
      "description": "This linen bedding set is made from 100% OEKO-TEX certified linen, which means it is free of harmful chemicals and safe for human use. The duvet cover is durable, and its texture improves with time. The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance. The pre-washed linen collection has a special stone wash finish, making the fabric soft yet very strong and long-lasting. Custom orders are accepted, and the bedding can be beautifully packed as a gift.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value sustainable and eco-friendly products",
          "useCase": "Using the linen bedding set as part of a sustainable lifestyle, appreciating its organic and biodegradable nature."
        },
        {
          "targetAudience": "People with sensitive skin or allergies",
          "useCase": "Utilizing the hypoallergenic and thermoregulating properties of linen to ensure comfortable and restful sleep."
        },
        {
          "targetAudience": "Homeowners and interior designers seeking luxury and durability",
          "useCase": "Incorporating the linen bedding set into their home decor for its timeless aesthetic, durability, and ability to improve over time."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=25e54bf9b762d49e8b6651ef3de9ece1312d8bbb%3A1066602418&click_sum=8159b3bf&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:38:11.043871",
      "productId": "RdIEYlewQl"
    }
  },
  {
    "data": {
      "product": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration",
      "description": "Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life.- INTERIOR II -This print is available in three optional sizes:A4 - 9” x 12” (21 x 29.7 cm)A3 - 11.7\" x 16.5\" (29.7 x 42 cm)A2 - 16.5\" x 23.4\" (42 x 59.4 cm)Each print is signed and including a white border for framing.Important note: The frame is not includedThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers",
          "useCase": "Decorating client spaces with unique and modern art prints."
        },
        {
          "targetAudience": "Homeowners with a modern or contemporary aesthetic",
          "useCase": "Adding a touch of sophistication and style to their living spaces."
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Expanding their collections with unique and limited-edition prints."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=e87754ed665cac6185cb2b70a2fbbabee46555ab%3A576508683&click_sum=02bb0a07&ref=stl_listing-1",
      "dateCreated": "2024-02-18T22:38:21.231119",
      "productId": "cMEpSycRfK"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting",
      "description": "This is a digital download of two high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7. This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.\n\nThis is a mid century modern, fine art print, contemporary art print, abstract art style, mid century poster, midcentury art print, abstract print file, fine art print for sale online, entrance wall art, apartment wall decor, printable guest room, printable women gift, downloadable art prints.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in modern and contemporary art",
          "useCase": "Decorating their homes or offices with stylish and unique artwork"
        },
        {
          "targetAudience": "Interior designers and decorators",
          "useCase": "Creating aesthetically pleasing spaces for their clients"
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Adding to their collections of abstract and minimalist art"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=9a377e301fc36d7d7cac47afa6d877c9588fe8a9%3A834853057&click_sum=20dbb497&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-18T22:38:33.366234",
      "productId": "cGsMuBUGZv"
    }
  },
  {
    "data": {
      "product": "Dip dye tapestry",
      "description": "This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel. This piece is a made to order item, so feel free to contact me if you would like to order this piece in a different size or colour. Each wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style. Please note slight colour variations may occur.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who are interested in bohemian or eclectic home decor",
          "useCase": "Using the tapestry as a wall hanging to add a touch of color and texture to their living space."
        },
        {
          "targetAudience": "Renters or individuals who live in temporary housing",
          "useCase": "Using the tapestry as a temporary wall covering to add a personal touch to their space without making permanent changes."
        },
        {
          "targetAudience": "Individuals who are environmentally conscious",
          "useCase": "Using the tapestry as a way to incorporate recycled materials into their home decor."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=537491880fab15bc7d04f151e40fd31d5c9e2590%3A991191051&click_sum=89852432&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:38:42.072327",
      "productId": "LuUJfsxKMO"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "The Bubble Cube Shaped Candle is a unique and beautiful candle that is perfect for home decor or as a gift. It is made from natural soy wax and pure white beeswax, and is available in a variety of scents. The candle is hand-poured and has a burn time of up to 2 hours. It is important to keep the candle away from drafty areas and to trim the wick to 1/8\"-1/4\" before each use.",
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "As a unique and aesthetically pleasing decoration for their homes."
        },
        {
          "targetAudience": "Gift Givers",
          "useCase": "As a thoughtful and handmade gift for friends, family, or loved ones for various occasions."
        },
        {
          "targetAudience": "Aromatherapy Enthusiasts",
          "useCase": "To create a relaxing and fragrant ambiance in their homes using the available scents."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=89dd3b2faa1ecaa79386a47c51c839cd946226da%3A774551709&click_sum=f42d887e&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:39:05.829014",
      "productId": "iSFqoxnQvt"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle",
      "description": "Hand-poured soy candle with a Peruvian palo santo wood scent blended with top notes of neroli and saffron, hints of cedarwood, amber, and moss. Made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks. Burn time approximately 45-50 hours. Trim the wick to about 1/4\" before each use.",
      "targetAudience": [
        {
          "targetAudience": "People who enjoy earthy and masculine scents",
          "useCase": "To create a relaxing and inviting atmosphere in their home"
        },
        {
          "targetAudience": "People who are looking for a high-quality, natural candle",
          "useCase": "To use as a gift or to enjoy themselves"
        },
        {
          "targetAudience": "People who are interested in sustainable products",
          "useCase": "To reduce their environmental impact"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=f375963ae83beb6383c44fe416d0e93ab8691d07%3A785763623&click_sum=839a6608&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:39:13.408048",
      "productId": "pXtsiEVWMs"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle",
      "description": "This candle is made with 100% natural soy and essential oils, and is scented with cypress, hinoki, and grapefruit. It is said to create an atmosphere of clarity and tranquility, and is perfect for use when you need to clear your head or relax. The candle is also vegan, USA made, and hand-poured in Rhode Island. It burns for up to 50 hours and comes in a 3.5\" high x 2.5\" wide vessel.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking clarity and awareness",
          "useCase": "Using the candle during meditation or yoga practices to promote mental clarity and focus."
        },
        {
          "targetAudience": "Those interested in aromatherapy and its potential therapeutic benefits",
          "useCase": "Inhaling the candle's aroma to experience the calming and uplifting effects of Hinoki, Cypress, and Grapefruit essential oils."
        },
        {
          "targetAudience": "Individuals who value sustainable and eco-friendly products",
          "useCase": "Appreciating the candle's 100% natural ingredients, vegan composition, and hand-poured production in Rhode Island."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=28c8e9a0bfbc67aae9bcdc4f179e0b5ef43b6ba7%3A879866486&click_sum=5cf5beff&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-18T22:39:29.586385",
      "productId": "FuCCpEHIeP"
    }
  },
  {
    "data": {
      "product": "Small Wooden Stool",
      "description": "Scandinavian decor with a minimalist design and natural wood finish. Versatile and can fit into any space. Manufactured from plywood produced by one of the biggest plywood suppliers in the world based in Finland. Finished with a natural hard wax oil. Weight limit is 120kg. Can change the size, material, surface treatment. Easy to assemble in 5 minutes.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate Scandinavian design and minimalist aesthetics.",
          "useCase": "Use the stool as a side table, plant stand, or footrest in their living room or bedroom."
        },
        {
          "targetAudience": "Homeowners or renters looking for a versatile and stylish piece of furniture.",
          "useCase": "Incorporate the stool into their existing décor or use it as a standalone accent piece in a small space."
        },
        {
          "targetAudience": "Businesses or creative professionals seeking a unique and functional addition to their office or studio.",
          "useCase": "Utilize the stool as a display stand for products or artwork, or as a comfortable seating option for clients or guests."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=72f8980b430ffdc539267b26e424e22381b7c4d4%3A570862928&click_sum=2b329283&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:39:46.994964",
      "productId": "gVHTtEcHxu"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.The stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.This collection combines the use of a natural material and simple forms.Collection: Furniture CollectionMaterial: Natural CorkDimensions:Cork stool #1 - Ø 30 x H 39 cmCork stool #2 - Ø 32 x H 45 cmYear: 2020Care instructionsYou should:> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;You should not:>clean it with any type of chemical and abrasive product;> place hot or sharp objects on the surfaces;> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years;",
      "targetAudience": [
        {
          "targetAudience": "Environmentalists",
          "useCase": "Cork is a sustainable and renewable resource, so these stools would appeal to people who are interested in living an eco-friendly lifestyle."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "The stools' simple and versatile design makes them a good choice for a variety of interior design styles. They could be used in a living room, bedroom, or even a commercial space."
        },
        {
          "targetAudience": "People who live in small spaces",
          "useCase": "The stools' small size makes them a good option for people who live in small apartments or houses."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=ad49ac18924f04d5bcbe0568a447071a045f1240%3A793579884&click_sum=f5151a0f&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:39:56.258782",
      "productId": "MhkeRxWGoM"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "This stool is a versatile piece of furniture that can be used as an end table, side table, stool, or plant stand. It is handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels. The stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow. It is available in two sizes and a variety of colors. Custom colors and sizes are also available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking for a stylish and functional piece of furniture",
          "useCase": "Using the stool as an end table, side table, or plant stand"
        },
        {
          "targetAudience": "Interior designers looking for a unique and eye-catching piece to add to a space",
          "useCase": "Using the stool as a decorative accent piece or as a functional piece of furniture"
        },
        {
          "targetAudience": "Businesses looking for a durable and stylish piece of furniture for their office or waiting room",
          "useCase": "Using the stool as a seating option or as a side table"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=f77ba6d3a671595059911d4a88e7b742ce4004f4%3A1198929077&click_sum=6b4d7b98&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:40:13.925180",
      "productId": "UyTtcwswal"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "The Coiled planter is designed to enhance the beauty of plants. It features a bauhaus/Japanese style and comes with a drainage hole and three \"feet\" for stability. The planter is available in various sizes to accommodate different plant sizes and comes in a matte finish. It is made from a plant-based bioplastic eco-friendly material, ensuring durability and sustainability. The natural wood and black wood matte finish options incorporate real recycled wood, adding a unique touch to the design.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts",
          "useCase": "Displaying and showcasing their favorite plants in a stylish and modern way."
        },
        {
          "targetAudience": "Interior decorators",
          "useCase": "Incorporating the planter into their designs to add a touch of nature and style to various spaces."
        },
        {
          "targetAudience": "Homeowners and apartment dwellers",
          "useCase": "Adding a touch of greenery and beauty to their living spaces with a planter that complements their existing decor."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=79eaedb1d3461c15080dda471887639e8953fefa%3A865339439&click_sum=4b75e813&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-18T22:40:29.186663",
      "productId": "Dyv6hSsJFW"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter / Metal Plant Pot / Brass Planter Stand / Gold and Pink",
      "description": "The Nude Pink and Brass Metal Floor Planter is a stylish and functional way to display your plants. Made from brass and aluminum with a static paint finish, this planter is durable and easy to clean. The pot diameter is 20cm, the total height is 30cm, and the brass stand height is 18cm. The planter is suitable for all house plants, and it can be rotated to any direction on its brass stand. The perforated separator inside collects excessive water to prevent root damage, and plants can also be placed with their pots inside. Please note that the plants in the photographs are for visual purposes only and are not included with the product.",
      "targetAudience": [
        {
          "targetAudience": "Individuals with a modern and stylish home decor aesthetic who appreciate the combination of natural and metallic elements.",
          "useCase": "Displaying indoor plants in a visually appealing and functional way, adding a touch of elegance and sophistication to their living spaces."
        },
        {
          "targetAudience": "Plant enthusiasts who are looking for a unique and stylish way to showcase their plant collection.",
          "useCase": "Creating a focal point in their homes by displaying their favorite plants in the Globe Planter, allowing them to enjoy the beauty and benefits of greenery while adding a touch of personality to their space."
        },
        {
          "targetAudience": "Individuals who are looking for a practical and versatile planter that can accommodate different plant sizes and shapes.",
          "useCase": "Growing and displaying a variety of indoor plants, from small succulents to larger ferns, in the Globe Planter's adjustable pot and perforated separator, ensuring proper drainage and root health."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=fa38c6c790c419b886b1b7789b1c61035f01a2c5%3A728731403&click_sum=c5bbe507&ref=stl_listing-2",
      "dateCreated": "2024-02-18T22:40:39.321299",
      "productId": "lyUkGtRRMA"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter",
      "description": "This handmade stoneware planter features intricate hand-carved tile patterns in vibrant red and pink hues. Its small size (approx. 2.5\" height x 3\" diameter) makes it ideal for housing small cacti or succulents. A small drainage hole at the bottom ensures proper water management for your plants.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who enjoy growing small plants such as cacti and succulents",
          "useCase": "Displaying and growing small plants in a stylish and decorative manner"
        },
        {
          "targetAudience": "Individuals looking for unique and handmade home decor items",
          "useCase": "Adding a touch of artistic flair and personalization to their living spaces"
        },
        {
          "targetAudience": "People seeking sustainable and environmentally friendly homeware products",
          "useCase": "Using a planter made from durable and natural materials, reducing waste and promoting eco-consciousness"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=6c82fe82721e65ca169172bb56335ded416f729b%3A1435558019&click_sum=2a0ef4d1&ref=stl_listing-3",
      "dateCreated": "2024-02-18T22:40:47.589527",
      "productId": "AfUZaedfGX"
    }
  },
  {
    "data": {
      "product": "Personalized Engraved Working Compass with Custom Handwriting",
      "description": "This custom engraved compass is made from top quality solid brass, and is durable for outdoor use. It can be engraved on the front, back, and inside with a photo, name, initials, text, your own handwriting text, symbol, or logo. It is a perfect personalized gift for any occasion, such as an anniversary, birthday, or graduation.",
      "targetAudience": [
        {
          "targetAudience": "Men who are interested in personalized gifts, particularly those with sentimental value.",
          "useCase": "Gift for a husband, boyfriend, father, or other male figure for occasions such as anniversaries, birthdays, or Father's Day."
        },
        {
          "targetAudience": "Individuals who appreciate unique and meaningful accessories.",
          "useCase": "Personal use as a keepsake or a conversation starter."
        },
        {
          "targetAudience": "Outdoor enthusiasts and adventurers.",
          "useCase": "Functional use as a navigational tool during hiking, camping, or other outdoor activities."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/264013568/personalized-engraved-working-compass?click_key=0904e1d75e2a112e460a5760e8a7440a0138185a%3A264013568&click_sum=ad7b3241&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-1&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:40:56.421126",
      "productId": "OxTu1sX3eK"
    }
  },
  {
    "data": {
      "product": "Personalized Printed Wood Family Name Sign",
      "description": "A custom-made wall art piece featuring your family name printed in a sophisticated font on a high-quality wooden plaque. This personalized family name sign makes for a perfect gift for new homeowners, newlyweds, or for those looking to commemorate a family name. The sign is easy to hang and versatile, making it suitable for a variety of rooms including living rooms, dining rooms, family rooms and more. Each sign is meticulously crafted with the utmost care and attention to detail, ensuring both its beauty and durability. With its natural wooden grain, this sign adds a touch of rustic charm to your home.",
      "targetAudience": [
        {
          "targetAudience": "Newlyweds",
          "useCase": "Commemorating their new family name"
        },
        {
          "targetAudience": "New homeowners",
          "useCase": "Personalizing their new home with a unique piece of wall art"
        },
        {
          "targetAudience": "Families looking to commemorate their name",
          "useCase": "Creating a timeless keepsake that can be passed down through generations"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385848388/personalized-printed-wood-family-name?click_key=0f155ee89234aea6eab6fd936a7ef8f729610e8b%3A385848388&click_sum=51ba4186&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-2&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:41:05.280518",
      "productId": "aqODxAMjcB"
    }
  },
  {
    "data": {
      "product": "Personalized Driftwood Sign",
      "description": "This engraved personalized driftwood sign is perfect for a housewarming gift, wedding gift, Christmas gift, anniversary gift, or gift for the family with a cottage, lake house, shore house, cabin, or beach house. It is hand engraved on a unique piece of driftwood and is drilled and strung with durable twine for hanging. In addition to your custom coordinates, your personalized sign includes an engraved arrow compass. Multiple size options are available, and custom requests are welcome.",
      "targetAudience": [
        {
          "targetAudience": "Couples",
          "useCase": "Personalized housewarming gift for a new home or anniversary celebration."
        },
        {
          "targetAudience": "Families",
          "useCase": "Sentimental gift for a family cottage, lake house, or vacation home."
        },
        {
          "targetAudience": "Travel enthusiasts",
          "useCase": "Memorable keepsake to commemorate special travel destinations or adventures."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/256801592/personalized-driftwood-sign-longitude?click_key=ed5b4458bbe4d2db5f21627f7d8605bc24aacc91%3A256801592&click_sum=286851fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-3&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:41:11.552439",
      "productId": "gdTPOsPcUK"
    }
  },
  {
    "data": {
      "product": "Large Piggy Bank",
      "description": "This large piggy bank is made of ceramic and is available in a variety of colors, including white matte, black matte, pink matte, yellow glossy, and turquoise glossy. It is 8\"x8\"x6\" and weighs only 27 ounces. It has a wooden snout that is durable and easy to pull out. The piggy bank is handmade in Tel Aviv within 1-2 weeks and is packed in a gift box that protects the item from breaking.",
      "targetAudience": [
        {
          "targetAudience": "Parents of young children",
          "useCase": "Teaching their children about saving money and financial responsibility."
        },
        {
          "targetAudience": "Adults who want to save money for a specific goal",
          "useCase": "Setting aside money for a down payment on a house, a new car, or a vacation."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Adding a touch of whimsy and sophistication to a room's décor."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/512748060/large-piggy-bank-black-white-piggy-bank?click_key=45b429c1570f76883d531f60910d2be1386223f8%3A512748060&click_sum=22c2be1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-4&pro=1",
      "dateCreated": "2024-02-18T22:41:18.949763",
      "productId": "ROgjfpZqhr"
    }
  },
  {
    "data": {
      "product": "Engraved Compass",
      "description": "This custom engraved compass is made from top quality solid brass, and durable for outdoor use. It has a diameter of 1.96 inches and comes with a chain. The compass can be engraved with up to 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side. The engraving can be anything you want, including a photo, name, initials, text, your own handwriting text, symbol, or logo. This engraved compass is a perfect personalized gift for a husband, boyfriend, father, or friend. It is a unique and unforgettable keepsake that will be cherished for years to come.",
      "targetAudience": [
        { "targetAudience": "Men", "useCase": "Anniversary gift" },
        { "targetAudience": "Groomsmen", "useCase": "Personalized gift" },
        {
          "targetAudience": "Hikers and campers",
          "useCase": "Functional and stylish compass"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=d72a52ceab3decaaa5fb5164a9dc6da3f8841b61%3A214526797&click_sum=8c47a93f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-5&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:41:28.104468",
      "productId": "FgCNewIOfB"
    }
  },
  {
    "data": {
      "product": "Giant Wall Hanging Poppy Set of 3 Red Metal Flowers",
      "description": "This set of 3 wall hanging poppies is made from welded plate steel and features a small hanger welded to the back for easy securing. The set includes 2 smaller poppies measuring 6 inches wide by 6 inches tall and 1 large poppy measuring 12 inches tall and 12 inches wide. These flowers are designed to add color and beauty to outdoor spaces such as patios and privacy fences.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add color and style to their outdoor spaces",
          "useCase": "Hanging the poppies on privacy fences, patios, or sheds to enhance the aesthetic appeal of their property"
        },
        {
          "targetAudience": "Gardeners and plant enthusiasts",
          "useCase": "Incorporating the poppies into their gardens or greenhouses as unique and eye-catching decorative elements"
        },
        {
          "targetAudience": "Artists and designers seeking inspiration",
          "useCase": "Using the poppies as a source of inspiration for their own creative projects or as a decorative accent in their studios or workspaces"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/523854497/giant-wall-hanging-poppy-set-of-3-red?click_key=a72ceed10513ab10499c1339cb25983666a08ada%3A523854497&click_sum=a9ea3e74&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-6&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:41:37.913156",
      "productId": "vBrrb9GheB"
    }
  },
  {
    "data": {
      "product": "Wedding Marquee Lights | Light up Names | Wedding Lights Decor | 12 Inch Marquee Letter Lights | Personalized Name Light | Light up Letters",
      "description": "These modern & contemporary marquee letters are sure to make a statement at your special occasion! \n\nItem Details:\n-White LED Marquee Metal Marquees\n-Marquees stand 12\" tall\n-2 openings on the back of each letter so it can be hung up\n-Available in letters A-Z, numbers and the \"&\" sign\n-On/Off switch\n-Cordless\n-Requires 2 AA batteries (not included)\n-Indoor use only",
      "targetAudience": [
        {
          "targetAudience": "Couples planning a wedding",
          "useCase": "Decorating their wedding venue with personalized name lights"
        },
        {
          "targetAudience": "Parents planning a baby shower",
          "useCase": "Creating a unique and memorable centerpiece for their baby shower"
        },
        {
          "targetAudience": "Individuals planning a birthday party",
          "useCase": "Adding a personalized touch to their birthday party decorations"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/536408395/wedding-marquee-lights-light-up-names?click_key=6d5b901fad6e742d16b200ac0eb8793697fda8a0%3A536408395&click_sum=24e98f90&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-7&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:41:46.390171",
      "productId": "bTaeyIOK9G"
    }
  },
  {
    "data": {
      "product": "Home Sweet Home - Custom Christmas Ornament - House - Family - Housewarming Gift - First - New Home - Hand Stamped - Bronze Skeleton Key",
      "description": "This custom Christmas ornament is a perfect gift for a new homeowner or to commemorate a special family memory. It features a 3.2\" skeleton key in your choice of color, a 1.75\" x 0.375\" aluminum rectangle tag hand-stamped with your wording of choice, a 7/8\" aluminum heart hand-stamped with your choice of address, an antique silver tone house charm, a 050\" aluminum round hand-stamped with your choice of year, aluminum jump rings, rustic/red/green bakers twine, and a metal ornament hook.",
      "targetAudience": [
        {
          "targetAudience": "Families who have recently purchased a new home",
          "useCase": "To commemorate their new home and create a lasting memory"
        },
        {
          "targetAudience": "Individuals who are looking for a unique and personalized Christmas ornament",
          "useCase": "To add a special touch to their holiday décor"
        },
        {
          "targetAudience": "Friends and family members who are looking for a thoughtful and meaningful gift",
          "useCase": "To show their loved ones how much they care"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/491927411/home-sweet-home-custom-christmas?click_key=1d25c6c04961235fa42dd15366c9eb4110050291%3A491927411&click_sum=b7597848&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-8&pro=1&sts=1",
      "dateCreated": "2024-02-18T22:42:01.340899",
      "productId": "gEAmYcGbZA"
    }
  },
  {
    "data": {
      "product": "Outdoor Sign, Rot Resistant, Wooden Carved Cabin Sign, Pine Trees, Camp Sign, Weekend Camping, Lakehouse Sign, Cottage Sign, Benchmark Signs",
      "description": "Personalized hand-carved wooden cabin sign made from high-quality lumber. The rustic edge signs are approximate in size and may vary slightly. The designs are as shown, and custom design changes may incur additional charges. The signs are made to order and can be personalized with a cabin sign, address plaque, short sign quote, or welcome sign. The wood has unique coloring and wood grain patterns, and the finishes may vary slightly due to inconsistencies in wood properties and picture lighting.",
      "targetAudience": [
        {
          "targetAudience": "Cabin owners",
          "useCase": "Displaying the sign outside their cabin to welcome guests and mark their property."
        },
        {
          "targetAudience": "Homeowners with a lakehouse or cottage",
          "useCase": "Decorating their lakehouse or cottage with a unique and rustic sign."
        },
        {
          "targetAudience": "Campground owners",
          "useCase": "Using the sign as a wayfinding tool to direct visitors to different areas of the campground."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/520505868/outdoor-sign-rot-resistant-wooden-carved?click_key=52699ae507d952736db16f87137dcbde29cce67c%3A520505868&click_sum=79365ce1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-9&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:42:09.738139",
      "productId": "yeKTpAf5cy"
    }
  },
  {
    "data": {
      "product": "Magic Box",
      "description": "The Magic Box is a unique gift that allows you to project a custom message on a wall. It is perfect for any occasion, such as birthdays, anniversaries, or Valentine's Day. The box is made of wood and has a candle that is included in the package. To use the box, simply load the candle into the box and place it next to a wall in a dark room. The message will then be projected onto the wall. The box is limited on the number of symbols that can be cut on one side, so please make sure your message is not longer than three lines, 12 symbols per line.",
      "targetAudience": [
        {
          "targetAudience": "People who want to make a romantic gift for a loved one",
          "useCase": "Giving the Magic Box as a gift for Valentine's Day, an anniversary, or another romantic occasion"
        },
        {
          "targetAudience": "People who want to create a unique and personalized gift",
          "useCase": "Customizing the Magic Box with a special message or image to make it a one-of-a-kind gift"
        },
        {
          "targetAudience": "People who want to add a touch of romance to their home",
          "useCase": "Using the Magic Box as a nightlight or decorative piece to create a romantic atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251037170/girlfriend-gift-gift-for-her-unique-gift?click_key=9d28e69e34fd52a9d9f503cae28cad03959011fc%3A251037170&click_sum=d57dc4c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-10&pro=1&sts=1",
      "dateCreated": "2024-02-18T22:42:20.182222",
      "productId": "IxbGdUxSSV"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift, Photo on Wood, Picture on Wood, Wood Anniversary Gift, 5 Year Anniversary, Wood Wedding Gift, Custom Wood Burning",
      "description": "A wood anniversary gift is a great, traditional option for your 5th year of marriage. Not only are our custom pictures on wood ideal for anniversaries, but also make perfect gifts for weddings, housewarmings and so much more! \n\nHave your own custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life. \n\nEach piece of wood will vary in wood grain, making each one completely unique. \nSeveral size options available to choose from. Due to the natural characteristics of the product, there may be slight variations of approximately ~0.5\" smaller or larger. \nPhotos will be cropped around the corners/edges, as this is the only way to fit a rectangular photo onto an oval piece of wood. All important aspects of the photo should not be located along the very edges of the picture. \nHorizontal photos will be placed horizontally on the wood & vertical photos will be placed vertically unless otherwise requested. \nWhite ink is not printed on the wood. This allows the natural grain of the wood to show through the photo. Colors of the photo on the wood may vary, as these are printed onto natural wood and not bright white paper. \nA clear protective coating is applied over your wood photo to help protect against stains, water and scratching. \nAll wood photos come with complimentary hardware for hanging. If ordering a stand, hanging hardware is not included. \nStands are not included, but can be purchased separately. \nThe bark of the wood is not removed from the wood in order to preserve the natural look of our wood photos. \nAll orders are securely packaged with extra bubble wrap for added protection during shipping. \nMade and Handcrafted in Florida, U.S.A.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "As a traditional and unique gift to commemorate their special day"
        },
        {
          "targetAudience": "Individuals looking for a rustic and personalized home decor item",
          "useCase": "As a decorative piece that adds a warm and cozy touch to their living space"
        },
        {
          "targetAudience": "Event planners or organizers seeking memorable gifts for special occasions",
          "useCase": "As a thoughtful and lasting gift for weddings, housewarmings, or other milestones"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=d31665fb07c3101a018f9dfbcc43f439a3ab1816%3A207134258&click_sum=23d0ed55&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-11&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:42:35.259400",
      "productId": "cjckmyULoS"
    }
  },
  {
    "data": {
      "product": "10th Anniversary Tin Rose",
      "description": "This solid cast tin rose is a stunningly designed and crafted piece, made from 100% pure tin. It is a heavy quality rose, not dipped or plated, and is polished to a shine. The head is approximately 6 cm and the stem is approximately 5-6 inches. It comes with either 1 or 2 leaves on the stem, depending on the cast. It also comes with a free 10th anniversary presentation tin and a little slip inside which explains about tin and why it is given for the 10th anniversary. It includes a date of manufacture stamp and a tin purity stamp.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 10th wedding anniversary",
          "useCase": "As a symbol of their lasting love and commitment"
        },
        {
          "targetAudience": "Individuals looking for a unique and meaningful gift",
          "useCase": "To express appreciation or affection for a loved one"
        },
        {
          "targetAudience": "Collectors of tinware or decorative items",
          "useCase": "To add to their collection or display as a cherished piece"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251651487/10th-anniversary-tin-rose-solid-pure?click_key=72367db3e06d6722226f31dcd47231d365603266%3A251651487&click_sum=c815946c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-12&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:42:43.226233",
      "productId": "fOkSjBBsXB"
    }
  },
  {
    "data": {
      "product": "New Home Ornament",
      "description": "Celebrate your first holiday in your new home with this custom ornament. The lightweight metal key (3 1/8 inches) features a hand-stamped tag (2 inches), adding a personalized touch. Complete your ornament with your preferred ribbon or cord. Please provide only your house number and street name for customization, as city and state are not included. Hand-stamping ensures unique variations in spacing, depth, and alignment, resulting in a one-of-a-kind keepsake. The ornament comes packaged in an organza bag, ready for gifting.",
      "targetAudience": [
        {
          "targetAudience": "Realtors",
          "useCase": "This ornament could be used as a housewarming gift for new clients."
        },
        {
          "targetAudience": "New homeowners",
          "useCase": "This ornament could be used to commemorate the first holiday in a new home."
        },
        {
          "targetAudience": "Hostesses",
          "useCase": "This ornament could be used as a hostess gift for a party."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/170071374/new-home-ornament-housewarming-gift?click_key=25e1790fc2dc54c94cbfcb999d5e07852172c1d6%3A170071374&click_sum=e53d6cf9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-13&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:42:56.434994",
      "productId": "SPXiwqgDHc"
    }
  },
  {
    "data": {
      "product": "Scratch off Map Poster",
      "description": "It's the perfect nostalgic home decor scratch off world map gift for the travel enthusiast to document travel memories and favourite places. Perfect travel map birthday gift for him or gift for her. Brilliant concept scratch off map allowing visited destinations to be scratched, revealing the beautifully styled up to date detailed world map underneath. It's the perfect map or gift for the travel enthusiast allowing complete personalization of the map to display a unique travel story. Simply grab a coin and start scratching off all the destination’s you have been lucky enough to visit creating your own personalized continually changing world map. Not only are countries featured on the map, there are also cities shown on the top layer and the world map underneath, allowing for more detailed scratching. Our Scratch the World Print is perfect for planning the next holiday when the last one is disappointingly over and the holiday washing is in the machine! Please note: No frame is supplied with this print.",
      "targetAudience": [
        {
          "targetAudience": "Travel enthusiasts",
          "useCase": "Documenting travel memories and favorite places"
        },
        {
          "targetAudience": "People who want to plan their next holiday",
          "useCase": "Visualizing potential destinations and scratching off visited locations"
        },
        {
          "targetAudience": "People who enjoy personalizing their home decor",
          "useCase": "Creating a unique and dynamic piece of art that reflects their travel experiences"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/475931494/scratch-off-map-poster-most-detailed?click_key=85f0f7ae3c5705e5c7e713ba233e986bbd85f595%3A475931494&click_sum=cb225552&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-14&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:43:05.651279",
      "productId": "ErYojYbfHD"
    }
  },
  {
    "data": {
      "product": "Married to the Sea",
      "description": "This is a giclee art print of the original painting, made with archival pigment inks on heavy stock, environmentally friendly Hahnemühle Bamboo fine art paper. The matte paper nicely presents the brushstrokes and texture of the original painting. All prints are signed with pencil in the border beneath the image unless you request otherwise.",
      "targetAudience": [
        {
          "targetAudience": "Art collectors",
          "useCase": "Display the print as part of their art collection"
        },
        {
          "targetAudience": "Interior decorators",
          "useCase": "Use the print to complement the interior design of a space"
        },
        {
          "targetAudience": "People who appreciate coastal or nautical themes",
          "useCase": "Display the print in their home or office to create a calming and inviting atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/83383628/married-to-the-sea-giclee-art-print?click_key=cbe3961131bbfbd459c789a6699c148345abae02%3A83383628&click_sum=fe7fddfa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-15&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:43:14.989043",
      "productId": "gNCdxGJbMn"
    }
  },
  {
    "data": {
      "product": "Home sweet home sign",
      "description": "The Home Sweet Home Sign is a beautiful and rustic addition to any home. It is made of 100% wood and features a matte white background with printed lettering. The sign is available in a variety of sizes, from 10\"x20\" to 20\"x48\". It is easy to hang with saw-tooth hangers and is made in the USA.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who are looking for a stylish and rustic way to decorate their home",
          "useCase": "The sign can be used to add a touch of warmth and personality to any room in the house, and it can also be used to commemorate a special occasion or milestone."
        },
        {
          "targetAudience": "People who are looking for a unique and personalized gift for a friend or family member",
          "useCase": "The sign can be customized with the recipient's name or a special message, making it a thoughtful and meaningful gift."
        },
        {
          "targetAudience": "Businesses that are looking for a way to create a warm and inviting atmosphere for their customers",
          "useCase": "The sign can be used to decorate a reception area, waiting room, or office space, and it can help to create a sense of community and belonging."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/401089083/home-sweet-home-sign-wood-framed-sign?click_key=dd794daeede390154e3735a71f93c919a588b840%3A401089083&click_sum=1840db49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-16&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:43:25.208940",
      "productId": "TgCUlBCyim"
    }
  },
  {
    "data": {
      "product": "Picture on Wood, Custom Photo on Wood, Rustic Portraits, Distressed Portraits, Reclaimed Wood Photo Transfer, Wood Photo Blocks",
      "description": "A personalized picture on wood is the perfect way to add a little rustic touch into your home decor. With a custom photo on wood, the possibilities endless. Wedding pictures, family photos and pet portraits are just a few ideas of special memories that can be captured on our wood photos. \n\nHave your own custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life.",
      "targetAudience": [
        {
          "targetAudience": "Those who wants to add a rustic touch to their home decor",
          "useCase": "Using it as a home decor item"
        },
        {
          "targetAudience": "Those who want to preserve special memories",
          "useCase": "Using it as a way to display and cherish special photos"
        },
        {
          "targetAudience": "Those who want to give a unique and personalized gift",
          "useCase": "Using it as a thoughtful and meaningful gift for friends, family, or loved ones"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/240735247/picture-on-wood-custom-photo-on-wood?click_key=75bebf17674e389147282e2737e5827558b62fa9%3A240735247&click_sum=4d06d514&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-17&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:43:37.531583",
      "productId": "CkbXNhVwsG"
    }
  },
  {
    "data": {
      "product": "Welcome Sign",
      "description": "Personalized welcome sign made of wood, with jute twine for hanging. The sign is approximately 5\" x 16\", with a dark walnut stain background and white lettering. The lettering is hand-painted and the sign is sealed with a polyurethane sealant for extra protection. The back of the sign is unsanded but stained and stamped with the company logo.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who want a personalized welcome sign for their home",
          "useCase": "To welcome guests and visitors to their home"
        },
        {
          "targetAudience": "Families who want a personalized family sign for their home",
          "useCase": "To display their family name and create a sense of belonging"
        },
        {
          "targetAudience": "Couples who want a personalized wedding sign for their wedding",
          "useCase": "To commemorate their special day and create a lasting keepsake"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/399982215/welcome-sign-welcome-door-sign-front?click_key=aed145ba62d6ef37d15043d150b5397c65932bfa%3A399982215&click_sum=ecbf9090&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-18&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:43:47.124070",
      "productId": "lkVJqhigsm"
    }
  },
  {
    "data": {
      "product": "latitude longitude sign",
      "description": "This latitude longitude sign is a perfect gift for weddings or bridal showers. It is a meaningful piece of art that would be a beautiful home decoration after the wedding. Each sign is handcrafted from solid wood and professionally printed with state-of-the-art processes. It is available in three sizes and three colors. The back of the sign is finished and it includes a hanger and felt pads. Normal processing and shipping time is 5-7 business days, but there is a 1st in Line option with free shipping that creates the item in 3 business days and includes free USPS Priority Mail shipping, free tissue paper wrapping, and a gift message card/envelope with ribbon/bow. All images and designs are the property of ©Spang Gang Designs, LLC.",
      "targetAudience": [
        {
          "targetAudience": "Couples getting married",
          "useCase": "A unique and personalized wedding gift that can be used as a home decoration after the wedding."
        },
        {
          "targetAudience": "People who want to commemorate a special place",
          "useCase": "A meaningful piece of art that can be used to mark the location of a special event or memory."
        },
        {
          "targetAudience": "People who want to add a personal touch to their home décor",
          "useCase": "A rustic and stylish sign that can be used to add a touch of personality to any room."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/498315936/latitude-longitude-sign-gps-sign?click_key=f455010c6c70f67ba7c7766aaef31d9050e1ba9c%3A498315936&click_sum=5210e9da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-19&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:44:06.989483",
      "productId": "ZczSUfmwiq"
    }
  },
  {
    "data": {
      "product": "Family Gift Reclaimed Wood Custom Family Name Signs Anniversary Gift for Her Gift for Parents Gift for Mom Personalized Valentines Day Gifts",
      "description": "These signs are made from hand-picked, reclaimed wood with a touch of rustic charm. The top board measures approximately 15x5 inches and can be personalized with your chosen last name or couple's names, along with an established date. Smaller kids boards (7x3 inches) can be personalized with first names and birth dates. Hangers are included on the back for easy installation, and the signs are 100% wood with knots and imperfections, adding to their unique beauty. They are handcrafted with care and can be ordered with a variety of options, including a grandparents version, additional kids boards or pet boards, and different sizes and styles. The signs are made to order, so please provide the necessary information when ordering. Please note that colors may vary due to differences in computer monitor displays.",
      "targetAudience": [
        {
          "targetAudience": "Families",
          "useCase": "Personalizing their homes with a unique and meaningful piece of decor that celebrates their family's history and togetherness."
        },
        {
          "targetAudience": "Couples",
          "useCase": "Commemorating their wedding or anniversary with a personalized gift that symbolizes their love and commitment."
        },
        {
          "targetAudience": "Parents",
          "useCase": "Creating a special gift for their children that will be cherished for years to come and that can be passed down through generations."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/493349587/family-gift-reclaimed-wood-custom-family?click_key=a2a7115e9ecc995ed3e946692b5629ddd63fbe0d%3A493349587&click_sum=9fdccfcd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-20&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:44:17.376687",
      "productId": "XIsAmjjycr"
    }
  },
  {
    "data": {
      "product": "Mountain Shelf",
      "description": "The Mountain Shelf is a geometric shelf inspired by nature and travel. It is perfect for displaying trinkets and items found outdoors, and makes a great gift for nature lovers. The shelf is made from pine and finished in the stain of your choice and it is approximately 21\" wide, 12.5\" at the highest peak, and 3.5\" deep. It weighs about 2 pounds and does not include hanging materials. The best way to hang it is from two nails at each peak.",
      "targetAudience": [
        {
          "targetAudience": "People who travel and collect trinkets from nature",
          "useCase": "Display their travel trinkets on the shelf to bring a bit of the outdoors in."
        },
        {
          "targetAudience": "Nature lovers",
          "useCase": "Use the shelf to display their favorite nature-themed items."
        },
        {
          "targetAudience": "Parents of young children",
          "useCase": "Use the shelf to create a woodland-themed nursery."
        },
        {
          "targetAudience": "People who own summer cabins",
          "useCase": "Use the shelf to add a unique touch to their cabin decor."
        },
        {
          "targetAudience": "People who like unique home decor",
          "useCase": "Use the shelf to add a touch of whimsy to their home."
        },
        {
          "targetAudience": "People who are interested in crystals and essential oils",
          "useCase": "Use the shelf to store and display their crystals and essential oils."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/525919176/mountain-shelf-geometric-shelf-triangle?click_key=4a9c7796399074825f9ac5532eb379f72af44274%3A525919176&click_sum=841d77c1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-21&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:44:27.005805",
      "productId": "nEeugJDulU"
    }
  },
  {
    "data": {
      "product": "Home Sweet Home Sign",
      "description": "This wooden sign is a perfect addition to any home. It is made of high-quality wood and features a beautiful, rustic design. The sign is available in a variety of sizes, so you can find the perfect one to fit your space. It is also easy to hang, so you can get it up on the wall in no time. Whether you are looking for a gift for a friend or family member, or simply want to add a touch of warmth and charm to your own home, this sign is a great choice.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners",
          "useCase": "Decorating their living room with a warm and inviting sign"
        },
        {
          "targetAudience": "Home decorators",
          "useCase": "Adding a touch of personality to their clients' homes"
        },
        {
          "targetAudience": "Gift givers",
          "useCase": "Purchasing a thoughtful and meaningful present for a friend or family member who is a homeowner"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/519055208/home-sweet-home-sign-above-couch-sign?click_key=e84133c1f62fe8fd59c1c670820d0b6dec895f3d%3A519055208&click_sum=5279f7d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-22&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:44:36.276051",
      "productId": "oOBocmJubk"
    }
  },
  {
    "data": {
      "product": "Third Anniversary Gift For Him - Personalized Leather Tray with Date and Initials",
      "description": "This leather tray is a thoughtful and practical gift for a third anniversary. Leather is the traditional gift for this milestone, and this tray is made from high-quality leather that will last for years to come. It can be personalized with the couple's initials and the date of their anniversary, making it a unique and special keepsake. The tray is available in a variety of sizes to fit any need, and it can be used to store keys, change, pens, pencils, or other small items. It's a great way to keep track of everyday essentials and add a touch of style to any home.",
      "targetAudience": [
        {
          "targetAudience": "Newlyweds celebrating their third anniversary",
          "useCase": "A personalized and sentimental gift that commemorates their special day and symbolizes the strength and durability of their relationship."
        },
        {
          "targetAudience": "Couples looking for a unique and practical gift for their bedside or dressing table",
          "useCase": "A stylish and functional tray to hold jewelry, keys, or other small items, adding a touch of organization and personalization to their daily routine."
        },
        {
          "targetAudience": "Individuals seeking a thoughtful and meaningful present for a loved one",
          "useCase": "A heartfelt gift that conveys appreciation and affection, whether for a birthday, Valentine's Day, or any special occasion."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385709588/third-anniversary-gift-for-him?click_key=e39202eef3dd3efa5b07f04ce22ab4575b65d95b%3A385709588&click_sum=250a5b9f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-23&pro=1&frs=1",
      "dateCreated": "2024-02-18T22:44:44.470423",
      "productId": "IVmcCroMFn"
    }
  },
  {
    "data": {
      "product": "Extra Large Farmhouse Window Pane Mirror",
      "description": "This rustic window pane mirror is constructed with reclaimed barnwood. It features a combination of 2.5\" & 3.25\" wide molding on the outside, 1\" dividers, and 12 --10\" Square Panes. It is available in Natural Barnwood, Reclaimed Natural, or any of the painted wellworn color finishes. It includes a frame, mirror, solid hardboard backing, and wire/hangers for hanging. It is easy to hang and comes with pull handles (optional), card board backing, and sawtooth picture hangers. Customers have praised its great quality and beautiful appearance.",
      "targetAudience": [
        {
          "targetAudience": "People who enjoy rustic or farmhouse decor",
          "useCase": "Adding a rustic or farmhouse touch to their home decor"
        },
        {
          "targetAudience": "People who are looking for a large mirror",
          "useCase": "Using the mirror as a statement piece in their home"
        },
        {
          "targetAudience": "People who are looking for a mirror with a unique design",
          "useCase": "Adding a unique touch to their home decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/192707281/extra-large-farmhouse-window-pane-mirror?click_key=ccc7c59364b411307eb131b905d7ef0fa52aa7a6%3A192707281&click_sum=d12a04d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-24&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:44:54.196458",
      "productId": "VOkaJWEHQw"
    }
  },
  {
    "data": {
      "product": "Library Card Pillows",
      "description": "These library card pillows will have you reminiscing about the days when the librarian would stamp the due date on the back of the book. Each pillow is screen printed by hand on cotton canvas and features a classic library checkout card design on both the front and back. Measuring approximately 12\" x 16\", these pillows come with a poly-fil insert and a zipper closure along the bottom.",
      "targetAudience": [
        {
          "targetAudience": "Book Lovers",
          "useCase": "Decorating their reading space"
        },
        {
          "targetAudience": "Librarians",
          "useCase": "Displaying in their workspace"
        },
        {
          "targetAudience": "Teachers",
          "useCase": "Creating a cozy reading corner in their classroom"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/249386293/library-card-pillows-librarian-gift?click_key=b9797f48ad7a118ae12c46c095403f87965448f4%3A249386293&click_sum=bd57a2b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-25&etp=1",
      "dateCreated": "2024-02-18T22:45:05.665953",
      "productId": "OygyzhswUm"
    }
  },
  {
    "data": {
      "product": "Silkscreen Sleeping Cat Pillow",
      "description": "This one-color silkscreen pillow is perfect for the cat lover in your life. The pillow measures 16\"x7\" and is made with muslin fabric and stuffed with 100% poly-fil. The pillow has been silkscreened with non-toxic water-based acrylic paint. Custom cat pillows are also available.",
      "targetAudience": [
        {
          "targetAudience": "Cat lovers",
          "useCase": "Decorating their homes with cat-themed items"
        },
        {
          "targetAudience": "People who have lost a beloved cat",
          "useCase": "Finding comfort in a pillow that resembles their pet"
        },
        {
          "targetAudience": "Parents of young children who love cats",
          "useCase": "Providing a cuddly and comforting toy for their children"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/244235802/silkscreen-sleeping-cat-pillow?click_key=5de11d9e74ee0dbb20ca3e365d4128d12624fa1a%3A244235802&click_sum=12360200&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-26&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:45:13.140833",
      "productId": "FhTysC5GZy"
    }
  },
  {
    "data": {
      "product": "Metal Bookend",
      "description": "Modern bookends with \"L\"-shape design, dimensions of 5\" x 6\" x 3.5\", sold individually or in sets of 2. Crafted from durable 16 gauge steel, the bookends feature a natural, untreated finish that may vary slightly in coloration and markings. The metal construction ensures durability while maintaining a lightweight design. The plasma cut process creates precise and unique designs. Suitable for home office, bookshelf organization, reading nooks, and farmhouse decor. The seller, Highland Ridge, donates 10% of profits to their partner organization, Jubilee Trading Co., which supports artisans in Morocco and provides aid to communities in need.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a minimalist and modern aesthetic for their home or office.",
          "useCase": "Organizing and displaying books, magazines, or other reading materials on shelves or desks."
        },
        {
          "targetAudience": "Home decorators looking for unique and artisanal pieces to enhance their living spaces.",
          "useCase": "Adding a touch of industrial charm and visual interest to bookcases, shelves, or other display areas."
        },
        {
          "targetAudience": "Gift-givers seeking a thoughtful and practical present for housewarmings or other special occasions.",
          "useCase": "Providing a stylish and functional item that can help organize and decorate any home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/517695044/metal-bookend-home-office-bookend-simple?click_key=b991ec797e8f7c0af27965262b18e4cd8d3e9595%3A517695044&click_sum=78736773&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-27&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:45:31.075248",
      "productId": "NxlctYgjBV"
    }
  },
  {
    "data": {
      "product": "Marquee Letters",
      "description": "Customizable, light-up letters made from steel and light bulbs. Available in 18\" height with varying widths depending on the letter. Standard finish is brown patina, but distress or no distress custom finishes are available. Includes a 7-foot power cord, inline on/off rotary switch, and E12 base G type bulbs. Can be hung on the wall or made to stand on their own. Non-lit options are available. Shipping is free within the contiguous United States.",
      "targetAudience": [
        {
          "targetAudience": "Event companies",
          "useCase": "Spelling out words to light up events"
        },
        {
          "targetAudience": "Homeowners",
          "useCase": "Decorating walls with illuminated letters"
        },
        {
          "targetAudience": "Businesses",
          "useCase": "Displaying illuminated signs or logos"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/185365138/18-marquee-letters-light-up-letter?click_key=d1789ea0c07ee1a1b5cec75518d96bee45aa4991%3A185365138&click_sum=5eea0ca7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-28&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:45:41.160696",
      "productId": "tUpHaojhoY"
    }
  },
  {
    "data": {
      "product": "Cactus Marquee 36\"",
      "description": "This 36-inch cactus-shaped marquee light is made from steel and light bulbs, and is available in five different colors. It has an open back and a seven-foot power cord with an inline on/off rotary switch. The light is intended for indoor use and includes E12 base G type bulbs. Spare bulbs are included in case of damage during shipping. The light can be customized in terms of color and size, and non-lit options are also available.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value unique and eye-catching home decor",
          "useCase": "Adding a touch of whimsy and personality to their living spaces"
        },
        {
          "targetAudience": "Businesses seeking to create a vibrant and inviting atmosphere",
          "useCase": "Enhancing the ambiance of retail stores, restaurants, or office spaces"
        },
        {
          "targetAudience": "Event planners looking for distinctive lighting solutions",
          "useCase": "Creating a memorable and visually appealing backdrop for weddings, parties, or corporate events"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/230729594/cactus-marquee-36-cactus-wall-decor?click_key=39324cb987b698c701a0a0a20a9637a738c6c638%3A230729594&click_sum=83a4ebbc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-29&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:45:51.000358",
      "productId": "izesyNeWFa"
    }
  },
  {
    "data": {
      "product": "Burlap Bunny Easter Basket",
      "description": "This burlap Easter basket is made from high-quality, natural burlap and lined with 100% cotton. It features a sweet little pom pom tail and is professionally sewn. The basket comes in three sizes: small, medium, and large, and can be personalized with a name or initials. It is sturdy but not rigid and ships folded. A steamy iron can easily remove any wrinkling due to shipping. Recommended laundering: spot clean only.",
      "targetAudience": [
        {
          "targetAudience": "Parents with young children",
          "useCase": "Easter basket for their children"
        },
        {
          "targetAudience": "People who like to decorate their homes for Easter",
          "useCase": "Decorative basket for Easter decorations"
        },
        {
          "targetAudience": "People who are looking for a unique and handmade gift",
          "useCase": "Gift basket for Easter or other occasions"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/503197798/burlap-bunny-easter-basket?click_key=96eea06389b792a35f62672689e23f3e77c08f40%3A503197798&click_sum=5876a4b7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-30&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:46:03.320334",
      "productId": "OtdzjUHRBK"
    }
  },
  {
    "data": {
      "product": "Suncatcher - Irish Gift - Crystal + Wood Moon - Thank you gift - Window Hanging - Rainbow Maker SMALL VERSION",
      "description": "These captivating suncatchers, when positioned in a window, harness sunlight to generate stunning rainbows within your space. Crafted from an array of woods like Beech, Spalted Beech, Oak, Olive Ash, or Elm, each piece is adorned with high-quality Asfour glass crystals. The Crystal Angel features a 20mm Asfour crystal body with Tibetan silver wings and a 10mm Asfour crystal head crowned with a Preciosa crystal, while the Crystal Sphere boasts a 20mm diameter. The wooden base measures 90mm at its longest point and is suspended by a durable Dyneema fishing line, allowing for effortless spinning of the moon and crystal. Each piece is meticulously finished with danish oil for an optimal sheen and packaged in an eco-friendly gift box. Whether as a thoughtful birthday present, a heartfelt thank you, or a simple gesture of remembrance, this suncatcher is a unique and cherished gift.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate unique and handmade gifts",
          "useCase": "Gifting the suncatcher for special occasions such as birthdays, new babies, \"thank you\" gifts, and \"thinking of you\" gifts."
        },
        {
          "targetAudience": "Individuals seeking home décor that adds a touch of natural beauty and creates a calming ambiance",
          "useCase": "Displaying the suncatcher in their homes, bedrooms, sunrooms, offices, yoga studios, or mindfulness spaces to enhance the aesthetics and promote relaxation."
        },
        {
          "targetAudience": "Art enthusiasts who value the combination of wood and crystal in artistic creations",
          "useCase": "Collecting the suncatcher as a piece of unique artwork that showcases the beauty of natural materials and craftsmanship."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/201614691/suncatcher-irish-gift-crystal-wood-moon?click_key=4cdc97a32c15f56e59a786e57e4b8a16c39ae087%3A201614691&click_sum=d4245a5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-31&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:46:15.809642",
      "productId": "JM3FaINzNd"
    }
  },
  {
    "data": {
      "product": "Custom Portrait from Photo",
      "description": "Hand-drawn portraits made to order, ready for proof review in 2-3 days. Unlimited revisions until approved. Printed on high-quality matte cardstock or available as a digital file. Choose from various sizes and delivery options. Free shipping within the USA. Additional charges for international shipping or self-printing from a digital file. The final design is for personal use only and not for resale. Custom backgrounds available for purchase. Personalized and hand-drawn by the artist, not outsourced replicas. Winner of the 2023 Albie Original Concept Design Award.",
      "targetAudience": [
        {
          "targetAudience": "Parents looking for a unique and personalized gift for their children",
          "useCase": "Custom portraits can be used as a special keepsake or a unique piece of home decor."
        },
        {
          "targetAudience": "Couples looking for a romantic and memorable gift",
          "useCase": "Custom portraits can be used to commemorate a special occasion, such as a wedding or anniversary."
        },
        {
          "targetAudience": "Individuals looking for a fun and creative way to express themselves",
          "useCase": "Custom portraits can be used as a unique and personalized profile picture or social media avatar."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/223829168/custom-portrait-from-photo-cartoon?click_key=75bb34fac8aa1b2bb2aa0159139485af8cabab42%3A223829168&click_sum=2c2dbf68&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-32&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:46:25.216078",
      "productId": "mlqlduZfMA"
    }
  },
  {
    "data": {
      "product": "Anatomical Heart",
      "description": "This sculpture is a cast of an anatomical human heart, made of resin and hand painted. It stands 9.75\" tall, and is a perfect complement to a macabre bridal shower.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in anatomy and art",
          "useCase": "Decorative display in home or office"
        },
        {
          "targetAudience": "Medically-minded individuals (e.g., doctors, nurses, students)",
          "useCase": "Educational or reference tool"
        },
        {
          "targetAudience": "Those seeking unique and macabre home decor",
          "useCase": "Conversation piece or accent piece in a themed room"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/187929337/anatomical-heart-vase-pewter-finish?click_key=c9e38660b0a661cf6d80b331d339f92e10d69c65%3A187929337&click_sum=52bad1fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-33&etp=1",
      "dateCreated": "2024-02-18T22:46:35.742304",
      "productId": "iEoCGzQzXE"
    }
  },
  {
    "data": {
      "product": "Personalized Gymnastics Medal Holder Display",
      "description": "The personalized gymnastics medal holder is the best way to display the medals collected by your kid. It is made from select pine and 1/8\" thick baltic birch plywood and is available in two sizes - 12\" and 20\". The 12\" holder has 5 posts while the 20\" holder has 10 posts. The name insert is available in 11 standard colors and custom colors are available for an additional $5. The medal holder is easy to hang with keyholes on the back and comes gift wrapped at no extra charge upon request. The product is shipped USPS and ships within 10 business days.",
      "targetAudience": [
        {
          "targetAudience": "Parents of gymnasts",
          "useCase": "Displaying their child's gymnastics medals"
        },
        {
          "targetAudience": "Gymnasts",
          "useCase": "Storing and organizing their own medals"
        },
        {
          "targetAudience": "Coaches and trainers",
          "useCase": "Displaying their team's medals or recognizing individual gymnasts"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/211991005/personalized-gymnastics-medal-holder?click_key=299f83646479afbab5a241de226b449ffec80958%3A211991005&click_sum=adf8b266&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-34&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:46:43.559984",
      "productId": "3vKHgHcQti"
    }
  },
  {
    "data": {
      "product": "LARGE velvet pumpkins set of 3",
      "description": "This bestselling set of 3 Large hand made fabric pumpkins adds charm to your home décor! This set includes 3 large pumpkins made in luxurious velvets: 1 Gray, 1 Ivory, and 1 Taupe. This set creates an instant table centerpiece and adds wonderful texture to rustic, farmhouse and traditional décor.\nAll of our Velvet Pumpkins are carefully hand cut, stitched, and finished in our small workshop in Madison, Wisconsin, USA. Our velvet Pumpkins are also one of our best sellers - they've been featured in publications like Elle, Town and Country, Huffington Post, Refinery29, and Polyvore.\nEach pumpkin measures approximately 6.25\" wide x 3.25\" tall, PLUS the 4.375\" tall stem. The resin stem is realistic, and very durable. Actual colors will vary due to individual computer screens and fabric dye lots.\nThis set looks great on its own, but you can also purchase multiple colors to round out your mix! You can do this by color, or check out our \"Create Your Own\" listing:\nhttps://www.etsy.com/listing/606985784/large-velvet-pumpkins-create-your-own. Because of these options, we do not do substitutions on our curated sets.\nVelvet pumpkins make lovely party favors, wedding décor and centerpieces. Check out the Wholesale listing to order 24 or more pumpkins in your choice of colors at discounted pricing:\nhttps://www.etsy.com/shop/YourHeartsContent?ref=seller-platform-mcnav&search_query=wholesale+pumpkins\nLooking for the perfect way to display your pumpkins? We have a carefully selected group of accessories that you can use with you pumpkins! Just navigate to the \"accessories\" section of our shop and browse to find that perfect piece to round out your velvet décor.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who value elegant and sophisticated décor",
          "useCase": "Adding a touch of luxury and warmth to their homes with these plush velvet pumpkins."
        },
        {
          "targetAudience": "Wedding planners and event designers",
          "useCase": "Creating stunning centerpieces and table arrangements that add a touch of rustic charm to special occasions."
        },
        {
          "targetAudience": "Gift-givers looking for unique and thoughtful presents",
          "useCase": "Presenting loved ones with these exquisite velvet pumpkins as cherished keepsakes or seasonal decorations."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/481627726/large-velvet-pumpkins-set-of-3-taupe?click_key=effbe8d293fa844d0b9af9f5c5ecec83b94d9c4b%3A481627726&click_sum=353a405c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-35&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:46:55.542953",
      "productId": "JQcDbwkwOO"
    }
  },
  {
    "data": {
      "product": "Front Door Wreaths, Best Selling Wreath, Burgundy Red, Green, and Cream Hydrangea Wreath, Year Round Wreath, Winter Wreath",
      "description": "This hydrangea wreath is perfect for a variety of door colors and is one of our top-selling designs. It catches the eye without being overwhelming and features artificial hydrangeas in shades of burgundy red, olive green, and cream. It's a beautiful and durable wreath that can be enjoyed for years to come.\n\n**Wreath Sizes**\n• Small 15-16\" overall diameter and 5\" deep.\n• Medium 19-20\" overall diameter and 5\" deep.\n• Large 22-24\" overall diameter and 5\" deep.\n• X Large 26-28\" overall diameter and 5\" deep.\n\n**Helpful information**\n• Ribbon is included with the wreath.\n• Display the wreath in covered areas outdoors or indoors as a year-round wreath.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of elegance to their front door",
          "useCase": "This wreath can be used to add a touch of color and sophistication to a front door, making it a welcoming and inviting space."
        },
        {
          "targetAudience": "Individuals who want to add a touch of nature to their home decor",
          "useCase": "This wreath can be used to bring the outdoors in, adding a touch of nature to a living room, dining room, or bedroom."
        },
        {
          "targetAudience": "People who are looking for a durable and long-lasting wreath",
          "useCase": "This wreath is made with high-quality materials and is designed to withstand the elements, making it a great choice for year-round use."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/231262085/front-door-wreaths-best-selling-wreath?click_key=bb49e796a1f4423e15a44882f0e221807b346911%3A231262085&click_sum=5ec5a683&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-36&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:47:07.727344",
      "productId": "S2DSytUPvF"
    }
  },
  {
    "data": {
      "product": "Metal Bookend // shaped as Falling Books",
      "description": "This unique bookend is shaped like a man holding up falling books. It is made of metal and painted black. The bookend is inserted into the cover of the first book to be supported, and then additional books can be leaned on it. This creates the illusion that the books are about to fall on the man, who is stretching out his arms in a defensive position. The bookend is 18 cm long, 11.5 cm high, and 12 cm wide. It weighs 380 grams.",
      "targetAudience": [
        {
          "targetAudience": "Book lovers who enjoy unique and humorous home decor",
          "useCase": "Displaying the bookend on a bookshelf to add a touch of whimsy and personality to their space"
        },
        {
          "targetAudience": "People who are looking for a stylish and functional way to organize their books",
          "useCase": "Using the bookend to support a small collection of books on a desk or table"
        },
        {
          "targetAudience": "Individuals who appreciate modern and contemporary design",
          "useCase": "Incorporating the bookend into a minimalist or industrial-style home decor scheme"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/484180211/metal-bookend-shaped-as-falling-books?click_key=d383198bc3d263b19934d68d94ac827a59b6e28b%3A484180211&click_sum=8366727a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-37&etp=1",
      "dateCreated": "2024-02-18T22:47:16.840367",
      "productId": "QEjORwrpJa"
    }
  },
  {
    "data": {
      "product": "Compass Wall Decor",
      "description": "The Compass Wall Decor is a beautiful piece of metal art that is perfect for any nautical or beach themed room. It is made of 16 gauge steel and is available in over 100 color choices and sizes from 12\" to 36\". The compass is triple sanded for a high quality, smooth finish and is powder coated for longevity. It is also weather resistant, making it perfect for both indoor and outdoor use. The compass comes with two 1/4\" screw holes for mounting.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy coastal or nautical decor",
          "useCase": "Adding a nautical touch to their home or office space"
        },
        {
          "targetAudience": "People who are interested in travel and exploration",
          "useCase": "Using the compass as a decorative reminder of their adventures"
        },
        {
          "targetAudience": "Those who appreciate unique and handmade artwork",
          "useCase": "Displaying the compass as a statement piece in their living room, bedroom, or entryway"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/271070195/compass-wall-decor-nautical-compasswall?click_key=f7e1517b6ef374bca0fbb9f8bc1192b00fc9218f%3A271070195&click_sum=71e5f5a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-38&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:47:33.128706",
      "productId": "yHbWWhxNzX"
    }
  },
  {
    "data": {
      "product": "Baptism Gift Girl, Gift from Godmother, Baptism Gift for Goddaughter, Christening Gift, Ceramic Baptism Water Bowl for Ceremony",
      "description": "This handmade ceramic baptism water bowl is a unique and meaningful gift for a baptism or christening. It is made entirely by hand in a faith-filled studio and features a hand-pulled spout for pouring the baptismal waters during the ceremony. The bowl is about 4.5\" wide and comes with a verse that can be personalized with the child's name and baptism date. It is a beautiful and cherished keepsake that can be used for generations to come.",
      "targetAudience": [
        {
          "targetAudience": "Parents of a child being baptized",
          "useCase": "To use during the baptism ceremony to pour the baptismal waters."
        },
        {
          "targetAudience": "Godparents of a child being baptized",
          "useCase": "To give as a gift to the child being baptized."
        },
        {
          "targetAudience": "Grandparents of a child being baptized",
          "useCase": "To give as a gift to the child being baptized."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/66042419/baptism-gift-girl-gift-from-godmother?click_key=9d5206ca635a5e29cb224bdb33f1dff473fdbc00%3A66042419&click_sum=8c698085&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-39&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:47:42.589752",
      "productId": "gTEOZpggHL"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift for Him | Soundwave Art | Wood Anniversary | Voice Recording Gift",
      "description": "A creative traditional 5 year anniversary gift printed on wood. Use a voice recording or a favorite song to create a unique and memorable soundwave art gift for your 5th anniversary or any occasion for your husband or wife. They can scan the optional QR code to play the voice message or song. This personalized gift will bring back memories for years to come. It is made of 3/4\" thick premium baltic birch wood, with a specialized printing process that prints directly on wood resulting in super vibrant colors, retaining high quality without sacrificing clarity. It is protected against moisture & heat to give you a print that will last for years to come and is easy to clean. Sizes up to 11\"x14\" include a stand. You can customize it with a song, in most cases, only a link to the song on YouTube is needed, or if you have an MP3 file of the song, you can email it to the provided email address. You can also customize it with a voice message, which you can easily record on your mobile phone using your Voice Memos or Voice Recorder app, and then email the file to the provided email address. A small card with the QR code printed on it is included with your order, and you can choose to have an optional gift message printed on the card. You can also request to have the QR code printed on the art itself. A free proof is available, but please note it adds 1-3 business days to the processing time. Wood prints usually ship in 3 business days and arrive in 2-5 business days depending on your location in the US and your order size.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "A unique and personalized gift that commemorates their special day and allows them to relive special memories."
        },
        {
          "targetAudience": "Individuals looking for a meaningful and sentimental gift for a loved one",
          "useCase": "A thoughtful present that expresses their love and appreciation, capturing a special moment or message in a visually appealing way."
        },
        {
          "targetAudience": "People who value personalized and artistic home décor",
          "useCase": "A unique and eye-catching piece that adds a personal touch to their living space, serving as a cherished reminder of special occasions or loved ones."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/477563341/5th-anniversary-gift-for-him-soundwave?click_key=bda223b39b67d4f23de4e6d69e2f625949cad621%3A477563341&click_sum=42d1ef68&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-40&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:48:01.897007",
      "productId": "VuNLjhCIlP"
    }
  },
  {
    "data": {
      "product": "GPS Coordinates Longitude Latitude Sign",
      "description": "This 8\" x 12\" wooden sign is a custom-made piece that displays the coordinates of a special location. It's available in three stain colors (Dark Walnut, Briarsmoke, or Early American) and features hand-painted coordinates in a consistent style. The back of the sign is stained and stamped with the seller's logo. It comes with hanging hardware and is shipped via USPS Ground Advantage 2-4 day. The seller emphasizes that cancellations are not accepted and that all coordinates will be converted to the style pictured. The product is made from natural wood and may have variations in knots and grains, as well as imperfections such as dents or cracks. The seller also notes that all sizes are approximate and may vary up to an inch.",
      "targetAudience": [
        {
          "targetAudience": "Realtors",
          "useCase": "Closing gifts for clients"
        },
        {
          "targetAudience": "Homeowners",
          "useCase": "Housewarming gift or display of special coordinates"
        },
        {
          "targetAudience": "Individuals seeking a unique Christmas gift",
          "useCase": "Personalized and meaningful present"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/461000746/gps-coordinates-longitude-latitude-sign?click_key=51fd9ccab446f761df29b3c8452f7d15b98c099b%3A461000746&click_sum=0a611d43&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-41&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:48:11.622552",
      "productId": "qLLaHWQiYm"
    }
  },
  {
    "data": {
      "product": "Personalized Kitchen Sign",
      "description": "This personalized kitchen sign is a great way to add a touch of personality to your kitchen. It is made from high-quality materials and features a matte white finish with precise black ink lettering. You can choose from a variety of sizes and frame stain options to find the perfect sign for your kitchen. The sign is easy to hang and makes a great gift for any occasion.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who enjoy cooking and entertaining",
          "useCase": "Decorating their kitchen or dining room with a personalized sign that reflects their style and personality."
        },
        {
          "targetAudience": "People who are looking for a unique and meaningful gift for a cook or chef",
          "useCase": "Gifting the sign as a birthday, holiday, or housewarming present."
        },
        {
          "targetAudience": "Businesses that want to create a custom sign for their kitchen or dining area",
          "useCase": "Using the sign to promote their business or to create a more welcoming and inviting atmosphere for customers."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/247240515/personalized-kitchen-signs-gifts-decor?click_key=d1f3cfcba1b1825b78e6599c54b1aa66764e0eae%3A247240515&click_sum=2aad58c7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-42&frs=1&etp=1",
      "dateCreated": "2024-02-18T22:48:21.176233",
      "productId": "bDTyrWwOeq"
    }
  },
  {
    "data": {
      "product": "Reclaimed willow wood coasters",
      "description": "These coasters are made from reclaimed willow wood and come in a set of 4. They are approximately 3-4 inches in diameter and 3/8 of an inch thick. The coasters are decorative and natural, and can be used for place settings or decoration around the house. They are ready for gifting and can be personalized with a card. The natural wood product will need air and should not be left wrapped up. Variations include Natural (lightly sanded to retain natural texture) and Lacquered (sanded smooth and lacquered for a smooth satin finish).",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for natural and rustic home decor",
          "useCase": "These coasters can be used to protect tabletops from scratches and spills, and they can also be used as decorative accents."
        },
        {
          "targetAudience": "People who are looking for unique and handmade gifts",
          "useCase": "These coasters can be given as gifts for birthdays, holidays, or other special occasions."
        },
        {
          "targetAudience": "People who are environmentally conscious",
          "useCase": "These coasters are made from reclaimed wood, which is a sustainable and environmentally friendly material."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/219370277/4-coasters-wood-slices-wood-coasters?click_key=f3e532fb270fe37a08466f06d52024304f450d39%3A219370277&click_sum=97538070&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-43&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:48:30.775899",
      "productId": "BZwphvpqAS"
    }
  },
  {
    "data": {
      "product": "Pineapple, Front Door Wreath, Front Door Decor, Pineapple Decor, Door Hangers, Elegant Door Wreath, Door Decorations, outdoor wreath",
      "description": "This Pineapple Door Hanger is a charming and cheerful addition to any home, creating a warm and inviting atmosphere. Made of high-quality steel and powder-coated with a UV-resistant finish, it is designed to withstand outdoor conditions and last longer than average wreaths. Available in sizes ranging from 20\" to 26\", with or without an over-the-door hook for easy hanging, it complements any decor style. The heavy-duty carbon steel construction, hand-designed laser cuts, and triple-sanded smooth finish ensure durability and safety. The fade- and rust-resistant powder coating allows for both indoor and outdoor use, and all text is showcased in uppercase lettering. Custom orders are welcome, and free shipping is offered to the Contiguous United States for orders over $35.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a touch of charm and cheer to their home",
          "useCase": "Decorating their front door to make it more inviting"
        },
        {
          "targetAudience": "People who are looking for a unique and stylish way to decorate their home",
          "useCase": "Using the wreath as a centerpiece in their living room or dining room"
        },
        {
          "targetAudience": "Businesses who want to create a welcoming atmosphere for their customers",
          "useCase": "Hanging the wreath on the front door of their business"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/267098338/pineapple-front-door-wreath-front-door?click_key=bc41c6d74221f56a0e72055954ca658dc5a53ad3%3A267098338&click_sum=cd761cf5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-44&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:48:40.639492",
      "productId": "EGTjVaVZiD"
    }
  },
  {
    "data": {
      "product": "Suncatcher Crystal - Moon - Wooden Gift - Memorial Gift - Housewarming Gift - Birthday - Special Friend MEDIUM VERSION",
      "description": "These beautiful suncatchers create dazzling rainbows when hung in a window. Ideal for birthdays, special friends, remembrance gifts, housewarming and more. They brighten up any home, yoga studio, or workspace. Made in Ireland, these hand-crafted crystal window creations are made from a variety of Irish woods such as Beech, Oak, Olive Ash, Spalted Beech, Elm and Walnut. Crystal Angel = 20mm(3/4 inch) diameter Asfour crystal body with 2 x 14mm Asfour Crystal octagons, 2 x 18mm Asfour Crystal octagons and 10mm(1/4 inch) Asfour crystal head with Preciosa crownCrystal Sphere = 30mm(1 1/4 inch) diameter Asfour crystalCrystal Sun = 40mm (1 1/2 inch) diameter Asfour crystalWood Dimensions: Approx 130mm (5 inches) at its longest point.Hanging string length: approx 300mm (12 inches) - please let us know if you would like this longer or shorter for your particular requirements.This moon is medium sized. For small and large versions please view other listings. Personalized options are available where you can have a special message engraved into the wood. The above image is a sample. The characteristics of each piece of wood will vary slightly. We are very conscious of making sure that each and every piece is of equal natural beauty.-Each piece is finished with danish oil to what we believe is the perfect sheen.-It is hung with a high quality braided Dyneema fishing line which does not degrade in light like many other common threads. This line allows for exceptional free flowing spinning of the moon and the crystal within the moon.-Wood is sourced locally in the west of Ireland-They come carefully packaged in an environmentally responsible plastic-free gift box.- We will gladly include a gift note for you so that the recipient knows who sent their special gift. Printed on recycled Kraft paper. An option for your gift note will come up in the checkout process.Dispatched same or next working dayPlease note that these suncatchers are designed for indoor use and have not been tested outdoors.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for a unique and meaningful gift for a special occasion.",
          "useCase": "They could give the suncatcher as a birthday present, a housewarming gift, or a memorial gift."
        },
        {
          "targetAudience": "People who are interested in home décor and want to add a touch of elegance to their home.",
          "useCase": "They could hang the suncatcher in a window to catch the sunlight and create dazzling rainbows around their room."
        },
        {
          "targetAudience": "People who are looking for a way to add a touch of nature to their home.",
          "useCase": "The suncatcher is made from natural materials, such as wood and crystal, and it can be used to create a calming and relaxing atmosphere in a room."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/226585297/suncatcher-crystal-moon-wooden-gift?click_key=0b51d37a975bc7ca21599e0ae803b65d1b08ec25%3A226585297&click_sum=7958e09f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-45&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:49:11.220365",
      "productId": "noiwiLcOnm"
    }
  },
  {
    "data": {
      "product": "Vintage Tropical Botanical Print Set No. 1",
      "description": "This set of four hand-colored etchings from the 1770s by botanical illustrator George Ehret is a great addition to any coastal or beach decor. The prints are digitally enhanced and added to a lightly tinted background, which enhances their vintage charm. They are available in a variety of sizes and can be printed on archival canvas textured paper or archival smooth matte paper. The prints are ready to frame and are sized to fit \"off the shelf\" standard retail frames.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in vintage and botanical home decor",
          "useCase": "Decorating their homes with unique and stylish artwork"
        },
        {
          "targetAudience": "Coastal homeowners and beach enthusiasts",
          "useCase": "Creating a tropical-inspired ambiance in their living spaces"
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Adding high-quality giclee prints to their collections"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/246131668/vintage-tropical-botanical-print-set-no?click_key=b11205daac1af18ffa5a83786da26bfd21f6d555%3A246131668&click_sum=22ed5a6a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-46&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:49:24.944158",
      "productId": "uOEMmOGvjr"
    }
  },
  {
    "data": {
      "product": "Watercolor seascape painting",
      "description": "This is a giclee print of my own original watercolor painting. Printed with colorfast ink on premium archival fine art paper. Prints are signed in the back and have a white border for easy framing. I live on the wild and beautiful coast of Downeast Maine. We moved to an old, old house with a small farm in the forest, near the water. There is nothing I love more than taking quiet time for myself out on the water. Printed on Epson Velvet Fine Art Paper because it is very similar to the original paper these were painted on. Options for paper size are 8x10 inches, 11x14 inches, 16x20 inches. Not all images fit standard paper sizes and may need custom frames. Most images can be custom printed larger on paper or canvas, just go to \"custom\" or convo me with you wish and I will do everything to make it happen. Each print is packaged in a protective, acid-free sleeve and shipped in a flat cardboard mailer. I usually ship the print by regular mail the day after I receive the order. I am very happy to accommodate special orders like larger prints or portraits. Prices do apply. Please feel free to convo me with any questions or requests. I love comments and convos from people around the world!",
      "targetAudience": [
        {
          "targetAudience": "Art collectors",
          "useCase": "To add to their collection of original artwork"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "To use as a decorative element in their clients' homes"
        },
        {
          "targetAudience": "People who love the sea",
          "useCase": "To bring a piece of the ocean into their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/247020065/watercolor-seascape-painting-archival?click_key=ddac94d9996bccd0dd8c5ff7ac3385b0dcad45fa%3A247020065&click_sum=e2adab18&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-47&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-18T22:49:35.697081",
      "productId": "xoAJY5SnBd"
    }
  },
  {
    "data": {
      "product": "Wooden bottle opener",
      "description": "Wooden bottle opener, personalized wall bottle opener, magnet bottle opener. The product is made of 18mm plywood, and is approximately 11.81\" / approximately 30 cm in size. It has a hidden magnet on the top for easy mounting on any wall. The beer bottle opener is laser engraved and is a great gift for any occasion. The hidden magnet opener collects your cap, it catches the bottle caps as they fall.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a stylish and functional way to open bottles",
          "useCase": "Mounting the bottle opener on a wall in their kitchen or bar area for easy access and to catch bottle caps"
        },
        {
          "targetAudience": "Businesses looking for a unique and personalized way to promote their brand",
          "useCase": "Customizing the bottle opener with their logo or branding and using it as a promotional item or giveaway"
        },
        {
          "targetAudience": "Individuals looking for a thoughtful and practical gift",
          "useCase": "Gifting the bottle opener to friends or family members who enjoy drinking beer or other bottled beverages"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/564113725/wooden-bottle-opener-personalized-wall?click_key=1d4cad9253f353d3d3d0d67a1e383a832ba18876%3A564113725&click_sum=4b78ef9e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-48&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-18T22:49:43.786007",
      "productId": "PszRZxYXks"
    }
  }
]
