[
  {
    "productId": "oCuEXHPaxH",
    "url": "https://www.etsy.com/listing/1444799234/realtor-closing-gift-housewarming-gift?click_key=7231362cdf0345d11e6ebc5cdfe0e2b46a9f15d3%3A1444799234&click_sum=43693401&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-1&pro=1&frs=1",
    "title": "Realtor Closing Gift, Housewarming Gift, Personalized Outdoor Cooler, Real Estate Gift, Realtor Gift, Backyard Decor, Backyard party",
    "description": "The perfect housewarming, wedding gift, anniversary gift, or just for you!! This cooler is great to display drinks inside or outside with a handmade Frio removable liner that makes refilling and cleaning a breeze!*SIZE & CAPACITY● This cooler holds around 24 cans● Dimensions 24”Long x 12”Wide x 10”Tall*ABOUT THIS ITEM● Handbuilt in Texas from Western Cedar● Removable insulated liner snaps in with buttons● Laser Engraved Personalization● Can stay outdoors, does not need to be inside.*HOW TO ORDERTo order, select your style then enter what you want engraved. Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only to request a proof please make a note when placing your order.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.**Social Media:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product.  We appreciate every opportunity to earn your business!  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Very pleased.  Fast shipping.",
      "Great quality and fast shipping!",
      "The quality of this is amazing! It’s a great  gift and it’s really what i expected and more! My dad has been asking for a cooler like this and i can’t wait to see his face when he sees it’s customized as well!"
    ]
  },
  {
    "productId": "AEUxpyltAp",
    "url": "https://www.etsy.com/listing/1528223123/tulip-eight-styles-of-metal-garden-yard?click_key=ad486ff994fafa28cb11ce5a2568851e421724e3%3A1528223123&click_sum=0d99d452&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-2&pro=1&bes=1",
    "title": "Tulip- Eight Styles of Metal Garden Yard Art Home Decor",
    "description": "Our Tulip Hand Painted Metal Garden Yard Art Home Decor are a beautiful and artistic addition to any garden or home. Each piece is carefully hand-painted, adding a unique touch to your outdoor space. The metal material gives it a rustic appearance, adding charm and character.Tulips are well-known flowers that come in various colors and symbolize love and beauty. Did you know that they were originally cultivated in the Ottoman Empire and then brought to Europe in the 16th century?Unfortunately, we have decided to retire this product from our line, so it will no longer be available for purchase. But if you're lucky enough to have one, it will surely bring joy and beauty to your surroundings for years to come.",
    "reviews": [
      "Love these. I got them as a gift for a friend and she loves tulips. They look so nice in her yard.",
      "Well made. Looks so nice in the garden.",
      "Mine were really rusty but the color was great and they looked nice. It was a gift and the person I gave them to loved them.",
      "Perfect!! So cute and shipped quickly!"
    ]
  },
  {
    "productId": "FGCMJswSmu",
    "url": "https://www.etsy.com/listing/1254648309/bells-garden-stake-happy-gardens-garden?click_key=cbb2bb6933f972a0dabc517ab9d27c0d1ad804eb%3A1254648309&click_sum=aa5ba3ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-3&pro=1&bes=1&sts=1",
    "title": "Bells Garden Stake - Happy Gardens | Garden Stakes | Gardening Decor | Gardening Gifts | Yard Art | Yard Decor | Outdoor Decor | Metal Art",
    "description": "Bells Garden StakePlant elegance and let joy blossom. Our Flamed Bells Garden Stake pleases the eyes and ears alike, with a timeless circular motif and an array of five bells, which emit lovely sounds as breezes caress.Like other Happy Gardens stakes, this one has been individually handcrafted, and will bring lasting beauty to your surroundings.Steel construction; flamed finishDimensions: 55” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Absolutely beautiful. Exactly as pictured and described.",
      "I love the sound of these little bells!  Very impressive in person. Lovely!  Thank you so much!",
      "Well packed. Lovely item. Pleasant tinkle of bells. Thank you very much.",
      "Yay! It's always our pleasure to provide you the best product and service. You deserve the best. Thank you for your business, Barcia!"
    ]
  },
  {
    "productId": "ZLjaKNmEFn",
    "url": "https://www.etsy.com/listing/1694903679/2-pack-gorgeous-hummingbird-solar-light?click_key=b7d061e7a207da844f4f1d0719e7494b0b56402d%3A1694903679&click_sum=c5289aa6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-4&pro=1&frs=1&sts=1",
    "title": "2 Pack - Gorgeous Hummingbird Solar Light Wind chime | Perfect as an outdoor, front or backyard decoration. The Perfect Gift for him or her",
    "description": "These Gorgeous Hummingbirds Solar Light Wind chimes will transform your front or backyard into beautiful work of art!- SOAR POWER - Turn the 'ON / OFF' Switch at the bottom 'ON'. Let the Sun charge it for at least 4 hours and enjoy the power of the Sun to light up your garden.- 7 ALTERNATING COLORS - These hummingbirds will alternate between 7 different color at night making them the most beautiful wind chime you'll own!- PERFECT GIFT - These Solar Lights are the perfect gift for anyone special in your life. They are perfect as a housewarming gift!",
    "reviews": [
      "Bright and colorful \nCan’t wait to put them out",
      "Gorgeous wind chime with beautiful colors!",
      "Great product. I love how it lights s up different colors. It gives you a sense of peace.",
      "Well packed and ornament is just as described."
    ]
  },
  {
    "productId": "otkGLaFOBH",
    "url": "https://www.etsy.com/listing/1304849440/cottagecore-suncatcher-leaf-dreamy?click_key=e88772ba4f546622684ff51f94d548cb276c0d9f%3A1304849440&click_sum=f281ea9e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-1&pro=1&frs=1&content_source=30fc75d594390d712574acb8d7d3f04eb7b6779b%253A1304849440",
    "title": "Cottagecore Suncatcher / Leaf Dreamy Crystal Suncatcher/ Aesthetic Butterfly Window Decor / Car Charm /Dreamy Decor / Cottagecore Room Decor",
    "description": "Let's make some rainbow 🌈These handmade suncatcher will catch the beautiful sunlight and cast thousands of rainbows around your room!🌈Brighten up your mood everyday and they are a soothing addition to your living or workspace.🌈Hang them on the windows side to catch as many sunlight as you can and let them brings you a beautiful rainbow shower.🌈Total Length:Small Moon:48cmLarge Moon: 50cmStar Shape:48cmRound Shape:48cmLove Shape:50cmNote:Due to the different monitor and light effect, the actual color of the item might be slightly different from the color showed on the pictures. Thank you!Please allow 1-2cm measuring deviation due to manual measurement.#Suncatcher #Crystal Prism #Window Decal #Cottagecore #ButterflyDecor #Rainbowmaker #Aestheticbedroom",
    "reviews": [
      "Fantastic! Made a great wedding gift!",
      "I like it because it is the same as in the picture. Beautiful.",
      "Not the best quality. Very easily broken.",
      "The metal rings holding it together are a little weak, but that's an easy fix. Other than that it's absolutely wonderful; it looks gorgeous and it has that wonderful sense of whimsy that I was looking for, for my sister"
    ]
  },
  {
    "productId": "weVtqtNTeZ",
    "url": "https://www.etsy.com/listing/1487981459/rustic-metal-flowers-set-of-5-unique?click_key=abcc266ba343bc34e1e86c69c46ca3516e1e2136%3A1487981459&click_sum=56f25b62&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-2&pro=1&frs=1&sca=1&sts=1&content_source=ad43bd809507986844a66c48b6651a7080e1313e%253A1487981459",
    "title": "Rustic Metal Flowers - Set of 5 - unique handmade rusty outdoor garden art landscape sculpture or lawn ornament for yard or flower plant bed",
    "description": "Behold the captivating allure of our stunning collection of handcrafted rustic flowers, each a masterpiece in its own right. While they may share a similar aesthetic at first glance, these flowers are anything but identical. Immerse yourself in the individuality of each bloom, as no two are precisely alike. Your complete set includes all five distinct styles pictured, ensuring a diverse and visually appealing ensemble.Designed to replicate the grandeur of nature, these flowers stand at an impressive life-sized height of approximately 10 inches, with dimensions of 3 inches in width and 2.5 inches in depth. The intricate detailing and craftsmanship shine through, making these flowers an exquisite addition to any space.Elevating their charm is a red-orange-brown natural iron oxide aged patina finish, commonly known as rust. This Really Unique Special Texture not only adds a touch of color but also requires no maintenance, offering a hassle-free way to enhance your decor. Embrace the evolving hues over time, as the rust develops its unique character while preserving the timeless beauty of the flowers.Proudly made in the USA, these handcrafted blooms are not just a testament to skilled artistry but also environmentally conscious, being 100% recyclable. Immerse your surroundings in the enduring beauty of these unique rustic flowers, a celebration of craftsmanship and sustainability.",
    "reviews": [
      "Beautiful! It's a great gift for the gardener in our family. Thanks.",
      "Beautiful and very well made",
      "Very nice little flowers. Nicely made, nicely packed and delivered promptly. A happy addition to our porch."
    ]
  },
  {
    "productId": "muWQUerzyG",
    "url": "https://www.etsy.com/listing/1521920910/rustic-log-live-edge-bench-with-back?click_key=f2675154d41d3958b3a8f61ece03bbdf470e5e7a%3A1521920910&click_sum=260ae5e7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-3&pro=1&frs=1&etp=1&content_source=3f142b38831099080faeb3aba3143a1edcbb9e57%253A1521920910",
    "title": "Rustic Log Live Edge Bench with Back Rest Patio Seating For Outdoor Porch Wooden Handcrafted Sturdy Bench Log Base",
    "description": "This elegant, handcrafted bench is our top seller and an eye catcher for any front porch or lake front view.  Relax and watch the sunset on this beautiful live edge bench with a back rest for comfort.We offer multiple finish options, can alter size per request, and can add log arm rests upon request as well for additional charges.Dimensions: 48\" length x 16\" seat height with a 39\" total bench height.  The seat width varies however is approximately 15\" for sitting.  Please reach out with any side preferences if you have them!Our Water Seal finish is a Thompson's Water Seal that is not photo'd however it is similar to the natural clear finish but with no shine- the water will bead up and roll off once it touches the water seal bench.  This water seal will need to be reapplied every 6 months to a year to maintain bench integrity if in harsh conditions.Things to note:Each bench we make is different- all knots, live edges, and character are different based off the piece of raw wood used and the tree it came from.Minor Assembly is required and will take about 5 minutes if you have a towel, hammer, and drill handy.  We recommend 2 people assembly but not required.Do not glue the product until you are sure you have everything you need and there are no damages.  Once you have fully assembled the product and are pleased, you can go back and add glue.  It is very difficult to return a product after gluing it.Feel free to ask any and all questions, thanks!",
    "reviews": [
      "It's truly beautiful. Has an elegant but rustic feel!",
      "This piece is awesome and well worth the investment. Very sturdy. Shipped well packaged. Love it!",
      "I love the way your bench looks there, so nice! thanks for the positive feedback!",
      "I have been looking for a bench for sometime, but couldn't find what I wanted. When I received my bench from Southern Rustic Log it was better than I expected. I loved it!  It was well made and didn't take us long to assemble. I would highly recommend this company.",
      "we appreciate the positive feedback so so much! so glad you are loving it!",
      "Absolutely stunning and as expected"
    ]
  },
  {
    "productId": "uJwJbPuDrb",
    "url": "https://www.etsy.com/listing/1516715280/sitting-frog-garden-statue-outdoor-yard?click_key=915474c4ebd6f7920e11f0190722f320f990369b%3A1516715280&click_sum=bc02555d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-4&pro=1&frs=1&content_source=7c97c53e4468bcad8943433062321c62ee3eb102%253A1516715280",
    "title": "Sitting Frog Garden Statue, Outdoor Yard Decor, Resin Art Decor, Lawn Decor, Porch Decor, Home Decor, Room Decor, Table Desk Ornament",
    "description": "✦ See our entire collection here:https://www.etsy.com/shop/TheGardenHeavenItem: Sitting FrogsMaterial: ResinType: Garden StatueSize: 4.5 x 15.5 cm / 1.7 x 6.1 inNote:The size of the product is measured by hand. The real object is placed horizontally, and there may be an error of 1-3 cm. Please pay attention to this factor when purchasing! All product pictures are taken in kind. Due to differences in lighting and displays, there may be color differences with the actual product. Such problems are not product quality problems. The final color is subject to the actual product.",
    "reviews": [
      "Oh so cute - these welcoming little guys are such an addition to my garden-",
      "Item is good quality but my issue is with size vs cost. It’s quite small considering how high the price is…",
      "Quick response to my question and the garden chicken decorations are amazing!",
      "High quality, great accessory for your nerdy house decor. 🖖🏻"
    ]
  },
  {
    "productId": "atUKyoHdiy",
    "url": "https://www.etsy.com/listing/1162506393/triple-spinning-heart-garden-stake-happy?click_key=6f49d99aa17474be654a67bd2ef8605191020ec3%3A1162506393&click_sum=6fb2f048&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-5&pro=1&sts=1&content_source=c4f7de3bc54bef84c370ce176a91ac9bafbc6d17%253A1162506393",
    "title": "Triple Spinning Heart Garden Stake - Happy Gardens | Yard Art | Outdoor Art | Gardening | Garden Gifts | Metal Art | Yard Stakes | Decor",
    "description": "Triple Spinning Heart Garden StakeAdd a touch of romance to your garden with this best-selling Triple Spinning Heart Garden Stake. This piece has a neutral, iridescent glow that really stands out in green, grassy or leafy areas. This stake spins in the breeze, too, making it even more interesting to onlookers. As always, this item in individually handcrafted and made with care.Dimensions: 6.5” W x 30” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Love it so much thanks",
      "Yay! I am glad to know you're happy with your purchase, Jodi. Thank you for your business :)",
      "It was smaller than I had expected,  but I still love it!!",
      "Hello Sherry. Thank you for your feedback. Sorry if the item is smaller than expected. If it's smaller that what we listed in the description, please message us so we can make this right for you. Thank you!",
      "Was another gift and really liked.",
      "Fantastic! We appreciate your feedback and thank you for your business, Candace :)",
      "Bought this for my daughter. She is moving into a new house and just had her third child so I thought the three hearts will mean a lot to her and give her something special for her new home."
    ]
  },
  {
    "productId": "JNy1byOVCg",
    "url": "https://www.etsy.com/listing/1646725734/solar-dangling-birdinsect-garden-decor?click_key=cd6d714c8add9fd302fa6eec9062b77a8b057781%3A1646725734&click_sum=4a6a693c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-6&pro=1&content_source=82cb52fceff2a34525150ac2f7958e0300c0af7b%253A1646725734",
    "title": "Solar Dangling Bird/Insect, Garden Decor, Yard Art, CHOOSE Style",
    "description": "* Dim: Apprx 4-7/8\" diameter. x 27-3/4\" H, overallBEES: 2-5/8\" W x 1-3/4\" D x 2\"EachHUMMINGBIRDS: 4-1/8\" W x 2-3/4\" D x 4-1/8\" H, EachCARDINALS: 3-1/4\" W x 2-1/8\" D x 3\" H, Each* Liven your outdoor space with this solar yard art.* Each unit features 6 figures, with 1 steady-on white light in each, hanging at different lengths.* Automatically on during night and recharge during the day.* Made from: Polypropylene, plastic and metal",
    "reviews": [
      "This humming bird outside lighting is just what I needed for my back porch. Lights up so pretty.  I would recommend this item.",
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it.",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!"
    ]
  },
  {
    "productId": "eVHFRtazRl",
    "url": "https://www.etsy.com/listing/1339327552/butterflies-on-branches-multi-hanging?click_key=889428601c975dcab2aadf24fb4af9acd016aebe%3A1339327552&click_sum=58012466&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-7&pro=1&sts=1&content_source=2d59845a41e29a5029f3774f0ea06d167efb05b9%253A1339327552",
    "title": "Butterflies on Branches Multi Hanging Ornament Gifts for Mom | Garden Decor | Yard Art | Patio Decor | Gardening Gifts | Wind Chimes | Decor",
    "description": "Butterflies on Branches Multi Hanging OrnamentThis bold, colorful butterfly ornament—at over four feet long—will simply take your breath away.About the productThere’s butterfly garden decor, and then there’s this. One of the most elegant, beautiful products we’ve ever carried, this piece features a smattering of handcrafted, ornate butterflies in bold-yet-natural colors. It’s the perfect piece for any gardener looking to add a sense of elegance and beauty to their outdoor space.Why we love itThis piece is simply irresistible—from the handiwork to its unexpected length. We know you’re going to love it!Shipping detailsMost orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote dad, “We’re going as fast as we can! Promise!”)Measurements6” x 2” x 50”MaterialsHandcrafted, flamed metal.DetailsQuick, frustration-free installation.Backed by our friendly, one-year warranty.",
    "reviews": [
      "Great item! Fast shipping. Loved it.",
      "This is so beautiful. It's a gift for my mother and I'm sure she will love it. The colors on the butterflies are very vibrant.",
      "Fabulous! We are so happy to read your feedback. Thank you so much for trusting us.",
      "it is so beautiful, love it.",
      "I bought this as a gift, but it's so pretty I'm contemplating keeping it. The foil effect of the paint is really gorgeous. It's the perfect touch of color without being garish."
    ]
  },
  {
    "productId": "CZstWfUEeD",
    "url": "https://www.etsy.com/listing/1017989549/7-stone-cairn-garden-statue-stone?click_key=eba78f1a39c12779d12050f4ab1a8f43dfba41c8%3A1017989549&click_sum=4f0b7484&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-8&pro=1&sts=1&content_source=e40075237cd35d75fa331780ac918d8a90809e58%253A1017989549",
    "title": "7-Stone Cairn Garden Statue | Stone Statues | Garden Art | Outdoor Decor | Zen | Gifts for Mom | Garden Decor | Yard Art | Cairns | Garden",
    "description": "7-Stone Cairn Garden StatueThis elegant 7-Stone Cairn Garden Statue proves that some of the most beautiful things in life are really quite simple.Whether displayed on its own or alongside other garden décor, this peaceful statue–which is made from real river stones–is sure to earn daily oohs and ahhs.Crafted by hand like all of our Happy Gardens statues, this piece will be a focal point in your garden for years to come.Dimensions: 11” HWeight: 6.5 lbsHANDCRAFTED WITH LOVE - Our garden statues are made by hand with reclaimed river stones by some pretty incredible people. The Honduran manufacturer who provides us with these statues dedicates a portion of his proceeds to improving life for these artisans.EASY TO INSTALL AND CARE FOR - When you receive your statue, the hard work will have already been done. Rest assured you (or the lucky recipient of your gift!) will have this item on display in no time. And cleaning and caring for the statue will be a breeze, too.MADE WITH QUALITY MATERIALS - Unlike many garden statues available for sale, the ones we offer at Happy Gardens are made from only the best products like real river stones and heavy-duty steel.BACKED BY A FRIENDLY ONE-YEAR WARRANTY - If you have a problem with your garden statue within a year of purchase, just call us! Our customer service team is proud to stand by our one-year limited replacement warranty.",
    "reviews": [
      "Love this stone tower! Thank you for such fast shipping and for the Shasta Daisy seeds!! They are my absolute favorite!!!",
      "Item matched description.  Very high quality.",
      "This made my day! Grateful to know you like it. Thank you for your business!",
      "Lovely cairn for my the landscaping bed adjacent to my front walk.  The architectural elements complement the sense of calm it exudes.",
      "This sounds fantastic, Carolyn. Thank you for your business and I am glad you like it :)"
    ]
  },
  {
    "productId": "AgZfinXQEL",
    "url": "https://www.etsy.com/listing/1648011897/artisanal-mastery-unveiled-handcrafted?click_key=c012f49768eb3a125c02aaac8610b62c90423815%3A1648011897&click_sum=957e48f2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-5&pro=1&frs=1",
    "title": "Artisanal Mastery Unveiled: Handcrafted Moroccan Mosaic Table - A Unique Blend of Culture and Craftsmanship",
    "description": "Indulge in the allure of Moroccan craftsmanship with our Handcrafted Moroccan Mosaic Table, a masterpiece meticulously created by skilled artisans. This table is more than just a piece of furniture; it's a symbol of tradition, artistry, and the rich cultural tapestry of Morocco. Each intricate mosaic tells a story, making this table a focal point that transcends utility and transforms your space into a work of art.Features:Boho Elegance:Immerse your home in the charm of Boho Decor with our mosaic table, adding a touch of free-spirited elegance to any room.Dining Delight:Elevate your dining experience with a table that not only serves its practical purpose but also becomes a conversation starter.Crafted by Hand:Our artisans pour their heart and soul into every detail, ensuring that each piece of the mosaic is meticulously placed for an exquisite finish.Mosaic Artistry:Witness the mesmerizing beauty of mosaic art come to life, creating a visual spectacle that captivates the eyes and the imagination.Epoxy Excellence:The high-quality epoxy finish not only protects the mosaic but also enhances its colors, creating a durable and visually stunning surface.Handmade Gift Inspiration:Explore the joy of giving with a handmade gift that is not only functional but also carries the warmth of thoughtful craftsmanship.Personalized Charm:Add a personal touch to your living space with a table that can be personalized to match your unique style and preferences.Christmas Table Elegance:Infuse the spirit of Christmas into your home with a table that becomes the centerpiece of your festive decor.Gifts for Her:Surprise the special women in your life with a unique gift that combines beauty, functionality, and the charm of Moroccan art.Unique Gift Experience:Give the gift of uniqueness with a table that stands out as a memorable and one-of-a-kind present.Table Lamps Harmony:Complement the aesthetics of your space with table lamps that enhance the ambient lighting, creating a cozy and inviting atmosphere.Boardgame Table Adventure:Transform your table into a haven for board games, adding a layer of entertainment to your living space.Console Table Versatility:Whether in the entryway, living room, or hallway, our console table seamlessly adapts to various spaces, adding style and functionality.✅ Infos :-Place Origin : Morocco ( FEZ )-Materials    : Organic CLAY-Color          : Every Table has unique petterns (mosaic tiles ), colors and sizes✅ Take care of your Moroccan Mosaic Table :- Wipe your ceramic table only with a soft cloth or sponge,- Clean your table by hand gently✅ Need Help We are here for you Contact Us :-Please do not hesitate to contact us via etsy. we will get back to all messages with in 24 hours✅ Packaging and Shipping- The Mosaic tables Packed in bubble wrap with other packing materials, placed in a wooden box and shipped withe care.- All of our products are shipped with FedEx.- We ship All the week except for Saturday, Sunday and holidays.- After you have placed your order, you will receive a confirmation message requesting a phone number. We need it for the tracking documents.- We will provide a tracking number once your item is shipped- We take a lot of pride in our items and will always make sure they are very well packed and protected for shipping.- Please be aware of delays on shipping that are out of our control such as Customs holds, Holidays, weather delays or other disruptions.✅ MONEY BACK GUARANTEEYou are covered by the Returns & exchanges policy of our Shop policies.We want all our customers to be completely satisfied!Thank you for visiting",
    "reviews": [
      "Top transaction. Very nice carpet.",
      "The pillow I purchased was even more beautiful in person, and of exceptional quality. Heavy wool with saturated colors. Shipping was super fast and communication was a breeze. I highly recommend this shop.",
      "Beautiful quality, packaged very well and I’ll definitely be ordering from this shop again in the future. Thankyou so much!",
      "Rug is beautiful. Seller was incredibly helpful, responsive and communicative and the item arrived at quickly and well-packaged. couldn’t have asked for a better experience."
    ]
  },
  {
    "productId": "CY7rCEXCSZ",
    "url": "https://www.etsy.com/listing/1254513885/walnut-balcony-table-space-saver-balcony?click_key=c06cebb5d39607dbfa5b9b53c037bb86e3ac37a5%3A1254513885&click_sum=41145c52&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-6&pro=1&frs=1&sts=1",
    "title": "Walnut Balcony Table Space Saver, Balcony Bar Table Railing, Wooden Patio Bar Table, Folding Table Terrace, Custom Table with Winter Cover",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.You can check our other balcony bar table in here:https://www.etsy.com/shop/PureWoodesign?ref=seller-platform-mcnav&section_id=38610171Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.Our Balcony Bar Cover DETAILS :XXSmall: 15.7\" Length (40 cm)XSmall: 21\" Length (53.5  cm)Small: 24\" Length (60 cm)Medium: 31.5\" Length (80  cm)Large: 39.5\" Length (100 cm)Xlarge: 47.3\" Length (120 cm)2Xlarge: 59\" Length  (150 cm)3XLarge: 70.8\" Length  (180 cm)4XLarge: 78.7\" Length  (200 cm)5XLarge: 86.6\" Length  (220 cm)6XLarge: 96.4\" Length  (245 cm)Made with polyester.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.Pack Details:We are shipping your furniture with a durable hard box !We can also make a pack free of charge 😊Shipping:We are making your furniture as a custom order and crafted one by one meticulously.As a team, we’re working to serve your ring as soon as possible! Please check current shipping time when you order 😊FREE shipping & EXPRESS Shipping worldwide. 😊I am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Customer Service:We are always here to serve you! Whenever you want to ask something, please do not hesitate to get in touch with usThank you for reading all the details! If so, please click the “Favorite Shop” to follow our new furnitures and to get news about updates and discounts! 😊",
    "reviews": [
      "Wonderful product! And wonderful people to deal with:)",
      "Thank you so much for your lovely feedback and beautiful photo! We're thrilled to hear that you find the balcony bar table wonderful. Your satisfaction means the world to us. Enjoy your patio furniture! It looks amazing on your terrace.",
      "Love it! A gift for the whole family to enjoy during the holidays!",
      "Thank you kind words for balcony bar.",
      "Great ordering experience and product!",
      "Thank you kind words for balcony table."
    ]
  },
  {
    "productId": "CIxcQ0aGEG",
    "url": "https://www.etsy.com/listing/1673086051/relaxing-and-fun-therapy-sensory-swing?click_key=7f177fd5d3c1583fc0bf256b752d26a6b71935e2%3A1673086051&click_sum=04de7891&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-7&pro=1&frs=1",
    "title": "Relaxing and Fun Therapy Sensory Swing, Indoor, Kids Hammock, Comfortable, Montessori Furniture,Yoga,For Toddler,Decor,Personalized,Hammocks",
    "description": "Sensory Swing,Indoor and Outdoor,Kids Hammock,Cute,Comfortable,Relaxing and Fun Therapy,Montessori Furniture,Yoga,For Toddler,For Adults,Home Decor,Quality,Personalized,Kids Activities,Gift ChristmasSensory Swing (Hardware Included) for Children with Special Needs,Snuggle Swing Cuddle Hammock for Autism, ADHD, Asperger's Syndrome and SPD$$ 4 working days delivery option only applies to the sensory swing product. Product package is included in the price: Sensory Swing and Fast Delivery Option. Customers in the USA can benefit from this option. For customers in Canada and other countries, please send us a message for fast delivery. Please specify the colour option.NEXT DAY SHIP USA!!!!!FOR SPECIAL NEEDS: Ideal of this cuddle swing is designed for kids and teens who have Sensory Processing Disorder, Asperger's Syndrome, ADHD, or those on the autism spectrum. The raindrop swing helps child learn body awareness, balance, motor planning, and spatial skills. It also provides sensory pressure all over and creates a fun space to bounce, swing, spin, or lie down enjoying the movement of the swin.Therapy oscillation works wonders, not only is extremely fun for children, but its flexible and stretchy fabric is great for occupational sensory integration therapy, vestibular stimulation, spatial awareness. Deep pressure creates calming effectsINDOOR SWING FOR KIDS: Vestibular swing Promote coordination and balance, strengthens muscles, and improves motor skills. The compression of the cocoon swing helps your child feel secure similar to getting a hug or being swaddled.EASY USE: No need to purchase extra hardware or figure out complicated pieces.The whole swing can be set up within few minutes indoor/outdoor. The daisy chain can adjust the length, you can adjust it to the most comfortable state according to your needs. .(Age: 3~10. Young children should use it under supervision and with help of adults)-Color : MULTICOLOR-The length of the product is 140 cm/ 55’’Maximum weight: 80 kg/ 180 LbsBenefits:A few Notes:-The Swing Fabric can be machine washed in cold water and is recommended to be hung to dry.-Suggested ceiling height: 210cm / 82,6‘’-Recommended for ages -3+-Connection apparatus can be safely applied to wooden and concrete columns. The yellow steel apparatus sent is suitable for 2 regions.-The product should be used under parental supervision.***This swing is great for developing body awareness and addressing motor planning skills.***Provides a calming effect and provides vestibular input with increased pressure.***This sensory swing is made with of quality Lycra and seat belt weaving.***Hooks and dowels are sent with the product free of charge.*** The product should be at a height of 1m/ 39’’ from the ground. Considering its flexibility, your ceiling height should be minimum 2.20m/ 86,6’’. The product can extend down to 20cm/ 7,8’’. The ropes in the package has adjustable length.*** Adjustable rope total length 100cm/ 39’’ - Adjustment section 64cm/ 25’’ - The 36cm/ 14’’ gap is the part used to connect the product.Note: Because of the stretchiness of the fabric, you will need a high ceiling for this.My other products link:https://www.etsy.com/shop/SensorySwingShopLLC?ref=simple-shop-header-name&listing_id=1171331279* When will your product be shipped? The product is delivered to cargo within 1-2 working days.* We work with DHL, Tnt and Fedex, All European Countries are delivered to your door within 1-4 days, America and Canada regions are delivered to your door within 3-5 days. Express air cargo.Important Notes:1. You can wash in the washing machine and dry in open air.2. For returns, shipping and cancellations, please get information from us !!!3. Please contact us for different size options.",
    "reviews": [
      "As expected. No issues. Thank you.",
      "Hi Dara. Everything is for the happiness of our children. My team and I are very happy about your comment. I am sending you a specially prepared discount coupon. Thanks.",
      "Great product, fantastic communication, great customer service, would gladly buy again.",
      "Hi Hans. Everything is for the happiness of our children. My team and I are very happy about your comment. I am sending you a specially prepared discount coupon. Thanks.",
      "Great product and customer service!",
      "Hi Lyndsay. Everything is for the happiness of our children. My team and I are very happy about your comment.  I am sending you a specially prepared discount coupon. Thanks."
    ]
  },
  {
    "productId": "QavvWvmOVk",
    "url": "https://www.etsy.com/listing/1657190129/artistic-mosaic-table-handmade-round?click_key=87bcf8238e71bcecc2604b82e4db9bfefe3af988%3A1657190129&click_sum=c7eb1109&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-8&pro=1&frs=1&sts=1",
    "title": "ARTISTIC MOSAIC TABLE, Handmade Round Cyan Blue Table, Traditional Custom Made Design,  Luxurious Outdoor Patio Furniture For Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric design in different colors. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades of cyan blue and white, creating a warm and inviting look.The mosaic pattern on the table can be custom made with a variety of colors, including vibrant blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.CONTACT US FOR MORE CUSTOM MADE ORDERS , WE ARE OPEN TO NEW DESIGNS !GET YOUR IRON CHAIRS FOR YOUR TABLE USING THIS LINK :https://www.etsy.com/listing/1645111013/set-of-handmade-iron-chairs-moroccan",
    "reviews": [
      "The customer service really helpful. Very pleased with the response. Definitely will recommend this company to purchase item. Beautiful tables.😘",
      "Great chair, looks nice outdoors",
      "Very nice and helpful seller!Beautiful side table, perfectly made to measure and in customized colours, well packed and fast shipped. 👍👍👍👍",
      "As the picture, well made and good quality.  Arrived quickly and well packed."
    ]
  },
  {
    "productId": "XqpIkCgCgn",
    "url": "https://www.etsy.com/listing/1182010254/asian-garden-columns-zen-garden-garden?click_key=f1004eac2d9a2ac72104bcca57133add5e6c8332%3A1182010254&click_sum=b1f059da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-9&pro=1&frs=1&sts=1&content_source=4e7bc53ca01ddf27dd3ce2afc99ae29e5c28405a%253A1182010254",
    "title": "Asian Garden Columns - Zen Garden - Garden Decor - Garden Statue - Well Cover - Landscape Light Cover",
    "description": "Garden columns are a great way to add visual contrast to your garden, flower bed or deck.  This asian garden design is cut on all four sides so it looks great from anywhere in your yard. Each column is welded by hand and pre rusted so it will blend in with your landscape as soon as you place it in your space.  They work great as a stand alone monolith or combine 2 or more for extra texture.  They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DGarden Column TOP:https://www.etsy.com/listing/1521161735/garden-column-lid-succulent-planter-box?click_key=033619dc41177fff88fd543c6b4e41b0a59aea5a%3A1521161735&click_sum=23261f22&ga_search_query=lid&ref=shop_items_search_1&pro=1&frs=1&sts=1***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture and finish all of our work from a small shop in Tennessee.  Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum and glass combined.  88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.HARDWARE INCLUDED - Our work comes ready to mount with predrilled holes and 4 x 6\" long garden stakes to stabilize each column.SOLID STEEL CONSTRUCTION - Our garden columns are made from 16 ga mild steel, about the thickness of a dime.  Designed to last many years without maintenance inside or out.",
    "reviews": [
      "The items look as described and in the listing photos. One of the items arrived damaged, likely during shipping. It is relatively minor damage, and it was possible to conceal that portion in the dirt, so I didn't register a complaint.",
      "Beautiful and high quality yard art.  I highly recommend this shop.",
      "This is a beautiful piece in the yard.  My neighbors love it too.  I put a solar \"tiki\" light in it for night time interest.  Really happy with this piece of art!",
      "This is a nice product"
    ]
  },
  {
    "productId": "UIROecevyI",
    "url": "https://www.etsy.com/listing/1381492306/colorful-metal-butterfly-yard-art-garden?click_key=3fef9a441ad62ff0484ca59d76892facb4a4aac2%3A1381492306&click_sum=eb42cc1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-10&pro=1&content_source=cddcadb65eb49234080ea083d58071b18ba19aff%253A1381492306",
    "title": "Colorful Metal Butterfly Yard Art- Garden Decoration- Outdoor Metal Decor- Monarch Butterfly Unique Yard Decoration- Garden Art Stake- Gift",
    "description": "* Note: Our butterfly and other artwork is being copied by other sellers. Our artwork is hand drawn original artwork by myself made on the computer and then cut with CNC plasma machine. If you see artwork that looks just like ours, they are infringing on our copyrights.*Heavy-Duty 16 gauge hot rolled steel cut with CNC plasma*-9 inches wide by 11.5 inches tall-(excluding stake)There is a 1/4 in diameter steel stake welded to the back of the butterfly and measures 10.5 inches in length.*Available in Multiple Powder Coat Finishes*-Stone Satin Black-Soft Satin White-Porsche Silver-US Penny Vein-Oil Rubbed Bronze-Black Copper Vein-Canyon Copper II-Gold Bar Gold-Canary Yellow-Very Red-Juju Orange-Passion Pink-Matte Pink*All of our powder coat finishes can withstand the toughest conditions and are UV resistant.*Also available in bare metal. This item will have no sealant on it and will slowly rust over time.THIS IS A TWO DIMENSIONAL PIECE.This butterfly would be a wonderful gift and addition to their home for any gardener or nature lover!The perfect accent to landscaping, flower pots, cut flower gardens, and landscaping!We are a local business out of Sparta, TN. Thank you for supporting small businesses like us!",
    "reviews": [
      "It is absolutely gorgeous!!  Can’t wait for the weather to get warmer so I can put it out ❣️❣️❣️",
      "Absolutely love these butterflies! They will make a great addition to my front yard landscaping garden. They are very heavy duty and won't  tip over in the wind! Very happy with my purchase and finding this shop!",
      "The monarch garden decor shipped quickly and was exactly as expected.",
      "Beautiful large butterfly and so well made! Looks amazing!"
    ]
  },
  {
    "productId": "KdzWxOYVle",
    "url": "https://www.etsy.com/listing/1002418003/butterfly-garden-stakes-bundle-pack?click_key=13cad7e4e552bc06bdbe687bf633950e073829b4%3A1002418003&click_sum=bb0c13e7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-11&pro=1&etp=1&content_source=00510dda9af1267195c3949dd50796bb55e96e07%253A1002418003",
    "title": "Butterfly Garden Stakes, Bundle Pack, Potted Plants Decoration, Outdoor Decor, Spring Butterflies, Multi Color",
    "description": "Beautiful Butterfly Garden Stakes Perfect for Flower Pots and Outdoor Decoration.These colorful and cute Butterfly Stakes have springs attached, so they sway in the wind like the real insects do.The wings can be pushed shut or open depending on your preference.***Want specific butterfly colors?Just add a note at checkout***Dimensions:2\" wide 11.5\" long",
    "reviews": [
      "Very nice , realistic, have bought 2 times",
      "Great , would by again and recommend",
      "So cute and looks great in the garden."
    ]
  },
  {
    "productId": "wZkumYVYBt",
    "url": "https://www.etsy.com/listing/152087488/dragonfly-suncatcher-decorative-garden?click_key=e8ef4df6fce71e274bf2df0baaccb3ba4a3daabd%3A152087488&click_sum=f81aa0b9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-12&pro=1&sts=1&content_source=dbbdd219fb8a0d173ca68d238eda4fc292e3bc2b%253A152087488",
    "title": "Dragonfly suncatcher, decorative garden art, copper plant decor, butterfly porch ornament, plant gifts",
    "description": "The Dream Cascade Suncatcher, a stunning addition to any outdoor or indoor space. Our suncatcher is meticulously crafted using solid hand-sculpted copper and shimmering crackle glass orbs. Measuring 10.5 inches long with a total length of 14 inches (including the hook), this whimsical design features two 1 inch diameter orbs and three 1/2 inch diameter orbs.Our suncatcher is adorned with a charming copper dragonfly or butterfly, adding a touch of natural beauty to your surroundings. This semi-precious metal is over 99% pure, ensuring that your suncatcher is of the highest quality and will last for years to come.Perfectly placed in outdoor spaces, sunrooms, patios, porches, and more, this suncatcher will enchant your garden and create an atmosphere of tranquility. Its natural charm and sparkling glass make it a true delight for the senses. Our Dream Cascade Suncatcher also includes a copper hook, making it easy to hang and display.Personalize your Dream Cascade with a hand-stamped copper disc to design the perfect gift, celebrate a special memory, and bring joy! We can stamp names, dates, and words to offer encouragement and delight.Experience the beauty of nature with our Dream Cascade Suncatcher. Adorn your favorite tree or hang it by your window and watch as it creates a mesmerizing display of light and color. Don't miss out on the chance to own this irresistibly beautiful suncatcher!Find the perfect plant and garden accessories at Dragonfly Dreams:GARDEN STAKES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=5382837WIND CHIMES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32634106WHIMSY STICKS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32633808Artisan-designed handcrafted sculptures, created in my home studio with raw materials sourced in the USA and purchased from USA small businesses. Handmade art may vary slightly in size. Loving care is taken at each step of the process to ensure the pieces created are exceptional.* We offer combined shipping on multi-item orders based on weight and destination. The combined rate is calculated at checkout.This art should be cared for in the same manner as fine jewelry. Copper will age to a beautiful patina if left in its natural state. Patina is not a destructive process but if you wish to retain the bright finish of this art it will need to be cleaned periodically if displayed outdoors.Items pictured above are examples, your item will be specially made for you.Some glass orbs have a luster finish, some do not. We cannot guarantee what finish will be available at the time of your order, please contact us prior to placing an order if you have a preference.© 1999-2024 Dragonfly Dreams",
    "reviews": [
      "So cute, will look nice in my garden",
      "It is beautiful I wish it was a bit bigger",
      "Very pretty - looks great!",
      "It’s beautiful quality and exactly what I was looking for!"
    ]
  },
  {
    "productId": "VPKwjrqwBE",
    "url": "https://www.etsy.com/listing/1461263128/water-repellent-outdoor-floor-cushion?click_key=55bdc681b9148566c0c1da94a8df1df52f9d22f0%3A1461263128&click_sum=767badf2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-13&pro=1&frs=1&pop=1&sts=1&content_source=ecb0d52253ee3e5a6dbc887b41f53eaae417ecfe%253A1461263128",
    "title": "Water-repellent Outdoor floor cushion, floor sofa, floor cushion, custom size floor pillow, floor couch, custom outdoor cushion",
    "description": "Waterproof floor cushionsThese cushions are very versatile, you can use these straight on the floor, on a lounger chair, on a wooden bench, by the pool, indoors.These are made from water-repellent fabric (This article has been tested and resulted in a water resistance average of 1727 mm H2O. This means it is waterproof against rain.)Filling: holofibre, polyester cushion filling.Cushion is tufted.There are multiple sizes available and custom sizes are possible to order by request, usually it takes 1-2 weeks to prepare. Extra colors also by request.**BOTTOM**23\"x39\" / 60x100cm23\"x63 / 60x160cm23\"x71\" / 60x180cm23\"x78\" / 60x200cm31\"x47\" / 80x120cm36\"x63\" / 90x160cm31\"x78\" / 80x200cm47\"x71\" / 120x180cm (the first picture of the listing)Round D45\"/ 115cmYou can also order matching pillows for the back, these are tufted in 1 row. If you wish to have more tufting rows, please write a special request with the order :)** BACKREST**15\"x24\" Backrest cushion (40x60cm)15\"x31\" Backrest cushion (40x80cm)15\"x47\" Backrest cushion (40x120cm)We recommend have sets of:31\"x47\" & backrest 15\"x47\"36\"x63\" & two backrests at 15\"x 31\"47\"x71\" & 15\"x47\" Backrest cushion  or 3 backrest cushions at 15\"x24\".This cushion is about 5\" thick. Comes with a zipper.The cushion also has an inner cushion that is not sewn shut, so if needed, there is possibility to add more filling in the future ( there is a zipper too).",
    "reviews": ["Great quality and I love it!!"]
  },
  {
    "productId": "hBMoHzxDTx",
    "url": "https://www.etsy.com/listing/1376639745/suncatcher-lighthouse-stained-glass?click_key=3a0cfd2ee549c7fa62da344790316f5d29d4c627%3A1376639745&click_sum=0d6e5a9b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-14&pro=1&frs=1&etp=1&content_source=502b74f467c516d8ab071b171860f95954bee467%253A1376639745",
    "title": "Suncatcher lighthouse Stained glass Window panel Wall Art Decor Home decor Marine theme Birthday gift idea",
    "description": "Suncatcher irized lighthouse very beautiful decoration for a room.Hello dear buyer! Welcome to our authorship stained glass decors store!We are Olha and Daria, founders of this store and people who create beauty for you. We have been engaged in stained glass for over nine years.In this difficult time, work saves us and your smiles warm us. We love our business and do our best to ensure that you are satisfied with the fact that you turned to us.We can also create individual works. If you have an idea that you really want to implement, then we will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live color may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!",
    "reviews": [
      "Bought as a Christmas gift for my mom. Didn’t arrive in time for Christmas, but I knew it probably wouldn’t when I ordered it. It’s very well made, and was packed very securely. My mom loved it!",
      "Wonderful little stained glass. Excellent quality— will definitely buy from this seller again.",
      "Great transaction, seller responds immediately with questions. Great workmanship and hard to find item. Product arrived greatly packed and in perfect condition 👍🏼😁"
    ]
  },
  {
    "productId": "GiFQkjBdCk",
    "url": "https://www.etsy.com/listing/1363810273/hanging-bird-feeder-wooden-birdhouse?click_key=c5f6fc5df4acf7be889e12b79260c70e70deaf2e%3A1363810273&click_sum=6b08385a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-15&pro=1&frs=1&etp=1&content_source=e0f2d3389d0988fff33abc61971363294b3588ab%253A1363810273",
    "title": "Hanging Bird Feeder, Wooden Birdhouse, Squirrel Feeder, Large Birdhouse, Outdoor Decor",
    "description": "This feeder is a wooden bird feeder that looks really amazing and serves its purpose both in feeding birds and as a decoration. It has a handsome design with detailed laser cutting, creating a beautiful tree silhouette that will look beautiful to people and look like twigs to birds.Handmade wooden birdhouse- 100% nature and craftsmanship- The houses are handmade.- Nothing is machined!!- Ideal for the ecologically conscious consumer.* Birdhouse, feeder, winter aid or fun while watching.* with four open sides, easy to fill* super firm for fixing by the metal hook* provide protection against moisture and moisture* high-quality & robust workmanship* quickly hung up",
    "reviews": [
      "Beautiful! Very well made and wrapped with care. Exactly what I was looking for to add to my parakeet’s flight room. Even the eye screw has a small block of wood covering the metal point inside the feeder. The safety of my birds is the most important thing to me. The floor was very easy to line with cage paper. Thank you for all of the details put into this item so they will be safe from any harm. I cannot wait for them to find it on their next outing. Thank you very much!",
      "Exactly as expected, lovely color",
      "Great gift for a friend’s preschooler",
      "No problems! Good customer service etc."
    ]
  },
  {
    "productId": "9AflOTIkaD",
    "url": "https://www.etsy.com/listing/847435139/hummingbird-stained-glass-suncatcher?click_key=a4cc569f5833227509049f9b9ea6235445dcbf45%3A847435139&click_sum=bc0edd6d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-16&pro=1&etp=1&content_source=277475273fe6f1af10a78f20f0bc1bd884e6f399%253A847435139",
    "title": "Hummingbird stained glass suncatcher Stained glass decor Modern stained glass bird lover gift",
    "description": "This sophisticated Hummingbird suncatcher could be perfect decor for your home and garden. Its a good accessory for your interior and amazing gift for people whom you love.BUY 3 PAY LESSIf you want to buy a set please use the link:https://www.etsy.com/listing/687927124/hummingbird-stained-glass-suncatcher?ref=shop_home_active_1&pro=1DIMENSIONS:Height 3.2 inchWidth 4 inchGlass, berries and leaves could be a little different.Price include gift&safe packaging and window fixture.All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me in private messages for details.Any item can be customized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Very satisfied with purchase.  Items were carefully packaged.  Customer service was quick to respond when I had a question!",
      "Adorable and well-made. I would recommend!",
      "The hand painting just makes it gleam in the sunlight. Little guy hangs in my kitchen window so I can look at him absolutely beautifully made. Thank you so much.",
      "Quality is great! Shipping was decent considering the time of year and origin. I did have to sign for the package or go pick it up at the post office!! The tip of the hummingbird beak is very sharp. It was a perfect gift to give to my mom for Christmas!"
    ]
  },
  {
    "productId": "DERg9kheTa",
    "url": "https://www.etsy.com/listing/805734720/floral-boho-outdoor-patio-throw-pillow?click_key=3a691c878a9cb21e12ac4cc09131f0a481bb6a7d%3A805734720&click_sum=6ce7f1a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-9&pro=1&frs=1",
    "title": "Floral BOHO Outdoor Patio Throw Pillow Bohemian Flower Girl Art Painting Artist Pillows Abstract Watercolor Outside Cushions Garden Artwork",
    "description": "FREE SHIPPING!The outdoor pillows have UV protection, and are waterproof / mildew resistant.\"Floral Sister\" is one of my original mixed media artworks transformed into unique outdoor throw pillows and other home decor accessories l.Cut and sewn to order in the USA.All the art and design you see in my store was painted by me and sold exclusively through my Sincerely Joy brand ✌️THANK YOU SO MUCH FOR YOUR SUPPORT OF MY ART!➤ C.Cambrea Art printed on both sides.➤ The pillow is filled and sewn shut.➤ Durable 100% spun Polyester Poplin fabric.➤ Tumble dry low, do not bleachAVAILABLE SIZES:➤ 16\" x 16\"➤ 18\" x 18\"➤ 20\" x 20\"ALSO AVAILABLE AS AN INDOOR PILLOW:https://www.etsy.com/listing/229614951/original-art-pillow-fairy-angel-abstract🌸SHIPPING: These pillows are made to order so kindly allow 4-6 business days for printing and shipping prep.➤ Fav my shop if you like this. Etsy will notify you when i post new work ✌️🌸 AS A THANK YOU FOR THE SUPPORT OF MY ART all customers receive a 10% off coupon upon checkout. Good for your next purchase with me! Every purchase enables me to continue to do what I love and your support is so appreciated! ❤︎LETS CONNECT:☀︎ Read more about the products and brand: http://www.sincerelyjoy.com/☀︎ Instagram:@ccambrea☀︎ Patreon:https://www.patreon.com/ccambrea☀︎ Pinterest:https://www.pinterest.com/SJstore/© C.Cambrea Art🌸 Sincerely Joy",
    "reviews": [
      "Beautiful! Waiting on andirondack chairs to arrive. LOVE them!",
      "Very happy with my purchase!",
      "Love it so much! Awesome"
    ]
  },
  {
    "productId": "Mlh8fkDRZv",
    "url": "https://www.etsy.com/listing/1690201807/luxury-indoor-tree-with-flower-outdoor?click_key=d7e4b0d99cd7b5a5ca5b72417e1b7bd21496f128%3A1690201807&click_sum=0183b3d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-10&pro=1",
    "title": "Luxury indoor tree with flower, Outdoor swing stand for adult, Child tree swing, Sitzbank kind, Altalena floreale, Hanging chair swing set",
    "description": "💢Luxury swing with wedding tree flower can be used indoors and outdoors for adults and children, you can use the Boho style swing flower on your special occasions, swing for decor or for taking photos.💢 Add fun and decor to the environment with a handmade flower swing. Swinging indoors or outdoors provides relaxation. Put it in your backyard, living room, children's room, bedroom as a charming tree rocking chair. This isn't just a swing; It makes a memorable gift for weddings or any special occasion, plus it can be personalized. Elevate your space with this stylish minimalist design.💢Perfect as a charming addition to children's rooms, living room decoration or even restaurants and photo studios.💧order preparation time: 1-3 business daysKey Features:✨ Floral Elegance: Adorned with a captivating flower pattern, our swing seamlessly integrates into any home decor style.❇ Quality Craftsmanship👶 child Room Decor🛋️ Living Room Decor💫hanging chair swing set💢Ideal for Restaurants and photoshoot✅industrial style and retro swing❤Handcrafted with care and attention to detail🔰Outdoor swing stand for adult💯luxury swings are 100% handmade and wooden.♻Eco-friendly materials for a sustainable choice🎁nice gift idea✨ Eye-Catching Home Accent: Make a statement with this stylish indoor swing that doubles as a decorative masterpiece.DIMENSIONSwood size: 65 x 20 cm (25.6 x 7.87 inches)Swing load up to 120 kg.Size of the rope: 2- 2.5 meters👉If you want a different thread size, please specify in the message after ordering!!🤙-----------------------(𝙋𝙇𝙀𝘼𝙎𝙀 𝘾𝙊𝙉𝙏𝘼𝘾𝙏 𝙈𝙀 𝙁𝙊𝙍 𝙔𝙊𝙐𝙍 𝘾𝙐𝙎𝙏𝙊𝙈 𝙎𝙄𝙕𝙀𝙎!!)---------------- ---------------It can be used as decoration in photo shoots, housewarming parties, restaurants and cafes. It may also be a good idea for furniture decoration. It can be hung outdoors and indoors.🌴Swings are made of pine and oak.This wooden swing is brushed, varnished and coated with paint that protects the wood from moisture and UV rays.natural swings have rounded edges, making them safer.⛔Two carabiner clips are included in the package to hang the swing.Swing hanging hardware is NOT INCLUDED.⚠️ SECURITY:Do not leave your child unattended!!! Swings are designed to be used under 100% adult supervision. We are not responsible for any injuries resulting from misuse of our product.⚠⚠FOR ROPE DIMENSIONS LARGER THAN 3 METERS;SINCE WE DO NOT HAVE SPACE AT THIS HEIGHT, WE ADD THE ROPE TO IT AND SEND IT. YOU JUST THREAD A ROPE THROUGH THE HOLES AND TIE A KNOT ACCORDING TO YOUR OWN MEASUREMENTS.EVERYTHING OTHER THAN THIS COMES PREPARED🅾🆃🅷🅴🆁 ​ 🆂🆆🅸🅽🅶 ​ 🅼🅾🅳🅴🅻🆂https://www.etsy.com/shop/ElitedesignsforyouTR?ref=profile_header",
    "reviews": [
      "I was in contact with many nice sellers on etsy. He was by far the best. He responds to all questions and requests. Very helpful and very nice. Responds very quickly and really tries very hard. You don't need to worry. The price is fair. Swing is one to one as in the photo.",
      "Very fast shipping very happy with the item"
    ]
  },
  {
    "productId": "ZsNk9rooqw",
    "url": "https://www.etsy.com/listing/1461263128/water-repellent-outdoor-floor-cushion?click_key=e11cae2f126eae5cb698ae4122197313f5a6e5f6%3A1461263128&click_sum=295dbeb7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-11&pro=1&frs=1&pop=1&sts=1",
    "title": "Water-repellent Outdoor floor cushion, floor sofa, floor cushion, custom size floor pillow, floor couch, custom outdoor cushion",
    "description": "Waterproof floor cushionsThese cushions are very versatile, you can use these straight on the floor, on a lounger chair, on a wooden bench, by the pool, indoors.These are made from water-repellent fabric (This article has been tested and resulted in a water resistance average of 1727 mm H2O. This means it is waterproof against rain.)Filling: holofibre, polyester cushion filling.Cushion is tufted.There are multiple sizes available and custom sizes are possible to order by request, usually it takes 1-2 weeks to prepare. Extra colors also by request.**BOTTOM**23\"x39\" / 60x100cm23\"x63 / 60x160cm23\"x71\" / 60x180cm23\"x78\" / 60x200cm31\"x47\" / 80x120cm36\"x63\" / 90x160cm31\"x78\" / 80x200cm47\"x71\" / 120x180cm (the first picture of the listing)Round D45\"/ 115cmYou can also order matching pillows for the back, these are tufted in 1 row. If you wish to have more tufting rows, please write a special request with the order :)** BACKREST**15\"x24\" Backrest cushion (40x60cm)15\"x31\" Backrest cushion (40x80cm)15\"x47\" Backrest cushion (40x120cm)We recommend have sets of:31\"x47\" & backrest 15\"x47\"36\"x63\" & two backrests at 15\"x 31\"47\"x71\" & 15\"x47\" Backrest cushion  or 3 backrest cushions at 15\"x24\".This cushion is about 5\" thick. Comes with a zipper.The cushion also has an inner cushion that is not sewn shut, so if needed, there is possibility to add more filling in the future ( there is a zipper too).",
    "reviews": ["Great quality and I love it!!"]
  },
  {
    "productId": "cxrnFVkyeq",
    "url": "https://www.etsy.com/listing/1411944654/handmade-earthy-grey-pottery-gourd?click_key=afaf0c8eab1eb443b2ec9b110fe2eb38e0aa5ace%3A1411944654&click_sum=458890bb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-12&pro=1&frs=1&sts=1",
    "title": "Handmade Earthy Grey Pottery Gourd-Shaped Vase  ( multiple sizes )",
    "description": "Earthy Gray Pottery Pot  (finish varies no two are the same) Hand made. Finish and size vary in these Unique vintage Pots, No two are exactly the same each has its own Vintage Character.11 inches Dimensions: 5 (in) Width X 5(in) Depth X11(in) Height.10 inches Dimensions: 5 (in) Width X5 (in) Depth X10 (in) Height.No two pieces we carry are the same , dimensions might differ from each pot .",
    "reviews": [
      "Beautiful item! I ordered this for my boyfriend and he absolutely loves it.",
      "Beautiful sturdy exactly what I hoped for",
      "Very cool, stool! :) Love it. Might get another.",
      "Thank you for your feedback and review .",
      "Great quality gift and arrived on time.",
      "Thank you for your feedback and review ."
    ]
  },
  {
    "productId": "kJhXUCV9kS",
    "url": "https://www.etsy.com/listing/875526284/spice-bird-garden-balancer-by-happy?click_key=9c978dd5b89c4681f6c8ca1a4dbc81f77c9d5fb0%3A875526284&click_sum=03b13669&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-17&pro=1&sts=1&content_source=421d5365f488bfc068eaa76c7de0b0aae735b8dd%253A875526284",
    "title": "Spice Bird Garden Balancer by Happy Gardens, Yard Art, Garden Stake, Outdoor Decor, Garden Decor, Garden Ornament, Garden Art, Gardening",
    "description": "Spice Bird Garden BalancerThis Spice Garden Balancer will bring a touch of kinetic energy to your garden, lawn or flowerbed. This moving sculpture features a cute little bird perched on a branch with detailed leaves. Perfect for a flower bed, and right at home in a potted plant, this whimsical piece makes a fun addition to any outdoor space. Like all our ornaments and statues, this Happy Gardens item is individually handcrafted.Dimensions: 18” L x 26” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!Don't forget to also check out our very popular wind spinner collections, and very popular wind chimes.Other similar products of interest include:Spice Bird Rain GaugeSpice Bird Plant PickHanging Spice Bird Bath",
    "reviews": [
      "My husband loved this gift!",
      "Great to know that he loved it. We appreciate your review, Angie and of course, thank you for doing business with us :)",
      "I love the quality. It brings something fun to my garden!",
      "Yay! Glad to know you're loving it, Jennifer. Thank you for trusting us. ❤️❤️❤️",
      "great color, great Christmas gift, fast delivery"
    ]
  },
  {
    "productId": "FRoZZHxIhR",
    "url": "https://www.etsy.com/listing/682838296/ships-in-2-days-metal-cat-garden-stake?click_key=132288d6f9e781c45000f591adc807641d207337%3A682838296&click_sum=6eca5061&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-18&pro=1&frs=1&sts=1&content_source=d680924f59c803f6452f59d097d4a8ef9f2a0fcf%253A682838296",
    "title": "Ships in 2 Days | Metal Cat Garden Stake - Gifts for Her - Cat Lovers - Garden Art - Spring Decor - Summer Decor - Metal Art",
    "description": "*2 DAY SHIP ONLY APPLIES TO RAW STEEL FINISH, THIS REFLECTS OUR PROCESSING TIME FROM ORDER DATE TO SHIPMENT DATE NOT TOTAL TIME TO ARRIVE AT YOUR DOOR.  PLEASE ALLOW AN ADDITIONAL 3 DAYS FOR POWDER COAT FINISHES.Let this metal garden stake add some rustic charm to your outdoor space. This steel cat yard art is perfect for your garden, yard, or patio. This marker is a great way to add some sweetness to your garden decor!ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding images, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 10\" wide x 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.-FinishRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that dayOUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "I love it! I have a cat so it is perfect for outside our front door!",
      "Absolutely met all expectations! Heavy durable material that will be able to withstand any weather. Very happy with it and proud to display it!",
      "The piece is very well made and feels like it is going to last. It's nice and heavy, perfect for my needs. It was packed safely and shipped very quickly as well."
    ]
  },
  {
    "productId": "hKbbNIUeCa",
    "url": "https://www.etsy.com/listing/826342357/hearts-ornament-garden-ornament-hanging?click_key=4906c50c03320954d7cdb5147cb6148f0e711185%3A826342357&click_sum=5390a3ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-19&pro=1&sts=1&content_source=2fd76d7e16d6b2960c6b31bafd48a1f3883eed9a%253A826342357",
    "title": "Hearts Ornament, Garden Ornament, Hanging Ornament, Outdoor Heart Ornament, Outdoor Spinner, Patio Decoration, Gardening Gifts, Gift for Mom",
    "description": "Hearts OrnamentPassion, compassion, and love: Celebrate life’s essentials with our Flamed Hearts Hanging Ornament. This exquisite piece features hearts within hearts, which begin as flat, two-dimensional shapes and take on a third dimension with every touch of the breeze. The flamed metal finish is versatile enough to complement existing adornments, and it offers a subtle, colorful gleam that’s wonderfully irresistible. Like other hanging ornaments from the Happy Gardens collection, this one has been individually handcrafted, and will bring lasting beauty to a variety of settings.Framed heart spinnersFlamed steel constructionDimensions: 48” LCAREFULLY HANDCRAFTED - Our ornaments are intricately designed and then produced using high-quality, durable materials that are perfect for the Great Outdoors.EASY TO ASSEMBLE AND CLEAN - Each of our ornaments is as frustration-free as possible. Rest assured that all assembly will be straightforward, and that you’ll be enjoying your new decor the very same day it arrives. All our ornaments can be cleaned without hassle, too.DESIGNED TO DELIGHT - Our ornaments are beautiful and unique. That means they’ll stand out not only in your garden, but also in the gardens of those you love. We work tirelessly to source products that make great gifts and are markedly different from what mainstream sellers are offering. You can rest assured every item we stock is special and will make a great gift--or make your neighbors totally jealous!TOP-OF-THE-LINE QUALITY - We take pride in every item we sell. All of our ornaments have been individually chosen for their beauty and durability. We work with only the finest craftspeople, and often choose sturdy-but-beautiful materials like steel and stone to increase the longevity of our ornaments.NO-RISK 1 YEAR WARRANTY - Our collection of ornaments is backed by a one-year, limited replacement warranty and our top-notch customer service. If your purchase doesn’t meet your expectations, just let us know within a year. We’ll replace it, give you a refund or make it right.",
    "reviews": [
      "So beautiful, great quality and , fast shipping",
      "For the price, the quality is good. It was exactly what the pic looks like and what I wanted.",
      "I totally love these hearts! They are a really great piece. I'm sure I'll purchase more in the future.",
      "Beautiful! I Love it! Quality is great!"
    ]
  },
  {
    "productId": "zMMfbFbbIW",
    "url": "https://www.etsy.com/listing/875531042/frog-garden-statue-frog-sculpture-yard?click_key=1735ba2d200b3d082e985c995e86f777bb3ea598%3A875531042&click_sum=3fe65e11&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-20&pro=1&sts=1&content_source=b09042448d7405239dd8cec47b4e412d68a58f28%253A875531042",
    "title": "Frog Garden Statue, Frog Sculpture, Yard Statue, Patio Statue, Garden Decor, Outdoor Statue, Outdoor Sculpture, Gardening Gifts, Garden Art",
    "description": "Frog Garden StatueYou don’t need to worry about kissing this frog–he’s already a prince once placed in your garden! Built with natural river stones and steel, our Frog Garden Statue looks good in all types of outdoor settings and can be placed just about anywhere. Crafted individually by hand, this piece will be a notable, lasting accessory to your home’s exterior. (Or interior! Who’re we to judge!?)Dimensions: 3” x 2” x 1.5”River Stone and SteelHANDCRAFTED WITH LOVE - Our garden statues are made by hand with reclaimed river stones by some pretty incredible people. The Honduran manufacturer who provides us with these statues dedicates a portion of his proceeds to improving life for these artisans.EASY TO INSTALL AND CARE FOR - When you receive your statue, the hard work will have already been done. Rest assured you (or the lucky recipient of your gift!) will have this item on display in no time. And cleaning and caring for the statue will be a breeze, too.TOTALLY ADORABLE - Our animal-themed garden statues are so cute, our customers almost can’t stand it. Order your favorite animal, or create an outdoor menagerie and collect ‘em all.MADE WITH QUALITY MATERIALS - Unlike many garden statues available for sale, the ones we offer at Happy Gardens are made from only the best products like real river stones and heavy-duty steel.BACKED BY A FRIENDLY ONE-YEAR WARRANTY - If you have a problem with your garden statue within a year of purchase, just call us! Our customer service team is proud to stand by our one-year limited replacement warranty.",
    "reviews": [
      "Super cute rock frog for garden!!",
      "The little frog was just too cute.  The customer service was over the moon good.  They did everything they could to get it shipped quickly as it was a gift.  It arrived the day of.",
      "Hi there, Jan! I am glad everything went well. We believe that our customers deserve nothing but the best 💚 Thank you for your business!",
      "Love this rock frog!! He is awesome!!!"
    ]
  },
  {
    "productId": "ZvmUwIaxzM",
    "url": "https://www.etsy.com/listing/879873244/dragonfly-suncatcher-glass-garden-art?click_key=021b59a57055382d5246e333b0bdc30a95d6a780%3A879873244&click_sum=944aa979&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-21&pro=1&sts=1&content_source=ae611472cdc6d5824ddb062d26d197b458d83baa%253A879873244",
    "title": "Dragonfly suncatcher, glass garden art, copper outdoor decor, jeweled butterfly sun catcher, whimsical gifts for her, plant mom, mothers day",
    "description": "The Dream Cascade Suncatcher, a stunning addition to any outdoor or indoor space. Our suncatcher is meticulously crafted using solid hand-sculpted copper and shimmering crackle glass orbs. Measuring 10.5 inches long with a total length of 14 inches (including the hook), this whimsical design features two 1 inch diameter orbs and three 1/2 inch diameter orbs.Our suncatcher is adorned with a charming copper dragonfly or butterfly, adding a touch of natural beauty to your surroundings. This semi-precious metal is over 99% pure, ensuring that your suncatcher is of the highest quality and will last for years to come.Perfectly placed in outdoor spaces, sunrooms, patios, porches, and more, this suncatcher will enchant your garden and create an atmosphere of tranquility. Its natural charm and sparkling glass make it a true delight for the senses. Our Dream Cascade Suncatcher also includes a copper hook, making it easy to hang and display.Personalize your Dream Cascade with a hand-stamped copper disc to design the perfect gift, celebrate a special memory, and bring joy! We can stamp names, dates, and words to offer encouragement and delight.Experience the beauty of nature with our Dream Cascade Suncatcher. Adorn your favorite tree or hang it by your window and watch as it creates a mesmerizing display of light and color. Don't miss out on the chance to own this irresistibly beautiful suncatcher!Find the perfect plant and garden accessories at Dragonfly Dreams:GARDEN STAKES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav&section_id=5382837WIND CHIMES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav&section_id=32634106WHIMSY STICKS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav&section_id=32633808Artisan-designed handcrafted sculptures, created in my home studio with raw materials sourced in the USA and purchased from USA small businesses. Handmade art may vary slightly in size. Loving care is taken at each step of the process to ensure the pieces created are exceptional.* We offer combined shipping on multi-item orders based on weight and destination. The combined rate is calculated at checkout.This art should be cared for in the same manner as fine jewelry. Copper will age to a beautiful patina if left in its natural state. Patina is not a destructive process but if you wish to retain the bright finish of this art it will need to be cleaned periodically if displayed outdoors.Items pictured above are examples, your item will be specially made for you.Some glass orbs have a luster finish, some do not. We cannot guarantee what finish will be available at the time of your order, please contact us prior to placing an order if you have a preference.© 1999-2024 Dragonfly Dreams",
    "reviews": [
      "Beautiful item for my parents house in Florida.",
      "It is so beautifully made!!",
      "Sun catcher is so pretty. Thank you!",
      "It's even prettier than in the pictures! I bought it as a birthday present, and now I'm thinking of ordering one for myself. I'm also keeping this store in mind for future gifts! I'm very happy with the purchase."
    ]
  },
  {
    "productId": "dufCPNLYgX",
    "url": "https://www.etsy.com/listing/1505400092/gone-fishing-skeleton-garden-decor?click_key=1e1b849c3297d95bde535499758ee7f0503ec256%3A1505400092&click_sum=454f71d8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-22&pro=1&frs=1&content_source=2358e411114aae28a0d61c1a7361158ff0a2a2e6%253A1505400092",
    "title": "Gone Fishing Skeleton Garden Decor, Outdoor Yard Decor, Lawn Decor, Porch Decor, Home Decor, Room Decor, Resin Decor, Desk Ornament",
    "description": "Item: Fishing SkeletonMaterial: ResinType: Garden DecorSize: 4.5 x 11.5 cm / 1.7 x 4.5 inches",
    "reviews": [
      "Real cute item.  I was concerned about the shipping time and got fast/quick responses from the seller.  did not arrive in time for Halloween, but I was going to use it year round anyway.",
      "This was a gift. They loved it.",
      "They were very helpful when my items was lost  in transit and sent a replacement promptly.",
      "Customer service was excellent. The item that I ordered never made it to me and I was issued a refund promptly. It would have been nice to receive the the product but the seller made it right."
    ]
  },
  {
    "productId": "3wZtPKEFHx",
    "url": "https://www.etsy.com/listing/1246609119/rustic-metal-squirrel-with-brackets-tree?click_key=f839e91206252746b44e7e569b52e7d967b9e8e2%3A1246609119&click_sum=f68c85ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-23&pro=1&content_source=f090a8b7c33c93c6fce489b0ca31313926e5262a%253A1246609119",
    "title": "Rustic Metal Squirrel with Brackets- Tree Stump Art- Mailbox Decor- Outdoor Animal Yard Decoration- Summer Woodland Creatures Plasma Art",
    "description": "16 Gauge Mild Steel13” x 14” or 11.5” x 12.5”This rustic metal woodland squirrel is the perfect addition to decorate the backyard, mailbox, woods, or landscaping.Comes with two brackets that allows for easy installation and can be affixed to tree stumps, fences, mailbox, railing, etc.Rusted on both sides to create a beautiful patina and then lightly clear coated to ensure the rust stays in place.A perfect birthday gift or present to adore our woodland creatures and turn a backyard into a forest.Made from quality steel and cut with a CNC plasma cutter.We are a local business out of Sparta, TN. Thank you for supporting small businesses like us!",
    "reviews": [
      "I absolutely LOVE my squirrel.  Every little detail is captured, and if you saw it out of the corner of your eye, you might, like my husband, think it was real!",
      "Excellent product, received it quite fast!",
      "I gave the squirrel as a gift for a friend and they loved it. It is super cute and it well made. I was happy with how quickly the item was made and shipped. Definitely recommend!"
    ]
  },
  {
    "productId": "vYydyyAsqU",
    "url": "https://www.etsy.com/listing/696778067/garden-sun-catcher-with-large?click_key=ad10b27193477948a2a8c42fa930101c40567d3f%3A696778067&click_sum=b1f2014b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-24&pro=1&frs=1&sts=1&content_source=1e6d71979d6bfeef61df5fa9894731d8ba92695b%253A696778067",
    "title": "Garden sun catcher with Large rhinestones & mirrors perfect decoration for outdoor parties, teacher gift, gift for gardener, FREE hooks",
    "description": "These multi-colored extra large rhinestone adorned strings of garden art are a favorite and best seller!  The rhinestones are HUGE and really pop, adding loads of color!   Perfect for outdoor party decorations year round!Fancy Tree Jewelry adds whimsy and fun to any outdoor space year round! Everyone loves the tiny reflections and the bursts of sparkle that scatter and dance when the wind catches and the sun or moon is shining. Tough enough to withstand summer heat and the winter freeze, these unique dangling sun catchers are magical and dazzling.Strings adorned with mirrors,  acrylic rhinestones or glass beads, some with crosses or snowflakes, strung from branches, hanging from your deck or porch will add whimsy to your outdoor space. These catch the breeze as it wafts by and the mirrors scatters the sunlight to create a magical ambiance. Add a bit of whimsy by hanging several strings.Hang your Fancy Tree Jewelry from tree branches, garden hooks, off your deck, anywhere you need a little bling! Leave out rain and shine, summer and winter!  All weather! That's right, you never have to take these inside. These are tough little buggers, and easily handle the extreme cold to the extreme heat!  These are made with #15 fishing line, acrylic rhinestones, glass beads ...  materials that are made to withstand any type of outdoor condition, from the minus 20 degrees of the upper mid-west to the extreme heat of the Arizona summers.Fancy Tree Jewelry would be the perfect accessory to dress up your garden year round, and they would also make the perfect gift!!🩵 LENGTH / SIZE: These are 12\", 24\", 36\", 48\", and 60\"🩵 FREE hook with each string of Tree Jewelry (ie: buy 12 strings, get 12 FREE hooks!)🩵 MIRRORS: The mirrors are hand-cut, and so this means the edges are very sharp! Please be extra careful when touches, especially those little hands. Each is approximately 1/2\" in size.🩵 HOW TO HANG: Each string has a loop at one end. Loop it over a small branch with the hook so that the string can dangle freely.🩵 CARE & MAINTENANCE: You can leave these out year round, through summer heat and winter cold. Every once in a while, you can wipe clean the mirror to make sure they sparkle & reflect!🩵  If you need your Tree Jewelry sooner, for an event or gift deadline, you can now upgrade your order to EXPEDITED!  Add this to your cart, and your order will be jumped to the front of the queue!!   Use this link:https://www.etsy.com/listing/100860490/tree-jewelry-garden-art-rush-my-order🩵 SHIPPING TIME: 2-3 business days within the USA with USPS Flat Rate Shipping.  Each string is hand-made and will be packaged for safe shipping.  You will receive a tracking number to track your package!🩵 INTERNATIONAL ORDERS: I have a set price for shipping to international destinations.  Each order is different, depending on order size, weight, and country, and so shipping prices vary greatly.  I will REFUND the difference to you once actual shipping costs are calculated.  I do NOT make money on charging extra!!  If you are unsure of what your costs will be, send me a message with your intended order and your address.  I will calculate for you and give you a good estimate of what to expect.  Thanks for understanding!!❤️ GIFTS: We can ship our Fancy Tree Jewelry directly to your gift recipient. We are happy to include a complimentary gift note and even gift wrapping for the occasion!  Please send us the text you'd like to use in the notes to the seller field",
    "reviews": [
      "Looks beautiful.  Most likely will order some for gifts.",
      "Thank you Suzan!",
      "Beautiful and looks great in my yard next to another hanging ornament. Adds just the right amount of bling and sparkle.",
      "Thank you!  Looks amazing!",
      "Love these, already had some and decided to decorate my front yard tree even more for the winter.  Looks great.",
      "The beading is a little off but they're going in my garden so no one will be looking too close."
    ]
  },
  {
    "productId": "egcJVcSymK",
    "url": "https://www.etsy.com/listing/1643488629/sturdy-plant-stand-natural-bamboo-2-tier?click_key=fe951a9f2f7f2ff585e09e190ed67be32c0fc251%3A1643488629&click_sum=9bcd9a96&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-13&pro=1&frs=1",
    "title": "Sturdy Plant Stand Natural Bamboo 2 Tier Tall Corner Plant Stand Pot Holder for Small Space Flower Shelf Rack Display Table Minimalist",
    "description": "Dimensions: The Bamboo Tall Plant Stand measures 12.6(W) x 12.6(D) x 23.6(H) Inches. It provides ample space for multiple plants or different-sized pots, allowing you to create a personalized display.Durable Bamboo Plant Shelf: Made from 100% natural bamboo, this plant stand is sturdy, sustainable, and built to last. Its natural finish adds a rustic charm to any home decor.Versatile Usage: Use this flower shelf rack in your living room, balcony, patio, or garden. It's ideal for displaying potted plants, flowers, succulents, herbs, or even decorative items like books or photo frames.Indoor and Outdoor Use: With its weather-resistant design, this corner plant shelf is suitable for both indoor and outdoor use. Bring the beauty of nature inside or create an inviting outdoor display.Stylish and Functional: The sleek and minimalist design of this tall plant stand adds a touch of elegance to any space. Its open-shelf structure allows for proper air circulation, promoting healthier plant growth.Easy to Clean: Simply wipe the bamboo plant stand with a damp cloth to keep it clean and looking fresh. Its smooth surface is easy to maintain.Easy Assembly: The plant stand comes with all the necessary hardware and a clear instruction manual. No extra tools required, simply follow the steps to assemble it in minutes.",
    "reviews": [
      "Cute little plant stand, looks like the description,\nShipping was a day early.",
      "Very beautiful plant stand I love the color of the wood.",
      "It is a nice style and sturdy enough for a medium size plant.",
      "Exactly as shown, easy to assemble."
    ]
  },
  {
    "productId": "sTPQUfpvUj",
    "url": "https://www.etsy.com/listing/1117306943/mosaic-fountain-handmade-for-outdoor?click_key=4480f3230fc1bbda7a829fb1521cacbba2cc5669%3A1117306943&click_sum=0e2ea073&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-14&pro=1&frs=1",
    "title": "Mosaic Fountain Handmade for Outdoor Patio,Handmade Furniture,Handcrafted Mosaic Fountain,Mosaic Decor,Unique Ddesign;Wall Mosaic Decor",
    "description": "**All our products can be left outdoor in winter time or summer,the tile is very known for its durability.**IMPORTANT NOTICE : for bigger sizes of this item please visit the links bellow, there is a special sale on them actually :https://www.etsy.com/listing/1193717883/garden-mosaic-fountain-for-outdoor-patiohttps://www.etsy.com/listing/1099855695/garden-mosaic-fountain-for-outdoor-patioAtlasTiles introducing to you the new item in our store, the tiles fountains, handmade by artisans trying their best to pass on their heritage to the rest of the globe. A fountain where every detail counts. Distinguished design with a variety of colors, AtlasTiles promises you the best material quality.The fountains are elegantly and exquisitely handcrafted by Moroccan artisans with variegated terracotta made from euphonious synchronized colors. The artful patterns of the tiles are encased in a big iron frame similar to the shape of the fountain.The back of the fountain is made of Resin instead of Cement, that way the fountain is lighter, you can easily move it, if you feel like changing a bit of view. Moreover, the iron frame glued to the fountain has wheels so you don’t have to carry it.Let us explain how the fountain works: After you unpack the fountain, make sure you put it somewhere near a socket so you can plug the engine water pump. This is very essential for the circulation of the water you put inside the fountain. There you go, now you can enjoy the sound of water flowing inside you house.A little suggestion from our team: use flavored kind of water in the fountain, that way you get to enjoy the pretty smell as well as the sound. Bring your coffee and come to relax.The fountain comes also with an electric water pump, a mounted spout and a solid packaging so no need to worry about the shipment,and a demonstration of how the fountain works that way you will be able to make it work certainly.Morocco is one of the few countries in the globe having mountains to extract tiles, and one of the best in its production. A unique designs, distinguished colors and famed materials to obtain a high-quality product.The story begins precisely in the area called Ben Jellik. Mountains of raw clay used in Zellige. After the clay is drawn out from the heart of the mountain and took to the four to give it the shape, the clay tiles are paint with colored glass in one of the two sides, then they are levelled and cut. The cutting is done in three phases: First is a form need to be drawn, whether we want triangles or squares or stars, then comes “Nequach” or the artisanal responsible of cutting it by hand by a sharp big hammer to give a perfect form to the clay, and finally they use a small hummer to sharp the edges. Then comes the artisan to start putting the individual hand-cut piece of tiles and start making the fountain, upside down which is magical, tells a lot about the expertise of the artisans. When he is done with the fountain, he adds the resin so the tiles stick together and he flips the fountain.You can watch it all in the amazing video in our store.AtlasTiles guarantee to you the total safety in terms of shipment.All our items are handmade and TOP quality.Our Instagram account and Pinterest to check our new items:Instagram : @AtlasTilesPinterest : @ AtlasTilesFor more information, feel free to visit the link bellow:https://www.etsy.com/shop/AtlasTiles/AtlasTiles team.Keywords: Moroccan Tiles Fountain, handmade Tile Fountain, Real Mosaic Fountain Morocco, AtlasTiles Fountain,Interior Decor, Mosaic Artistic Tiles Fountain,Backyard Design Patio Foutain,Morrish Pattern Fountain,Wall Mosaic Fountain,Garden Fountain,wall hanging, Room Decor, oversized, Nursery room, Nursery décor, Large furniture, home décor, gift for mom, Gift for her, gift for grandma, craft room décor, room decor aesthetic, wedding favors, decor wall art original bedroom, decor home, Decor wall, decor for bedroom, decor wall art original,Moon Wall Hanging, Moon Decor,Handmade Hammered mosaic,Boho Bedroom Celestial ArtKEYWORDS : Moroccan Tiles Fountain, handmade Tile Fountain, Real Mosaic Fountain Morocco, AtlasTiles Fountain,Interior Decor, Mosaic Artistic Tiles Fountain,Backyard Design Patio Foutain,Morrish Pattern Fountain,Wall Mosaic Fountain,Garden Fountain,wall hanging, Room Decor, oversized, Nursery room, Nursery décor, Large furniture, home décor, gift for mom, Gift for her, gift for grandma, craft room décor, room decor aesthetic, wedding favors, decor wall art original bedroom, decor home, Decor wall, decor for bedroom, decor wall art original,Moroccan Tile tagine,Andalusian Kitchen Style,Interior Design, Handmade Pottery tagine,Antique tagine,Home Décor,Cooking Time, Middle Age Porceline,Real Traditionnal Tile,Indoor Design,Cookware,Keywords: Moroccan Tile Sink,Andalusian Bathroom Style,Interior Design, Handmade Pottery Washbasin,Antique Sink,Home Decor, Middle Age Porceline,Real Traditionnal Tile,Indoor Design,Renovation ideas,Marble Design,Luxury Sink,Decor InspirationNotice :- Please we inform you that the scheme may be incomplete for the small sizes of the items, however the processing time is shorter,and the items are fascinating nevertheless.-We inform you once again that the colors may be slightly different from the real thing due to the Camera/Phone resolution,-Contact us for anything regarding shapes or sizes of custom colors.Thank you",
    "reviews": [
      "Shipping took much longer than expected.  I would put next order in more in advance.  \nCustomer service was very pleasant and sinks are beautiful!",
      "Nice item … like it a lot",
      "Beautiful sink. It was packaged very sturdily and was delivered quickly. Everything went smoothly."
    ]
  },
  {
    "productId": "ZyRXlxpfYx",
    "url": "https://www.etsy.com/listing/1107004110/wind-flower-viii-metal-yard-art-metal?click_key=34fec79e81c71357eb38363694d3823fc7b3fb37%3A1107004110&click_sum=b1584bb5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-15&pro=1&cns=1&sts=1",
    "title": "Wind Flower VIII | Metal Yard Art | Metal yard art flowers| Metal Yard Spinner | Metal Flowers for Garden",
    "description": "Wind Flower VIII is the perfect unique addition to your backyard décor.It rotates with the slightest breeze and brings light and motion into your garden,creating a feeling of complete unity of living nature with the essence of metal.Place it amongst garden shrubbery or flowers. Simply push into the ground and position vertically.Wind flower VIII  can be easily transformed into a kinetic wind spinner which can then be placed on a tree or on a cornice.Kinetic Wind Flower VIII  makes the perfect gift for modern art lovers and gardeners alike. Truly unique and one-of-a-kind, our modern wind spinners are sure to amaze and delight any recipient and are ideal for gifting on any occasion; Christmas, birthdays, retirement, anniversaries, house warming presents or treat yourself and your garden to a new art installation.Made of stainless steel, the windflower will serve you for years, bringing the magical dance of the wind into your garden.● Thoughtfully designed kinetic metal flower to add an attractive addition to your outdoor area and makes  the perfect gift for your mom, dad, spouse, grandparent, child, or anyone in between!● Great for those wishing to up the style of their outdoor décor and enjoy a unique artisanal piece that will provide peace and tranquility.● Easy to assemble and install● Stainless steel which lasts for years● Dimensions: 30 in. tall, 12 in. wide● Garden decorationfull product video:  https://www.youtube.com/watch?v=3EFr1e2MwWsmore info : https://www.ilventosculptures.com",
    "reviews": [
      "Great wind spinner! Came unassembled, but watch the video and it's easy to put together - only made one mistake, quickly corrected. Many thanks!",
      "awesome product! This is my second one!",
      "Super item by a great seller! Very helpful in tracking the delivery. Love this shop, I now have several products.",
      "Great item, beautiful craftsmanship! Spins easily, simple to assemble. Love the stainless look, highly recommended, great seller, thank you!"
    ]
  },
  {
    "productId": "FBSoenrNN4",
    "url": "https://www.etsy.com/listing/1674186544/reproduction-3-piece-set-chairs-pair?click_key=1106fce8a158bef2176fc2a1662d6f03c233b31d%3A1674186544&click_sum=61fd851a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008142-4-16&pro=1&frs=1&cns=1",
    "title": "REPRODUCTION 3 Piece Set Chairs Pair Side Table NAVY Powdercoated Patio Retro Style Shellback",
    "description": "Looking to add a splash of color and retro charm to your outdoor space? Look no further than this 3-piece REPRODUCTION set of powder-coated chairs and side table. The Navy color and shellback design evoke a fun, retro vibe that's sure to impress your guests. Perfect for relaxing in the sun or enjoying a cold drink, this set is a must-have for any patio or deck. Don't miss out on this stylish and functional addition to your outdoor decor! Fast, Free Shipping! Easy To Assemble!",
    "reviews": [
      "Such a beautiful set! I get lots of compliments on it. Exactly what I hoped for.",
      "Perfect replacement brackets. Packaging was great and shipping was fast.",
      "The item was just the right size."
    ]
  },
  {
    "productId": "NyclbSocRS",
    "url": "https://www.etsy.com/listing/1644732241/silhouette-fairy-dancer-solar-yard-art?click_key=9ac29864e0724ede60cf84b81e0c6cbc932b9e7b%3A1644732241&click_sum=9716845d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-25&pro=1&sca=1&content_source=41ed13be58acafa283e684b6761c1b7a2156aa1a%253A1644732241",
    "title": "Silhouette Fairy Dancer Solar, Yard Art, Garden Decor, CHOOSE Color",
    "description": "* Dim: 5.5\" W x 5.5\" D x 36\" H.* Beautifully colored 3D solar stakes each feature an elegantly posed ballerina with fairy wings and a solar lighted skirt.* Small coil springs create a flutter effect of her wings in the wind and glow from the reflection of solar skirt at night.* Material Metal and Acrylic.",
    "reviews": [
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it.",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!"
    ]
  },
  {
    "productId": "LRuubcmOhI",
    "url": "https://www.etsy.com/listing/977109657/dragonfly-whimsy-flutterer-dragonflies?click_key=7f60bfc4e44acb53ba609f471404ecd6dca4b883%3A977109657&click_sum=0b9324c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-26&pro=1&sts=1&content_source=ae3d735f8a5cabdfa81829c7bff7d5364fa6b707%253A977109657",
    "title": "Dragonfly Whimsy Flutterer | Dragonflies | Yard Art | Garden Stakes | Yard Stakes | Rain Gauges | Garden Decor | Outdoor Art | Gardening",
    "description": "Dragonfly Whimsy FluttererTreat your garden to a special touch! Our Dragonfly Whimsy Flutterer makes a marvelous addition to your landscape, beautifully complementing a flower bed, or even adding the perfect finishing touch to a favorite potted plant. With five delicate dragonflies that dance as breezes pass, this charming piece makes a wonderful gift for yourself or someone special. Like all Happy Gardens stakes, this one is handcrafted, and brings lasting beauty to your home’s landscape.Sturdy metal constructionBeautiful flamed finishDimensions: 20” W x 55” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Item arrived in a timely fashion, packed well, and matched the description perfectly.",
      "Glad you like it, Catherine. We appreciate your support to our small business. :) Take care!",
      "perfect christmas gift thank you",
      "Awesome and super fast shipping!!",
      "Thanks a lot for your feedback. We are so happy to know you like it :)"
    ]
  },
  {
    "productId": "hTdawtOsnP",
    "url": "https://www.etsy.com/listing/1672095658/smoking-funny-fairy-garden-gnome-white?click_key=1615a58fdb7283ac1b1212ddc04bd9ce2c7ad5b2%3A1672095658&click_sum=1cacb601&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-27&pro=1&frs=1&content_source=7f741d6ef13ec213503e11865152420be194c2e3%253A1672095658",
    "title": "Smoking Funny Fairy Garden Gnome | White Wizard Gnome, Outdoor Statue, Dwarf Garden Sculpture, Garden Decor, Garden Figurine, Home Decor",
    "description": "🚬 Smoking Funny Fairy Garden Gnome👉Turn your garden into a magical paradise with these charming resin dwarfs!👉 These cute little figures add a fun touch while also keeping an eye on your plants.👉 Crafted from high-quality resin, they're built to last and will maintain their charm for years to come.👉 Come rain or shine, they'll be there to bring a smile to your face and brighten up your day.👉Size: 15cm x 9.5cm x 7cm👉 Expertly Hand Painted And Polished in the United Kingdom",
    "reviews": [
      "Awesome product would recommend prodcut",
      "So lovely. Really stands out in the garden",
      "My second little birdhouse from this seller, very happy with it and highly recommend this seller.",
      "Thank you so much for you support!",
      "Lovely wooden birdhouse for my garden, good communications with the seller. Would recommend highly.",
      "Much appreciated Clare :)"
    ]
  },
  {
    "productId": "MKmqxyfbSU",
    "url": "https://www.etsy.com/listing/963140872/bee-spiral-with-bells-mobile-wind-chime?click_key=9dc12c6f590d22221a72968492be601feb15aec3%3A963140872&click_sum=af98bbd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-28&pro=1&sts=1&content_source=2edbc3a90d2c5849452d9a2740a3319ee3280a85%253A963140872",
    "title": "Bee Spiral with Bells Mobile Wind Chime | Garden Decor | Patio Decor | Wind Chimes | Gifts for Mom | Gardening Gifts | Outdoor Decor | Decor",
    "description": "Bee Spiral with Bells Mobile Wind ChimeCelebrate everything bees do for our world with this charming, unique Bee Spiral with Bells Mobile Wind Chime! This piece features spiral nests and delicate little bees in a natural, flamed finish. We love it suspended from a tree, just like a real beehive would be. Like all Happy Garden spirals, this one has been individually handcrafted, and will bring lasting beauty to any landscape.Whimsical honey bee motif with 8 bellsDimensions: 12” D x 35” HEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and wind chimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and wind chimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!Check out our other popular collections including the large range of rain chains, and stakes and gauges.Other similar products of interest include:Hanging Dragonfly with Bell OrnamentBell Spiral Garden Stake MulticolorPine Cone with Bell OrnamentHanging Bells Multicolor Mobile",
    "reviews": [
      "Sturdy well made bee chimes!  First shipment was unfortunately broken in transit, but seller quickly replaced it for me.\n\nJust put it out in my garden for spring!",
      "Great to know all went well. Thank you for working with us to make things right. We value your business, Cindy! ❤️",
      "I love these wind chimes. And the design is so fun!!",
      "The bee wind chime is so much better than I expected!  Very happy with purchase!!",
      "Awesome! So happy to know you like it. ❤️ We value your business and thank you so much for trusting us.",
      "Great gift for my Mother!",
      "Lovely! So sweet of you, Brian. Thank you for sharing this feedback. Another happy mom ❤️ We appreciate your business."
    ]
  },
  {
    "productId": "ROqRyS10TQ",
    "url": "https://www.etsy.com/listing/1582003935/metal-hummingbird-and-flower-garden-art?click_key=79b2961a0eda47bdfbb2ded3b1d6346720523612%3A1582003935&click_sum=66703038&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-29&pro=1&frs=1&etp=1&sts=1&content_source=f42c277b40ab6810b9f2509ea7489f5ad798d55b%253A1582003935",
    "title": "Metal Hummingbird and Flower- Garden Art",
    "description": "Metal Hummingbird and Flower- Garden ArtAvailable in (1) Single or Sets of 3Metal Hummingbird and Flower. Each hummingbird and flower is approximately 5\"x6\" with an 18\" bendable stem. The hummingbird wings are also bendable. These are also available with stem extenders that add an additional 18\" for a total of a 36\" long stem.Technicals:- 5\"x6\" hummingbirds- 18\" bendable stems- 18\" Stem Extenders (add-on)- Stems and stem extenders are gently coiled for shipping. This allows for the use of less packaging material and a lower shipping cost, which keeps my prices as low as possible for you.Other Garden Decor items:Metal Flower Set:https://www.etsy.com/listing/1459106844Metal Butterfly Set:https://www.etsy.com/listing/1459111490Metal Dragonfly Set:https://www.etsy.com/listing/1459114464Metal Hummingbird Set:https://www.etsy.com/listing/1465974998Metal Fairy Set:https://www.etsy.com/listing/1465979816Metal Dragons:https://www.etsy.com/listing/1478188389All of our metal garden art is made of raw mild steel that will arrive to you with a light amount of rust. Once placed outside your garden items will continue to patina to a beautiful rust colored finish. A simple spray-on or dip application of household vinegar will speed up this process even more.Contact me if you have any questions.Made in New York, USAbyNaked Metal Studio LLC",
    "reviews": [
      "Just as beautiful as the picture. Arrived packaged well and on time.",
      "This piece is unbelievably beautiful! Excellent craftsmanship, the metal exceeded expectations! Shipped super fast and delicately wrapped. Thank you so much, I can’t wait to order more!",
      "The packaging was weird and we weren’t sure if we were supposed to bend the metal back"
    ]
  },
  {
    "productId": "ukCtSghvJJ",
    "url": "https://www.etsy.com/listing/1251362621/garden-decor-outdoor-metal-agave-yard?click_key=4d25efc716f26a2388b0f94b65f75787a16bea1b%3A1251362621&click_sum=06bd9721&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-30&pro=1&frs=1&content_source=bb5e0f6df7a10e0eccc6315f0f88801055a88ae5%253A1251362621",
    "title": "Garden Décor Outdoor Metal Agave Yard Art, Handmade Rustic Cactus Tequila Plant Sculpture Patio Backyard Lawn Ornaments and Accessories(2pc)",
    "description": "Inspired by natures beauty, this metal agave is sure to impress. This piece is 100% handmade from steel and features a beautiful, durable finish. Our artificial succulent is perfect for adding a rustic, yet modern feel to any garden or home interior. It's extremely sturdy, and the unique design will make it stand out in your landscaping. The vibrant colors of each hand painted spine will add personality and flair to any space. To ensure it's sturdiness and beauty, each piece is welded by hand and is sprayed with an acrylic sealer to prevent fading. There are many great benefits of owning an artificial plant, one being maintenance. No need to water, prune nor fertilize. It is also allergy friendly.STURDY & STRONG💪🏽 We have designed our steel agave plant to be as sturdy as possible, replacing the flimsy stake with a larger and stronger base that can either be beautifully displayed or easily buried to make it appear as if it's growing from out of your garden. Each spine is securely welded, enforcing its original position and is sure to never bend nor break.HANDMADE🖐🏽 Our tequila sculpture is 100% handmade and hand painted in Mexico, where the unique natural Mexican maguey plants originate. Our rustic Aztec desert decoration brings beautiful gifts from Mexico's soil to your home. As these artificial agaves are handcrafted individually, no two are exactly the same, imperfections and dimensions may slightly differ.NO INSTALLATION REQUIRED 🔨 Tools not necessary. This plant comes completely finished and ready to set up as soon as you unpackage it. NO screws, NO bolts, NO extra work. Save the energy here by simply setting the agave wherever you desire.WEATHERPROOF💦 Made of heavy duty steel, our faux lawn ornament will handle any of the outdoor elements thrown its way. Through rain and dusty desert wind storms, the thick materials will never bend and the base is certain to keep it in place.INDOOR AND OUTDOOR USE🏡 If you are looking for decorations to spice up your front garden, backyard, patio, or even the interior of your home, your search ends here. This cute metal statue allows you to get creative with your inner designer self.PRODUCT DIMENSIONS:FIRST PLANT16\"X10\"X10\"2.5 LBSSECOND PLANT12\"X9\"X9\"1.5 LBSAs each piece is hand crafted, dimensions may slightly differ.",
    "reviews": [
      "Beautiful product - will look great outside!",
      "Great for the back yard.",
      "I had a small problem with the order that was handled ASAP. Order arrived on the day they started. The plant looked exactly as pictured. High quality. I only wish they were just a little bigger. Thank you guys. Happy customer.",
      "I love, love my new agaves! I love the scissored edges, it makes them look real. They are well made. They come in one piece, each plant is professionally welded together. \nI love the green and brown color ... just spectacular!"
    ]
  },
  {
    "productId": "OZjLiCzOvu",
    "url": "https://www.etsy.com/listing/1217266245/hummingbird-solar-powered-led-wind-chime?click_key=b9369159d944b7c18845038e5631420db2bdd208%3A1217266245&click_sum=17feab1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-31&pro=1&content_source=66b623c69c145b24580b4750de8043bcfe761dfd%253A1217266245",
    "title": "Hummingbird Solar Powered LED Wind Chime, Color Changing, Outdoor Decoration, Patio Lighting",
    "description": "Solar Powered LED Color Changing Humming Bird Wind ChimesAutomatically recharges and saves power, no batteries necessary!High quality and made with careColors are beautiful and illuminate at nightHooks easily, and very smooth set up processPackaged very securely with bubble wrapPlease feel free to send me a message with any questions you may have!",
    "reviews": [
      "It was a gift … they liked it!",
      "Item was delivered as described.",
      "Came super fast. The quality seems good will be a Christmas present for my mom who loves hummingbirds!",
      "Good quality, fast shipping…product just as described!"
    ]
  },
  {
    "productId": "IZXDKNryjA",
    "url": "https://www.etsy.com/listing/1461658203/solar-lights-set-of-2?click_key=0bb7b523ca4171eaae3b2ca6577528c2ce18ab26%3A1461658203&click_sum=d49b963a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-32&pro=1&content_source=b513bcefd3ed489001b2d2e39e8b4cdb07ad187d%253A1461658203",
    "title": "Solar Lights, Set of 2",
    "description": "Waterproof.27\" tall with stake.15.5\" tall without stake.2 per pack!",
    "reviews": [
      "Beautiful flowers 💐. Very timely delivery.",
      "Very pretty still raining here so haven’t seen them light up",
      "Nice light and great customer service",
      "My sister loved this product"
    ]
  },
  {
    "productId": "nUpFKeuEIw",
    "url": "https://www.etsy.com/listing/1507131589/butterfly-stained-glass-wind-spinner?click_key=d0d7a21a3064ea052d5e52b843396419f28433fa%3A1507131589&click_sum=29a3886f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-33&pro=1&sca=1&content_source=9b5d52c9b706da170cbeb2ba9023f36e396846d0%253A1507131589",
    "title": "Butterfly Stained Glass Wind Spinner, Yard Decor, Outdoor Garden Decor, Butterfly Gifts For Women, Unique Gifts For Mom, Birthday Gift",
    "description": "These metal spinners open up into a beautiful piece of art that moves and spins in the windThe pictured design will be printed double sided onto aluminum. Suitable for indoor or outdoor use, e.g. yard, garden or in a windowCharms or additional spinners can be hung from the bottom for extra personalization (not provided)..........................SIZING AND MATERIALS8\" x 8\" (203mm x 203mm)Made from .045'' (1.15mm) thick aluminumDurable, scratch-resistant and waterproofHardware included for hangingShipped flat and easily assembled - see listing photo for instructions........................................................FURTHER INFORMATIONPlease note that colours shown on your monitor/phone may appear slightly different from the finished productDesigns are transferred using a dye sublimation printing process which produces a permanent, high quality image that won't scratch, peel or fade away with timeAs all of my items are made to order, I can provide extra personalization if needed. Simply send me a message before ordering and I will do my best to meet your requirements!........................................................SHIPPINGFree shipping to Canadian addresses are sent using Canada Post Lettermail and I am unable to provide any tracking information for this service. You can also choose Upgraded shipping which includes trackingOrders to USA are shipped using USPS and tracking will be providedPlease check out the other items in my shop athttps://www.etsy.com/ca/shop/MortalFrogGifts",
    "reviews": [
      "love it ty. Well packaged.",
      "loved it!!! great quality and super funny gift",
      "Absolutely beautiful and perfect as a keepsake. Great to work with and super friendly. Looking forward to some other goodies!",
      "Absolutely love it! Perfect anniversary gift!"
    ]
  },
  {
    "productId": "KyTTPWZAoU",
    "url": "https://www.etsy.com/listing/219872278/copper-and-glass-wind-chimes-dragonfly?click_key=8c383e5cb2a281958f43f65dca4a47594d0f791c%3A219872278&click_sum=5bf18ed0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-34&pro=1&sts=1&content_source=f3b2611100e11e0dec10a17b79e2f7e170cbd133%253A219872278",
    "title": "Copper and glass wind chimes, dragonfly and butterfly garden decor, personalized indoor and outdoor garden art, plant mom gifts",
    "description": "A gorgeous whirlwind wind chime created from glass, copper, and bells!• 15 inches long• 22 inches total length with hook• Eighteen 1/2 inch glass orbs• Hand-sculpted copper (semi-precious metal over 99% pure)A whimsical whirlwind copper top created with a circle and spiral combination, adorned with a copper dragonfly or butterfly. Completed with 18 shimmering 1/2 inch diameter glass orbs nestled in solid hand-sculpted copper. As a special finishing touch, little copper bells that softly jingle!   Delightful as a tree charm or suncatcher and perfectly displayed indoors or out! Includes a copper hook.Double Rainbow color selection has 12, 1/2 inch diameter glass orbs, not 18.Find the perfect plant and garden accessories at Dragonfly Dreams:GARDEN STAKES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=5382837WHIMSY STICKS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32633808SUNCATCHERS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32650315Artisan-designed handcrafted sculptures, created in my home studio with raw materials sourced in the USA and purchased from USA small businesses. Handmade art may vary slightly in size. Loving care is taken at each step of the process to ensure the pieces created are exceptional.Made to order by hand with attention to detail.  Whimsical & Magical with the Warmth & Beauty of True Copper!This art should be cared for in the same manner as fine jewelry.  Copper will age to a beautiful patina if left in its natural state.  Patina is not a destructive process but if you wish to retain the bright finish of this art it will need to be cleaned periodically if displayed outdoors.Items pictured above are examples, your item will be specially made for you.© 1999-2024 Dragonfly Dreams",
    "reviews": [
      "Very pretty and I have had compliments",
      "Arrived quickly and exactly as ordered",
      "The chimes are beautiful! I absolutely love them. It perfectly matches the description and was beyond my expectations! Shipping was fast and packaged with care. I will be ordering more artwork from this seller, I highly recommend her!",
      "Item itself is beautiful & arrived undamaged. Happy with purchase."
    ]
  },
  {
    "productId": "poCBfhWYko",
    "url": "https://www.etsy.com/listing/1674999753/columbine-hand-painted-wildflower-garden?click_key=8902c49101f6d682542a605f0ba780e166047013%3A1674999753&click_sum=038571b5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-35&pro=1&content_source=d4d8180841803b5f8662f68952f53fb67e1b2354%253A1674999753",
    "title": "Columbine Hand Painted Wildflower Garden Art | Flower Silhouette | Rusted Metal Yard Art | Garden Gifts | P121P",
    "description": "Bring the serene beauty of the wilderness into your garden with Columbine, a hand-painted wildflower metal silhouette. Crafted with meticulous detail, this garden art piece adds a touch of natural elegance to any outdoor space. The vibrant hues of the Columbine flower are captured in every stroke, creating a stunning focal point amidst your blooms. Whether adorning a flowerbed or gracing a tranquil zen garden, this piece is a thoughtful gift for any nature lover or gardening enthusiast. Handcrafted with care, each Columbine silhouette embodies the essence of the great outdoors, inviting you to pause, breathe, and appreciate the simple wonders of the natural world. Enhance your outdoor sanctuary with this exquisite garden treasure.",
    "reviews": [
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed."
    ]
  },
  {
    "productId": "AUjQeZWIKN",
    "url": "https://www.etsy.com/listing/1018501440/personalized-48-qt-wood-cooler-excellent?click_key=ecfe77d110899e2129ed189ac9b554012edd13ff%3A1018501440&click_sum=30ed7f1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-36&pro=1&frs=1&etp=1&content_source=4ff02e5772cd0a472bf6d5eeb1bf321f26bbbb54%253A1018501440",
    "title": "Personalized 48 qt wood cooler.  Excellent patio accessory item!",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "I love it, just as I hoped it would be.",
      "Cute little deck cooler just wish it was a bit taller",
      "This is my second time purchasing this item - love it!"
    ]
  },
  {
    "productId": "DwbFgDrSAa",
    "url": "https://www.etsy.com/listing/860602326/bird-house-garden-decor-stake-with-bells?click_key=2e4486d156101df9e90080386d4f55036cc4deec%3A860602326&click_sum=6cfc7e1a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-37&pro=1&sts=1&content_source=4046782aae88c557548736c02c38463783cc9fd8%253A860602326",
    "title": "Bird House Garden Decor Stake with Bells, Garden Decor, Patio Stake, Yard Art, Outdoor Decor, Gardener Gift, Birds Lover Gift, Gift for Home",
    "description": "Bird House Garden Decor Stake, Assorted StylesAlone or in groups, these whimsical beauties add an enchanting touch to any outdoor space! Our Bird Houses Garden Stakes come in assorted styles – yet each offers some similarities. Cheerful birds peek out from their lovely little domiciles, adding a sense of sweetness to your outdoor space. Each stake includes a single sculpted bell, which offers a pleasing chime whenever breezes blow. Like all décor from our Happy Gardens collection, this garden stake has been individually handcrafted, and will bring lasting beauty to any outdoor space.These are sold on an individual basis. We unfortunately don't allow the choosing of a selected style at this time.Flamed metal finishDimensions: 5.5” W x 34” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!You may also be interested in our best selling stakes and gauges including:Triple Calla Lily Garden StakeStanding Birds Garden StakesHummingbird Garden StakeBird House Garden Decor StakesBell Spiral Garden StakeSpice Bird Rain Gauge",
    "reviews": [
      "I love these little houses!",
      "I bought this as a gift. The recipient is thrilled with it. It’s a charming garden stake unlike any other. I will buy from this artist again.",
      "Lovely! Thanks for your feedback and for support, Beth!",
      "Received quickly and great shape"
    ]
  },
  {
    "productId": "waIvSRFbKB",
    "url": "https://www.etsy.com/listing/1449470911/new-arrival-beautiful-hand-painted-palm?click_key=6cbeb8b15078c2ebeb5c67364fa07eb66039f504%3A1449470911&click_sum=cb6c9daa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-38&pro=1&frs=1&content_source=b2d15d78a6eb316182b66ee0fd8e6747fdff1ce8%253A1449470911",
    "title": "New Arrival !!! Beautiful Hand Painted Palm Trees, Bamboo Wind Chime, Mothers Day Gift, Ships Free G-107",
    "description": "Painted Palm Trees Bamboo Wind Chime G-107Size approx: 5\"top - 35\" - 38\"tColor: soft jewel tonesPainted TubesRepurposed woodHanger for easy installationCalming mellow tonesMade in the Philippines by families that use the natural resources around themNo two are alike - but similar- always the same approximate lengthPlease let us know that this is a gift and we will include a card with your message.We no longer ship to Puerto Rico or any of the Protectorates. We also do not ship Internationally.  We will ship our packages with FedEx and UPS, please no PO Boxes for delivery addresses. No partial returns accepted, all items must be returned.",
    "reviews": [
      "Beautifully crafted. Seller shipped promptly.",
      "Beautiful and meet my expectations.",
      "Great quality! Can’t wait to hang it up",
      "Very nice windchime.  Communication was excellent and shipping prompt.  Thanks!"
    ]
  },
  {
    "productId": "TWhLboosyl",
    "url": "https://www.etsy.com/listing/956213040/poly-wall-flower-fence-flower-outdoor?click_key=ae4c9a8377e51b38b83242e6fabe71e8ca692b32%3A956213040&click_sum=32b4d3ff&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-39&pro=1&frs=1&content_source=a0e9d4774e75cc08b4708a4fc417d01056228962%253A956213040",
    "title": "Poly Wall Flower, Fence Flower, Outdoor Decor, Fence Decor, Yard Art, Garden Shed Decor, Bright Colors (SET OF THREE)",
    "description": "Poly FlowerEach set comes with 1 of each flower (7.5X8, 10X11.25, 17.25X19.25)Available Colors Red, Lemon Yellow, Bright Purple, Aruba Blue, Cardinal Red, Pink, Bright Orange,Blue, Sky Blue, Lime Green, White, Brazilian WalnutCustom colors available on request.These flowers will brighten up your fence, garden, or backyard.Made to last a lifetime.Our products will not splinter, crack, chip, peel or rot and are impervious to insects.Rich colors stay brilliant, thanks to built-in UV protection.Low Maintenance (No painting, staining, or waterproofing required.)Choose your desired flower color when placing your order.If you want different colors in the set you can let me know via the note during checkout.Each flower is assembled with stainless steel screws and has a small hook for hanging.Check out my other listing to buy individual flowers.Contact me if you would be interested in buying in bulk at a discounted price.",
    "reviews": [
      "Another awesome sale! This seller never disappoints with quality and fast shipping!",
      "I was delighted when I opened the package!! Beautiful work and colors!! Will be back for more😊",
      "Thanks!",
      "Bought these for a summer camp! Great quality and our campers LOVE them! :)",
      "Thanks!",
      "There are so adorable and look exactly like the picture! Love them.",
      "Thanks!"
    ]
  },
  {
    "productId": "ulLAtCoCb4",
    "url": "https://www.etsy.com/listing/1140593935/hummingbirds-triple-ring-mobile?click_key=d8c974d2c9147a2ed05bee7799c543200793af8d%3A1140593935&click_sum=aad0bd53&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-40&pro=1&frs=1&etp=1&content_source=45cb633b1fddc5e11c588c1d87a7a709cd465e8d%253A1140593935",
    "title": "Hummingbirds Triple Ring Mobile",
    "description": "The Hummingbirds Triple Mobile is a beautiful display of these iconic energetic birds. It features three unique hummingbird silhouettes. The first ring displays a hummingbird in flight with wings outspread, feeding on the distinctive Fuchsia flower. The second ring displays a hummingbird resting in its nest among the trees, a rare and hard-to-spot sight. The third ring displays the iconic hummingbird silhouette, hovering in midair while sipping from a trumpet-shaped bloom.The Hummingbird Triple Ring Mobile is made of recycled steel and pre-treated to create our signature rusted texture and natural look. It would be the perfect accent hung from your front porch to greet guests that visit your home! Or, display this in a native plant garden to attract other hummingbirds to feed!INSPIRED BY NATUREHummingbirds are tiny, yet iconic birds that can be spotted at feeders throughout much of the Americas. Bring their distinctive silhouette and energy year-round to your garden or patio with our Hummingbirds Triple Ring Mobile!SO EASY TO INSTALL & DISPLAYThis gorgeous piece of metal garden art is so easy to display. It includes a chain so that you can easily hang it wherever you’d like as soon as it arrives!Your steel silhouette can be gently shaped by hand to add dimension and depth. Simply fold out the wings and branches to awaken their life-like charm!THE PERFECT SIZESKU# M300Dimensions: 8 in. wide x 8 in. deep x 24 in. high.",
    "reviews": [
      "Super duper cute! Mom loved it",
      "Just as pictured and shipped quickly!",
      "Great quality and wonderful customer service!"
    ]
  },
  {
    "productId": "QPFzftAEPS",
    "url": "https://www.etsy.com/listing/1397830576/folding-space-saving-table-for-deck?click_key=5fb15d909b65ab6cd06cd6fbf93197a375632c60%3A1397830576&click_sum=51f0f075&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-41&pro=1&frs=1&sts=1&content_source=395135ff1a53759241689949a5b308c1cb954b3b%253A1397830576",
    "title": "Folding Space Saving Table for Deck, Veranda, and Porch Railings, Balcony Bar Table Hanging over Railing, Outdoor Foldable Railing Bar Table",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.FREE & EXPRESS SHIPPINGFREE shipping (USA) & EXPRESS Shipping worldwide.FAST DELIVERYI am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Any questions please message me.",
    "reviews": [
      "I love my barstools and I loved working with Omer and his team. They are awesome. The product is so easy to open and close. I am in love with the green color too!",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find barstool table awesome. Your satisfaction means the world to us.",
      "Ömer was so easy and lovely to deal with. The bar arrived within a few days and it’s so easy to install and use. Adds a whole other element to my balcony. Thank you for this beautiful piece",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony bar table quite beautiful. Your satisfaction means the world to us. Enjoy your new spacesaver table!",
      "The craftsman provides a lovely product and excellent communication. His video installation instructions are straight forward.\nThank you Ömer for a lovely addition to my outdoor sitting area!\nI will send photos this summer. \nCheers, Kendall"
    ]
  },
  {
    "productId": "C4vPUyisKf",
    "url": "https://www.etsy.com/listing/969884473/stained-glass-copper-garden-art-in-retro?click_key=64ee88899ba5313ae940305cc20f58864c8838fc%3A969884473&click_sum=01717b10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-42&pro=1&frs=1&content_source=9f35b83a5e786ac5703a14a9bf5c8eb9c37b70b2%253A969884473",
    "title": "Stained glass & copper garden art, In retro 70’s colors Free shipping, Sale",
    "description": "Attention colors may not match exactly. Stained glass sheets will vary in color.The frame shown is a large oneColor Retro 70’sThis is real stained glass like the glass that has been used in stained glass windows for 100’s of years.Each circle is wrapped in real lead came and the frame is real 1/2 copper tubing and soldered together.Large frame is 9in x 34inSmall frame is 6in x 32inFree Shipping on any of them.We will also do custom colors in any colors you like.My unique mounting system of 2-  steel stakes that you pound into the ground and slide the copper frame.   over them it will insures they will withstand it wind. outdoorsThey have a copper frame to protect the glass and give it a look of elegance.",
    "reviews": [
      "Beautiful work, high quality materials, really well packed and arrived on time.  My friends loved it.",
      "We absolutely love it!! Met all expectations",
      "This is a beautiful and well made decoration and I’m going to Oder another one to add to it! Just beautiful!"
    ]
  },
  {
    "productId": "IAABKqIDwh",
    "url": "https://www.etsy.com/listing/1681099919/loveballs-100-authentic-japanese-marimo?click_key=4bec8f9b474398bfc7a564cee247892c8cee234d%3A1681099919&click_sum=639d660d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-43&pro=1&frs=1&content_source=50ea24a728cc72bfa3971007a4ed374e7985b9b5%253A1681099919",
    "title": "Loveballs : 100% Authentic Japanese Marimo Moss Balls",
    "description": "Each LoveBall is a living work of art, carefully nurtured to create a captivating, spherical moss wonder. Nestled in crystal-clear glass containers, they capture the essence of love and tranquility, making them an ideal gift for your special someone.Key Features:💚 Living Love: These Marimo moss balls are living, breathing expressions of love from nature, and they symbolize eternal love and care.🌿 Low Maintenance: LoveBalls require minimal care, making them a hassle-free gift. Just provide them with a bit of indirect light and change the water every few weeks.🪶 Unique and Thoughtful: Surprise your valentine with a unique and meaningful gift that stands out from the typical flowers and chocolates.🏞️ Bringing Nature Inside: LoveBalls add a touch of greenery and serenity to any space, creating a tranquil atmosphere that's perfect for romantic evenings.💌 Gift-Ready: Each LoveBall comes in a stylish glass container, making it a ready-to-gift package for your beloved.Spread Love with LoveBalls:Whether it's for your partner, friend, or family member, LoveBalls: Marimo Moss Valentine is a beautiful, lasting gift that symbolizes your love and care. These exquisite moss balls are a unique way to celebrate the season of love and bring a piece of nature's beauty into your lives.Don't wait; get your LoveBalls today and watch your love grow, just like these enchanting Marimo moss spheres",
    "reviews": [
      "Item is as lovely as pictured!  The item was damaged enroute but seller immediately sent a replacement. Top notch!!! A+++",
      "Best purchase ever. Customs unwrapped the bubble wrap so my free gift broke but that’s okay because my main item was perfect!! Customer service was also amazing and helped me piece back together the mini terrarium.\nWill be doing future purchases here!",
      "These are two lovely little moss balls. Moss balls in love <3"
    ]
  },
  {
    "productId": "rcibPHaAeL",
    "url": "https://www.etsy.com/listing/1428129399/bird-wind-chimes-ceramic-wind-chimes?click_key=7aac58d6a957437278998af9e740e05c1ada4495%3A1428129399&click_sum=e76d6016&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-44&pro=1&sts=1&content_source=c5ca8a1c02ea79fa61109d452b1e664b1a962c1b%253A1428129399",
    "title": "Bird Wind Chimes, Ceramic Wind Chimes, Outdoor Wind Chimes, Ceramic Bells, Gift For Home, Garden Decor, Japanese Wind Chimes, Patio Decor",
    "description": "Bird Wind Chime Bell, Hand Painted Terracotta Clay, Boho Windchimes, Patio Decor, Boho Home, Garden Decor by Matr Boomie. Hang this bird terracotta clay bell wind chime, in an indoor or outdoor space where it can catch movement or wind to make a unique, soothing sound. Artisans in India use traditional pottery techniques mold and fire terracotta clay into modern designs for the home, patio or garden. This bird decor comes with a rustic jute hanger and tassel and hand painted white details, which would blend well with various design aesthetics.Dimensions5\"L x 3.5\"W x 3.25\"H ; hanging cord approx. 4\"LOur products are fair trade which means purchases directly support the artisans who make them and support wider community development projects in marginalized communities.*Due to the handmade nature of our items, variation is expected and item may differ slightly from photos.",
    "reviews": [
      "I love this little bird so chic.",
      "Lovely items - will make great gifts!",
      "Love love love! So cute and perfect for the bird lover in my life",
      "So beautiful! Quick shipping also!"
    ]
  },
  {
    "productId": "oeYTqGGzEd",
    "url": "https://www.etsy.com/listing/1416149190/saddle-up-plant-stand-canyon-sky-8-stand?click_key=c818f36b03afaaeaf020fb906310c72e77ac5b98%3A1416149190&click_sum=34c43289&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-45&pro=1&frs=1&etp=1&sts=1&content_source=0388818f651b6217fd132cfe7fe70f71629480e2%253A1416149190",
    "title": "Saddle Up Plant Stand - Canyon Sky - 8\" Stand Perfect for Displaying Plants - 3D Printed Aesthetic Apartment Décor",
    "description": "This sturdy little stand reminds me of a horse, she carries a LOT of weight so throw your big plant on Saddle and she'll keep it sturdy with her knocknees. Tested to 60 pounds!Saddle Up Plant Stand are 8 in tall, 10 in wide, and 8 in deep.-------------------------------------------------We are a completely queer owned and operated 3D Print Shop and Design studio, focused on achieving sustainable, equitable pay and the most earth-friendly material sourcing we can manage. We collaborate to build our own printers and design our own models and grow together as a group of creative friends. These are 3D Printed from our home printer farm, we give as much attention as we can to the quality of these prints, striving for smooth surfaces, nice matte finishes, well placed seams, lack of stringing etc. While there may be very small imperfections on some prints, we really try not to ship anything with significant printing flaws. If you do have issues with your print, we are more than happy to work out a return and refund. :)All our prints are made with corn-based PLA plastic",
    "reviews": [
      "A+++ Incredibly cute and very sturdy. Fast shipping",
      "My new favorite plant stand. The colors and shape are so cute!",
      "Very uniquely e. I love these pieces."
    ]
  },
  {
    "productId": "yEXrrsfDtr",
    "url": "https://www.etsy.com/listing/1541110309/patio-bar-planstiki-bar-plans-diy?click_key=8c70e57437e1f97613d729606ee804e12daefcd4%3A1541110309&click_sum=d657f525&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-46&pro=1&etp=1&dd=1&content_source=7f3e6604c35deb32bbdf7f2fe208f8d7efe0b502%253A1541110309",
    "title": "Patio bar plans,Tiki bar plans DIY Outdoor wooden bar plans, Build garden bar project,outdoor bar plans featuring wall roof, storage shelves",
    "description": "What will you find in this PDF download?• Easy to read step by step instructions• Material list• Tools needed• Helpful materials neededIMPERIAL UNITS.Time to build: About 7-8 hoursTotal cost of build: About $400Skill level required: Beginner-Pros of a DIY outdoor bar?-Summer is just around the corner and it’s a perfect time to gather friends and family to relax and enjoy the outdoors. This fantastic bas provides the necessary storage to hold glass bottles, glassware, napkins, and bar accessories.This DIY outdoor bar is more than just seating, it provides a space that enables you to host and service the guests and family in a more organized and professional way. The working counter of the outdoor bar provides a spacious area that can serve both as a working space and as storage for bar accessories.You can also use this bar center as a DIY outdoor buffet stand, beverage stand, and area for dispensing food for guests to take to their seats. You can place ice bins and coolers to keep drinks cold for the duration of a backyard, deck, or patio event.-How much does it cost to make this bar?-Total cost is about $400.-How difficult is it to make this outdoor DIY bar?-This would be a great project for anyone who is new to woodworking. The joints and cuts are simple and beginner friendly. If you follow the step-by-step instructions, you will be able to avoid mistakes, waste material, and in the end create the bar table without much hassle or worry.",
    "reviews": [
      "Item delivered in seconds digitally.",
      "Ssss sss ddd de ggg",
      "Great item, very clear instructions.",
      "Plans are very clear and detailed. After a bunch of different places we tried to put it, it is a little big for the topography of our yard, but I am taking a bunch of the design and construction ideas to customize one to fit."
    ]
  },
  {
    "productId": "nGbfSMCmrx",
    "url": "https://www.etsy.com/listing/1205651165/rusty-metal-3d-dragonfly-dragonfly-gift?click_key=364705b9d0d384316b49b4988f85eca775d56762%3A1205651165&click_sum=6ed81138&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-47&pro=1&frs=1&etp=1&content_source=dbe23fa80a33b2e13490e82ce49746edd9cb1365%253A1205651165",
    "title": "Rusty Metal 3d Dragonfly / Dragonfly Gift / Garden Insect / Garden Ornaments",
    "description": "Single Piece dragonfly that is freestanding on his legs.  Each Dragonfly is laser cut in house and rusted using our all natural formula, the item you will receive will be as pictured and ready to admire in your garden or make the perfect gift.We can arrange custom orders for larger versions or if you need a stake welding on, please get in touch for a competitive quotation within 24hrsDragonfly has a wingspan of 22.5cm  (9 inches)Larger version in our shop found herehttps://www.etsy.com/uk/listing/849606035Free UK delivery and competitive international tracked shipping",
    "reviews": [
      "A little smaller than I expected but overall very cute.",
      "Amazing its so cute and good quality.",
      "Perfect Xmas gift for my friend . Well made item",
      "Fantastic workmanship! The dragonfly feels really robust but looks so delicate."
    ]
  },
  {
    "productId": "U3KdOpfltQ",
    "url": "https://www.etsy.com/listing/1013490522/stained-glass-copper-garden-stakes-multi?click_key=50881efc11efd250b2097898f7e51f3f7cf82720%3A1013490522&click_sum=cacf16b2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-1008143-4-48&pro=1&frs=1&content_source=0224aef88a174e992234349bf641b1afcdd129b5%253A1013490522",
    "title": "Stained glass & copper garden stakes Multi color Free shipping",
    "description": "This is a stock Color there can be no changes in colors.This one is Multi colorThis is real stained glass like the glass that has been used in stained glass windows for 100’s of years.Each circle is wrapped in real lead came and the frame is real 1/2 copper tubing and soldered together.Large frame is 9in x 34inSmall frame is 6in x 32inFree Shipping on any of them.My unique mounting system of 2-  steel stakes that you pound into the ground and slide the copper frame.   over them it will insures they will withstand it wind. outdoorsThey have a copper frame to protect the glass and give it a look of elegance.",
    "reviews": [
      "Another beautiful stained glass garden decoration. Thank you!",
      "lovely.    seems durable.",
      "We bought this for a friends Labyrinth. Every year we add another piece of art to the walk.  This piece is unique and just a joy to look at.  We will need something else from you next year! Thank you so much",
      "Beautiful piece I know m mother will love.  Excellent customer service, first ite arrived with a broken glass.   When I notified the seller and asked if I could get a replacement in time for Christmas,  he made a new one and sent asap.  Received in time.   Thank you so much!  Definitely recommend."
    ]
  },
  {
    "productId": "jJyTqltdqB",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=ca8d4600ca7430faea04360786f222a4da92f20e%3A1567221560&click_sum=e08d38f2&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!"
    ]
  },
  {
    "productId": "uaGpzKJOVu",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=6696082aa60a70369bdcf46b5eed3fbb4191727a%3A1544035118&click_sum=986110c2&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Great product, and service would highly recommend it to anyone.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "cDnjigewTf",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=daccaa2bec7e338e45c2971295cea6a456d38331%3A747068567&click_sum=b09309d4&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!"
    ]
  },
  {
    "productId": "lYKoirjVIJ",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=043b81a524210848f7dd303b22ee9aeac3e3c250%3A654638870&click_sum=7a70e077&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "daSvduqOqp",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=fb0bf961ec27e6c82822e8cbc3b1400e99e597a2%3A1355783916&click_sum=3e0b562a&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist"
    ]
  },
  {
    "productId": "yTKGNjPOue",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=16ee9621339f74a6f340265f5fea50a2be31f8aa%3A1411614241&click_sum=7ee95437&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!"
    ]
  }
]
