[
  {
    "productId": "atwnp4lNXi",
    "url": "https://www.etsy.com/listing/1580491196/personalized-leather-toiletry-bag?click_key=a489eba3cbd64ef47500c92e4454c06e29670886%3A1580491196&click_sum=f49a05fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-1&pro=1&frs=1&bes=1",
    "title": "Personalized Leather Toiletry Bag, Leather Dopp Kit Groomsmen Gift, Graduation Gifts for Him, Anniversary Gift, Birthday Gift for Men",
    "description": "Welcome to Princeton Craft!Step into the world of exquisite leather craftsmanship with our collection of handcrafted toiletry bags. Our dedication to artisanal excellence is evident in every meticulously crafted piece. Whether you're on the hunt for a thoughtful gift or seeking a trusted companion for your journeys, our Dopp kits are designed to impress. Here's why you'll find them captivating:Personalized Leather Dopp Kit Bag, Christmas Gift, Father's Day Gift, Monogrammed Men's Toiletry Bag, Leather Gift for Him, Graduation Gift, Doctor Gift, Fireman Gift, Groomsmen Gift, Gift for Dad, Birthday Gift, Gifts for Men, Anniversary Gift, Leather Dopp Kit, Wedding Gifts, Personalized Gifts, Gifts for HusbandCrafted with Precision and Quality:🌟 Each Dopp kit is a labor of love, carefully handcrafted using top-quality cowhide leather to ensure longevity and timeless aesthetics.🌟 Beyond functionality, our leather Dopp kits are a declaration of your unique style and appreciation for the finer things in life.The Ideal Gift:🎁 In search of the perfect gift? Look no further! Our leather Dopp kits make for unforgettable presents for birthdays, anniversaries, weddings, and special milestones.🎁 Whether it's for your partner, groomsmen, father, or a dear friend, our Dopp kits combine practicality with sophistication.Personalization and Versatility:🔍 Elevate your Dopp kit by selecting from our four captivating color options: Antique Black, Light Brown, Dark Brown, and Blue.🔍 Add a personal touch to your gift with custom engraving.🔍 Have a distinctive design in mind? Reach out to us to explore your unique ideas.Designed for Your Ease and Style:✨ Our Dopp kits boast spacious interiors to neatly organize your toiletries and travel essentials.✨ Choose from a range of sizes available at PrincetonBags,-SMALL     (7\" x 3.9\" x 3.9\")-LARGE     (8.25\" x 4.25\" x 4.25\")-X LARGE  (9.5\" x 4.5\" x 4.5\")ensuring you find the perfect fit for your needs.✨ Each kit features a robust YKK brass zipper, guaranteeing the safety of your belongings while you're on the move.Shipping and Delivery:🚚 Your order will be thoughtfully prepared and dispatched within a business day. Select from our various shipping options for prompt, dependable delivery to your doorstep.Your Satisfaction, Our Priority:💌 At PrincetonBags, we hold your satisfaction in the highest regard. Should you have any queries or special requests, please don't hesitate to get in touch. We're here to ensure your purchase brings you joy.Unlock Savings with Bulk Orders:📦 Planning to acquire 8 or more Dopp kits? Benefit from exclusive discounts for bulk purchases. Reach out to us to uncover how you can save while indulging in top-tier quality.Connect with Us:💬 Have a question or require assistance? We're just a message away, ready to assist you in making the perfect choice and ensuring your shopping experience is seamless and enjoyable.Discover the allure and utility of our leather Dopp kits. Explore our collection today and elevate your travel style with PrincetonBags!",
    "reviews": [
      "Shipped quickly, amazing quality. My boyfriend loves the smell of it so much!",
      "This item was exactly what my husband wanted!  I was a little disappointed the shipping time wasn’t as quick as Etsy said it would be, but the quality of the item was fantastic!",
      "great quality and great gift",
      "My husband liked it a lot. Thank you so much."
    ]
  },
  {
    "productId": "XdAbYZJktl",
    "url": "https://www.etsy.com/listing/1531902969/dog-name-necklace-personalized-dog-ears?click_key=43392961a4db22c6da481088df30a66e1f25c9e3%3A1531902969&click_sum=0d820bf6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-2&pro=1&frs=1&bes=1&sts=1",
    "title": "Dog Name Necklace | Personalized Dog Ears Necklace | Custom Pet Jewelry | Pet Name Necklace | Pet Memorial Gift, Gift for Her,Christmas Gift",
    "description": "Dog Name Necklace, a personalized piece of jewelry that celebrates the special bond between you and your beloved furry friend. Crafted with love and attention to detail, this necklace is the perfect way to keep your pet close to your heart wherever you go. Each Dog Name Necklace is custom-made with your dog's name beautifully engraved on a dainty nameplate pendant. With 925 sterling silver, create a necklace that suits your style and preference. Our skilled artisans carefully handcraft each necklace to ensure the highest quality and craftsmanship. The attention to detail is evident in every curve and line, making each piece a unique and cherished keepsake. The Dog Name Necklace is not only a wonderful way to honor your furry friend but also a meaningful and thoughtful gift for any dog lover. Surprise a friend or family member with a personalized necklace featuring their pet's name, and watch their face light up with joy. Wearing the Dog Name Necklace is a beautiful reminder of the love and joy that our pets bring into our lives. It's a conversation starter and a way to share the story of your beloved pet with others.💎 All our dainty jewelry are handmade with love!➜ Material: REAL 925 STERLING SILVER➜ Finish: STERLING SILVER • 18K GOLD • ROSE GOLD❤ P E R F E C T    G I F T   C H O I C E ❤🐶 Dog Name Necklace İs packed in a delicate gift box.  This Necklace is perfect for gifting on any occasion, whether it's for a birthday, anniversary, Christmas, Mother's Day, Valentine's Day or just because. It's a thoughtful way to show your loved one how much you care, and it's something they can cherish for years to come.⚠️ If you do not add font, I will create it with F-2. Please ensure to take note of this while completing the order. !!!!Dog Ears:Ear 1 - AkitaEar 2 - Alaska MalamuteEar 3 - Australian CattleEar 4 - Australian ShepherdEar 5 - BeagleEar 6 - Belgian SheepdogEar 7 - Bernese MountainEar 8 - BichonEar 9 - Boston TerrierEar 10 - Basset BoundEar 11 - BoxerEar 12 - Border CollieEar 13 - BulldogEar 14 - Bull TerrierEar 15 - Cane CorsoEar 16 - Charles SpanielEar 17 - ChihuahuaEar 18 - ChowEar 19 - Cocker SpanielEar 20 - CollieEar 21 - CorgiEar 22 - DachshundEar 23 - DobermannEar 24 - Dogo ArgentinaEar 25 - DalmatianEar 26 - English PointerEar 27 - English MastiffEar 28 - French BulldogEar 29 - German ShepherdEar 30 - Golden RetrieverEar 31 - GreyhoundEar 32 - Great DaneEar 33 - HuskyEar 34 - Jack RussellEar 35 - Labrador RetrieverEar 36 - Miniature PinscherEar 37 - MatteseEar 38 - PugEar 39 - PomeranianEar 40 - PoodleEar 41 - RottweilerEar 42 - Saint BernardEar 43 - SchnauzerEar 44 - SamoyedEar 45 - Staffordshire TerrierEar 46 - Shih TzuEar 47 - Shiba InuEar 48 - Staffordshire BullEar 49 - Tibetan MastiffEar 50 - Yorkshire TerrierNotice:> Our products are small.> Check out the wearing photos.> It is a small piece of jewelry with meaning.> Although plating products have advantages, they also have disadvantages.> Stay away from water and soap.> If the color is discolored, try removing it with a silver cleaner or toothpaste.➤Production TimeAll items are custom made to order. Production Time is about 3 - 5 business days. This can change during peak seasons.😊 Thank you so much choosing me.ABOUT LIBRAMINIMALISThttps://etsy.me/3VhKTmKFor other jewelry in my store, please CLICK:➤https://etsy.me/3VkEoQ0",
    "reviews": [
      "Great customer service. I purchased the Cattle dog ear style and they accommodated having it not personalized. It’s a very cool necklace.",
      "Exactly as pictured, absolutely adorable!!!!",
      "Ordered as a gift for myself after my little guy passed away. Arrived on time and I haven't taken it off since. Great price - love it!"
    ]
  },
  {
    "productId": "uAxigxqzKN",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=c2233194ebf0e965e748c897b8a2780ce7129f0f%3A1544035118&click_sum=e263b9f8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-3&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Great product, and service would highly recommend it to anyone.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "This board was absolutely stunning! It was a gift to my dad and it was perfect.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "SHLwDLSZTM",
    "url": "https://www.etsy.com/listing/1218016121/14k-gold-multi-circle-name-necklace?click_key=5c1bc92f2b3bb15fe66613c823a5c6251f61172f%3A1218016121&click_sum=576ad515&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-4&pro=1&frs=1&bes=1",
    "title": "14K Gold Multi Circle Name Necklace, Silver Family Name Engraved Pendant, Custom Made Jewelry, Moms Personalize Gift, Valentine's Day Gifts",
    "description": "What is the perfect way to dress up any outfit or add your own flair?                                                       Accessorizing with jewelry, of course!From sparkling zircon necklaces and fashionable bracelets to stackable rings, GoldenRatioDesignCo has the perfect jewelry piece to accentuate your wardrobe, your lifestyle and your budget.♥ Our Circle Name Necklace is a versatile, intimate piece that can be worn everyday with your favorite shirts.★ PRODUCT DETAILS;*Material Options: 925k Sterling Silver & Rose Gold Plated & Gold Plated & 14K Gold & 14K Rose Gold & 14K White Gold► HOW TO ORDER;Please select your preferred CHAIN ​​LENGTH and MATERİAL-CIRCLE QUANTITY from the menu while adding to card.Please sort your desired names into the personalization box as in the example:We kindly ask you to consider this order while writing the names...1-Emma2-Robert3-Jessica4-Joseph5-ElizabethWHY ∙ YOU ' WİLL∙ LOVE ∙ IT• It's dainty and can be worn every day...• A special piece you'll treasure...• High quality materials and attention to detail...Attention International Buyers!!!The recipient is the importer of record and must comply with all laws and regulations of the destination country. Orders shipped outside of the United States may be subject to import taxes, customs duties and fees levied by the destination country. The recipient of an international shipment may be subject to such import taxes, customs duties and fees, which are levied once a shipment reaches the recipient’s country. Additional charges for customs clearance must be fulfilled by the recipient; GoldenRatioDesignCo has no control over these charges, nor can GoldenRatioDesignCo predict what they may be.International Returns:You are justified in refunding only the item price",
    "reviews": [
      "Great quality, as shown in the pictures! Perfect for a gift!",
      "Wife loved the item, great Vday gift",
      "Hey Esty..you need a better review section. Buyers should be able to rate their purchases without having to leave a 5 word review.",
      "Beautiful necklace! My mom is going to love it."
    ]
  },
  {
    "productId": "Zgtymzt8fF",
    "url": "https://www.etsy.com/listing/650996575/personalized-brown-leather-bracelet-3rd?click_key=a6edf28dcd8dc2a1c74d7929736d448f971e76eb%3A650996575&click_sum=57012ee5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Brown Leather Bracelet // 3rd Anniversary Gift for him",
    "description": "Personalized Leather Bracelet //  Handmade Jewelry // 3rd Anniversary or Graduation GiftAre you searching for the perfect meaningful or funny gift for Valentines Day? Look no further! Our adjustable two snap cuff bracelet is a meaningful personalized gift that lets you show your love with a subtle hidden message. Minimalist, and rustic on the outside and sweet and sexy on the inside. A cute fun gift to celebrate your commitment and years together. Full grain leather made to last, just like you and your special person.HOW TO CUSTOMIZE:1. Choose your size according to the sizing guidelines shown as the second photo.  Adjustable is our most popular if you are unsure!*The size ranges shown tend to be almost snug at the high side of the range and roomier at the low side, please keep this in mind when choosing your size.2. Choose your preferred font from the font list (this is the second photo in the listing, swipe left on the first photo to view).3. Use the 'Add your personalization' section during checkout to include your custom text for the inside of the bracelet** IMPORTANT, PLEASE READ **- Text will be printed exactly as it is written so please double check for typos. We will assume that any misspellings or grammatical abnormalities are intentional since we see these so regularly in custom engravings (inside jokes, silly and sweet messages, etc)- The only change we will make is to change '<3' into an actual heart character '♥' so if you do not want us to make this change please leave a note during checkout. The heart character in your engraving will be the heart character shown on the same line as the font you have selected unless otherwise specified.- If you use a an outlined heart character in your personalization text (♡) we will do our best to use an outline heart instead of a solid heart- In order to process and ship your order as fast as possible while keeping prices as low as possible we do not provide design proofs for customized bracelets.- Please reach out to us if you have a problem with your order, we're here to help and just an email away:  contact [!at] locallaserco.com____________________DETAILS:Material: Full Grain Leather with dark brown burnished edges and a soft smooth flesh side.Outer Color: Rich medium brownInner Color: medium brown with dark brown engravingClosure: Durable and easy to use solid Brass button closureDimensions: 0.5\" x size chosen at checkout (refer to the guide in product images)Hypoallergenic: YesGift Box: Included (3.5\"x3.5\" cotton filled gift box)Handcrafted In: North Carolina, USABy: Local Laser CompanyLOCAL LASER CO. ~ OUR PROCESSAll of our leather goods are handmade in our shop on the East Coast. We use high quality full grain leather sourced in America to create our products, ensuring that they will last.Many of our leather goods and gifts can be engraved with your personalized message - check out our shop or shoot us a message to find products that can be personalized. We love creating custom leather gifts for Anniversaries, Weddings, Birthdays, and more. We work hard to ensure your order ships out as fast as possible.",
    "reviews": [
      "my boyfriend has barely taken them off since he got them (ordered 2)! ❤️",
      "They were super respectful when I asked them to send it to a different address than the one that automatically came up. Speedy delivery, and good quality! Would highly recommend!",
      "Good quality bracelet a nice gift"
    ]
  },
  {
    "productId": "unqdPDvcFl",
    "url": "https://www.etsy.com/listing/1412062459/gift-for-friend-personalised-gift-for?click_key=216b64e40250e7ab518166716bb4c816fccb84bd%3A1412062459&click_sum=2103518b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-2&etp=1",
    "title": "Gift For Friend, Personalised Gift for Her, Personalised Candle, Simple Typography",
    "description": "This apothecary style jar candle makes a wonderful gift for a friend, perfect for letting them know how much they mean to you.The subtle stone coloured label is divided into five sections of text with a charcoal border, the main feature reads \"To My Absolute Favourite\". There is space for a personalised message of gratitude, a cute heart and gifting sign-off in the following sections. The last box shows the candle's scent of choice and burn time in a beautiful pairing of script and serif fonts. This candle is the perfect gift for your favourite friend!The jar candle is presented in an apothecary style jar with lid and filled with a natural soy wax. Hand poured in our Manchester workshop, the candles are personalised to order before being beautifully packaged by hand with a choice of charming scents.Two container sizes available:Standard jar candle - 25 hour burn time | 140g approx.Large brown jar candle - 40 hour burn time | 190g approx.Create the perfect gifting experience with our range of little extras.LUXURY GIFT WRAPElevate your gift's presentation with our signature Kindred Fires gift bag. Select 'this order is a gift' on the cart page and add gift wrapping to your order. We’ll pack your goodies inside the bag ready for the recipient to open upon delivery.WICK TRIMMER & SNUFFER SETThe perfect duo for candle lovers - our wick trimmer and snuffer set is crafted to help care for your candles, ensuring longevity and optimal burn.https://www.etsy.com/uk/listing/1661102691/wick-trimmer-and-snuffer-set-giftBATH SALTSRelax and unwind with our essential oil bath salts. A soothing mix of salts, natural oils and rose petals expertly blended and presented in a glass bottle with gold foiled label.https://www.etsy.com/uk/listing/1646926082/dead-sea-himalayan-bath-salts-essentialCandle scents to choose from:TRANQUILITYA calming, fresh scent reminiscent of relaxing spa days. This candle's aroma is light yet indulgent. Tranquility beautifully combines fresh citrus with eucalyptus on a clean floral base.PASSIONFRUIT PALMThis enticing, uplifting fragrance radiates summer confidence. Passionfruit Palm is a complex blend of passionfruit and pineapple combined with a floral bouquet on a musky base.BLACK VELVETAn indulgent, alluring scent that transports you to a night of adventure. Black Velvet combines exotic spices with an intense blend of jasmine and oud on a woody base.SUNLIT ROSEDrift through a charming English garden filled with the scent of the majestic rose. Distinctly feminine, Sunlit Rose is a heady combination of rose and violet on a bold base of amber and vanilla.SECRET BEACHAn exotic escape, Secret Beach is reminiscent of a tropical ocean breeze. Fresh orange and soft peach rest on a creamy coconut and vanilla base. Close your eyes and let yourself drift to a place that’s just yours.PINK JASMINEA sweet, feminine fragrance that creates a serene and joyful mood. Pink Jasmine has a bold base of amber and vanilla with sweet notes of pear, peach and jasmine.SPICED ORCHARDInspired by the nostalgia of woodland walks and sugared treats, Spiced Orchard is a fragrance that celebrates all things Autumn. Brimming with warming spices, vanilla, and apple.WINTER FORESTSnow covered boots crunching on shimmering ground, surrounded by tall pine trees and icy skies. This is Winter Forest, a rich blend of alpine wood and balsam together with warming notes of cinnamon and clove.FESTIVE SPICEA spiced festive essential oil blend. Combining sweet orange extract, clove bud and cinnamon bark, Festive Spice evokes cosy memories of wood fires and mulled wine on dark winter’s nights.MOONLIT WONDERAll the glamour and luxury of a magical Winter’s night are evoked by this rich, indulgent fragrance. Moonlit Wonder combines shimmering juniper with warm amber on a musky, patchouli base.WANT TO SEE MORE GIFTS FOR HER?Take a look at our gifts for her page here:https://www.etsy.com/uk/shop/KindredFires?section_id=28117500CHECKOUT OUR NEW HOME FRAGRANCE SECTION:https://www.etsy.com/uk/shop/KindredFires?section_id=45470990",
    "reviews": [
      "Loved this product!! The shipping was quick, and the value is great.",
      "Beautiful and comes beautifully presented.",
      "Candle smelled so good! International shipping to USA took longer than expected.",
      "Will always get my candles from here x"
    ]
  },
  {
    "productId": "LvnLNeircx",
    "url": "https://www.etsy.com/listing/1282187736/engraved-leather-belt-personalized?click_key=0d22b30e07c62d6875226831e3cc1419bd6d6dfb%3A1282187736&click_sum=23443ba8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-3&pro=1&frs=1&etp=1&sts=1",
    "title": "Engraved Leather Belt, Personalized Vintage Men's Belt, Custom Handmade Belt, Gifts for Boyfriend, Valentines Day Gift for Him",
    "description": "Engraved Leather Belt - Personalized Men's Belt - Custom Handmade Belt - Genuine Leather - Gift for Boyfriend - Valentines Day Gift🎁 High-Quality Custom made leather gift for Dad - Anniversary gift for Husband - Men's Belt for Boyfriend - Gift for groomsmen 🎁🎁 Best Personalized Leather Belt Gift for Dad, Husband, Valentine, Brother, Son, Partner, Men, Grandfather, Groomsmen, Boyfriend 🎁✨It is made with Genuine European Leather.✨ This belt is 1 1/4 inches wide.✨Please check my store for other designs!!!✨Feel free to contact me if you have any questions.✨I gladly accept bulk ordersHow to order:📏 Select your color and length option (IF YOU NEED A SHORTER SIZE, JUST LEAVE A NOTE IN YOUR ORDER. I WILL SHORTEN IT FOR YOU)📏 Select your engraving option, you can see the different locations in the listing photos.📏 Write your personalization into \"PERSONALIZATION\" box📏 If you need a custom font you can send us a message❗❗❗ We do not make any changes to the context of your personalization. Please make sure you don't have any typos ❗❗❗",
    "reviews": [
      "Thank you for the awesome product, great customer service, and fast shipping!",
      "Really nice. Great quality. Fast Shipping.",
      "Good product and the belt is of good quality."
    ]
  },
  {
    "productId": "DO4lpOZTrI",
    "url": "https://www.etsy.com/listing/531708321/gift-for-him-personalized-cuff-links?click_key=9d6f35fafefce6ed372658f414ea4eb0acf67a1c%3A531708321&click_sum=e537e369&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Gift for Him Personalized Cuff Links, Handwriting CuffLinks Fiancé Gift Wedding Gift for Husband, Custom Cufflinks, Valentine’s Gift for Him",
    "description": "Custom cufflinks make a beautiful gift for your fiancé or father on your wedding day.  Engraved with your personal message, he is sure to treasure these forever.  Stainless steel cuff links measuring 5/8 inch each are engraved with the handwriting of your choice.  Choose circle or square.  These are meant to be engraved with YOUR actual handwriting!  If you don't want to use your actual handwriting, just choose the option to use the handwriting font instead. Refer to the last photo in the listing to see the example. If using your writing, it is preferred that you write on white paper with NO LINES and that when you take the photo, please have no shadows over the words.*Also available in rose gold plated, yellow gold plated or gunmetal plated. Option available in the dropdown menu.Would you like a proof?  Since most of our items are custom made to order, we can't offer proofs on every item created.  We always use our best artistic vision so a proof isn't necessary.   But if you would like to see it for yourself before it is engraved, then use this link here to purchase a $20 proof.  This includes one revision.https://www.etsy.com/listing/641556709/proof-feeAfter purchasing, please send a photo of your paper as an attachment (in .jpg format from your phone is fine!) via etsy convo OR email to  etsy [!at] lovegeorgie.com with your name, username or order number.Please note the following:*We may need to adjust the layout slightly for it to fit.*If it's very large with many parts, please tell us which part you want.*The more text there is, the smaller it will be. Please keep that in mind when choosing what you want engraved.  The less the better!*Very old paper with hard to read writing, or many wrinkles, may take much longer and there would be a an extra fee for that. We will contact you before proceeding once we see your image if that's the case.",
    "reviews": [
      "Fast shipping and fabulous quality product!",
      "Amazing product and so personal. Absolutely love these for my fiancé",
      "Robyn communicated well with me and delivery was spot on!"
    ]
  },
  {
    "productId": "gqiacmwgnP",
    "url": "https://www.etsy.com/listing/927526784/personalized-easter-tic-tac-toe-bunny?click_key=42a2bb08168d55926b7c88237711cae4fd3eafe4%3A927526784&click_sum=f43d54ed&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-5&frs=1&etp=1",
    "title": "Personalized Easter Tic Tac Toe Bunny and Eggs - Easter Basket Stuffer For Kids - Easter Gift Basket - Kids Baby Toddler Basket Stuffer",
    "description": "These adorable personalized tic tac toe sets are the perfect stocking stuffer. Comes with 5 bunnies and 5 eggs. Pick any 2 colors of your choice for your game set.Set is 4.5”x5.5Made out of solid wood*Grain of wood may vary*Colors may vary from photos due to the coloration of your monitor*If no color is selected, colors will be chosen at random*NOT RECOMMENDED FOR CHILDREN UNDER 36 MONTHS OF AGETO ORDER:Put colors & name you’d like in “notes to seller” box at checkout!",
    "reviews": [
      "Love it, So cute. Thank you so much",
      "Love it, So cute. Thank you so much",
      "A little smaller than I expected.  Still. I know my grand-daughter will like it."
    ]
  },
  {
    "productId": "VMnxeMGXIp",
    "url": "https://www.etsy.com/listing/1543020920/personalized-kids-nylon-fanny-pack?click_key=1a5fe942afb862ffc974db09efb78be656242f1b%3A1543020920&click_sum=21c0aa6f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-6&pro=1&etp=1&sts=1",
    "title": "Personalized Kids Nylon Fanny Pack | Chenille Letter Patch Fanny Pack | Custom Kids Belt Bag | Kids Mini Fanny Pack | Crossbody Patch Bag",
    "description": "Personalized Kids Nylon Fanny Pack | Chenille Letter Patch Fanny Pack | Custom Belt Bag | Kids Mini Fanny PacksHands free is the way to be with our cute kids nylon fanny packs! These adorable fanny packs make a great birthday or holiday gift!KIDS NYLON FANNY PACK:• Nylon and polyester material• Available in  lilac, hot pink, light pink, tie dye + white• Wear as a fanny pack or crossbody belt bag• Gold accent zipper & buckleDEMINSIONS:• Bag size: Kids size: 9.5” x 4” x 2.5” | *models in pictures are 6 and under*",
    "reviews": [
      "My five year old granddaughter will love this Fanny Pack. We celebrate her birthday on March 4th. Can hardly wait to give it to her. Will come in handy for vacation.",
      "Beautiful product, the colors, materials. Very happy with the purchase",
      "This is such a cute birthday gift!! Perfect for our 3 yr old!",
      "The bag was adorable and came quickly. Highly recommend."
    ]
  },
  {
    "productId": "faYQKJqNgi",
    "url": "https://www.etsy.com/listing/1011475892/clear-glass-mugs-personalized-bridesmaid?click_key=a9bbc0e096d2a8d8d00eb1b47ac5ee6a2feed465%3A1011475892&click_sum=e40bdf94&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-7&pro=1&etp=1&sts=1",
    "title": "Clear glass mugs- personalized bridesmaid mugs- bridesmaid proposal - custom mug- bridesmaid gifts- gift for maid of honor proposal box gift",
    "description": "-—DETAILS——This listing is for ONE personalized clear mug(No other items included)Mug holds 13 oz.Please note all mugs will be made for “righties” unless specified in the notes to seller box at checkout. Brides are made as lefties to show ring when taking a photo :)PLEASE READ CAREFULLY :Mugs will be made as shown with all lowercase letters and a heart. Please let me know if you wish to change to first letter capitalized in the notes to seller box by requesting “FIRST LETTER CAPITAL” as it does change the design.FOR BRIDESMAID PROPOSAL SET (as shown in 3rd photo) use this link:https://www.etsy.com/listing/1232511948/clear-glass-mugs-personalized-bridesmaid?click_key=69969b68b7e14365283cad4ee3634365dfbac5b0%3A1232511948&click_sum=1f25ecd8&ref=shop_home_active_1Heart may be removed upon request.*Mugs are made with Professional outdoor vinyl (not engraved or painted)Not dishwasher or microwave safe. Please gently hand wash only for longevity of your new mug!-—HOW TO ORDER-—1- Please select quantity and/or any add ons2- Add to your cart3- Please leave me names needed in the “ notes to seller” box4- Checkout—CURRENT PROCESSING TIME-—My current processing time is 1-2 weeks on all products! If you need your item sooner, please send me a message and I will do my best to accommodate. You may also choose to RUSH YOUR ORDER. This upgrade will ensure your product is shipped in 1-2 business days!RUSH MY ORDERhttps://www.etsy.com/listing/513951572/please-rush-my-order?ref=shop_home_active_44WANT TO BUILD YOUR OWN bridesmaid proposal box?:TO SEE MORE ITEMS IN MY SHOP, Please click below:https://www.etsy.com/shop/HappilyChicDesigns?ref=l2-shop-header-avatarPlease message me with any questions or customization requests :)Cordially,Nikki @ Happily Chic Designs",
    "reviews": [
      "It turned out beautiful! I can’t wait to use it!",
      "bought these as a thank you gift for my bridal shower hostesses and they are SO cute!",
      "The cup is a nice size and the writing on it is what I wanted",
      "This is my second year purchasing for my coworkers/friends for Xmas. A HUGE hit for friends with unique names. I get lots of pics of a mug full of coffee with a “thank you, thinking of you” message."
    ]
  },
  {
    "productId": "PqEBCDnLLE",
    "url": "https://www.etsy.com/listing/891978477/custom-calendar-keychain-anniversary?click_key=18ecac77dc361b8f821a5552e8865a0fa88cc0f1%3A891978477&click_sum=29fc8d54&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-8&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Calendar Keychain • Anniversary Gift For Her • Save The Date, Wedding Gift • Special Gift For New Mom • Personalized Keychain • CM26b",
    "description": "♡ CUSTOM · CALENDER · KEYCHAIN ♡| Turn a special date into a treasured piece for you to cherish always |» ITEM · DETAILS «——————————◗ Material: SOLID 925 STERLING SILVER◗ Finish (Available in 3 colors): Silver, Gold and Rose Gold◗ Dimensions: 1.0 inch◗ Item will come packaged in a cute jewelry box, ready for gifting!» HOW · TO · ORDER «————————————◗ Choose the finish you would like in the drop down menus.◗ Let us know the [ month/day/year ] you would like in the PERSONALIZATION BOX upon ordering.◗ Engraving options:› [ One Side ] means you would only like either the front or the back of your piece to be engraved.› [ Both Sides ] means you would like both the front + the back to be engraved.» MORE · INFO «—————————◗ Production time: All of our items are hand and custom made to order. Our turnaround time is about 2 weeks upon ordering and receiving order information. It is subject to change during peak seasons.◗ Standard shipping within the US takes about 3 - 5 business days. International shipping varies depending on country and location.» MORE · FROM · US «————————————◗ Handwriting Jewelry -»http://etsy.me/2cd8mmw◗ Custom Name Jewelry -»http://etsy.me/2bQ5Zqm◗ Birthstone Jewelry -»http://etsy.me/2bU9GJm◗ Fingerprint Jewelry -»http://etsy.me/2dwmF58◗ Gifts for Him -»http://etsy.me/2bEjODj» BACK · TO · OUR · SHOP «———————————————◗http://SilverHandwriting.etsy.com» VIEW · OUR · POLICIES «——————————————◗https://www.etsy.com/shop/SilverHandwriting/policy♡ Feel free to contact us if you have any questions or concerns! Happy shopping with SilverHandwriting ♡——————————————Copyright © All images by SilverHandwriting. All rights reserved.",
    "reviews": [
      "5 star service from start to finish and a quality product that my girlfriend adores..",
      "High quality item and was a great gift!",
      "All expectations were met, very beautiful"
    ]
  },
  {
    "productId": "BmvnnJfuEU",
    "url": "https://www.etsy.com/listing/1117449685/ultimate-spa-box-for-women-personalized?click_key=28769aaa0f8fed0cd2c1e6bc7a80c99986c2c725%3A1117449685&click_sum=c257dada&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-5&pro=1&frs=1&sts=1",
    "title": "Ultimate Spa Box for Women| Personalized Gift| Friendship Gift| Christmas Gift for Her",
    "description": "Is there someone you think is truly awesome – a coworker, friend, neighbor? Then let them know by sending them one of our truly lovely gift boxes packed with thoughtful items …. and we can mail directly to them!Love Delivered ❤️GIFT BOX INCLUDES:✿ Natural Perfume Roller✿ 1  All Natural Lavender Shower Steamer✿ 8 oz Lavender Bath Salts✿ 8 oz Asian Tea Body Butter✿ Clay Mask✿ 1 Lavender Bath Bomb✿ 1 All Soy Candle 15 hour burn life✿ Decorative Matches✿ Crinkle Paper✿ Free Shipping!✿ Personal handwritten greeting card with a message from you!SHIPPINGShipped in a branded Gift Box Love Co box ready for gifting!***All gifts are shipped out 1-2 business days after the order was made. Additionally, as you're making your order, Etsy provides you with an estimated delivery date.******Please note, if you are shipping this as a gift, please update the shipping address to where it should be sent. We will ship to the address you give at Etsy checkout.******If an incorrect shipping address was given and the gift is returned back to our shop, the customer is responsible for paying the re-shipping fee.***PERSONALIZATION can be made by leaving a message in the personalization area; please remember to ALSO INCLUDE YOUR OWN NAME. Messages written on the card are exactly as they were received in the order.Please check the photos for instructions and answers on questions you might have.**Due to succulent pot shortage there may be variations in pot designs and color. They will still have a cute feel and same vibe as our shop! 🖤How is the boxed shipped?Each box is shipped in a branded Gift Box Love Co box ready for gifting!How do we ship your package?We ship all of our packages through USPS and FedEx depending on size and location.",
    "reviews": [
      "Great quality products!  Everything in the box matches descriptions and pictures perfectly!  The items over exceeded my expectations!  & the personalized note I requested was beautifully hand written!  10 out of 10, definitely recommend <3",
      "The item was a gift and met my expectations.",
      "This was a gift, but recipient was very pleased with it",
      "Very nice quality, received very quickly."
    ]
  },
  {
    "productId": "whscNgPQKB",
    "url": "https://www.etsy.com/listing/189597916/personalized-mini-oak-whiskey-barrel?click_key=39a72dccfc4811037d939086d937f6bc41936277%3A189597916&click_sum=4e370d1d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-6&frs=1&etp=1&sts=1",
    "title": "Personalized Mini-Oak Whiskey Barrel - Groomsmen Gift - Birthday Gift for Him - Engraved, Customized, Monogrammed for Free",
    "description": "This is the perfect gift for that favorite liquor or wine connoisseur in your life. It makes a great Groomsman, Wedding Party, Father's Day and Birthday Gift.This whiskey barrel is fully functional and can be used to age or store any spirit.This is a steel banded Oak Barrel/Cask and it comes with its own stand, spigot and bung which makes for convenient serving and filling. Each barrel/cask has enclosed directions.1 Liter Barrel measures 6.5 \" x 4.5\" x 4.5\"2 Liter Barrel measures 7.5” x 5” x 5”3 Liter Barrel measures 8.5” x 5.5” x 5.5”5 Liter Barrel measures 10\" x 7.5\" x 7.5\"10 Liter Barrel measures 12\" x 9\" x 9\"This is for one barrel.For other great groomsmen and men gifts click here:http://www.etsy.com/shop/MyPersonalMemories?section_id=13236312Thank you for looking,Kristin",
    "reviews": [
      "The product was gorgeous and my buddy loves it",
      "Beautifully done and shipped extremely quick and arrived very well packaged. There are some wood chips/shavings inside the barrel but hopefully those will come out with curing the barrel.",
      "Everything was wonderful and looked beautiful!"
    ]
  },
  {
    "productId": "jxUMCjsZhi",
    "url": "https://www.etsy.com/listing/1679042271/embroidered-easter-basket-custom-kids?click_key=54e2786d39f513f7c0653f47d99910d571c349bb%3A1679042271&click_sum=c20ee3a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-7&pro=1&etp=1&sts=1",
    "title": "Embroidered Easter Basket, Custom Kids Basket, Easter, Basket, Personalized Easter Basket, Taupe Floral",
    "description": "Our embroidered painted bamboo basket with a Taupe Floral printed liner will be a great Easter basket for your loved one! Fill it with candy and small treats to make a beautiful basket. Carrots decor is included, bunny stuffed animal is not included.Details:11\" x 11\" x 7.1\" (28cm x 28cm x 18cm)Chipwood and polyesterEmbroidery will be approximately 2\" in height and length depends on how many characters.",
    "reviews": [
      "Exactly what I was looking for!",
      "I absolutely love it. Everything is as they described. They responded very quickly when I had a slight issue in the mail which was not their fault, (things get lost in mail) they fixed and sent a new one. I will definitely be buying from them in the future 😍😍 100% recommend 👌",
      "absolutely great! so soft, and just as cute as the photos",
      "Awesome blanket! Super soft ! Would recommend anyone to get one!"
    ]
  },
  {
    "productId": "fGmKpOQxhf",
    "url": "https://www.etsy.com/listing/1300726402/bloody-mary-boarddrinking?click_key=b265a8ef190f717341fd6d34027c9c8e9daacc21%3A1300726402&click_sum=b348375a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-8&pro=1",
    "title": "Bloody Mary Board,Drinking Gift,Personalized Gift,Gift for Him,Christmas Gift,Personalized Monogram,Beer Gift,Beer Drinker,Flight Board",
    "description": "Personalized Michilada BoardHeight: 9 inchesWidth: 15 inchesStyle: 1/2\" Birch Plywood, Laser Cut and Laser EngravedThis product is handmade and made to order.Due to use of natural wood each order will slightly differ.**All sales are final**",
    "reviews": [
      "Item great.  Shipping took longer than I expected.  Still worth purchasing.",
      "Fast shipping and great quality!",
      "They loved the gift!  Turned out fantastic!!!"
    ]
  },
  {
    "productId": "bYMLNreKfv",
    "url": "https://www.etsy.com/listing/1166352794/personalised-first-mothers-day-book-a?click_key=afedad86ee13bda9bfc16c027590e544a74f5bf8%3A1166352794&click_sum=99417c32&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-9&pro=1&etp=1",
    "title": "Personalised First Mother's Day Book | A Unique Personalised First Mother's Day Gift from Baby to Mum | Letterfest",
    "description": "Celebrate your first months of being a mum with our personalised book for new mothers.The story is written on behalf of the baby, thanking Mum for all the wonderful things she does eg how she makes the baby laugh, places they visit, going to sleep etc.PERSONALISING YOUR BOOK- Select what you call Mum - Mummy, Mum, Mommy, Mom, Mammy, Mam, Mama, Ma- Written on behalf of baby - enter child's (or children's) first name in personalisation field (max 30 characters)- Tell us the amount of days since baby's birth - remember to do it from day you are giving book (eg Mother's Day) not from day of ordering.- On the first page we print your gift message - enter this in NOTES TO SELLER at checkout. Only enter a message as everything you type here will be printed. If you have any other questions - please contact us with a separate message.For our full range of books with further personalisation, visit letterfest.com24 pages, 210x250mm when flat (a little shorter than A4)",
    "reviews": [
      "Amazing quality of product. Can’t wait to give this to my wife as her Mother’s Day present",
      "It’s a beautiful gift perfect very sweet",
      "This book is beautiful and is such a lovely present for Mother's day!"
    ]
  },
  {
    "productId": "Vuz9bKxSaN",
    "url": "https://www.etsy.com/listing/1618566577/sterling-silver-alphabet-initial-letter?click_key=4c81cbf046e1de9f11a8b4a0181be21cbfe1f784%3A1618566577&click_sum=2954ce39&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-10&etp=1&sts=1",
    "title": "Sterling Silver Alphabet Initial Letter Bracelet, S925 Beaded Name Zodiac Bracelet, Personalised Minimalist Bracelet, Gift for Her",
    "description": "• DETAILS:Material: 925 Sterling Silver (S925)Bracelet  Length: 16cm + 3 cmFreshwater Pearl Size: 5mm approx.Round Plated Size: 8mm approx.• The pearls are natural freshwater pearls, close to round, not oval-shaped. Natural pearl more or less has growth pattern on the surface - such as tiny naturally occurring pitted spots that are not artificially caused. These bracelets are suitable for not only daily wearing but formal occasions.• FAVORITE ∙ MY ∙ SHOPYou can find more Jewellery that will surprise you herehttps://www.smiletomolly.etsy.comThey are made in high quality and well packaged to give as gift.• NOTE:Due to differences in computer monitors, printed colours may differ slightly to those shown on screen.Keep your Jewellery in perfect condition by treating them with care, cleaning them with a dry cloth and keeping them away from water.• RETURNS:Please contact me if your item is damaged or not in the condition you were expecting before leaving negative feedback. We do our best in providing you with clear photos to best display the items you purchase. If any items are damaged or if you are not satisfied with your order for whatever reason, we gladly accept returns and will provide you with a refund in full!• HANDLING ∙ TIME:This item will be dispatched 1 - 2 business day after you place your order.• WE ∙ SHIP ∙ WORLDWIDE:US: 5 - 11 business days.UK: 2 - 3 business days.International: 5 - 20 business days.They are estimated times, not guaranteed delivery times. A tracking number will be provided once dispatched.Please verify your ETSY Delivery Address, I am not liable for lost or stolen packages. Please note your tracking number.• PACKAGING:Order will come with velvet pouch, 1 pouch per jewellery.Please feel free to message with any questions.Thank you!",
    "reviews": [
      "Love this - thank you",
      "Perfect as usual \nCome quick also thanks x",
      "I'm in love so stunning also thanks for the earrings there gorgeous 😍",
      "amazing quality, came super fast and was in beautiful packaging. the perfect gift!"
    ]
  },
  {
    "productId": "zFGhsOVIeF",
    "url": "https://www.etsy.com/listing/545231592/blanket-scarf-women-oversized-shawl?click_key=f6f710914f2cd8c58586a0da9e2c216a38ee950b%3A545231592&click_sum=a738af72&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-11&pro=1&etp=1",
    "title": "Blanket Scarf Women, Oversized Shawl, Plaid Pattern Scarf, Warm Winter Scarf, Oversized Scarf, Gift for Her, Pashmina Shawl",
    "description": "A warm winter scarf designed in Scotland and inspired by our heritage tartans. Ideal for wrapping up against the cold, this is a blanket scarf women will wear again and again. Perfect as a pashmina shawl, winter wrap or oversized blanket scarf this super soft tartan scarf is a classic winter accessory.Easily personalise by adding charms to your scarf and give a personalised gift for her your loved one will cherish.A classic plaid pattern scarf, this oversized shawl can be easily personalised and given as a gift. This oversized scarf is an ideal Christmas gift, gift for her or birthday gift idea.🎀 Gift Presentation: Add an additional gift box to your scarf and add a touch of elegance to your gift.M A K E - I T - P E R S O N A L . . .If you would like to personalise your order - you can select from the drop down options above.Initial charms can be added in Silver or Gold.Care Tips: We recommend washing these scarves at 30C with a mild detergent. Wash with similar colours and dry flat.P R E P A R A T I O N - & - P R O C E S S I N G - T I M EWe are excited to now offer expedited processing on all personalised orders, which may take anywhere from 1-2 business days.We process all orders received by 1pm SAME BUSINESS DAY and all others next business day.Shipping: UK customers we use Royal Mail 48 and our Standard Shipping Time is 2-3 Business Days.For all of our International Orders we use Royal Mail International Standard. Our Shipping time ranges from 7-15 Business Days.**** Please allow extra time for International Shipping.***A B O U T - AURORA GRACE DESIGN : We sell unique, quirky scarves for customers who like something colourful, loves design and is inspired by travel. Whether you prefer subtle and softer shades, or like to make a statement with your scarf, our wide selection of scarves, shawls and wraps has you covered. Add us to your favourite shop and you will never miss out on our fresh, brand new styles.",
    "reviews": [
      "It looks exactly like the pictures arrived really quickly. It looks really warm and cosy",
      "lovely quality and great service",
      "I don't like to give reviews"
    ]
  },
  {
    "productId": "nhDsjufYGh",
    "url": "https://www.etsy.com/listing/1209519801/housewarming-gift-wedding-gift-new-home?click_key=7b107446c93da728d1d684d9762fc85e5e083c92%3A1209519801&click_sum=ca688803&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-12&pro=1&etp=1&sts=1",
    "title": "Housewarming Gift | Wedding Gift | New Home Gift | Personalized Custom Doormat | Personalized Gift | Welcome Door Mat | Welcome Mat",
    "description": "☆ The Best Housewarming Gift & Wedding Gift for Yourself and Your Loved Ones: Custom Personalized Doormat!☆ The doormats are made of premium quality coconut. It is applied to the doormat with the best quality UV printing. The back is made of non-slip material.☆ Use one of the most commonly popular personalized doormat designs. Before placing an order, please check how many different designs will appear. These home door mats are ideal as housewarming gifts for new homes or as anniversary gifts for those who like to indulge in a little elegance.· SIZE OPTIONS ·- Sample: 9\"x12\" | 22,8 cm x 30,5 cm- XS: 12\"x26\" | 30,5 cm x 66 cm- Small: 16\"x24\" | 40,6 cm x 61 cm- Medium: 18\"x30\" | 45,7 cm x 76,2 cm- Large: 24\"x36\" | 61 cm x 91,4 cm- XXL: 24\"X48\" | 61 cm x 121,9 cm☆ Personalized doormats are a very suitable front door decor. A funny doormat or designed as welcome door mat. You can choose other different designs according to home decor or wall decor as integrated. Each door mat is created using the best materials to ensure that it will last a long time.☆ We feel proud to serve you with custom doormats such as last name doormat, wedding gift or new home gift! Other products as personalized gift is available in a variety of designs at our store.Our mats are made of ecologically friendly natural coconut fibers with a biodegradable back to keep them from sliding around. UV printing seals the ink into the mat fibers, completing the design.☆ They're significantly more durable and attractive than laser-engraved or spray-painted mats. These are without a doubt one of our most popular products. You or the person who receives your gift will be astounded whether christmas or easter gift.☆ We recommend that you keep your doormat in a dry area as possible, to prolong the life of the design. To clean the mat, shake it out. Our mats are made from natural coconut fibers. All mats are unique. Do not saturate the mat with water.",
    "reviews": [
      "The customer service was outstanding. The writing on the rug was impressive, I would highly recommend them to my friends.",
      "Your wonderful review has brought a smile to our faces! We're so grateful for your high praise and appreciate the time you took to share your thoughts. We can't wait to have the pleasure of serving you again in the future! Warmest regards.",
      "Nice product and quick delivery.",
      "Your wonderful review has brought a smile to our faces! We're so grateful for your high praise and appreciate the time you took to share your thoughts. We can't wait to have the pleasure of serving you again in the future! Warmest regards.",
      "Requested product customization on a 24 x 36 mat. Received first delivery where it was damaged / wet at delivery. Product had splotches where the mat got wet, and were not drying. I reached out to buyer to resolve damaged product and sent photos right away. Customer service was a slow process, seemed a bit reluctant almost but, eventually the buyer sent a replacement mat. I would suggest more secure packaging to cover the full mat and protect it from moisture or damaging during shipping. Overall, the second mat is exactly as I ordered.",
      "it was perfect and exactly what i was looking for!",
      "Your wonderful review has brought a smile to our faces! We're so grateful for your high praise and appreciate the time you took to share your thoughts. We can't wait to have the pleasure of serving you again in the future! Warmest regards."
    ]
  },
  {
    "productId": "dDpGrwxQDV",
    "url": "https://www.etsy.com/listing/649665032/smoked-cocktail-gift-set-drink-kit-for?click_key=da15e59c75b95923a610fa841372822cb7f15cbe%3A649665032&click_sum=7650edc4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-13&pro=1&frs=1&etp=1",
    "title": "Smoked Cocktail Gift Set Drink Kit for the bourbon lover | Aroma Series Whiskey Barrel Perfect for Old Fashioned Smoky Wood w/ Torch & Glass",
    "description": "This unique at-home bourbon gist set kit comes loaded with other superb equipment such as:Authentic Whiskey Barrel Wood Stave PieceCulinary Mini Torch in Distillery CopperMCB Logo embossed sandblasted deep etched Rocks Glasses x2 - 11ozTurn your drinks into specialty drinks!Experience cocktail hour differently. Try the Smoked Cocktail Gift Set to add new smoky flavor to your beverages. Burn the wood to begin your journey.Curated with authentic whiskey barrel wood for the true smoky flavor you desire. Don’t forget to whiff the absolute best aroma.The old-fashioned smoky wood comes with a round circle cut out to match the natural curve. Wood slats are bent to ensure the glass sits perfectly and lock in the unique bourbon flavor.Take note that the barrel wood stave piece will only fit our rock's glass with perfection.MotorCityBarrels deals with exceptional drinking supplies carved out of aged whiskey barrels. Our goal is to upcycle authentic barrels to preserve their rich vintage feel and use their essence to enhance your drinking experience.We deliver all your products with utmost care and safety.Explore our online store today!Please note...BUTANE GAS SOLD SEPARATELY - unfortunately we cannot ship these bad boys with the gas in them - Butane gas cans can be easily found at any local hardware, convenience store or even grocery store. Generally always at checkout counters. Torch receives universal butane can tip. See the amazon link above.The Barrel Wood Stave Piece will only fit our rocks glass. It is cut out to specific dimensions of the glass.Want to see it in action? Check it out below!https://www.youtube.com/watch?v=WETA6-SvqMw",
    "reviews": [
      "My husband made cocktails and loved it !!",
      "Gifted this for Christmas to friends and they loved it!",
      "My dad loved this gift ! Thank you again!",
      "I did not personally use it, as it was a gift. Compared  to others available it is a great \nvalue for what you get"
    ]
  },
  {
    "productId": "DQHECnOCBB",
    "url": "https://www.etsy.com/listing/1187607365/communion-fish-bracelet-personalized?click_key=d18f8c790c068d2b9b279f7cefe3aea76f82d022%3A1187607365&click_sum=08cfe889&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-14&etp=1&sts=1",
    "title": "Communion fish bracelet personalized with engraving hand stamped for baptism, birthday, back to school, confirmation",
    "description": "Personalized bracelet with a hand stamped engraving.A great gift idea for baptism, communion, confirmation or confirmationThe offer is for a bracelet with two hand-stamped sliders. These can be personalized on one or both sides. The bracelet can be easily turned around, so that you can always change what is legibly found on your bracelet if there is an engraving on both sides.The bracelet is comfortable to wear and 100% waterproofBracelet color:Choose your desired color from our color overview in the product images.Material bracelet:high quality sail ropeMaterial slide:blackened aluminum, brushed aluminum or polished copper - durable and rustproofSize:Bracelet: Ø = 10 mmPendant: 16 x 14mmmanufacturing methodhandmade in GermanyYou can find the bracelet with aluminum sliders here:https://www.etsy.com/de/listing/903126130/personalisiertes-armband-mit-namen-und?ref=shop_home_active_2You can find more products from myjori at:https://www.etsy.com/de/shop/myjori/Please note that individually made pieces of jewelery are non-returnable.The bracelets are not suitable for children under 3 years of age due to small parts.Due to the lighting conditions in the product photography and different screen settings, the color of the product may not be reproduced authentically.",
    "reviews": [
      "Very happy with my choice!",
      "Very fast delivery. The bracelet is very beautiful and well made.",
      "Very fast delivery. The bracelet is very beautiful and well made.",
      "The bracelet fully met our expectations. Thanks"
    ]
  },
  {
    "productId": "btaIrxdHEx",
    "url": "https://www.etsy.com/listing/1195723836/personalised-glass-coffee-mug-tea-cup?click_key=264abb73621a775366c30d68ccfb38448a3226c7%3A1195723836&click_sum=65ed789b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-15&etp=1&sts=1",
    "title": "Personalised Glass Coffee Mug/ Tea Cup, Custom Logo Laser Engraved Corporate, Birthday/ Teacher/Office/ Mother's Day/ Father's Day Gift",
    "description": "DETAILS• Personalise it with initials, name or custom logo to complete the look of this Glass Coffee Mug/ Tea Cup.• Looking for something unique ? We have an extensive selection of design to choose from.• Make great unique gifts for a birthday, house warming gift and pretty much anything else you can think of.• It's aesthetic and practical that can be used every single day.• Personalised your own Glass Coffee Cup to be given for your clients as closing gifts or your company promotion purposes with your clients names or artwork, monograms or your logo laser engraved. Our customised glass mug can be corporate gift for your business partners or clients also!✔ FUNCTIONAL:- Made from heat resistant glass that holds both hot and cold beverages.- Tempered glass should be handled with care! A damaged edge or a scratched surface can cause the glass to break suddenly.✔ PERMANENT and long lasting engraved bottles using high quality laser machine, an alternative better options for vinyl stickers that will easily peel off over time.✔ STYLISH cup with 27 engraving design options.SPECIFICATIONSVolume: 360 ml or 240mlMaterial: Tempered glass- Microwave-safe.- Dishwasher-safe.Technique: Laser Engraved. Personalise any design with any name, date, available template design or custom logo, your own image.HOW TO ORDER1. Select your preferred size.2. Choose single or double side engraving.3. Type in Engraving Style and exact order you want it engraved based on our provided Design Template Options. You can add additional instructions in ( ) brackets.Example:Side 1: #20, AmeliaSide 2: #25, Best Mom Ever▸If you want to use your own logo, please attach/ send us your file once you finish . Please note to attach the highest resolution file as possible to avoid quality issues Not all files are scanned prior to manufacturing, if you're not sure, please send us an email after placing the order to confirm if the file is of an acceptable quality.▸You can combine or pick any font, icon, style, etc between our provided designs, or choose not to include a date, title or icon for example. All artwork based on our available design is free of charge.▸If you don't like any of our template and want to create your own bespoke artwork design, please feel free to contact us with any questions you may have, a small additional fee may apply.DELIVERY TIMEProcessing Time:Upon placing an order, our dedicated team initiates the meticulous process of designing your artwork(s), collecting your item(s), crafting your personalised product(s), and carefully packaging it. The duration of production varies based on the chosen production process and the complexity involved. Please find below estimated turnaround times:Item TypeProcessing Time*Rush Order(25% Surcharge)*Non-Personalised Items1-2 business days-Personalised Items2-7 business days1-2 business daysSigns & Hoops3-10 business days1-3 business days* The provided processing time does not include the duration required for customer artwork approval. Timely responses to artwork confirmation emails are crucial, as any delays in approval will extend the overall processing time.Rush Order option is available during checkout.Shipping Time:We send out your order when all items are ready. The delivery time varies based on your chosen shipping options and location. After shipping, you'll get a confirmation email with a tracking number. If there are no scans in the first 24 hours, don't worry—sometimes the system takes a day or so to catch up.Our carriers estimate delivery times:Region/CountryStandard Shipping*Express Shipping*Australia2-4 business days1-3 business daysNew Zealand5-8 business days2-5 business daysUnited States6-9 business days3-6 business daysCanada6-9 business days3-6 business daysUnited Kingdom6-8 business days4-6 business daysEurope6-14+ business days4-10+ business daysMiddle East6-12+ business days4-8+ business daysSingapore5-7 business days3- 6 business daysHong Kong5-9 business days3-6 business daysRest of Asia3-14 business days1-5 business daysRest of the World6-14+ business days1-5 business days* Please be advised that the provided delivery estimates are general approximations, and the actual delivery times may vary based on factors beyond our control. These factors include the load volumes of our shipping partners, deliveries to regional areas, and potential customs delays. While we make every effort to expedite the process, however we cannot accept responsibility for delays resulting from such circumstances.* Additionally, delivery estimates are subject to change due to various variables.* Express shipping specifically affects the speed of your order's delivery after we've processed it, relying on the efficiency of the postal service. It does not expedite the internal processing time needed to create your item, which is addressed by our Rush Order service option. Should you wish for a quicker processing time, a 25% fee on the order's value will be applied. This option is conveniently available during checkout.",
    "reviews": [
      "Great product! Super fast service and delivery. Product is good quality however, being a gift, more care should be taken to remove the IKEA price sticker glue from the bottom of the cup. This can easily be removed so it’s not a big issue but it just doesn’t look good.\nDespite this I would highly recommend and will purchase from this seller again.\nThank you",
      "Quality was good and item matched the description. Such a great little gift!",
      "My granparents loved them I filled them with chocolates for Christmas a great gift",
      "My grandparents absolutely love there cups I filled them with chocolates for Christmas"
    ]
  },
  {
    "productId": "xXzcvAdDKA",
    "url": "https://www.etsy.com/listing/1135504469/personalised-cable-knit-slipper-socks?click_key=cf3e676a8ea5b34de2554bd00e577e799a3e3547%3A1135504469&click_sum=3bb28168&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-16&etp=1&sts=1",
    "title": "Personalised Cable Knit Slipper Socks with Fluffy Sherpa Lining and Rubber Soles, Monogrammed Slipper Socks, Womens Slipper, Loungewear",
    "description": "For the ultimate in cosy comforts, try our fluffy sherpa lined knitted slipper socks. Whether you're snuggled up by the fire with your favourite book or enjoying a slumber party with your besties,our socks make the ideal finishing touch to your loungewear looks.Available in 6 different styles with a classic cable knit design, our socks will take you through the winter months in style. A cute alternative to traditional slippers, the non-slip sole will keep you feeling secure when walking on wood or tiled floors and the soft sherpa lining makes them extra cosy on chilly days at home.When you place your order choose the sock colour you'd like from the drop down menu along with whether you'd like them plain or embroidered.If you'd like embroidery, please select the design you'd like.If you do not choose an embroidery  colour on your order, we will use our discretion to choose for you.SPECIFICATIONS:One Size Only (equivalent to UK Womens Shoe Size 2-6)Care Instructions: Machine Washable, do not Tumble DryMaterial: AcrylicColours: Grey, Teal, Pink (cosy wool feel)Striped; Pink,Grey&White, Blue,Grey&White (soft chenille feel)You might also like our new shorter slipper socks;https://www.etsy.com/uk/listing/1640567324/personalised-cable-knit-ankle-slipper?ref=listing_published_alertDISPATCH TIME:Please allow up to 5 working days for processing before dispatch.",
    "reviews": [
      "Fantastic item, delivered quickly and really high quality. Thanks!",
      "Gorgeous socks personalised and fast delivery",
      "GREAT BOOTTES NOTHING TO COMPLAIN ABOUT.THANKYOU"
    ]
  },
  {
    "productId": "4nhX4luchN",
    "url": "https://www.etsy.com/listing/725776914/custom-house-portrait-personalized-home?click_key=4ba200ad1591697b53f2fd5d5214603497d171d1%3A725776914&click_sum=73ffaa79&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-9&pro=1&frs=1&etp=1",
    "title": "Custom House Portrait, Personalized Home Gift, Gift for Her, Christmas Gift, Home Decor, Closing Gift",
    "description": "Custom House Portrait - Personalized & Custom Watercolor Effect House Portrait - DIGITAL FILE, FRAMED PRINT, UNFRAMED PRINTDigitally mastered print for unique home gift.The perfect personalized gift, a unique keepsake to commemorate a new home, special place, your childhood home, or a new family vacation spot! Personalized Home Decor.Available in many sizes: 5x7\", 8x10\", 11x14\", 16x20\", 18x24\", 20X30\"We can customize any and all text and match colors upon request!----------------------------------------------------------------------------------*This item is digitally-mastered, not an actual watercolor painting.****DETAILS****★ All prints are professionally printed with high quality archival inks to last a lifetime!★ Unframed Prints & Rolled Canvas prices include standard shipping to the US via USPS first class mail.★ RUSH shipping available:Upgrade to Priority or Express shipping at checkout using a shipping upgrade! We now offer Fedex options as well!★ Be sure to checkout the additional images for more info on ordering and shipping!★ UNFRAMED OR FRAMED (see framing options in images) OR CANVAS!-------------------------------------------------------------------------------****ORDER PROCESS****★ STEP 1: Choose your size of print (5x7\", 8x10\", 11x14\", 16x20\", 18x24\", 20X30\")★ STEP 2: Select if you want digital, print, frame, rolled canvas, or gallary-wrapped canvas.★ STEP 3: List all of the text you'd like in the personalization box.★ STEP 4: Double-check your shipping address before submitting your order★ STEP 5: Complete your checkout★ STEP 6: Message us with an attachment of your photo★ STEP 7: Your proof will be sent via Etsy Conversation to you within 2-3 business days and we MUST get your approval before we ship out. Please double-check your email address is correct and you can receive Etsy notifications so you will be notified when we convo you the link to approve. All prints are shipped within 1-2 business days of your approval.",
    "reviews": [
      "This is my 5th purchase for my 5th grandchild. Perfect !!!",
      "Absolutely perfect! My parents will be thankful to have this to remember all the wonderful family memories. Thank you!",
      "My son loved it -perfect",
      "Great quality! Glad I bought it."
    ]
  },
  {
    "productId": "rgggzAZmOJ",
    "url": "https://www.etsy.com/listing/1487653643/groom-gift-from-bride-picture-cufflinks?click_key=93da75e546673c7268dd798bbae049ddd022309c%3A1487653643&click_sum=1fac2761&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-10&pro=1&etp=1&sts=1",
    "title": "Groom Gift From Bride Picture Cufflinks, Custom Photo Cufflinks, Personalized Photo Groom Gift Cufflinks",
    "description": "Are you ready for a surprised touching reaction with perfect gift for him? Recapture the moments. For those special times. For those special men in your life. Using your own creative vision make custom cufflinks. You can use any combination of photos or personalized messages to create your cufflinks. You're in control!  No doubt about it any man in your life will love them! More than cufflinks, they are treasured memorial keepsakes. Great for husband gift for your anniversary!I come through for you.  Once you select your shipping method, Etsy will provide a \"ready to ship in\" time frame and an \"estimated delivery\" time frame based on the shipping method chosen. Please be aware expedited shipping does not mean it goes out the following day, rather it will arrive faster than standard shipping once it is shipped within the \"ready to ship in\" time frame. HOLIDAY ORDERS are subject to delays with the carrier services.How to order and send me your Image, Quote, Message or Logo:•    Simply purchase the productHOW TO SUBMIT YOUR PHOTO ON DESKTOP1.) CLICK ON “PURCHASES AND REVIEWS” FROM YOUR PROFILE DROP DOWN MENU2.) SELECT “ORDER” - THEN “HELP WITH ORDER”3.) SELECT “MESSAGE SELLER ABOUT SOMETHING ELSE”4.) CLICK SEND HELP REQUEST5.) YOU WILL DIRECTED TO A CONVERSATION BOX WHERE THERE IS A PHOTO ICON ON THE RIGHT SIDE6.) CLICK ON THE PHOTO ICON TO ATTACH YOUR IMAGES 3 AT A TIMEHOW TO SUBMIT PHOTOS FROM A MOBILE DEVICE1.) CLICK ON “YOU” PROFILE ICON2.) SELECT “PURCHASES AND REVIEWS”3.) SELECT HELP WITH ORDER UNDER YOUR PURCHASE (LEFT CORNER)4.) SELECT “I WANT TO MESSAGE THE SELLER ABOUT SOMETHING ELSE”5.) SEND HELP REQUEST6.) SELECT YOU - THEN MESSAGES - SELECT THE LAST MESSAGE BOX (SHOULD SAY CARLY OR PENDANT PLACE STORE)7.) THERE IS A CAMERA ICON IN THE LOWER LEFT CORNER, CLICK ON THIS AND YOU WILL BE ABLE TO ATTACH 3 PHOTOS AT A TIME•    Light photo correction and background removal available•    Please include your name and email address in the message box.•    Supported files formats - GIF, JPG, PNG. Please DO NOT crop your photo.Rest easy when I message you with a sample of how your photo or message will appear when cropped to the circular shape of your custom cufflinks.You're #1. Honest and trusted with over 2,500 five-star reviews. 100% Satisfaction Guarantee!This custom photo gift includes:•    One pair of 16mm platinum tarnish resistant cufflinks•    Handcrafted boxAlthough these are not engravable, I can add a message to the gift boxSAVE 20% OFF this purchase right now by going tohttp://eepurl.com/dslu2bI do not crowd your email space. I just send an email every so often with an exclusive discount :-)Photos by Lamy Lens photography",
    "reviews": [
      "Seller was very quick to respond and did a phenomenal job. The cuff links came out perfect and I can’t wait to give them to my fiancé on our wedding day!",
      "Absolutely love the way they turned out! I can't wait to gift them to my husband!",
      "The seller sent a draft quickly and it shipped very fast! I’m so happy with this purchase- a sweet way to incorporate passed loved ones!"
    ]
  },
  {
    "productId": "XgEOaV9QjD",
    "url": "https://www.etsy.com/listing/1529837042/leather-duffle-bag-men-personalized?click_key=9fe3e319391944d1a2270e948a4f1f9757242a7b%3A1529837042&click_sum=c2060ab8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-11&pro=1&sts=1",
    "title": "Leather Duffle Bag Men Personalized, Personalized Gift for Men, Monogrammed Duffel Bag, Gift for Him, Boyfriend Gift, Husband Birthday Gift",
    "description": "Genuine Leather Personalized Travel Bag!This is a High Quality Durable Bag built to last!This Leather Weekender makes the perfect bag for a carry on, gym bag, groomsmen gifts, and more!Bag Measures: 23\"X12\"X10\"Includes Leather Strap",
    "reviews": [
      "It seems to be great quality!!  And the promptness of the order was great!!",
      "Great looking quality bag with very fast shipping.",
      "QUALITY PRODUCT, ARRIVED ON TIME, VERY HAPPY WITH IT."
    ]
  },
  {
    "productId": "ZMrjRbJuJZ",
    "url": "https://www.etsy.com/listing/1469404646/personalized-hammer-for-dad-fathers-day?click_key=4117e059138f547f78a19f6479033bb1d910df8b%3A1469404646&click_sum=c8eac0ca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-12&pro=1&sts=1",
    "title": "Personalized Hammer for Dad, Fathers Day Gift, Personalized Gift from Kids, Engraved Hammer, Father's Day, Dad Birthday Gift for Dad Gifts",
    "description": "Custom Laser Engraved Sturdy Hammers!We engrave each hammer with top of the line laser technology to ensure precise long lasting design for your custom text!Hammer Details:16 oz. Wooden Hammer5.25\" X 13\" X 1.25\"",
    "reviews": [
      "My husband loved it!! Came in a very timely matter and was perfect. Highly recommend!",
      "Was a gift to my bf and he loved it",
      "I gave it to my dad and he was really happy"
    ]
  },
  {
    "productId": "UoxSOKtFwk",
    "url": "https://www.etsy.com/listing/1066826751/2nd-anniversary-gift-cotton-anniversary?click_key=d2f010768aa4d4af5d8ea9f726692290705d1fb1%3A1066826751&click_sum=00a78580&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-17&frs=1&etp=1&sts=1",
    "title": "2nd anniversary gift, Cotton anniversary, second, wedding gift, engagement, romantic gift, trending now, cotton  anniversary 2",
    "description": "Display your devotion on a pillow!Names and date are up to you.  The longer the names, the smaller the font.  The date is generally the date of the marriage, not the current year.Your pillow will look just like the sample pillows, but with your personalized information.If you want to add the additional (5.00 ) option for back sided printing, it can be a sentiment, note or the names on the back, text will be smaller than the front.• Yours will look like the sample, but with your names.• Cream cotton fabric, or creamy oatmeal  fabric both of which are light cream with flecks of brown, tan, black running through them,  these variations are normal for these fabrics.• Insert IS included with purchase.• Back with *envelope closure or zipper closure when available.• Printing black.• Spot clean, air dry, iron  reverse or dry clean to maintain color. pillow is a décor item and should be treated as such.•  pillows may have a distressed appearance, this makes your pillow one of a kind!GIFT WRAP:https://www.etsy.com/listing/572639017/gift-wrap-wrapping-provided-priority?ref=shop_home_active_1&frs=1&crt=1* Fabric may vary due to supply availability, causing slight variations in shade and/or weave. Cover closure may vary between envelope closure and zipper.",
    "reviews": [
      "Excellent customer service, very responsive, great product! Will def recommend",
      "Very tasteful and pretty pillow.  Great customer service too!",
      "My son and daughter in law loved this beautiful pillow for their second anniversary!  Thank you!!"
    ]
  },
  {
    "productId": "IbdOsXcBNC",
    "url": "https://www.etsy.com/listing/780107583/personalised-leather-coin-purse-women?click_key=3aa94ad78aff45fe6f2fcf590b39c15b8dc99271%3A780107583&click_sum=bcb2572b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-18&etp=1",
    "title": "Personalised Leather Coin Purse Women | Pink + Red Love Heart Print | Mother's Day Gift for Her | Secret Message Coin Purse + Gold Initials",
    "description": "Made from soft blush pink leather and printed with red hand-drawn hearts, this coin purse has love to share. Perfect for your mum or grandma this Mother's Day.Our personalised leather coin purses are the perfect size for when you don’t need your full wallet: night’s out, holidays, travelling light. With initials on the front and a secret message printed inside, they are the perfect gift for Mum on Mother’s Day, your best friend’s birthday, a treat for yourself.Handmade from sustainably sourced, premium quality British leather and made in the UK, at our workshop in the New Forest to be exact. A clever origami design that’s seamless with no need for stitching, held tight by a secure popper to keep your coins safe. Room for 3-4 cards as well – our coin purses are little but they hold a lot.Personalise your leather coin purse with a hidden message printed on the inside flap for an extra £5: share a secret, say “happy birthday”, write a note to self. Our coin purses are the answer to your gift buying dilemmas – the perfect present for your best friend’s birthday, your office secret santa (if you really like them), a “thank you” to your bridesmaid squad or an “I love you” to yourself. The perfect size to fit in your jacket pocket, favourite clutch bag or Christmas stocking.-  Made from sustainably sourced leather and solid brass fixings-  9.5 x 7 x 1.5cm, holds up to 5 credit cards-  Up to 12 characters on the front (all caps), optional 70 characters inside (case sensitive)-  Subtly stamped with the Sbri brandmark beneath the flap-  Perfect size for nights out, holidays and festivals-  Packaged in a Sbri gift bag as standard",
    "reviews": [
      "Adorable!!! The perfect little valentine's gift.",
      "super cute but smaller than i expected.",
      "Very cute and well made item. Thank you!",
      "Knocked the love mojo out of the park on Valentine's Day with this customized coin / card purse."
    ]
  },
  {
    "productId": "NllcPELoxx",
    "url": "https://www.etsy.com/listing/974125502/leather-drumstick-bagpersonalized?click_key=2ecc783e2656924aaaadd1a7a01e93f38d19a785%3A974125502&click_sum=62a01a2f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-19&pro=1&frs=1&etp=1&sts=1",
    "title": "Leather drumstick bag,Personalized drumstick bag,Gift for drummer,Gift for musician,Drumstick holder,Drum stick bag,Drum stick holder",
    "description": "Introducing our handmade Leather Drumstick Bag, a must-have for any musician or drummer. Crafted from genuine leather, this drumstick bag is designed to last for years to come, providing a durable and reliable option for transporting your instruments to rehearsals or classes.With a wide selection of colours to choose from, you can select a style that matches your personal taste and preferences. The slide buckle ensures that your drumsticks are held securely in place, preventing them from falling out during transport. And with the convenient wristlet, you can easily carry the bag around with you wherever you go.For an extra special touch, consider personalising your drumstick bag with engraving or stamping. This makes for a thoughtful and unique gift idea for any musician or drummer in your life.With a length of 43.5 cm (17.12 inches) and a width of 6.5 cm (2.55 inches), this drumstick bag is the perfect size to hold all of your essential instruments while remaining compact and easy to carry. Don't settle for a basic drumstick bag - upgrade to our high-quality Leather Drumstick Bag and experience the difference for yourself.",
    "reviews": [
      "Beautiful leather work and timely delivery",
      "Happy with purchase. Nice item!",
      "Exactly as seen online. Great quality!"
    ]
  },
  {
    "productId": "gHvxqQAaEj",
    "url": "https://www.etsy.com/listing/1297761172/personalised-bunny-rabbit-new-baby-gift?click_key=17ae1e809578275eae82b2b48742f3f81e346970%3A1297761172&click_sum=135400b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-20&etp=1&sts=1",
    "title": "Personalised Bunny Rabbit, New Baby Gift, Personalised Plush Soft Toy, Your Name Teddy, Cuddly Toy, Girls and Boys Teddy Baby Shower Gift",
    "description": "Personalised Bunny Rabbit - New Baby GiftA gorgeous teddy for a special boy or girl, whatever the occasion, christening or baptism gift, or birthday or Christmas gift this is one to be loved and treasured for a life time.  Our bespoke soft bunnies can be made for many different occasions, please see our other designs here:https://www.etsy.com/uk/shop/GlamAndCoGiftsProduct Details:❤︎ Super Soft Personalised Bunny - Grey or White❤︎ Available in White or Grey❤︎ 26cm - 34cm Tall (approx)❤︎ CE CertifiedBunny Care:❤︎ We use permanent ink that is infused into the fabric so it will not come off.❤︎ Smooth the tummy of the bunny from head to toe to bring the fur back to the perfect print.Complies with EN71 European Toy Safety regulations.Also available in this listing is a matchingCeramic Ornament:A gorgeous piece of home decor, with a personalised design making it a special gift idea. Presented with a jute tie or ribbon and a free gift bag.Product Details:❤︎ Circle: 7cm x 7cm with approx thickness of 3mmHow to order:1. Change quantity to the amount of pieces that you would like to order2. Select the drop down menu, and select any possible options3. Type your personalised details in the \"Personalisation Box\"4. Click “add to cart”5. Select your preferred shipping method (terms of each shipping service can be found under the shipping policy section)6. Any further comments can be included in the notes to seller section. Queries, requests, or urgent orders must be requested in advance of the order.❤︎ Shipping & Production time scales and terms can be found under the Shipping & Policies tab just below the product image.❤︎ Please READ Shipping & Production times before ordering.NEED TO KNOW:❤︎ Photos are meant for examples and inspiration only. Your custom gift will be made to order based on the specifications you provide during checkout. As each item is unique and made for you, refunds and exchanges are not available unless an error was made by Glam& Co Gifts.❤︎ Once your item has gone into production we are unable to accept cancellation requests or changes to fonts or designs.❤︎ Please ensure that your dispatch address is up to date and correct, as returned items will be charged if they need to be re-sent.❤︎ Please check the shop announcements page for current promotions, and shipping information.Thank you for visiting our shop, we hope you enjoy our products as much as we enjoy making them for youWe will be happy to answer any questions that you may have, please convo us directly through Etsy.Our gifts are perfect for so many occasions please keep shopping to see our gifts ❤︎",
    "reviews": [
      "As described, makes a lovely gift",
      "Was bought as a gift",
      "Exactly as described and pictured, good quality and arrived quickly!",
      "Sent as a gift and happily received by newborn Isabella"
    ]
  },
  {
    "productId": "BwDiabHUxg",
    "url": "https://www.etsy.com/listing/1177652546/leather-passport-holder-personalized?click_key=9c71a3c3e0bbca5006537fa4e288ae2b566e344d%3A1177652546&click_sum=b56da80a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-21&pro=1&etp=1&sts=1",
    "title": "Leather Passport Holder , Personalized Refillable Notebook Journal Cover , Vow Book cover, 3rd Anniversary Gift For Him Mother's Day",
    "description": "It's just a sweet personalized gift for every occasion such as birthday, graduation , bachelorette , wedding , 3rd anniversary, housewarming,Mother's Day GiftOfficiantTravelBible JournalPassportEach order comes with ONE notebook as seen in the pictures.Notebook dimensions: 4\" by 5 1/2\"48 pages 24 sheets paperThis leather passport cover is made from a high-end real leather and comes in three different colors.Elaborate stitching gives it a high quality look and they'll basically last forever as this leather is extremely durable yet soft to the touch.Each order comes with ONE notebook as seen in the pictures.Our leather passport covers are in;Martha Stewart's Travel Collection :https://www.etsy.com/people/rj6ulyn17s95w90q/favorites/travel?ref=profile&ref=finds_ctaFEATURESAll leather notebook covers are handmade from 100% cowhide leather in our pet-free, smoke-free studio in Brooklyn, NY.We supply our leather from local vendors.Dimensions: When closed: 6\" by 4 1/2 \"Please note that due to the very nature of it, leather sometimes can have small marks on it. Each and every piece looks slightly different than one another.PERSONALIZATION is available. Please enter your initials or enter one name. Capital letters only.( Custom logo stamping is also available for large batches, please message me to learn more)*Personalized items can't be returned or exchanged but please contact me if there's any problem and I'll do my best to make it right.NOTEThis listing is only for the leather journal covers. Props are not includedYou can find our detailed return policy in FAQI gladly accept returns, exchanges, and cancellationsReturns are accepted  for full refund minus outgoing shipping  costs.Questions about your order?Please contact me immediately if you have any problems with your order. I will be more than happy to help.FOLLOW our story & production process and be in the know about all collaborations , new items , impromptu sales :  www.instagram.com/zeyn.nyBACK TO OUR SHOPwww.etsy.com/shop/zeynnyABOUT US : We are a  husband and wife team, immigrated from Istanbul  to New York in 2014. Both of us held corporate jobs for over five years before deciding to pursue a creative career. We first manufactured leather goods for other designers but in 2020 pivoted to selling our own designs on Etsy. Today, we create unique leather and waxed canvas goods for our Etsy shop Zeyn NY, while also operating a retail shop in Red Hook/ Brooklyn.Thank you for visitingZeynep & Erdem",
    "reviews": [
      "Looks just as pictured. Great quality.",
      "good gift for those who like traveling",
      "I bought this for my husband for his birthday! He loved it!",
      "Made for a great gift for my world traveler. She loved it!!"
    ]
  },
  {
    "productId": "ZAZpVntfRs",
    "url": "https://www.etsy.com/listing/517610090/leather-engraved-music-sheet?click_key=4401f7983804acc2e8db0db204edfc8d1c632495%3A517610090&click_sum=f9e646b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-22&frs=1&etp=1&sts=1",
    "title": "Leather engraved music sheet, personalized framed music notes, 3rd wedding anniversary gift, leather picture, custom engraving",
    "description": "Leather engraved music sheet, such a lovely idea for the 3rd wedding anniversary.Size: 6'' x 8''Dark wood framePlease note that for this product we use original music sheets which are 2 to 5 pages long and we are only able to use the first page and if it fits a part of the second page (not the entire music sheet). We can also use a certain part of the music sheet, but for that please make sure to contact us via Etsy message right after you place your order.The music sheet is laser engraved on genuine leather. The engraving is sealed with special satin finish, so you can enjoy it for many years to come.",
    "reviews": [
      "Such a beautiful keepsake and gift for my husband!!",
      "My husband loves the leather! It was a very unique gift he enjoyed getting, he put it in his office the next day.",
      "Extremely small! You can barely see the the notes, wording of song and your names and date of anniversary or wedding? Good quality  but Extremely and I say  again Extremely small!",
      "We are sorry to hear that you are disappointed with the size, however if we could point out the size of the product is very clearly written in the product description as 8x6\". We made sure that our customers are given a clear product description with materials, sizes etc. And we are always ready to answer questions and also to customize any of our product as size, shape and design."
    ]
  },
  {
    "productId": "PtSPvUiesT",
    "url": "https://www.etsy.com/listing/1383880754/personalized-standard-size-basketball?click_key=f7db58e985576cbb3fb7f2e15e8e9db0d0a986e5%3A1383880754&click_sum=780f0143&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-23&etp=1&sts=1",
    "title": "Personalized Standard Size Basketball Custom hand painted basketball gift for him gift for son gift for boyfriend sports gift customized",
    "description": "GIFT WRAP INCLUDED!!!! This is a personalized, hand painted standard size basketball... perfect gift for the basketball lover! Choose from a variety of colors to write the name, and each name will be outlined in black, with white shading inside. Choose the gift wrap option and receive a hand written note with your order!! Order this personalized basketball for your child's birthday, Christmas, Valentine's Day, or any other holiday or celebration. Perfect gift for any occasion!!Please note these are Handpainted, and meant for display purposes only. If you do decide to bounce and use as a regular basketball please don’t be surprised if the paint chips or comes off from bouncing on the ground. We do coat the names with a protectant but cannot guarantee that the paint won’t fade from usage.***No returns on personalized items.",
    "reviews": [
      "This was a last min order, but Nikki was so quick to respond and I received my purchase in less than a week! Love the personalized basketball! It’s super cute and I can’t wait to gift it to my nephew! Xo",
      "Wish the paint would stay on but they did warn it would wear off if used. Cute idea as a keepsake.",
      "My 7 year old neighbor loved this!",
      "Great to hear! Thank you!!",
      "Absolutely adorable loved the color and design!",
      "Thank you so much!!!😍"
    ]
  },
  {
    "productId": "xmWPvjo4Aw",
    "url": "https://www.etsy.com/listing/1549347029/personalized-pet-cat-memorial-stones?click_key=d2647571a21bd7352ae9e0627e0813a923546b9e%3A1549347029&click_sum=eb160b2b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-24&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Pet Cat Memorial Stones - Cherish Your Beloved Companion's Memories Foreve",
    "description": "Engraving the pet's name on this natural river rock ensures that our beloved companion will be forever etched into our memories.Our exceptional craftsmanship brings a new purpose to this river stone, allowing your thoughts and feelings to transcend to your cherished pets in heaven.Each stone is meticulously hand-carved by skilled artisans using natural stones collected from scenic rivers. As these stones are purely natural, their colors and shapes may vary based on availability, adding to their unique appeal.Throughout the years, we have remained dedicated to our craft, designing and engraving with unwavering passion. When you receive our work, you'll sense the sincerity and commitment we pour into each piece.Please allow us approximately 3 days to prepare your order for shipping. Should you have any inquiries, feel free to reach out to us.",
    "reviews": [
      "as described as the picture!",
      "I received my river rock today with engraving for my beloved cat and it's beautiful!  It turned out so nice and the rock is a wonderful smooth black/grey.  The inscription is lovely and the silhouette is equally so.  It arrived in very nice padded packaging in a box nestled with insulation.  \nI really like the fact that this seller donates a portion of their sales to Petsmart charities, I always donate when I go to their store.  Thank you for caring about animals and being a great seller!",
      "Beautiful quality and exactly as pictured. It’s the first thing I see as I go to the garden. Also the sweetest note included. Thank you!"
    ]
  },
  {
    "productId": "yAgkbCdXFG",
    "url": "https://www.etsy.com/listing/1193385464/personalized-christmas-gift-anniversary?click_key=fdc2ed79929a6dd850ea120e9a4f2d0a3142b729%3A1193385464&click_sum=9adc47fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-13&pro=1&frs=1&bes=1",
    "title": "Personalized Christmas Gift, Anniversary Gift for Him, Engraved Handwriting Wallet, Custom Photo Wallet, Gift for Husband, Gift for Him, Men",
    "description": "Personalized Leather Wallet, Slim Wallet, Father's Day Gift, Minimalist Leather Photo Wallet, Leather Wallet, Custom Card Holder, Gift for Him, Gift for Husband, Christmas Gift, Personalized Wallet, Groomsmen GiftPRODUCT FEATURES- This wallet is made of 100% Genuine Leather.- High-quality materials were used for this case with Original Full-Grain Cow-Hide Genuine Leather.- It has 1 main money slot and 1 ID slot. Moreover, it has 12 card slots and three of them can hold multiple cards.- It is very easy to carry in your front or back pocket.- Every single one of our beautiful wallets is handcrafted to perfection and subject to rigorous quality control standards. The quality, function, and style in our wallet are unavailable from competing products.- It softens naturally with use and ages beautifully with time. It is a high-quality product that can totally be used for a long time.>>If you are thinking of the perfect gift, this has a nice personal touch of custom engraved monogram, name or initials, or your custom logos such as company, team, or military! It will surely make a great gift for your loved ones or even for yourself!COLOR-Dark Brown-Brown-Antic Black-Antic Gray-Navy BlueHOW TO ORDERSTEP 1: Chose the way you view your finished wallet: Your options are: This will help us place the engraving in the correct place for that style.STEP 2: Chose what you want to be engraved. For this step, you have 3 options.The First option is Monogram/Logo: Select the monogram style you want, then write your letter.The Second option is Phrase: If you want to engrave a Phrase please select one of the four font styles, then write your message.The Third is Handwriting: Send a photo of handwriting via Etsy Message or Mailing at  PrincetonLeather [!at] gmail.comNote: Handwriting should be written on plain white paper. Please remember that higher photo quality will give a better result.STEP 3: Place your order.* Example-1: Design-1: ROBERT* Example-2: Font 2, \"I love you to the moon and back\"* Please type ''No Personalization'' if you select No Personalization>>We are only able to engrave exactly what the customer puts. We're not responsible for any typo provided by the customer. Please make sure everything is correct before you submit the order. We'll do our best to answer any change request, but no guarantee for any changes. It is good for Army, Navy, or Team Logo.>> Same-day free shipping by USPS when you order up to 2 PM (ET)>> %100 Money-back guarantee in 30 days!>>Our wallet makes a perfect gift for him or her on his or her Birthday, Anniversary, Graduation, Wedding, Thanksgiving, Christmas, Father’s Day, or Mother’s Day! Also, it is great for a Boyfriend gift, Husband gift, and Groomsmen gift, even just a treat for yourself!Click \"Add to Cart\" right now and order yours today!https://www.etsy.com/shop/PrincetonLeather",
    "reviews": [
      "My partner loved his new wallet with our fur baby on the front.",
      "I purchased this wallet for my husband as a Christmas gift and he loved it! The quality of the wallet was amazing and the sketch turned out so beautiful!",
      "Worked with me and sent fast! Great piece, my fiancé loved it."
    ]
  },
  {
    "productId": "mOKrHJAsYM",
    "url": "https://www.etsy.com/listing/1210872642/high-quality-name-necklace-personalized?click_key=a70387e5b8b08ddd50e3bdffee6d3695ea6636d4%3A1210872642&click_sum=c008f6fb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-14&pro=1&frs=1&bes=1",
    "title": "High Quality Name Necklace Personalized Jewelry Minimalist Handmade Jewelry Custom Name Necklace Christmas Gift Gift for Her - KNN",
    "description": "❤️❤️ EXCELLENT QUALITY NAME NECKLACE ❤️❤️A buyer can return the item for no reason at all⚠️ ⚠️ ⚠️ The photos you see with the review may belong to the  regular (not this item) name necklaces.⚠️ ⚠️ ⚠️❤️❤️100% Satisfaction Warranty for this item❤️❤️A buyer can return the item for no reason at all❤️❤️ This necklace was made in 120 microns thickness and it is one of the thickest and most durable necklaces in the market. ❤️❤️(Normally, name necklaces are made from 60-80 microns so they are thinner, lighter and easily breakable).❤️❤️ We Use only sterling silver OR !4K Gold. Please Select your material ❤️❤️❤️❤️Great choice for athletes and kids ❤️❤️❤️❤️ The photos you see with the review may belong to the regular (not thick) name necklaces.❤️❤️❤️❤️FREE  MOCK UP ❤️❤️If you want to see before how it looks like before purchasing, we can make mock up for you. Please feel free to contact us. Just message me your fonts that you like. Also you can ask me about this item.❤️❤️ MATERIAL ❤️❤️100% 925K Solid Sterling SilverOR100% 14K Solid GoldAll necklaces come with 2 inches extender except 14K Solid Gold options.14K Solid Gold options don't come with 2 inches extender.❤️❤️ UNBREAKABLE ❤️❤️This  item is resistant to the breakage and splits.❤️❤️ NONTARNISH ❤️❤️The impeccable quality compared on other name necklaces at market. Perfect for everyday wear.❤️❤️ WATERPROOF ❤️❤️It can be worn in the water❤️❤️ HIGH QUALITY CHAIN ❤️❤️The chains of these necklaces are also thick and solid. Moreover, they have a delicate design.❤️❤️ NONALLERGIC ❤️❤️We use only 925K Sterling silver OR 14K Gold. They are not allergen metals.❤️❤️ CHAIN ❤️❤️Box ChainFigaro ChainGourmet Chain❤️❤️ Please take a look my store to see my collection ❤️❤️https://www.etsy.com/shop/NorthstormCA?ref=simple-shop-header-name&listing_id=902096615❤️❤️ DISCOUNTS ❤️❤️We are happy to provide special discount for multiple orders such as for bridal parties and as bridesmaids gift sets. Contact me for additional coupon code.⚠️ ⚠️ ⚠️  ATTENTION ⚠️ ⚠️ ⚠️Please double check your shipping address, font, size, material and name for it. If you want I can change your item details in 12 hours of purchasing. Also you can change your shipping address before shipping date. Feel free to message me.14K Solid Gold Name Necklace - Personalized Jewelry - Name Necklace - Name Jewelry - Custom Name Necklace - Sterling Silver - Necklace - Gift for Kids Girl - Gift for Wife - Birthday gift for Wife - Christmas Gift for Kids Young Girl - Christmas Gifts for Baby Girl - 14K Solid Gold Thick Name Necklace - Personalized Jewelry - Name Necklace - Name Jewelry - Custom Name Necklace - Sterling Silver  - - Gift For Kid Girl - Gift For Baby Girl - Birthday Gift for Her",
    "reviews": [
      "Perfect just what I asked for",
      "You're very welcome! I'm thrilled to hear that you're pleased with the service. Remember, I'm here whenever you need assistance or have any questions. Don't hesitate to get in touch. Enjoy your purchase",
      "Prefect customer service and amazing necklace",
      "You're very welcome! I'm thrilled to hear that you're pleased with the service. Remember, I'm here whenever you need assistance or have any questions. Don't hesitate to get in touch. Enjoy your purchase",
      "Absolutely stunning!  The font is perfect and easy for my niece to read !  Quality is amazing!  I will definitely recommend! Thank you",
      "Thank you for your feedback and for expressing your satisfaction with your purchase! We're thrilled to hear that you're happy with your order. If you have any further questions or need any assistance, feel free to reach out to us"
    ]
  },
  {
    "productId": "cOTcRjcGjF",
    "url": "https://www.etsy.com/listing/195458719/custom-bracelet-personalized-gift-design?click_key=1e77b4932ed5c3911e8c2d835168715d766034a2%3A195458719&click_sum=1c5c9158&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Custom Bracelet | Personalized Gift | Design Your Own Jewelry | Custom Jewelry | Personalized Gift | Birthday Gifts For Her |",
    "description": "Design Your Own Personalized Custom Custom Cuff Bracelet| ORDERING INSTRUCTIONS CAN BE FOUND BELOW AND BY SCROLLING THROUGH THE PHOTOS ABOVE |Korena Loves chose stainless steel as the medium for our personalized jewelry for several reasons.  Stainless steel jewelry is sustainable and eco-friendly.  It’s known for its durability, making our jewelry long-lasting and reusable. It is resistant to tarnishing, fading, and corrosion, ensuring that your personalized engraving will stay beautiful. Additionally, stainless steel is a recyclable material, making it an environmentally friendly choice. By choosing Korena Loves stainless steel jewelry, you're not only investing in a timeless piece, but you're making a sustainable choice that helps to reduce waste.  We strive to craft gifts as unique and special as those receiving them and we hope you will feel good about gifting them. Spending our days surrounded by inspirational quotes of faith, love and happiness is our business and our joy.  May they bring joy to those who receive them as well. Thank you so much for visiting our shop.| VERY IMPORTANT PLEASE REVIEW THESE INSTRUCTIONS CAREFULLY PRIOR TO ORDERING |►  All of our items start off blank, the photos are meant for examples and inspiration only.►  Your custom jewelry will be made to order based on the specifications you provide during checkout.►  We carry no standing inventory and produce our jewelry only when ordered.►  Our engraver doesn’t have a proof mechanism, so production will generally begin without additional contact.►  Keep in mind custom crafted jewelry is seldom perfect or evenly spaced. Font and graphic sizes will vary based on character counts and graphic requests. These characteristics are all part of the charm and should not be considered defects.►  As each item is custom produced uniquely for you, refunds and exchanges are not available unless an error was made by Korena Loves.►  We are unable to accept cancellation or change requests after your item has begun the first stage of production.| CUSTOMIZATION & PERSONALIZATION |►  All Korena Loves jewelry begins blank and is made to order.►  Your instructions should be added to the personalization field provided when you load the item into your cart►  Our cuffs are priced by the width. Before purchasing please be sure you have selected a bracelet with the appropriate width/price to accommodate your text.►  The cuff width in the main photo is the width you are purchasing.  If you desire a different width, please purchase from a different listing with the width you desire in the main photo.►  We recommend no more than 60 characters of text including spaces per line.►  Our standard 6” cuff will fit most woman and is slightly adjustable the first time it is worn. Keep in mind these are true cuffs and meant to open in the back.- 1\" cuffs hold up to 5 lines and are available in the standard 6” length only, this size will fit most woman- 1/2\" cuffs hold up to 2 lines and are also available in a 5\" length for smaller wrists and a 7\" length for men & women with larger wrists- 3/8” & 1/4” cuffs hold 1 line and are also available in a 5\" length for smaller wrists| ORDERING INSTRUCTIONS |►  Below are a few simple and concise examples of how best to share your personalization instructions:►EXAMPLE ONEOUTSIDE:  Border M with the name SarahLEFT END:  3rd heartRIGHT END: Love, MomINSIDE: Quote shown in main photo►EXAMPLE TWOOUTSIDE: Border 3LEFT END: leave blankRIGHT END: leave blankINSIDE: I love you more►EXAMPLE THREENEED 5” LENGTH FOR SMALL WRISTSOUTSIDE: Border A with text Psalm 46:5LEFT END: 3rd CrossRIGHT END: Love, Aunt RoseINSIDE: God is with her, she will not fall| WEAR & CARE |►  Cuff bracelets should only be “sized” to your wrist the first time you wear them by gently opening or pinching the ends. After that, rather than bending the metal, simply slide the opening over the narrowest part of your wrist and then gently turn into the cuff. This will avoid overworking the metal so you’ll have a lasting treasure.►  Surgical grade stainless steel may contain some nickel, but is generally considered hypoallergenic for most people.►  Stainless steel jewelry is harder than silver and doesn’t usually tarnish, rust or require a lot of special care, however it can scratch. We recommend storing in it’s box, an individual bag or pouch. If your jewelry does get scratched, you may wish to contact a local jeweler for a professional polish.► Wash by dipping a soft, lint-free cloth in warm soapy water, and then gently wipe. Dry well with a clean cloth. Follow up with a jewelry polishing cloth for a nice shine.Don’t hesitate to contact us with any questions or concerns.Korena Loves | Personalized Jewelry | Personalized Gift | Personalized Bracelet | Gift Ideas | Gifts for Her",
    "reviews": [
      "It's absolutely perfect..I love it",
      "I absolutely love my personalized cuff bracelet. It was very easy to customize and the engraving was perfect!",
      "As described, good quality, engraving turned out great",
      "Designed the way I wanted and looks great."
    ]
  },
  {
    "productId": "kJaXqiNySW",
    "url": "https://www.etsy.com/listing/1306345941/personalized-anniversary-gift?click_key=b7d6575ff8545240cf707ee800642fe34acbbc0d%3A1306345941&click_sum=0065e663&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161038-13-16&pro=1&bes=1&sts=1",
    "title": "Personalized Anniversary Gift | Personalized Garden Stone | Personalized Gift | Anniversary Gift | 50th Anniversary | 20th Anniversary Gifts",
    "description": "Personalized Garden StoneOur beautiful personalized garden stones are custom made to order. Pick any two first names and date and the anniversary desired -Please note your personalization in the message box during checkout. Our garden stones ship quick from our studio in Southern California. We put lots love love and care into every item we create.Details:- Pick the size you would like. 8\" (18-20cm) and 6\" (14-15cm)- Our stones are weather proof.Our stones are created from slate and by nature are weather proof. The coating that is applied to the stone is also weather proof and will not be affected by rain, cold or snow. Over time the sun could fade the writing and we suggest using an outdoor furniture spray or UV protectant just as you would for outdoor furnishings. The stones include a stand for indoor display if desired.At this time we are not able to offer proofs before creating, please ensure all order information is correct before finalizing orders. If a mistake is noticed. Please notify us via convo within 12 hours.",
    "reviews": [
      "X x x x x x",
      "It's gorgeous and the seller was very responsive and made sure we received the item on time. Love the glossy look and the quality.",
      "Check the sizing to make sure it’s what you’re actually looking for"
    ]
  },
  {
    "productId": "bbhqoXScSi",
    "url": "https://www.etsy.com/listing/193661963/unique-mother-of-the-groom-gift-thank?click_key=810b122140fadd5849c75179cbd651eeb4ce21d3%3A193661963&click_sum=ed4509bd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-25&pro=1&frs=1&etp=1&sts=1",
    "title": "Unique Mother of the Groom Gift, Thank You For Raising the Man of My Dreams, Mom Gift, Mother in Law Gift, Personalized Square Keepsake Box",
    "description": "This unique and personalized mother of the groom gift is made of earthenware clay and has this text printed on the lid: 'Thank you for raising the man of my dreams.'  This beautiful square keepsake box is of heirloom quality and can be enjoyed for years to come. Best of all, the inside of the box can include a personalized message. The box measures 3 ½\" L x 3 ½\" W x 1 ¼\" H.Please select the text option for the inside when checking out. If you'd like the same text on the lid and inside but just want to change the name and date then please select 'Same + name & date' or if you'd like something different then select 'custom text'. Then add your name and date or custom text in the 'personalization section'.Our signature gift box with silver seal adds the perfect final touch! The box will be flat packed so you can simply assemble it, add your keepsake box and your gift will be ready to give! If you'd like to add a gift box (as shown in the last image) please add the link below to your cart before checkout:https://www.etsy.com/listing/836494785/add-gift-box-to-order-additional-service?ref=listings_manager_gridPlease click here to see the mother of the bride version of this box:https://www.etsy.com/listing/179720942/unique-mother-of-the-bride-gift-square?ref=shop_home_feat_4For up to date production times, shipping estimates, and holiday deadlines please see announcements on shop homepage for more information.  If you need it sooner than our standard lead time please contact us, we are able to expedite many of our products. Upgraded shipping for faster delivery is available at checkout for most items.https://www.etsy.com/shop/SusabellasWe love custom orders so if you have an idea, just send us a message!----Buy more than 1 keepsake box and receive a discount with these codes!Buy 2 keepsake boxes and receive $4.95 off your order - use code 2KEEPSAKESBuy 3 keepsake boxes and receive $8.95 off your order - use code 3KEEPSAKESBuy 4 keepsake boxes and receive $12.95 off your order - use code 4KEEPSAKES",
    "reviews": [
      "Perfect gift for my future MIL! She loved it! The personal touch was great",
      "Beautiful and exactly like I ordered.",
      "Amazing product, my mother in law will love it."
    ]
  },
  {
    "productId": "isFDWhLZyf",
    "url": "https://www.etsy.com/listing/1298386398/personalised-metal-wallet-photo-card-for?click_key=83d68f110034f9e874349f7b5f43c624e7af507c%3A1298386398&click_sum=44bf77d2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-26&etp=1&sts=1",
    "title": "Personalised Metal Wallet Photo Card for Dad Husband Grandad Gift / First Father's Day Keepsake Custom Christmas Present Him Gift For Dad",
    "description": "Keep a memory, moment or person close to you at all times with this thoughtful metal wallet card.The perfect stylish yet sentimental gift for a loved one. Simply send us your special message, and we'll do the rest.Send me your photo via Etsy message after you have made the order.- 4 Fonts to choose from- Comes with a FREE craft envelope to present the card.[HOW TO PERSONALISE]Add your message in the \"personalisation\" box when ordering, message after you have ordered with your photo.[DIMENSIONS]The metal card is W84 x H54mm x D1mm[POSTAGE]UK orders are sent via Royal Mail 2nd class and typically arrive within 2-3 days.International orders are sent via Royal Mail 'International Standard'. Orders within Europe usually arrive within 7-10 days and 2 - 3 weeks for those outside Europe.[FREE ENVELOPE & GIFT BAG]To add a special touch, we include a free envelope and a free elegant organza gift bag with your purchase. Simply select your preferred gift bag colour from the drop-down menu and let us know. It's our way of making your experience with us even more exceptional.[MADE FROM]Made from thick 1mm aluminium, which feels very high quality to touch without adding much weight to your wallet. Printed onto a special coating that gives a glossy, vibrant finish on both sides. Printed using our state-of-the-art sublimation printer ensures brilliant colour accuracy and perfect detail.Occasionally I will need to crop time image to make it fit in the card, I will use my own judgement and experience on how to best make the image fit the card, but if there is any part of the photo you do not want to be cropped out, please just message me after your order and let me know.NSFW images allowed - discretion assured.To add a special touch, we include a free envelope and a free elegant organza gift bag with your purchase. Simply select your preferred gift bag color from the drop-down menu and let us know. It's our way of making your experience with us even more exceptional.",
    "reviews": [
      "Great product and seller, I would recommend!",
      "Love it! Photo looks amazing on the material used. A great keepsake for my husband after I’m gone.",
      "Great quality and fast delivery. Love the cards."
    ]
  },
  {
    "productId": "2xgTNFnsur",
    "url": "https://www.etsy.com/listing/1679674805/embroidered-easter-basket-custom-kids?click_key=bbf232371d5bfae99205ba52509a80c74aa62944%3A1679674805&click_sum=2d9ad4af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-27&pro=1&etp=1&sts=1",
    "title": "Embroidered Easter Basket, Custom Kids Basket, Easter, Basket, Personalized Easter Basket, Baby Girl First Easter Basket, Baby Pink Gingham",
    "description": "Our embroidered pretty chipwood basket with a baby pink gingham printed liner will be a great Easter basket for your loved one! Fill it with candy and small treats to make a beautiful basket. Carrots decor is included, bunny stuffed animal is not included. Basket included.Details:11\" x 11\" x 7.1\" (28cm x 28cm x 18cm)Chipwood and polyesterEmbroidery will be approximately 2\" in height and length depends on how many characters.",
    "reviews": [
      "Exactly what I was looking for!",
      "I absolutely love it. Everything is as they described. They responded very quickly when I had a slight issue in the mail which was not their fault, (things get lost in mail) they fixed and sent a new one. I will definitely be buying from them in the future 😍😍 100% recommend 👌",
      "absolutely great! so soft, and just as cute as the photos",
      "Awesome blanket! Super soft ! Would recommend anyone to get one!"
    ]
  },
  {
    "productId": "mSlCdniDVa",
    "url": "https://www.etsy.com/listing/1163456124/personalised-our-little-family-family?click_key=2be57a1c66e9a219dd84f59ba0d4a8cd3c1985d1%3A1163456124&click_sum=92e1c4d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-28&etp=1&sts=1",
    "title": "Personalised - Our Little Family | Family Anniversary Gift - Choose Your Own Family Combination",
    "description": "Our little family frame comes with 1 or 2 adults and your choice of 0 to 4 children sat in an engrave wooden frame 'Our Little Family'.The anniversary personalised our little family frame is the perfect gift for mothers day, fathers day, Christmas, parents birthdays, or families in their new homes. It is a thoughtful ornament that is able to be displayed anywhere, with a sentimental meaning of the family.The wooden frame is 26.2cm x 11.2cm x 3cmN.B.Wood being a natural material will differ slightly in colour and grain.",
    "reviews": [
      "My wife loved it!  Highly recommend.",
      "The seller was of great assistance",
      "Absolutely amazing! So happy with the item thank you!",
      "Would definitely buy again lovely little buy seller had great communication and very fast delivery"
    ]
  },
  {
    "productId": "qYRAVwkTqi",
    "url": "https://www.etsy.com/listing/1258535394/custom-velvet-jewelry-case-bridesmaid?click_key=3b926ac920390647f5b5c7ef58e8b0171075d8a0%3A1258535394&click_sum=efc692a8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-29&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Velvet Jewelry Case | Bridesmaid Gifts Proposal | Personalized Italian Velvet Jewelry Box | Bride Gift | Gifts for Women",
    "description": "Elegant velvet jewelry box with custom name is a perfect gift for bridesmaid, maid of honor, bride, best friends, Mom, wife, girlfriend and more......Made of high quality velvet and suede, this box can be used to store jewelries, earrings, rings, bracelets or necklaces. The handy size 3.9\" x 3.9\" x 2\" allows it to be carried everywhere and  also a great partner for travel.Product details:Material: Velvet,  suedeSize: 3.9\" Length x  3.9\" Width x  2\" HeightBox color: light pink, dusty pink, mulberry, champagne, emerald, mint, midnight blue, baby blueMonogram color: Gold, silver, blackHow to purchase:1) Choose your box color from the drop down menu2) Choose font sytle and monogram colorYou can choose the font style and font color you wish. We offer \"DIY\" choice as well if you' d like to put on the sticker personally. The jewelry box will not be customized with any text then, instead of it, we will send a \"bride squad\" sticker in black font color to you.3) Add to cart4) Leave your name and placement in the personalization box.5) Click proceed to checkout to complete your orderHow to care:*Dry cleaning, using a soft bristled brush to wipe away any dirt or spots.*If the stain is still there, spot-clean it with a small amount of vinegar and water. Use a damp cloth to gently rub away stains.*Avoid soaking it in water.* About shipping *DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysInternational Shipping Note:*Please leave contact number for international shipping.*All duties and taxes shall be paid by customer.Therefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.--------------------------------------------------vintage jewelry box, bridesmaid proposal, travel jewelry box, maid of honor gift, bridesmaids gifts, jewelry organizer, mothers day gift, jewelry holder, wedding favor, travel jewelry case, gift for mom, gift for her, jewelry box, bride gifts, bridal shower gift, bridal party gift, anniversary gifts, gift for her",
    "reviews": [
      "It is so beautiful! I love it!!",
      "Excellent condition, ordered two as Christmas presents for loved ones of mine.",
      "Amazing quality and a lot bigger than expected which is a good thing it will hold a lot more jewelry than you think! Ordered this for my bridesmaids and not a single mistake ♥️",
      "Beautiful piece!  The quality is much better than I expected. I ordered as a gift but will definitely be ordering one for myself."
    ]
  },
  {
    "productId": "SsWgLltp4B",
    "url": "https://www.etsy.com/listing/710752834/love-letter-blanket-personalized-gift?click_key=4643cd56bb6ccf5910a5cdb7b4f4c279d92b99db%3A710752834&click_sum=e6768da9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-30&etp=1&sts=1",
    "title": "Love Letter Blanket: Personalized Gift for Mom, Woven Handwriting Custom Throw for Dad or Men, Mother’s Day, Grandparent, Cotton Anniversary",
    "description": "A personalized gift blanket made from your own unique handwriting! Write your own custom letter to a loved one so they can wrap themselves up in love. Make it extra personal by using your own handwriting, or keep it simple by using a font!This is the ORIGINAL Love Letter Blanket, all others are copies :)Makes a great gift for Mother's or Father's Day, Christmas, Valentine's Day, a wedding anniversary, graduation, memorial or birthday! Write your letter to your mom, dad or parent, your child, newlyweds, your husband, wife or partner, your teacher, or BFF. Or a \"note to self\"!Sizes:37\"x52\" - small size for a chair, or kids blanket.60\"x50\" - most popular size, great for throwing on a couch. Pictured in 1st photo.80\"x60\" - fit a few people, or use as a bedspread. Approximately the size of a queen size bed (just the top, not hanging down the sides).100% cotton and machine washable (wash in cold, tumble dry on low). Color is a natural un-bleached cotton (off-white/cream), with black writing, and red + blue lines. The reverse side is blue/green (see photos).➜ OPTION ONE: Choose the standard handwriting font (shown in the photos), and simply enter your text in the personalization section. I will send you a preview via Etsy message (usually within 1-2 business days). After you have approved it, it will take about 4-10 business days to make. If I do not receive a reply from you within 7 days, I will make the blanket as-is. The faster you reply to this preview message, the faster I can make the blanket :)OR:➜ OPTION TWO: Use your own handwriting! Simply print the template (http://bit.ly/LoveLetterEtsy), write your letter, then scan or take a photo of it, and send via Etsy message. After I have received your letter, it typically takes 4-10 business days to make. This option does not have a preview, and your blanket will look exactly like the template you submit.Important Notes:✦ Handwritten letters MUST BE WRITTEN ON THE TEMPLATE provided. I cannot currently work with letters not on the template, but have received many requests for this, so it may be available in the future.✦ Your letter may be written in any language!✦ The text you submit must be your original writing, or you must have authorization from the original writer. I cannot use COPYRIGHTED WORK such as poems or music lyrics.✦ RUSH ORDERS or rush shipping are not available, sorry. Please check the expected delivery dates before ordering.✦ Once the order has started production, I cannot cancel or change it. Please check your order before submitting it, including the shipping address.✦ Because this is a custom-made and personalized item, I do not accept returns. However, if there are any errors or quality issues, please contact me within 7 days of receipt with a photo and description of the issue and I will happily fix it.",
    "reviews": [
      "Overall amazing experience. \nWe gifted this blanket from my 6 year old son to his 93 year old great grandma. \nCan’t wait for my next order.",
      "Amazing! The perfect 2nd anniversary gift which is traditionally supposed to be made of cotton. This worked so well!",
      "Couldn’t have asked for better service",
      "The design/ordering process was clearly outlined, the blanket is very high quality and my wife loved it as a Christmas gift!"
    ]
  },
  {
    "productId": "zLUGchEicM",
    "url": "https://www.etsy.com/listing/1092324072/personalized-gift-tag-custom-tag-family?click_key=64001a7b7eb6e3b8c195c626f4716d7f6d2964bf%3A1092324072&click_sum=2070fb5e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-31&etp=1",
    "title": "Personalized Gift Tag, Custom Tag, Family Tags, Hostess Party, To From Tag, Birthday Gift Tag, Baby Shower, Birthday Party, Christmas tag",
    "description": "Our personalized gift tags are the easiest way to elevate your gifting and take your wrapping to the next level! It’s the perfect final touch your friends and family are sure to remember. Go the extra mile by pairing with our specialty gift wrap!Product Highlights:-2.75\" x 2.75\" square size-Pre-punched hole, ready for your ribbon or twine-Packaged in cello bagPersonalization:-Please include name(s) in the personalization box as you would like them printed.-Select colorway Multicolored, Pinks or Blues*Proofs are not sent unless requested. If requested, please allow extra time for communication and proof approval.Order Processing & Ship Time:-Orders are processed within 3 business days.-Products are shipped via USPS or FedEx and arrive within 7-10 business days from order date (often sooner). You will receive tracking information once your order has shipped!*Please let us know if you need your order by a specific date, especially during the holiday months. We do offer a rush option for up to 5 products, which can be purchased using the following listing links:-RUSH SHIPPING 1-2 ITEMS:https://www.etsy.com/joycreativeshop/listing/966241715/rush-order-processing-for-1-2-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1634351583876-RUSH SHIPPING 3-5 ITEMS:https://www.etsy.com/joycreativeshop/listing/952284782/rush-order-processing-for-3-5-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=163435160006______________________________________________Head to the shop here:https://www.etsy.com/in-en/shop/JOYcreativeshopSay hi ::  hello [!at] joycreativeshop.comConnect with us on Instagram, Facebook + Pinterest :: @joycreativeshopConnect with us online :: joycreativeshop.comThank you so much for your support of Joy Creative Shop! We’re so grateful for you!",
    "reviews": [
      "Thank you. Would recommend to Others. A+",
      "Amazing! Love it!\nThank you",
      "Beautiful product and quick shipment"
    ]
  },
  {
    "productId": "vfNbbfvulb",
    "url": "https://www.etsy.com/listing/509427414/personalised-bamboo-pen-box?click_key=b89a02d325f32102abd1cec769a984a26ad50b0e%3A509427414&click_sum=50ae032d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-32&pro=1&etp=1&sts=1",
    "title": "Personalised Bamboo Pen & Box",
    "description": "PRODUCT DESCRIPTION• Personalise this unique pen in a bespoke box to create a  treasured gift.• This bamboo rollerball pen can be personalised with up to 20 characters.• The pen is made from ecologically sourced bamboo• Please note that this product is a natural wood and will contain inherent variations.PERSONALISATION• Pen personalisation is included in the price.• For a small extra cost we can personalise the inside of the box and the box lid.• We engrave our pieces to create bespoke items especially for you, we are always happy to try and help if something is unsuitable but we regret we are unable to offer refunds on personalised items.FREE GIFT BOX• This item comes beautifully packaged in our Hurleyburley gift box. We can add a gift card for your special message.FREE STANDARD UK DELIVERY• Our standard postage is by Royal Mail 1st class post which has delivery guidelines of 1-2 working days but is not guaranteed to arrive within this timeframe.• This item is available for express next day delivery if ordered before 3pm MON – FRIMADE FROM• Bamboo• Rhodium plated stainless steelDIMENSIONS• Pen 1cm x 13.5cm• Box 17.1cm x 5.2cmPRODUCT CODE• HBA14",
    "reviews": [
      "Nice pen and arrived quickly. Thank you.",
      "Item arrived quickly, amazing quality so so pleased. Would definitely use again",
      "Speedy delivery and great quality!"
    ]
  },
  {
    "productId": "iwbACCGSUr",
    "url": "https://www.etsy.com/listing/1527860781/custom-father-of-the-bride-gift?click_key=47132e14e4c5a378f73f77f40a0d50efec2dff02%3A1527860781&click_sum=30f17e31&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-33&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Father of the bride gift, personalized Wedding  cufflinks, Daughter's Wedding Gift for Father, I loved your Dad Cufflinks",
    "description": "Metal cufflinks with a diameter of 20 mm, square walnut gift box (1.8 × 1.8 × 1 inch).Add your personalizationPlease select the cufflinks and box and write the information you need to customize: for example- Cufflinks (A) J N- Box Engraving (Style 1) M Monica- You can also choose a different design for both cufflinks, for example - Cufflinks A+BI will send you a mock-up via Etsy Inbox - you can modify it until you are satisfiedThe design is customizable! If you would like to use your design, logo or handwriting, please send us your photo via Etsy message.EngravingPlease view photos for design options or send us your design via Etsy message.Box OptionsPlease select \"Blank Box\" for no customization, or \"Engraved Box\" for a personalized box.Product ordering process.1. Choose the style we give you or write your personalization (text, design style, font and special instructions) under the personalization box on the listing. You can also send your design (high resolution .jpeg or .png) via Etsy message. 2.2. After we get your personalization, we will send you a design mock-up that can be modified according to your requirements, and we will create it only after you confirm it.3. After the design mock-up is approved, we will produce and ship within 3-5 business days (except weekends).",
    "reviews": [
      "I really appreciated the quality of this item. It shipped extremely fast. Amazing communication regarding the design and sending the tracking link. My dad is going to love it! Thanks!!!",
      "Great quality on my custom order.",
      "Amazing gift for my father",
      "Fantastic gift! Really good quality and magnetic box made it so unique too! Great, efficient, and timely customer service!!!"
    ]
  },
  {
    "productId": "UyQrQHNrlt",
    "url": "https://www.etsy.com/listing/270599712/romantic-gift-for-her-message-bottle?click_key=6961fed8ffab3eaaa7cf1126f09edfb594ced16a%3A270599712&click_sum=f1916bbd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-34&etp=1",
    "title": "Romantic Gift For Her, Message Bottle Keepsake, Valentines Girlfriend Gift, Personalised Anniversary Gift For Wife, Personalised Heart Token",
    "description": "A cute little romantic gift for her. A handpainted red heart suspended inside a little glass bottle.  A perfect Valentines gift for your wife, partner or girlfriend. Also makes a great wedding anniversary keepsake token gift.A glittery red heart suspended inside a miniature keepsake glass bottle with an engraved label with you own personalised message. I Love You Mummy gift, gift for mother or a romantic gift for an anniversary gift, love token or even as a wedding favour wedding favourWe cut a teeny heart from fine birch wood, hand paint, glitter it and suspend it on silver thread in a keepsake glass bottle. Finished with an engraved birch ply label attached to the neck of the bottle.made from:Birch ply, glass, cork, vegetable stain, glitterSmall Bottle - 4cm x 2cmLarge Bottle - 9.5cm x 3.7cm",
    "reviews": [
      "Lovely bottle. Great gift. My wife loved it.",
      "Got this for my wife as a little birthday gift. Really nice looking and was dispatched nice and quick.",
      "Wonderfully quick response and lovely gift. Thank you.",
      "It's is such a cute little gift!"
    ]
  },
  {
    "productId": "iAplJwVedc",
    "url": "https://www.etsy.com/listing/513537299/beat-block-wooden-cell-phone-speaker?click_key=e09c219412804fbe418b248cb14a7467fae4f937%3A513537299&click_sum=52d65cb0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-35&pro=1&etp=1&sts=1",
    "title": "BEAT BLOCK Wooden Cell Phone Speaker, Engraved Speaker, Unique Christmas Gift for Men, Groomsmen Gift, Wireless Speaker iPhone and Android",
    "description": "Meet our top selling Beat Block Wooden Cell Phone Speaker. No wires are needed to power this speaker. Just place your phone in the slot and let the hand carved wood amplify the sound of your favorite music and podcasts. There are no Bluetooth, batteries or annoying cords to worry about. It's even water resistant so you can enjoy at the pool! This unique wood speaker will be an amazing addition to your home décor. It's actually the best gift (in our opinion) for every occasion. Groomsmen and bridesmaids will love (and actually use) it! We also recommend it for Father's Day, Mother's Day, birthdays and Christmas.--------------------------PRODUCT DETAILS--------------------------- Available in light brown and dark brown finish.- Measures 4.4\" W x 3.39\" H x 3.31\" D.- Fits all iPhones and Android phones (certain bulkier cases may need to be removed for use).- Handcrafted from American Hardwood with a cherry stain. Handmade products feature naturally occurring variations in the wood such as knots, notches and swirls, so no two will look exactly alike. These characteristics contribute to make this a one-of-a-kind gift.- Speaker was previously sold under the MORPH name.- FREE SHIPPING on orders $35+- RUSH ORDERS available:https://etsy.me/2XbpDlk-----------------------PERSONALIZE IT!------------------------ We'll personalize the Beat Block by laser engraving the recipient's name, initials or the custom text of your choosing.- Select the location of your personalization from the dropdown. We can engrave on the front, top or both. If you select both, please indicate what wording goes where.- For a lower price, you can order this non-personalized (blank).- We also offer the ability to customize this speaker with a company logo or custom design: Shop our corporate gift coolers here:https://etsy.me/3tr7bsh-----------------------------------------TIMELINE AND RUSH ORDERS-----------------------------------------We engrave the wood speakers in the Kansas City area and they'll be ready to ship 2-4 business days after your order is placed. You'll be able to select your shipping speed at checkout.In a hurry? Our optional rush upgrade is $14.95 regardless of the size of your order. This service guarantees that your order ships by the end of the next business day, shaving 2-3 business days off of our production time. Read more and add to your cart here:https://etsy.me/2XbpDlk.",
    "reviews": [
      "Better than I expected, we use it a lot!",
      "Nice birthday gift! Works great for listening to music or podcasts without having to connect to a speaker",
      "This item is very well constructed and has met all my expectations. It matched the description. It arrived in a timely manner and was packaged very securely.",
      "Beautiful item and nice engraving. Fast shipping and great quality. Thanks so much"
    ]
  },
  {
    "productId": "bjblCVdvUg",
    "url": "https://www.etsy.com/listing/1576346868/no-words-just-hugs-candle-gift-box-for?click_key=7432aae1826b9fea9637c6462cc5668132c358b2%3A1576346868&click_sum=072848c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-36&etp=1",
    "title": "No words just hugs candle / Gift Box for Her Him / Sending you hugs in candle / Thinking of you gifts Gift for friend Get Well Soon Sympathy",
    "description": "The \"Hugs Candle\" Gift Box is a heartfelt expression of warmth and comfort, carefully curated for those special individuals in your life who could use an extra dose of love. With a focus on conveying empathy and support, this thoughtfully designed gift box offers a unique way to send solace and affection to friends, family, or acquaintances during challenging times.This set comes in a pretty package and includes mini matches in a cute jar.Enclosed within the elegantly crafted package is a specially crafted soy candle that embodies the essence of a warm embrace, designed to soothe and provide a sense of reassurance. The candle exudes a delicate yet calming aroma, filling the air with a subtle blend of comforting scents that evoke feelings of tenderness and understanding.While words may sometimes fall short in expressing emotions, the \"Hugs Candle\" Gift Box speaks volumes through its gentle presentation and the symbolic gesture of a candle, symbolising hope and light during dark moments. Whether it's to offer solace during times of grief, convey well wishes for a swift recovery, or simply to let someone know they are cherished, this gift serves as a token of heartfelt connection and support.With its understated elegance and profound sentiment, the \"Hugs Candle\" Gift Box transcends mere material offerings, encapsulating the profound essence of empathy, compassion, and solidarity. It is a reminder that, even in moments of sorrow or difficulty, the warmth of a virtual hug can provide a glimmer of comfort and strength, helping to illuminate the path toward healing and renewal.The candle's burn time is approximately 25 hours.We use:Natural, Vegan, Cruelty-Free, Non-Toxic Soy Wax100 % cotton wickAll jars have a slightly rustic look and can have slight marks on the glassware.OUR Fragrance List- Fig & Lotus- Strawberries & Cream- Candy Cane- Lavender- Pomegranate- Christmas Spice- Cedarwood & Jasmine- Amber and Sweet Orange- Cosy Winter Night- Pumpkin Spice- GingerbreadWarning: Never leave a burning candle unattended. Burn candles out of reach of children and pets. Always leave at least 10cm between burning candles. Do not burn a candle on or near anything that can catch fire. Only burn this candle on a level heat-resistant surface.Never burn this candle for more than 4 hours at a time. Do not allow the flame to touch the glass. Always burn for 3-4 hours on the first burn to ensure an even melt pool. Ensure the wick is upright, above the wax and central before the wax sets. Always trim the wick to 5mm before lighting to avoid smoking and damage to the glass. The glass may become hot during use. Extinguish when 5mm of wax is left and do not relight. Keep away from draughts.",
    "reviews": [
      "Love the scent of this candle. Will use it as a gift",
      "This was a gift and the recipient loved it.",
      "Thoughtful gift for a friend",
      "Beautiful candle and great service"
    ]
  },
  {
    "productId": "ZCxNtdPrSC",
    "url": "https://www.etsy.com/listing/753114313/watercolour-wedding-venue-sketch-hand?click_key=eab1da8c4b837aa14792e0e0eada509f88cfd5d9%3A753114313&click_sum=02665cd8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-37&pro=1&etp=1",
    "title": "Watercolour Wedding Venue Sketch Hand Drawn Personalised Gift Custom Building Illustration, Unique Christmas Xmas Presents for Couple Ideas",
    "description": "A stylish watercolour illustration of your wedding venue, hand-drawn by portrait artists in Devon and personalised with a message - a perfect gift for weddings.  The illustration is hand drawn, coloured and digitally printed.We provide a 'proof' for every order, this is included in the price.We can draw a variety of buildings including churches, castles, stately homes, hotels, beach wedding venues… the choice is yours.Timing:Each illustration is hand drawn by our in house artists so please allow up to 5 working days for the completion of you personalised illustration.Dimensions:Small- Mount size 25.5x25.5cm (10x10”), image size approx 15x15cm (6x6”)Extra Large- Mount size 38.8x38.8cm (approx 15x15”), image size approx 28x28cm (11x11”)How do I send my photo?Once you have placed the order, please send us a message with your name in the subject box and attach the reference image.What do you draw?We sketch from the perspective in the photograph and include some background such as sea, sky and landscape. We won’t include satellite dishes, dustbins, cars, etc - and you can let us know anything specific in your enquiry.The illustration is coloured and digitally printed.Please note with this product we do not draw people (for example bride & groom, families, couples, etc) who are pictured in the photograph, image or link that you supply.Can I check what you’ve drawn?Yes, we'll email a digital proof before dispatch. We will require approval before we send out the order. We offer up to 3 amends to your original drawing. For further changes there will be an additional charge.Want another style?See our other listings for house portraits, pencil sketches and detailed drawings. We also draw pets, people, sports stadiums, favourite places…Made from:Hand drawn and digitally printed to order on 200gsm acid free, fine grain artists paper. All prints supplied with a white, bevel-cut window mount.Framing:Our frames are all handmade in the UK from solid wood - choose from 3 styles (see image thumbnail for colours). Supplied with integrated hanging hook and Pilkington glass (Extra large frames are glazed with high grade UV perspex for glare reduction and safe shipping).",
    "reviews": [
      "Absolute perfection! Great responsiveness even when I had multiple special requests❤️",
      "I ordered this for my Brothers wedding and it came out beautifully they were quick to answer any questions and very quick delivery",
      "Really lovely and a great wedding gift. Pleased with the quality and the seller is fantastic. Delighted with the outcome."
    ]
  },
  {
    "productId": "oYPUqnyQkK",
    "url": "https://www.etsy.com/listing/208930046/barware-for-him-custom-gifts-for-dad?click_key=8adcfeb3ae3c172e7b5365e9d1aeba2b7eb11c85%3A208930046&click_sum=2c3b23a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-38&etp=1&sts=1",
    "title": "Barware For Him - Custom Gifts for Dad - Birthday Gift - Barware Set – Personalized Whiskey Decanter Set – Boyfriend Gift, Groomsmen Gifts",
    "description": "The perfect Barware Gift for Men!Birthday Gift for Men, Ideal for: Father's Day Gift - Gift for Dad, Groomsmen gift, Barware Set, Customized decanter, Fathers gift, whiskey decanter, Best mans gift, Unique mens gift, Custom decanter, personalized gift, glass decanter, groomsmen gifts, gifts for him, gifts for men.Boyfriend Gift, Personalized Whiskey Decanter Set. This engraved whiskey decanter set is the perfect men’s gift. Personalized with the name of your choice, this custom whiskey decanter and matching glasses will be displayed with pride for years to come.This personalized liquor decanter is topped with a square glass stopper. Unlike many lightweight glass decanters you’ll find, this guy has a heavy, solid base and weighs in at almost 3lbs. It will also hold 28oz (850ml) of his finest malted beverage. Each glass holds 250ml.Decanter Size: 8.5” x 3.5” x 3.5”Decanter Back Engraving: Can be up to 30 words**DURING CHECKOUT**Click the \"Choose: Engravings - Glasses - Wood/Card Box\" drop down menu to select If you would like a front engraving or a front and back message engraving, +2 glasses/+4 glasses/no matching glasses, and/or the upgraded wood display box.Please leave your entire personalization request in the \"Add Your Personalization\" box before adding to cart. Provide the name or initials (up to 12 letters), year, and if a front & back message option is selected, provide a message up to 180 characters including spaces. Please use the @ symbol in place of where you would like a heart icon engraved.Processing takes 3-6 business days. Shipping time takes additional 4 business days. Expedited shipping is available for delivery within 4-7 Business Days at an additional charge.Please contact us with any questions.Please Note:*Whiskey not included (we would if we could!)**For orders outside of the USA, it is down to the discretion of the customs agency in your territory whether customs will be charged on the import of this item. It's unusual, but can happen. Any fees incurred are the responsibility of the purchaser.",
    "reviews": [
      "Beautiful work! I’m so pleased with how it turned out.",
      "dad loves it! great personalization",
      "Great gift- he loved it"
    ]
  },
  {
    "productId": "FMCMPPtKXy",
    "url": "https://www.etsy.com/listing/973599286/easter-diy-easter-basket-stuffers?click_key=2404c666ac5d8248f9b3f0fb80982a779158488b%3A973599286&click_sum=db314b1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-39&etp=1",
    "title": "Easter DIY, Easter basket Stuffers, Personalized Paint Kit, Easter for Kids",
    "description": "This listing is for ONE personalized egg.These measure about 5” tall. These will come with a brush & paint. The paint is apple barrel acrylic paint. It is not washable.You can choose to upgrade shipping to priority, so your package will arrive to you sooner through USPS.",
    "reviews": [
      "Sooooo perfect for kids such a good idea",
      "As expected cute product pleased",
      "Items are really cute. Thank you"
    ]
  },
  {
    "productId": "gBVgqkczcC",
    "url": "https://www.etsy.com/listing/755226672/personalized-rustic-cheeseboard?click_key=4c61d4c2e2ecafacb92c033f020d3314db7bee9c%3A755226672&click_sum=32bf81bf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-40&etp=1&sts=1",
    "title": "Personalized Rustic Cheeseboard | Personalised Wedding | Birthday Gift | Anniversary Gifts | Gifts for Couples | Housewarming",
    "description": "Couples Olive Wood Cutting Board, Personalised Chopping Board, New Home, Wedding, Anniversary, Valentines Gift, Engraved Rustic Olive WoodA beautifully designed and unique Personalised Cheese Board, ideal for use as a chopping, cheese, cutting, serving or antipasti board, made from beautiful olive wood. The perfect personalised keepsake gift for any occasion, especially as a new home, wedding, valetines, anniversary or birthday gift.★Personalisation★Simply type your chosen Personalised text for both lines in the box above and follow the instructions.★Made from★Each Personalised Cutting Board has been carved from one piece of olive wood, which is a very beautiful and very hard wood. Every piece is completely unique with stunning grain patterns, colour and a rustic, organic bottom edge.★Ethically Sourced★We only use wood from very old olive trees that have come to the end of their natural fruiting life and have already been replaced with younger, more productive trees. These boards have been crafted by artisans to a very high standard.♥Another step forward for sustainability!♥By now choosing to not brand our gift boxes, we're encouraging recipients to engage in sustainable practices by reusing, repurposing, or regifting them. This approach reduces waste and promotes a more eco-friendly way of celebrating occasions. It also aligns with the growing awareness of environmental responsibility and encourages a circular approach to gift giving. Providing versatile and unbranded gift boxes gives them a longer lifespan and encourages creative thinking on how they can be used beyond their original purpose.★Care instructions★Hand wash with hot, light soapy water. Treat often with olive, coconut or any other food grade oil. A care guide is included with your personalized gift.Hand finished with an odorless and flavourless, organic hemp oil.★Sizes★4 sizes available. Please check the dimensions carefully before ordering.Shapes, colour and grain will vary slightly as each piece is unique.7.9\" x 5.5\" x 0.8\" (20cm x 14cm x 2cm) - Perfectly handy for chopping herbs, chilies, garlic, ginger, cheese, etc.11.8\" x 5.9\" x 0.8\" (30cm x 15cm x 2cm) - Great for serving cheese, chopping veg, and as above. (MAIN IMAGE)15.7\" x 6.3\" x 0.8\" (40cm x 17cm x 2cm) - As above again....but looks great as a serving and presentation board on the dining table.19.7\" x 7.9\" x 0.8\" (50cm x 20cm x 2cm) - As above, but large enough to serve as a Charcuterie board! GIFT BOX NOT AVAILABLE FOR THIS SIZE______________________________________________________________________More Personalized gifts and homeware can be found in our store.https://www.etsy.com/uk/shop/RusticFlitch.______________________________________________________________________",
    "reviews": [
      "Very impressed and they loved it x",
      "Fantastic service. The whole team very helpful and the gift arrived on time and the person was very happy with it. Thank you Mitch for your help. Keep up the good work 👍🏻",
      "LOVE THIS. Better than expected. The recipient of this gift loves it!"
    ]
  },
  {
    "productId": "XWsiKpvSNN",
    "url": "https://www.etsy.com/listing/1111382939/any-song-lyrics-personalised-print?click_key=c5b07f4d06e3fdbf5ee10bb343526222b3335bc7%3A1111382939&click_sum=d367517e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-41&frs=1&etp=1",
    "title": "Any Song Lyrics Personalised Print - Custom Vinyl Record Label, First Dance Gift For Mun Her Mam, Mummys day, Mother's day",
    "description": "Song words have such deeper meanings for people, and can be great memories to give as a gift at Christmas - reminding them of a wedding, birthday, event or even a person. That's why we have been creating vinyl record custom prints for over 7 years and are the original designer behind the 'vinyl record song print'.We've been working hard to bring you new designs and now have a contemporary '45 RPM' version to bring to you to capture the story of an event, a favourite song, a first dance, a song your parent sang to you as a child, a romantic track, a memorial song to celebrate their life and of course one that got everyone on the dance floor in your student days or brought the roof down at a concert!This brand new design for Christmas 2021 is made to look like an original vinyl record with groove and cut out details making it appear like it's actually a real record in a frame ... please note it is NOT a real record, you can't play it!The hardest thing is to choose your lyrics! We can offer our vinyl record design for any song words - words may be capped at around 300 which is sufficient for most songs.HOW DO I PERSONALISE MY ITEM?Our ‘solid vinyl record label’ print can be personalised in any way by adding things to make it special for your event. We ask you to let us know:•\tColour for label•\tArtist & SongThen for the label we need:•\tName/s (for top section)•\tDate (for released date, right of label under the 45)•\tOccasion or event (for top curved line ‘released under licence on XXX recordings)We can also add a longer message underneath the record in oh-so funky retro font to go with the vintage feelThe full text around the edge reads \"RELEASED UNDER LICENSE ON XXX RECORDINGS : PRINTED IN CELEBRATION :  ORIGINAL ARTWORK MANUFACTURED AND DESIGNED BY HARLEY DOGS DESIGNS\" this can be altered on request.Please see our examples and just add the personalisation as we ask for it during checkout and our designers will work their magicWe can also accommodate other requests if you have specific needs for the custom printCAN I HAVE MY ITEM SENT DIRECT?Of course! We offer a gift wrap upgradePlease note if you purchase the gift wrap option your note will be printed on a kraft gift tagNotes added to orders with no additional gift wrap are sent on plain paper.WHAT'S THE OCCASION?Our personalised song lyrics vinyl record is a romantic design making it great for a wedding, anniversary, Christmas or valentine's or of course a birthday for your husband or wife, brother, Dad or best friend.We have made 1000s of song lyrics prints for every occasion we can think of from births to bar-mitzvahs and you can rely on us to deliver stunning artwork for your event.WHAT HAPPENS NEXT?We are SUPER-FAST ... Once we receive all the details for your order we will send you a preview via Etsy in 1-2 working days to review.Once approved your item will be printed subject to any changes you may need.All our products are hand finished in our UK studio by our professional design team and will be printed and posted within 1-2 working days.MADE FROM240gsm brilliant white matt photopaper25x25cm frame standard deep edged with a perspex front32x32cm frame are standard deep edged with perspex frontsA4 Print is 21x30cm and DOES NOT come with a frameA2 Print is 42x59cm and DOES NOT come with a frameA1 Print is 59x84cm and DOES NOT come with a frameDIMENSIONS25x25x3.5cm framed OR 32x32x3.5cm framedCODEHDPRINT0040DISCLAIMERSome personalisation requests may mean we have to shuffle the design around a little but we will try to make it as close as possible to the example.All 'PRINT ONLY' options do not come with a frame ... hence 'PRINT ONLY'© Harley Dog Designs All Rights Reserved 2021",
    "reviews": [
      "My boyfriend loved cake exactly how I wanted it really impressed",
      "My husband love his Valentine's Day present and thought it was very unique, as did I.  Thank you for the originality of it and quickness in delivering it.",
      "Fast and sufficient \nCame exactly like the picture"
    ]
  },
  {
    "productId": "yMiPSzjSPV",
    "url": "https://www.etsy.com/listing/1376649262/personalized-easter-basket-tags-easter?click_key=a81773ac8b9ba17f88640fca68c787a5a02ba226%3A1376649262&click_sum=78a058d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-42&etp=1&sts=1",
    "title": "Personalized Easter Basket Tags, Easter Money Holder, Easter Gifts teens, Easter basket stuffers, Easter Bunny Money Holder, Easter Gift Tag",
    "description": "Personalized Easter Basket Tags, Easter Money Holder, Easter Gifts teens, Easter basket stuffers, Easter Bunny Money Holder, Easter Gift TagMake adding money to your kids' Easter basket a little more fun with this super cute easter bunny money holder tag. Featuring a cute bunny with an option to personalized with a name, these tags make a great gift on their own or fit into any Easter basket. These tag are also perfect for kids who have outgrown the tradition of having a basket, but you are looking for a fun way to still celebrate the holiday. Perfect Easter gift for teens, girls, boys, parents, and adult kids. The Easter bunny wooden handmade money holders will be the hit of your Easter activities.Bunny Money Holder with stand can be found the the link below:https://ritterohanawoodwork.etsy.com/listing/1654114555/easter-money-holder-easter-basketEaster tags are laser cut/engraved from maple wood. Due to the laser cut process there  may be a very slight smell of wood burning. This will go away with time.NON personalized Bunnies are 6.25\" tall and 3.75\" widePersonalized Bunnies are 6.5\" tall and 3.75\" wide.Money NOT includedDue to lighting, monitor, and mobile displays, colors may appear different the actual color. I do my best during the editing of the photos to match the true product coloringDue to the laser there may be a slight smell of burn, this will go away with time. With the natural wood there may be inconsistencies due to the nature of wood. I do my best of personally choosing the best pieces.I am the original designer of this specific design and all of my photos have my logo on them as authentication. You will finds many look a likes in your search. I appreciate you supporting the original owner.The photos found on my page are the property of Ritter Ohana Woodworking, LLC. No one has permission to use my photo for any reason.Please Note:I use USPS to ship all of my orders.  Shipping times vary  based on the shipping you choose at checkout.You may experience delays with the USPS. Once your package is dropped off it is out of my control on delivery times. Should anything happen to your package a claim will be made through USPS. Please reach out to me first so I can quickly help resolve the issue.Thank you for understanding!CONTACTFeel free to contact us with any questions via Etsy conversation.",
    "reviews": [
      "This is adorable! Even cuter than pictures.",
      "Could quite possibly be one of the best items I have purchased on Etsy--just beautiful and so well made!",
      "Omgoodness these are so cute. Can't wait to give them as Easter gifts.  Great quality and customer service. Would highly recommend this shop to others."
    ]
  },
  {
    "productId": "oXxDHNTqaw",
    "url": "https://www.etsy.com/listing/993500191/personalized-pacifier-clip-macrame-baby?click_key=cb97e7855203fee6f900e0a73bc94e96dfad629b%3A993500191&click_sum=a8309d6e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-43&etp=1&sts=1",
    "title": "Personalized Pacifier Clip, Macrame Baby, Heirloom, Baby Shower Gift, New Baby Gift, Unique Baby Gift, Baby Girl, Baby Boy, Baby Stocking",
    "description": "Our 100% Natural Cotton Macrame Pacifier clip is the perfect accessory for your little one. Measuring between 8.5-9.5 inches in length, this versatile clip can also be used to hold toys. The wooden clip is laser printed or engraved with your choice of wording and font, ensuring a personalized touch that will make this item even more special. Please remember to specify the exact wording and font style you desire when placing your order.Please keep in mind that, due to the handmade nature of our products, there may be slight variations in texture, size, and appearance. As such, each clip is a unique work of art, crafted with careful attention to detail.Please note that all of our items are made to order. If you require rush shipping, please contact us to discuss the possibility of expediting your order. We take great pride in creating each item to the highest possible standard and strive to deliver your order as quickly as possible.We also wish to remind our customers that our pacifier clips should be spot cleaned only, as exposure to water can cause the metal clip to rust and the wood to swell. Please dry promptly in sunlight after cleaning.Finally, we want to emphasize the importance of safety when using our products. Our pacifier clips are not toys and should never be used without supervision. They are not intended for chewing, and should be inspected before each use to ensure they are not damaged. Never use while your baby is unattended or sleeping. As the buyer, you assume all responsibility for the use of our products.",
    "reviews": [
      "So beautiful and great quality",
      "These paci clips are great quality & so cute! I’ve purchased several and am going to purchase more for gifts.",
      "Loveeee!!!"
    ]
  },
  {
    "productId": "gEsgKLqvys",
    "url": "https://www.etsy.com/listing/949349873/send-a-hug-candle-sorry-for-your-loss?click_key=f9f5bd79e4262249333472ec6f7d9a8081df5d42%3A949349873&click_sum=7246f695&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-44&pro=1&etp=1",
    "title": "Send a Hug Candle | Sorry For Your Loss Gift | Personalized Soy Candle | Condolence Gift | Sympathy Gift | Grief Gift | Mourning Gift",
    "description": "Hi, welcome to Hello You Candles!  Our Send A Hug Candles are made with 100% American grown, eco-friendly soy wax, and we only use clean burning fragrance and essential oils to scent our candles. Our candles are always free of dyes, harsh chemicals and pollutants and are hand poured in our shop in Laguna Hills, California.  A clean candle is a better candle, better for you and better for the environment.WHAT YOU WILL RECEIVE:1 - 4 oz, 9 oz or 16 oz soy candle in the design shown above, complete with your personal message printed on the back of the candle.PLEASE NOTE:  Due to very limited space on the 4 oz mini we we recommend keeping your message to 15-20 words.  Longer messages may need to be printed on a card rather than the back of the candle.CANDLE SCENT:  Please choose your scent choice from the drop down.  If you would like more information on our current scent options please click the link below to visit the \"Current Candle Scent\" section of our shop:https://etsy.me/3x3H5edSIZE GUIDE:~ 4 oz candle measures approximately 3 inches tall and 2 inches in diameter, 20 hour burn time~ 9 oz candle measures approximately 3.75 inches tall and 2.75 inches in diameter, 40 hour burn time~ 16 oz candle measures approximately 5 inches tall and 3 inches in diameter, 70 hour burn timeWe ship all candles via USPS 2-3 day priority mail. Please check our shop announcement for our current lead time.OTHER HELPFUL INFO:We do offer a discount on bulk orders, please contact me for details.",
    "reviews": [
      "Candle smells amazing.  Love the simple yet profound word hug.",
      "Super cute and know it meant a lot to those I gave it too.",
      "Beautiful smell! We chose “Spa Day.”"
    ]
  },
  {
    "productId": "JDXmlQfiYc",
    "url": "https://www.etsy.com/listing/928678700/personalized-gift-for-him-custom-beard?click_key=ba697dec3447c3ca4f265cc1f272c8e92e561f6f%3A928678700&click_sum=c5acb4a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-45&pro=1&frs=1&etp=1",
    "title": "Personalized Gift for Him, Custom beard comb, Beard care, Personalized gift for boyfriend, 5th Anniversary gifts for him, husband, Mens gift",
    "description": "🚀 Extremely fast groomsmen gifts shipping to the US! You will receive a personalized gift just in 4-5 business days! 🚀⚫The comb is created using high-quality wood for the tender care of your beard, mustaches, and hair!⚫Looking for gifts for men? Our groom gift is great for a 5th Wedding Anniversary, Birthday, Father's Day, Valentine's Day, or any special occasion.⚫Our beard comb is a great groomsman gift for the most demanding clients who value quality.⚫Simple and fun groomsmen proposal is a fantastic way to propose to your wedding party.⚫Handmade wooden comb is an amazing beard gift for your beloved – choose a top-notch gift for husband, father of groom gift or a gift for boyfriend.⚫Perfect for applying oils and balms for the best beard care possible.⚫Travel-friendly - It is highly portable because of its size. A folding beard comb fits perfectly in your jeans pocket or your wallet, so you can groom your beard anytime and anywhere.MATERIALNatural walnut wood⠀DIMENSIONS10 cm x 3,9 cm (3,9\"x 1,2\")TRAVEL COMBIt is highly portable because of its size. A folding beard comb fits perfectly in your jeans pocket or your wallet, so you can groom your beard anytime and anywhere.IMPORTANTThe color of the comb might be slightly lighter or darker than shown here as it is made of natural wood.PERSONALIZATION DETAILSThe backside of the comb can be engraved with text, name, logo or image. Please, indicate personalization requests in the Personalization Box during checkout.ORDER PREPARATIONThe time we need to prepare an order for delivery is 1-3 business days.For real man 😎Subscribe to our newsletter and stay updated on our special offers. Enjoy 20% discount on your next purchase.http://eepurl.com/h-r66n",
    "reviews": [
      "Matched description on Etsy !!",
      "Lightweight, beautiful, etching is as requested, thank you!",
      "Great quality and price.  Nice gift for my husband."
    ]
  },
  {
    "productId": "leWGnNkHUP",
    "url": "https://www.etsy.com/listing/1563358617/kids-winter-hat-with-personalized?click_key=d7cc0b0aa178e2ad5a9dcf2630932b2fb6bad259%3A1563358617&click_sum=1b38c4d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-46&pro=1&etp=1&sts=1",
    "title": "Kid's Winter Hat with Personalized Embroidery | Cozy Winter Hat for Babies and Toddlers | Gifts for Kids",
    "description": "Flowers and other patterns are value-added services and require an additional purchase of 'add a design'🧶 Wrap your little one in warmth and style with our Unisex Children’s Wonderfully Soft Chunky Knitted Beanie, complete with an adorable pom-pom detail! ✨ This beanie is not only wonderfully soft but also beautifully hand-embroidered with your choice of name or initial, making it an instant favorite for your precious child. 🌟🎨 There's no shortage of design options here, all of them super cute! You can choose to have a name elegantly embroidered around the brim of the beanie, opt for an initial on the front with charming blanket stitch detailing, or even add some exquisite crochet appliqué for a touch of flair! 🌈🌈 Select from a delightful range of beanie and yarn colors, and watch as I expertly embroider your choice across the brim. The possibilities are as diverse as your child's personality!📏 Designed to fit ages 1-5 years, this beanie is exceptionally stretchy and forgiving, ensuring a comfortable fit for your active little one. While it may not be the best fit for newborns, a few happy customers have reported that it worked perfectly for their newborns. 👶🌼 Each beanie is hand-stitched and meticulously customized according to your preferences, so please keep in mind that they do require some time to craft with care.⚠️ For the sake of maintaining its plush softness, remember to hand wash your beanie and lay it flat to dry. Avoid tumble drying to keep it as cozy as the day it arrived.Make your child's winter extra special with this personalized chunky knitted beanie! ❄️👦👧",
    "reviews": [
      "Bought for my little sister in law and it became the talk of the household. They all absolutely love it and it's her favorite hat now. Thank you!",
      "It’s sooo cute! I absolutely love it.",
      "Absolutely adorable, bought in yellow for my niece and it’s sooooooo cute."
    ]
  },
  {
    "productId": "zZ5sREfrCc",
    "url": "https://www.etsy.com/listing/290829369/unique-personalized-suncatcher-birthday?click_key=1f092ba4ccc6ce9f31691b8a386c6f23a6fb24b9%3A290829369&click_sum=57ef6461&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-47&frs=1&etp=1&sts=1",
    "title": "Unique Personalized Suncatcher - Birthday gift - Memorial gift - Teacher gift - Christening gift MEDIUM VERSION",
    "description": "When hung in a window, these beautiful suncatchers will catch the sunlight and create dazzling rainbows around your room.Ideal gift for birthdays, remembrance gifts, Christening gifts, Teacher gifts and much more. The suncatchers will brighten up any home, yoga studio, workspace, classroom...Choose your message and fill it in in the custom box above.All messages will be decorated with stars so please let me know if you would prefer yours without stars.If you would like to include an image or if you would like a specific design layout please contact me and I will see what I can do.Made in IrelandWe dispatch orders in 1-2 working days.These hand-crafted crystal window creations are made from a variety of Irish woods, namely Beech and Oak.Crystal Angel = 20mm(3/4 inch) diameter Asfour crystal body with 2 x 14mm Asfour Crystal octagons, 2 x 18mm Asfour Crystal octagons and 10mm(1/4 inch) Asfour crystal head with Preciosa crownCrystal Sphere = 30mm(1 1/4 inch) diameter Asfour crystalCrystal Sun = 40mm (1 1/2 inch) diameter Asfour crystalCrystal Swarovski Sun = 40mm (1 1/2 inch) diameter Swarovski crystal discWood Dimensions: Approx 130mm (5 inches) at its longest point.Hanging string length: approx 300mm (12 inches) - please let us know if you would like this longer or shorter for your particular requirements.This moon is our personalised medium size.For our large versions please view my other listing here:https://www.etsy.com/ie/listing/191502113/unique-personalized-gift-suncatcher-made?ref=shop_home_active_1&crt=1We also offer moons without personalisation. You can see our full list of all our suncatchers here:https://www.etsy.com/ie/shop/ArtwoodIreland?ref=seller-platform-mcnavThe above image is a sample. The characteristics of each piece of wood will vary slightly. We are very conscious of making sure that each and every piece is of equal natural beauty.- Each piece is finished with danish oil to what we believe is the perfect sheen.- It is hung with a high quality braided Dyneema fishing line which does not degrade in light like many other common threads. This line allows for exceptional free flowing spinning of the moon and the crystal within the moon.- Wood is sourced locally in the west of Ireland- They come carefully packaged in an environmentally responsible plastic-free gift box.- We will gladly include a gift note for you so that the recipient knows who sent their special gift. Printed on recycled Kraft paper. An option for your gift note will come up in the checkout process.Please note that these suncatchers are designed for indoor use and have not been tested outdoors.",
    "reviews": [
      "I absolutely love this! My long time friend is moving out of state, I bought this for her new home. It’s just perfect. It arrived in less then a week all. Thank you!!!",
      "Well, I can honestly say I was absolutely blown away when this box arrived! The craftsmanship, the quality, and the packaging were of unbelievable quality. I loved that there was a beautiful card included which gave information about the wood used and the item. Very fast delivery. If I could give more than 5 stars, I would. I will most definitely be ordering lots more for family and friends 🧡",
      "Very well wraped in a nice box, I don't want to take it out of the box because i want to offer it in the box so I've just seen slightly inside, it looks great and I'm looking forward to give it in 2 days..."
    ]
  },
  {
    "productId": "cVXqMLvDNr",
    "url": "https://www.etsy.com/listing/1325725302/personalize-baby-beanie-with-name-custom?click_key=bc806f6b167b62206a70839db23b6a0216b8f951%3A1325725302&click_sum=ad9a9099&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-161039-13-48&pro=1&etp=1&sts=1",
    "title": "Personalize Baby Beanie with Name | Custom Toddler Hat Kids Youth Child Infant Newborn Gift | Matching Christmas Baby Hat for Boys and Girls",
    "description": "The perfect gift, these personalized baby and toddler hats are sure to be a memorable keepsake. Names are laser engraved on a vegan leather patch for a high quality personal touch that will endure the length of infancy. These hats are available in 3 sizes, 6 hat colors, 4 patch colors, and 6 fonts.The three sizes are 0-3 months (newborn),  3-12 months (baby) and 1-10 years (toddler/little kid), with or without a personalized patch. When in doubt, size up. Although the medium size may fit until 12 months, I would recommend buying the larger size if your baby is 6 months or older already.  Use these for adorable baby photos and to keep your little one's head warm all winter long!Personalization is easy! Simply select the hat color and size from the drop-down options. Then provide the following in the personalization box:1. Patch color2. Font name3. Personalized text🚀SPEEDY SHIPPING!🚀 Orders ship Tuesday and Friday evenings, so if you place your order in the beginning of the week, you'll have it for the weekend for most locations in the US (Friday shipments typically arrive by Tuesday). Perfect for a last-minute personalized gift!All of our products are proudly made in the USA! Our shop is located in Akron, Ohio.Check out Lark and Lullaby's other listings for additional colors, styles and accessories @https://larkandlullaby.etsy.com.**These hats are hand wash cold only. The leather patch is adhesive and will be damaged if washed in a machine.Due to the handmade nature of our products, size positioning and placement may vary. Slight variations in color may occur due to monitor settings.Unfortunately due to the personalized nature of our products, Lark and Lullaby cannot offer returns or exchanges. If you need to cancel your order please do so within 1 hour of your purchase. If more time has elapsed please message us and we may still be able to cancel it if the item has not been personalized yet. Please see shop FAQs for details.",
    "reviews": [
      "Great buy for my son",
      "Its adorable. Just what I wanted!",
      "So cute and soft. The item shipped so fast and was exactly as I’d hoped."
    ]
  },
  {
    "productId": "JzZVvYOktw",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=97ed7fd3d4ea5cdbfb5b1d46579463459a7516a2%3A747068567&click_sum=7cf8e44a&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Would recommend this is a great gift",
      "I paid extra for this to be delivered by Christmas--and it came early :) Great responsiveness and its beautiful.",
      "The best! A great housewarming gift"
    ]
  },
  {
    "productId": "inePILUWYn",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=12969fc9755edcaf85ba3b0a91b8cd4b1340b9f0%3A1115114382&click_sum=48d5547e&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!",
      "They are going to love them"
    ]
  },
  {
    "productId": "uAVInJrvBY",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=a755960226fe4138b90df1169176ca83a9838587%3A654638870&click_sum=e8c2b763&ref=search_recently_viewed-3",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "UDcLmHaVNo",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=925b12da2c458d77961aa1c5d67761a78eef017f%3A1355783916&click_sum=87579b28&ref=search_recently_viewed-4&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "JcWTkygWtL",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=c6115d72881275afb87ffd5f3d5fbe0b06e06c43%3A1411614241&click_sum=c08ecf42&ref=search_recently_viewed-5&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "fCELAqXOAn",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=a494010719869c2bc030d9347b9713c8fa5d9df0%3A999136086&click_sum=7330b4c0&ref=search_recently_viewed-6",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you."
    ]
  }
]
