[
  {
    "productId": "BGEnCqXJmN",
    "url": "https://www.etsy.com/listing/1175126329/personalized-hammer-engraved-hammer?click_key=8412b8585ffa2d01121c2043c333cbcbf6e6ccd5%3A1175126329&click_sum=bd91f9dd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-1&pro=1&frs=1&sts=1",
    "title": "Personalized Hammer | Engraved Hammer | Custom Hammer | Personalized Hammer Gift | Gifts for Men | Husband Anniversary | Father's Day",
    "description": "Personalized Items are the best gift for any occassion. Our Engraved Custom Hammers are no exception to this rule.We can engrave the hammer with almost anything you'd like us to include on it(within the space and similar character counts as our samples)",
    "reviews": [
      "Second year in a row using this shop. Good items and quick shipping.",
      "Second year in a row using this shop. Good items and quick shipping.",
      "Second year in a row using this shop. Good items and quick shipping.",
      "Second year in a row using this shop. Good items and quick shipping."
    ]
  },
  {
    "productId": "DbpzmDfECI",
    "url": "https://www.etsy.com/listing/1486284362/personalized-round-board-with-2pc?click_key=47a8098984ec61aaf0e16b19a9798b77c63c7190%3A1486284362&click_sum=eac12e6e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-2&frs=1&sts=1",
    "title": "Personalized Round Board with 2pc Cutlery, Engagement Gift Bridal Shower Gift, Engraved Marble Cheese Board, Wedding Shower Gift for Couple",
    "description": "Personalized Name cheese board featuring a unique wood and marble design. Comes with a 2-piece cutlery set.  ❤ We are currently running a 40% for a limited time! ❤Featuring high-quality craftsmanship and perfect for entertaining, this stunning charcuterie board is a must-have for every one. Makes a perfect heartfelt gift for all occasions.Key Features:--------------------------BONUS 2-Piece Cutlery Set: Each cheese board comes with a matching 2-piece cutlery set, ensuring your mom has everything she needs to serve her guests in style.--------------------------Extra-Large Design: 12\" x 12\" - Our wood and marble cheese board is one of the largest on the market, offering plenty of space for an impressive spread of cheeses, charcuterie, and accompaniments.--------------------------Unique Brass Inlay: The brass inlay at the center of the board adds a modern and stylish touch, setting this cheese board apart from others.--------------------------Custom Engraving: Personalize the wooden part of the board with your choice of text engraving, creating a one-of-a-kind keepsake that your mom will cherish.--------------------------Exclusive Personalization: We're one of the few Etsy shops offering fiber laser engraving, which means we can also personalize the metal parts of the cutlery for an added touch of customization.If you have any questions, please message us. We thank you for supporting our small business! ❤",
    "reviews": [
      "I love the piece and customer service was fantastic, I will definitely be purchasing again!",
      "Beautiful product highly recommend product",
      "Thank you so much for your recommendation! We're thrilled that you find our product beautiful. Your support means a lot to us. Enjoy!",
      "Purchased as a wedding gift and it arrived timely and was beautiful",
      "Thank you for choosing us for such a special occasion! We're delighted to hear that the gift arrived on time and met your expectations. Wishing the happy couple a lifetime of love and joy!"
    ]
  },
  {
    "productId": "JfSsbJLauB",
    "url": "https://www.etsy.com/listing/1413455244/custom-name-necklace-18k-gold-plated?click_key=a7bd8f45979b1d5c701e5e518021f4b89b936952%3A1413455244&click_sum=54862474&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-3&pro=1&frs=1&pop=1&sts=1",
    "title": "Custom Name Necklace, 18K Gold Plated Name Necklace, Personalized Name Necklace, Birthday Gift for Her, Mother's Day Gift, Gift for Mom",
    "description": "Custom Name Necklace, 18K Gold Plated Name Necklace, Personalized Name Necklace, Birthday Gift for Her, Mothers Day Gift, Gift for Mom♡ Custom Jewelry will be the best gift on the special day for your love one, Personalized name jewelry is very popular nowadays. This is a stunning and special jewelry. Compared with others, it can bring back memories. More and more people choose it for gifting, This name necklace made from high quality brass, it is perfect gift for mom, sister, best friend, bridesmaid or yourself! . All jewelry from us are handmade with love ♡• Material:925 Sterling Silver; Brass• Finish Plated:Sterling Silver, 18K GoldH O W • T O • O R D E R-Select Necklace Color and chain length-Write name in the personalized box-Click \"Add to Cart\"-Check out-Complete orderP A C K I N G• All jewelry will come with a beautiful gift box for gifting, and if you want write a card to the recipient, please leave a gift message to us♡T U R N • A R O U N D • T I M E• All items are custom made to order. Our turn around time is about 4 - 8 business days. This can change during peak seasons. Delivery days is about 2-4 business days.-------------------------------------------------------------------Enjoy Your Shopping♡• All images are copyrighted by AnyaShopStudio. All rights reserved",
    "reviews": [
      "thank you.... the neclace is lovely.",
      "I love my necklace! I came quickly and looks great!!",
      "Beautiful would order 10x again",
      "It looks great, gonna give it as a gift"
    ]
  },
  {
    "productId": "CycnFRtWTj",
    "url": "https://www.etsy.com/listing/1470545721/name-puzzle-1st-christmas-gift?click_key=a626197d50a060e7cb162f346d2980931892070c%3A1470545721&click_sum=35a2248b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-4&pro=1&frs=1&bes=1&sts=1",
    "title": "Name Puzzle 1st Christmas Gift Personalized Busy Board Baby Gift First Birthday Baby Boy Girl Toddler Custom Wooden Puzzle",
    "description": "Looking for the best Baby Gift ?Personalized Wooden Busy Board with Name Puzzle is great gift for baby boy or baby girl First Birthday, 1st Christmas, Baby shower. Busy Board with Name Puzzle is great idea to turn the process of learning letters into a play! Sensory board improves fine motor skills, babies play with new objects, shapes, colors and studies them, it helps to develop logic, memory, finger grip and attention.👆Our Name Puzzle made from non-toxic high quality plywood, we carefully polish every detail, the pegs for letters and shapes are mounted very securely for the safety of your baby! (PEGS ARE INCLUDED IN THE PRICE)For painting we use safe Certified water based paint, the color can be chosen from the proposed options.📌Approximate Dimensions 📌*Length: 14.57 inches (37 cm)*Height:  9 inches (23 cm)📐The specified sizes refer to a puzzle up to 6-7 letters. The size of your puzzle will depend on the number of letters in your child's name. If the name has more than 6-7 letters, the size of the board will be increased.* The base of the board is 0.35 inches thin (9 mm) and each letter is 0.24 inches thin (6 mm) and  2.44 inches tall (62 mm).IF IN YOUR PUZZLE YOU HAVE LETTER ”I” - BE ATTENTIVE. THIS SHAPES CAN BE DANGEROUS FOR KIDS 0-3. DON’T LEAVE YOUR CHILD ALONE,  Instead - play with your kid and collect memories 😊",
    "reviews": [
      "Was a great gift to give!",
      "great product, I love it.",
      "Loved the puzzle and it was perfect.",
      "Exactly what I wanted. Quality is great and came quickly!"
    ]
  },
  {
    "productId": "UqkGuGkLjB",
    "url": "https://www.etsy.com/listing/601399076/personalized-weekender-bag-canvas-travel?click_key=c12594a70262d880b61ec08fb27f91c2f15d71af%3A601399076&click_sum=b2692d13&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-1&pro=1&etp=1&sts=1",
    "title": "Personalized Weekender Bag – Canvas Travel Bag – Groomsman Gift - Best Man Gift - Gifts for Him - Men's Luggage - Destination Wedding",
    "description": "Personalized Luggage Travel BagThis personalized canvas travel bag is a perfect way for your man to use his luggage. Designed for the ultimate space and comfort, it is the best and most stylish way for the men in your life to go on a weekend away.Highlights23.8” L x 8.7” (W) x 16.1” (H)16 oz canvas and faux leatherMagnetic Snap & Zipper ClosuresAdjustable shoulder strap for supportPERSONALIZATIONInitial(s) (up to 2 characters):*PLEASE NOTE: If you have selected Avante New for the font, I am only able to embroider a single initial.*Looking for a different style of bag? Here's a link to all the other options I have available:https://www.etsy.com/shop/GiftsForGuysCo?ref=seller-platform-mcnav&search_query=bagHave a question? Message me any time, I am always available to help answer any questions you might have.While you're here, don't forget to check out my store for more great guys gifts!https://www.etsy.com/shop/GiftsForGuysCo",
    "reviews": [
      "Gave as a gift & the recipient was eager to start using",
      "Excellent gift for my groomsmen.",
      "Excellent gift for my groomsmen.",
      "Excellent gift for my groomsmen."
    ]
  },
  {
    "productId": "XDXJyWCeRC",
    "url": "https://www.etsy.com/listing/572536849/wooden-name-puzzle-easter-gift-for-kids?click_key=53396fb511fc5b149b35e65e879091af698650fb%3A572536849&click_sum=05173c22&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-2&pro=1&frs=1&etp=1&sts=1",
    "title": "Wooden Name Puzzle, Easter Gift for Kids, Name Puzzles for Toddlers, Montessori, First Birthday, Baby Shower Gift, Custom Name Puzzle",
    "description": "Our personalized name puzzles make the perfect gift!A gift you love giving, our wooden name puzzles are a wonderful learning toy to give a toddler or baby for Easter, Birthdays, baby showers and as a new baby gift.  They are a fun \"just because I love you gift\" and a great way to encourage letter and name recognition.•\tFREE Shipping!•\tSuper cute gift shows you care•\tFun and educational•\tDisplay Stand available separately (see link below)Puzzles are a fun learning toy that encourage name recognition, spelling, and fine motor skills.  They are time tested and never go out of style.  Made of high quality baltic birch, our puzzles are 4.5\" tall and the length varies based on the length of the name.  The puzzles typically range from 10\" long, to a maximum length of 30\" based on the number of letters and shapes. The letters are approximately 3\" high, the perfect size to grab for your young learner.  All of the puzzle pieces are raised, making it easy to get them out and play with. We use non-toxic paint, eco-friendly ink, and a food grade non-toxic wood sealer that is child friendly.COLOR OPTIONS:  Please choose from below, or send us a message to customize with any available colorsShown on Color Options Page 1-1. Adventure:  Dark Green, Brown, Green, Spice, Dark Grey2. Mint & Navy:  Navy, Mint, Dark Grey, Light Grey3. Earthy:  Rust, Warm Sand, Peach, Spice4. Primary: Red, Orange, Yellow, Green, Sky Blue, Royal BlueShown on Color Options Page 2-5. Pink and Gold: Pink, Blush, Gold6. Coral & Mint: Coral, Mint, Blush7. Rose Dust: Rose Dust, Warm Sand, Peach8. Berry Fun: Bright Pink, Purple, Turquoise, MintThe exact colors used and order of the colors will vary from puzzle to puzzle.  The number of colors used varies based on the number of letters in a name.  Due to differences in monitors and devices, the colors may appear slightly different than shown on your screen.  If you have a specific request, please leave it in the Notes to Seller and we are happy to accommodate you if we can.  We are not able to include special characters like hyphens or apostrophes in our puzzles.  Our puzzles only include uppercase letters, without any special characters.FREE SHIPPING: We offer FREE 2 Day Shipping on most orders via UPS 2 Day Air.  In select locations that we are unable to ship UPS, such as PO Boxes, Hawaii, and Alaska, as well as rural locations without UPS delivery, we ship via USPS Priority Mail.RETURNS: We do not accept returns on customized items.  However, if you have any questions or concerns with your order, please don't hesitate to reach out.  Our number one goal is that you LOVE your order!  If we make a mistake, we will always make it right for you.CANCELLATIONS: We work hard to start work on your order as soon as possible!  Due to our quick processing time and the personalized nature of this product, we are currently unable to accept cancellations after the order is placed.  If you have any questions, feel free to reach out before placing your order. Thank you!",
    "reviews": [
      "I absolutely love this. The quality is amazing and the colors. Super fast shipping.",
      "Absolutely adorable. great quality and colors.",
      "The parents were so excited to receive this gift!"
    ]
  },
  {
    "productId": "weNwobKJhE",
    "url": "https://www.etsy.com/listing/1412668716/personalized-wood-bottle-openercustom?click_key=e43075918d5af61854411dd6490db78ef3c47499%3A1412668716&click_sum=8b03f994&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-3&pro=1&frs=1&etp=1",
    "title": "Personalized wood bottle opener,custom Engraved corkscrew opener,Wine corkscrew,Groomsman bottle openers,Unique Groomsman Gift,Gifts for Him",
    "description": "★Please note: For orders placed before January 1, 2024, the design default date is 2023, and for orders placed after January 1, 2024, the design default date is 2024.◆DESCRIPTION:Laser engraved wine corkscrew, laser engraved, will never fall off, the color of the engraving depends on the color of the corkscrew selected.This corkscrew is durable enough to last for years and is perfect for any occasion as a groomsmen gift, keepsake gift, etc., or as a gift for beer lovers.◆DETAIL:1) Dimensions: Length 5.5''2) Material: metal, wood3) Color: dark brown, light brown4) Process: laser engraving5)We engrave one side by default.◆HOW TO ORDER:1. Select your corkscrew color option.2. Choose your design style.3. Please enter the \"personalized content\" you want in the personalized box according to the design style you choose.For other great groomsmen and men's gifts, click here:https://www.etsy.com/uk/shop/QaliStudio?ref=seller-platform-mcnav",
    "reviews": [
      "The quality seems very good, the bottle opener has a little bit of weight to it which is nice. It came in designed as expected, & it turned out really great! The customer service was next level. Seller was extremely responsive and catered to my needs. Seller did everything in their power to make sure the item arrived on time, & it did!! Would definitely recommend this seller!",
      "Perfect my son love it",
      "Great quality, fast delivery, my groomsmen will love them"
    ]
  },
  {
    "productId": "GOXpBi2kiG",
    "url": "https://www.etsy.com/listing/649809633/personalized-notepad-with-name-and?click_key=758f74c8ab7da75f553ead956a6c8e7b3ff96aab%3A649809633&click_sum=88591b98&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-4&etp=1&sts=1",
    "title": "Personalized Notepad with Name and Initials / Small Notepad with Modern Design / Custom Personal Note Pad / Personalized Jotter Pad for Her",
    "description": "A modern, personalized notepad for everyday lists and thoughts. You choose the color and name, I'll take care of the rest!DETAILSA 48 sheet - 4.25” by 5.5” notepad printed on premium, heavyweight (70lb text) white paper and backed with thick chipboard.ORDERINGPlease include the following in the “Note to JubileeDesignStudio” at checkout:1. the initials and name you would like printed on the notepad (initials will be lowercase and name will be uppercase)Production will be completed within 5 business days. All notepads are packaged in a protective cello sleeve. A pdf proof is available upon request.Matching designs can be found below:Notecards:https://etsy.me/2y8AlgELetterhead:https://etsy.me/2PngoJjLarge Notepad:https://etsy.me/2KwQfdcAdditional notepad designs are available here:https://etsy.me/2Cx90bHIf you have a special request, please let me know. I would be happy to help! Additional information can be found in the shop policies. Thank you for shopping at Jubilee Design Studio!© Jubilee Design Studio",
    "reviews": [
      "Very considerate and thoughtful customer service. The print on the pad was lovely. This makes for a special gift, thank you!",
      "Just as advertised. It was great for business. Shipped on time.",
      "Design was exact to what I needed and the quality is beautiful. Highly recommend!",
      "Love this stationary - just ordered more.  Thank you!"
    ]
  },
  {
    "productId": "GnYVDUzGdk",
    "url": "https://www.etsy.com/listing/1389198325/custom-star-map-unique-romantic-gift-for?click_key=4d8df81ed2146058b252eeefe9a02aa612260ff5%3A1389198325&click_sum=6756b938&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-5&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Star Map - Unique Romantic Gift for Him or Her - Personalized Night Sky Print by Date - Perfect Valentine's Day or Anniversary Gift",
    "description": "A Personalized Star Map is the perfect way to mark special occasions in your life and the lives of your loved ones.🌟Our custom star maps are 100% accurate.We use unique planetarium-grade software with a catalog of over a million astronomic objects, to calculate and render the position of each star to produce the most stunning and accurate sky view. It is possible to create a star map for future dates as well.-------------------📦 FREE Shipping🌳 Sustainably sourced materials🏆 Premium FSC-certified museum-quality paper👀 You will receive a draft for approval🔁 Unlimited Revisions!✔️ Great quality and reasonable price-------------------★ HOW TO PERSONALIZE YOUR POSTER? ★Leave a note with your personalization info:1️⃣ Your Custom Quote:2️⃣ Style ( Pick from photo #5)3️⃣ Color ( Pick from photos #6 and #7)4️⃣ Font  ( Pick from photo #8)5️⃣ Date and LocationOrder Example:1️⃣ The day our journey began2️⃣ 3rd Style3️⃣ 2nd Color4️⃣ 3rd Font5️⃣ 17th July, 2020, London⚠️Within 12 hours you will receive a draft of your poster for approval. When you are happy with the final result, the poster will be shipped to your location.————————————————★ ★ ★ Custom Quote Ideas ★ ★ ★➟ Recipient name(s) \"Maria and John\" or \"Isabella Grace\"➟ A favorite quote➟ \"The Night We Met\"➟ \"Our Wedding Day\"➟ \"The Night We Became One\"➟ \"The Day We Said I Do\"➟ \"The Night We Made Our Vows\"➟ \"Forever Begins Here\"➟ \"The Stars Aligned\"————————————————IMPORTANT:Please be advised that the print and the frame will be delivered together, but not mounted to insure safer transportation. Mounting the poster is easy and straightforward. If you have any issues you can always get in touch with us at artmementos [!at] gmail.com📩 Feel free to send me a message if you have any questions or special requests.Thank you for supporting us and we hope you'll love our posters as much as we do!",
    "reviews": [
      "Great experience! We love it!",
      "Love it! turned out great",
      "Perfect anniversary gift for boyfriend!!!"
    ]
  },
  {
    "productId": "yicGItxDCm",
    "url": "https://www.etsy.com/listing/676679763/personalized-gift-framed-purple-metal?click_key=b2df6909def2e6d739f09c5e1de58b9549ba4ce0%3A676679763&click_sum=e9613a75&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-6&frs=1&etp=1&sts=1",
    "title": "Personalized Gift - Framed Purple Metal Rose for Iron 6th Anniversary",
    "description": "This stunning piece of wall art features an iron rose in a wooden frame that looks like it appeared straight from the pages of a fairytale!Meaning of purple roses: associated with enchantment and desire, a purple rose is a fitting gift to send a message of \"love at first sight\". Our purple rose will last well after the first blush of passion has worn off and will see you through to your \"happily ever after\".The frame can be personalized with an engraving and will make a romantic gift that will be around for years to come.Ideas include a gift for a wedding anniversary - especially a 5th year (wood) or 6th year (iron) - or order it to give on Valentine's Day or Mother's day.This unique piece will complement all styles of home decor. The rustic frame works well with a farmhouse and country style decor.I T E M ∙ S P E C I F I C A T I O N S• Natural pinewood frame with barnwood finish.• Frame measures 9\" x 14\".• No additional hardware required.• Can differ slightly from the pictures due to exposed knots, natural wood grains, etc.S H I P P I N GFor US and Canada: please allow 4 to 8 business days (processing + shipping) to receive your order.Faster shipping is available upon request. Please notify us before your order is placed so we can adjust the invoice for the additional cost.We can't guarantee a delivery date - even with expedited shipping - but we will do everything we can to get your item to you on time.For international orders: please allow 2-4 weeks for delivery. All customs and import fees are the responsibility of the buyer.",
    "reviews": [
      "I ordered this as a Valentine's Day gift for my wife.  She absolutely loved it! The flower is so beautiful.  Thanks for creating something so lovely.",
      "I loved it! My wife loved it! Very satisfied! Also smelled like fresh cut wood which was great 😂",
      "Looked great, just as described."
    ]
  },
  {
    "productId": "alabYRngqu",
    "url": "https://www.etsy.com/listing/1333480822/leather-toiletry-bag-groomsmen-gifts?click_key=d6f420a98347ef04ed529a3bc2c921232d9353f1%3A1333480822&click_sum=51433d48&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-7&pro=1&etp=1&sts=1",
    "title": "Leather toiletry bag, groomsmen gifts, anniversary gifts, dopp kit, valentines day gift, for men, personalized gift for him",
    "description": "✦We can guarantee a timely arrival if you send a message with the deadline prior to ordering this leather dopp kit, made to order and personalized.Our toiletry bag would be an awesome choice for your groomsmen gifts and excellent anniversary gifts option, as well as valentines day gift champion.Give it a try, even if it's a matter of a week.________________________________________________________________________________________________________________I would like to emphasize on this little moment:The personalization is hot stamped (that's an old school technique and it's hard to do, and it's not laser engraved). Stamped leather smells great, and doesn't have an unpleasant laser burned smell).It's a man against the machine thing, so it's really important.✦SizeStandard:8,5\"x4,5\"x3,5\"Large (I'd prefer to call it huge, but it sounds a bit rash for an official name)9,5\"x6,5\"x4,5\"✦LeatherI use distressed top grain cowhide leather, of the best quality. It's solid, but very soft.The distressed nature allows it to age beautifully, writing down the life story of it's owner.✦MakingYou are in the maker's shop. These bags are cut and sewn from the very scratch.You receive an object made with warmth and personal care, coming from a small studio, where people laugh, joke, and listen to the good music.✦PersonalizeIt is branded with a custom name/initials.Branding can be done on the outside and/or on the inside.While adding an item to the cart,Choose option \"1 stamp\" if you only want it personalized on the outside or on the inside.Choose option \"2 stamps\" if you want it personalized both on the outside and on the insidePlease provide information about names, letters, monogram style, stamp color(plain/gold), personalization strip color in \"note to the seller\", at the checkout.✦ShippingUS: around two weeks since the day of your order. Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.Canada: around three weeks since the day of your order.Europe: between two and three weeks since the day of your order.Australia: between three and five weeks since the day of your order.Rest of the world: between two and four weeks.Multiple items are shipped for the price of a single one - pay for shipping only once!",
    "reviews": [
      "made the perfect christmas gift!",
      "made the perfect christmas gift!",
      "I Love this item so much! It was a perfect gift for my wife!"
    ]
  },
  {
    "productId": "SjOxhCuUAU",
    "url": "https://www.etsy.com/listing/1332353627/personalized-notepad-personalized?click_key=2452810d0e4fa30865d3752ea0d16a6ca354c0ec%3A1332353627&click_sum=c929b59b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-8&etp=1",
    "title": "Personalized Notepad, Personalized Teacher Gift, Teacher Christmas Appreciation Gift, Personal Stationery, Style: Bold Pastel",
    "description": "Looking for a gift for a special teacher?  Look no further!  A personalized notepad with your beloved teacher's name will be a perfect, thoughtful gift!This notepad style (Bold Pastel) features teacher's name in a bold font in pastel colors.Notepad measures 4.25\" x 5.5\".Includes 50 pages, backed with chipboard.Your notepad will arrive ready for gift-giving!  Packaged in a clear cello bag, accented with ribbon or twine to match.To place your order:1.  Add the notepad to your cart.2.  In the \"Note to Seller\" section, include the personalization details EXACTLY as you'd like them to appear on the notepad.Colors can be changed upon request!  Don't hesitate to reach out for a custom order.A proof will not be sent, unless specifically asked for.Notepads will ship 3-5 business days after purchase.If you'd like to order 3 or more notepads, please use this listing for bulk pricing and combined shipping costs:https://www.etsy.com/listing/536568538/pink-apple-parties-notepads-bulk-pricing",
    "reviews": [
      "This is my second time ordering from this shop. Perfect product both times! Fast delivery, no issues at all.",
      "Quality was great and it met my expectations!",
      "This was the perfect teacher gift!",
      "Just perfect ! Exactly as ordered and quick !"
    ]
  },
  {
    "productId": "uudMJcMgcX",
    "url": "https://www.etsy.com/listing/1601404793/personalized-cigar-humidor-case-holder?click_key=e125f77fcd67f1ab881ed73e57db90a003779a2a%3A1601404793&click_sum=edcce76a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-5&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized CIGAR HUMIDOR CASE Holder Leather Cigars Custom Engraved Groomsmen Gifts for Him Dad Boyfriend Gift Men Father Groomsmen Golf",
    "description": "Personalized CIGAR HUMIDOR CASE Holder Leather Custom Engraved Groomsmen Gifts for Him Dad Boyfriend Gift for Men Man Groomsman Gift▬ 𝗔𝗕𝗢𝗨𝗧 𝗨𝗦 ▬PrecisionMemory aspires to create moments that last a lifetime with our personalized gifts for him & her.• Ships within 24 Hours.• Etsy Star Seller Support.• Designed in Los Angeles, California.• Express Shipping Available During Checkout!Please feel free to reach out to us with any questions.▬ 𝗣𝗥𝗢𝗗𝗨𝗖𝗧 𝗜𝗡𝗙𝗢𝗥𝗠𝗔𝗧𝗜𝗢𝗡 ▬The travel humidor is a firm, leather wrapped cylinder measuring 8 inches from top to bottom and 3 1/8 inches in diameter.The analog hygrometer measures 1.5 inches in diameter and is centered nicely.The outer pocket is closes with a zipper that of the same quality as mentioned above. The pocket will comfortably house a lighter, punch and/or cutters. It measures 3 1/8 inches across and 4 inches from top to bottom. The depth of the pocket is about 1 inch give or take an 1/4 because the pocket tapers and also is mounted to a cylinder. It's enough room to carry your basic cigar prep and lighting tools.▬ 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗭𝗔𝗧𝗜𝗢𝗡 𝗗𝗘𝗧𝗔𝗜𝗟𝗦 ▬Please provide your desired custom font/text in the personalization box. Multiple lines are welcome.• See listing gallery images for font options.• Listing images are examples of similar previous work.PERSONALIZATION EXAMPLE:Font: Bickham ScriptText: Michael",
    "reviews": [
      "Looks great love the engraving",
      "It’s perfect and exactly as I expected. My husband loved it.",
      "Very happy with my purchase! Great quality.",
      "Made for a great gift!"
    ]
  },
  {
    "productId": "ZkGOfBBELs",
    "url": "https://www.etsy.com/listing/583597337/personalized-ice-wine-beverage-tub?click_key=34fa3701a313984df5760d4c5306453395b264b6%3A583597337&click_sum=38fdad03&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-6&pro=1&frs=1",
    "title": "Personalized Ice / Wine Beverage Tub Wedding, Housewarming, Bridal Shower, Anniversary Gift - Insulated Stainless Steel Party Tub With Stand",
    "description": "*At checkout, choose with or without stand optionsMATERIAL:  Thick, double wall & insulated stainless steel crafted to be 100% leak-proof, rust-resistant, lead-free certified, and sweat-proof.KEEPS DRINKS COLD: Double wall construction & insulation keeps drinks colder, longer, while also guaranteeing absolutely zero leaking.SPECIFICATIONS: Size: 15\" x 15\" x 7\"H.  Weight:  6 lbs.  Capacity: 12qt / 3 gallon.HOME OR RESTAURANT USE:  A popular choice among those seeking home entertainment, wedding parties, catering companies, and anyone looking to impress their guests.Handcrafted with the highest quality, commonly used for home use and gifts:- Personalized gift- Wedding gift- Housewarming gift- Home parties and entertaining- DIY gift basket- Shower gift for new engagements- Gifts for the couple- Anniversary gifts- Bridal showerDECORATION:  Laser engraving compromises the exterior of party buckets, damaging the protective finish.  We use strong, permanent weather and waterproof vinyl as a safer and longer lasting alternative option.  It is built for indoors & out, with permanency and durability increasing with time rather than deteriorating.TIMING:  Many of our customers order our products as gifts, so we take timing and product quality seriously.  If you have any questions during the order process, we generally respond lightning fast.ORDERING:  Please submit this information in the notes to seller section at checkout:1) Vinyl decal text color (black, silver, gold, rose gold):2) Initials / Text3) Font - please choose ONE♥THE BIGGER PICTURE♥We donate a portion of our proceeds to the American Society for the Prevention of Cruelty of Animals, which gives dogs everywhere a fighting chance to live in a happy, healthy home.  Our goal is to provide customers unique, high-quality products at reasonable prices, while also advancing a cause that we care so deeply about.  We thank you for the support ♥\"",
    "reviews": [
      "Love it! All the wine for my family gatherings goes in there and it is beautiful on my counter!!",
      "It is beautiful and exactly what I was looking for.",
      "This arrived so fast! I was so impressed with the quality and service I received."
    ]
  },
  {
    "productId": "PGZZMYrePh",
    "url": "https://www.etsy.com/listing/1639811676/personalized-brother-of-the-bride-gift?click_key=c2264328b41be0139b250613e7f73849f84b90b7%3A1639811676&click_sum=1544dfaa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-7&pro=1&frs=1&sts=1",
    "title": "Personalized Brother of the bride gift, Custom Wedding Day Cufflinks, Engraved Gift Box Optional, Sweet Message for Bride Gift from Bride",
    "description": "Metal cufflinks with a diameter of 20 mm, square walnut gift box (1.8 × 1.8 × 1 inch).Add your personalizationPlease select the cufflinks and box and write the information you need to customize: for example- Cufflinks (A) J N- Box Engraving (Style 1) M Monica- You can also choose a different design for both cufflinks, for example - Cufflinks A+BI will send you a mock-up via Etsy Inbox - you can modify it until you are satisfiedThe design is customizable! If you would like to use your design, logo or handwriting, please send us your photo via Etsy message.EngravingPlease view photos for design options or send us your design via Etsy message.Box OptionsPlease select \"Blank Box\" for no customization, or \"Engraved Box\" for a personalized box.Product ordering process.1. Choose the style we give you or write your personalization (text, design style, font and special instructions) under the personalization box on the listing. You can also send your design (high resolution .jpeg or .png) via Etsy message. 2.2. After we get your personalization, we will send you a design mock-up that can be modified according to your requirements, and we will create it only after you confirm it.3. After the design mock-up is approved, we will produce and ship within 3-5 business days (except weekends).",
    "reviews": [
      "Excellent quality and the owner even sent a proof before customizing. 10/10 would order again.",
      "The item was quality, they had fast shipping",
      "The item was quality, they had fast shipping",
      "Quality is good. \nI put each pet on a link the engraved box really made it above and beyond. \n\nGet the box!!"
    ]
  },
  {
    "productId": "CDLdaBNnkU",
    "url": "https://www.etsy.com/listing/1161358788/personalized-gifts-for-him-groomsmen?click_key=35ea781a0972f8271abd80888b479098b04d7fac%3A1161358788&click_sum=d54de46f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-8&pro=1&frs=1&bes=1",
    "title": "Personalized Gifts for Him, Groomsmen Wallet, Engraved Leather Wallet for Men, Christmas Gift, Personalized Wallet, Custom Wallet for Men",
    "description": "Personalized Gifts for Him, Christmas Gifts, Engraved Leather Wallet for Men,Personalized Wallet, Handmade Custom Engraved Wallet for Men, Fathers Day Gifts** NEXT DAY FREE SHIPPING WITH USPS **I handcraft high-quality top-grain leather wallets. You can personalized with engraving on the front side with a monogram, name, logo. For inside you can add your message or your hand-written which making it very special for someone who will receive it.Functional and trendy, this Custom Leather Wallet is the perfect place to hold your most important cards.  Designed with the person who’s on the go in mind, this leather wallet features an array of conveniences. Not only is it easy to get your cards out of, it also can be customized with your monogram.Great as a gift, this credit card wallet is something that your loved ones will appreciate as a trendy and functional holiday gift.  Gift this amazing leather wallet to someone that you know that loves to shop!* FEATURES *- %100 Genuine Leather- Hand stitching- 12 Card Slots, 1 ID Flip-Up with Transparent Slot, 1 Cash Room and 2 Hidden Card Places.- 3 1/2\" by 4 1/2\" FoldedPersonalized Wallet, Engraved Wallet, Leather Wallet, Gift for him, Handwriting Wallet, Leather wallet for Men, Mens Wallet",
    "reviews": [
      "Was quick in getting me the product and did great with transferring my daughter's handwriting to the wallet.",
      "Great quality and speed of shipping. Very affordable would definitely order again.",
      "GREAT SELLER! Great quality! Fast shipping. My man loves his gift. I recommend seller 💖",
      "Great wallet good quality I recommend"
    ]
  },
  {
    "productId": "AMNltQkLrP",
    "url": "https://www.etsy.com/listing/1466616250/fathers-day-gift-dad-gift-gift-for-daddy?click_key=1196253db58d566ef1ad4fb2f197d9d76f9a2566%3A1466616250&click_sum=11dab773&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-9&etp=1&sts=1",
    "title": "Fathers Day Gift, Dad Gift, Gift for Daddy, Daddy Birthday Gift, Gift for Men, Daddy Keyring, Present Daddy Dada Father, Personalised Gift",
    "description": "Fathers Day Gift, Dad Gift, Gift for Daddy, Daddy Birthday Gift, Gift for Men, Daddy Keyring, Present Daddy Dada Father, Personalised GiftFor the Dad that loves a fist bump! The perfect gift for fathers day, birthdays or even Christmas!Please choose how many little fists you would like. We can accommodate up to 6 fists on the keyring. For keyrings with 5 or 6 fists the design changes slightly so that we can fit enough names on, please see the listing photos.If you would like this design with a dog paw included please use the link below:https://www.etsy.com/uk/listing/1604303398/fist-bump-with-paw-gift-for-daddyStainless Steel engraved 30mm disc available in silver or rose gold plated stainless steel.To view more our items, click here:https://www.etsy.com/uk/shop/TrashedGifts# INFORMATION #- UK ORDERS - 1st Class Postage- INTERNATIONAL ORDERS - Standard Postage- All orders are handmade to orderINTERNATIONAL ORDERS:All orders will be sent out via Standard International Mail. You will not be able to track your order.",
    "reviews": [
      "Cute little keyring brought as a secret Santa present. Perfect and really well received. Would definitely recommend.",
      "Love it! My partner was thrilled",
      "Just as described, my partner loves it",
      "Lovely gift for my partner would recommend"
    ]
  },
  {
    "productId": "rIDKqZcuAZ",
    "url": "https://www.etsy.com/listing/1524950143/personalized-square-jewelry-box-travel?click_key=c44cef9db0e30d96ea8a4162be7a757309cb95e0%3A1524950143&click_sum=337ab1af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-10&pro=1&etp=1&sts=1",
    "title": "Personalized square jewelry box, travel jewelry case, jewelry organizer bridesmaid gift for sister, friend",
    "description": "if there is no color selection, the default printed color is:Black Jewelry Box will be printed into the Silver color.White Jewelry Box will be printed into the Black color.Pink Jewelry Box will be printed into the Rose Gold color.Light Pink Jewelry Box will be printed into the Rose Gold color.Teal Jewelry Box will be printed into the Black color.💞If you are looking for a thoughtful, exquisite, and customizable gift for your bridesmaid, then this jewelry box is the perfect choice. This mini jewelry box is printed with her name in black font and is designed to store multiple rings, earrings, delicate bracelets or necklaces, making it ideal for wedding parties, bachelorette parties, beach parties, and vacations.💞FEATURES:1. Made of high-quality PU leather.2. The velvet lining prevents your jewelry from scratching.3. Dimensions: 3.93\"\" × 3.93\"\" × 1.96\"\"👉HOW TO ORDER?1. Choose the color of the jewelry box in the drop-down menu.2. Select the font design in the drop-down menu.3. Enter custom text in the personalization area, with a maximum character count (including spaces) of 10.",
    "reviews": [
      "So very cute! These will make amazing gifts for my bridesmaids.",
      "I can’t wait to give this to my daughter, (with a new pair of earrings made by me), for Valentines Day ♥️",
      "These jewellery boxes are perfect! I ordered 3 and sadly one came damaged, however the customer service was fantastic and they sent me out a replacement within days. Would definitely recommend."
    ]
  },
  {
    "productId": "CmoUOSqknB",
    "url": "https://www.etsy.com/listing/1404131406/personalized-jewelry-dish-custom-trinket?click_key=1d521aaa51f49b5a009cb610e844d62f2698aea6%3A1404131406&click_sum=86c62ec9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-11&pro=1&etp=1",
    "title": "Personalized Jewelry Dish, Custom Trinket Holder, Personalized Bridesmaid Gifts, Ring Dish, Porcelain Ring Tray, Bridesmaid Proposal Gift",
    "description": "Free Shipping on Orders of $35+*Font with swoosh is lowercase only*Ordering Steps:1. Select vinyl font color2. Write names/text that you wish to be displayed3. Select quantityEach personalized porcelain ring dish is approximately 3.5 x 3.5 x .75 inchesPlease contact within 14 days of receiving the items if there is an issue with your order.Custom Jewelry Holder, Personalized Bridesmaid Gifts",
    "reviews": [
      "bought these for a senior night locker gift! great quality! was worried how protectively they would be shipped but they were packaged with care!",
      "Super cute dish for my loose jewelry! I love it! And I appreciate the fast shipping :-) Thank you!",
      "Very elegant dish, perfect gift"
    ]
  },
  {
    "productId": "fouHaDs6BV",
    "url": "https://www.etsy.com/listing/1584770975/hand-embroidered-linen-crown-for-kids?click_key=b397ab7ab3357981655b3a87bdf9a662b298124c%3A1584770975&click_sum=e50c84af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Hand Embroidered Linen Crown for Kids and Children's Birthdays, Personalized Gifts | Keepsake for First Birthday Party and Special Occasions",
    "description": "Add a sprinkle of fairy-tale magic to your baby's milestones with our heartwarming, handcrafted birthday crown! Stitched from the coziest, baby-soft linen, it's crafted with love and designed to bring warmth, comfort, and joy as your little one grows.From their very first giggle to their first steps and beyond, this crown promises to be a cherished companion on their incredible journey. Brighten up photo sessions, name announcements, or simply a day of play with this crown's intricate hand-embroidery.We take pride in every single delicate stitch and each stitch tells a story of tradition, craft, and pure love, making every occasion extra memorable. Our crowns are made from 100% high quality natural fiber linen, which is considered the most sustainable (cloth) materials and environmentally friendly. Sized at a comfy 3.75 x 14.8 inches with darling linen straps, it's easy-peasy to tie and adjust to fit your little one's head, at any size, which ensures your baby feels like the prince or princess they truly are.What's more? This isn't just a crown, it's a soon-to-be treasured family heirloom. Imagine the joy in years to come when this very crown graces the heads of future generations, weaving stories of love, laughter, and family bonds. As they say, the best gifts are not just things, but memories we create and this crown is ready to make plenty! So, whether you're on the hunt for the most heartfelt gift for your best friend's baby shower, or want that extra sprinkle of enchantment for your own little star's big day, our luminous, handcrafted crown is a beacon of love, tradition, and joy.★ Safety notice:-Crowns should be worn under supervision only. Do not leave baby unattended, sleeping or awake, with their crowns★ Care instructions:-Lint roller can be used for removal of dust, fine debris like bread-Stains can be wiped with cotton swabs, sponge-Washing: Due to the nature of being hand-made, the crown should only be washed when necessary to keep its original shape for a long time. Remember to dry-wash only and the crown should be washed separately (only itself, not with other clothes). Though the chance is very small, if wet-washed, the pompoms can still leak/bleed a tiny bit. In that rare case, please kindly contact me so that I can assist you and guarantee your highest satisfaction.-No squeezing, please! Wet crowns can be blotted with a towel, then laid flat to dry-Keep away from direct strong heat sources",
    "reviews": [
      "Item as beautiful as in photos. Great quality and hand crafted beautifully. Arrived on time and packaged nicely. Would highly recommend",
      "Great quality product and fast delivery. Perfect for my little ones birthday.",
      "The most magical crown for our little boy! So so beautiful that photos just don’t do it justice! And Connie is fabulous and such amaizng communications! Would definitely recommend! Such a keepsake and so many nice memories to come in it! Thank you!",
      "I got this for my son’s first birthday and it came out perfect! The quality is amazing and I can’t wait for him to wear it next week. It also shipped super quick!"
    ]
  },
  {
    "productId": "pAQl6TT0IF",
    "url": "https://www.etsy.com/listing/1366341628/whiskey-sticks?click_key=8bd904f9a0da9046e7601abf5e188c69363f10cd%3A1366341628&click_sum=3749d3a6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-13&frs=1&etp=1&sts=1",
    "title": "Whiskey Sticks",
    "description": "Whiskey SticksBetter Whiskey in 24-36 hours6 sticks100% Natural Aged White OakUse to improve flavor, remove toxins, accelerate agingSimply add 2 Whiskey Sticks to 750ml of the whiskey of your choice.Wait 24-36 hours.For a smoother, richer flavor, wait 72 hours.Pour yourself a glass, sit back, relax and enjoy!",
    "reviews": [
      "Really works! Bought these as a stocking stuffer gift for my husband last Christmas. He grew up on Wild Turkey and tried the sticks in a decanter if that. He loved it so much, he took it to his \"men's club\" gathering of the boys and let them try it. One of them liked it so much he begged for 2 sticks. I came back the next day and placed an order for 2 more packs. Owners are super nice and a pleasure to do business with!",
      "Exactly what I wanted. Fast shipping.",
      "These sellers are the absolute kindest people I have ever  come across all these years while buying on Etsy. I  Will tell all my friends.  Thank you most kindly for the sweet gift."
    ]
  },
  {
    "productId": "vGWXMcntaC",
    "url": "https://www.etsy.com/listing/1433433263/bronze-heart-for-8th-anniversarywedding?click_key=c19f8e68c8ccc78515ba473ccf98516583e8204f%3A1433433263&click_sum=7c529fcb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-14&frs=1&etp=1&sts=1",
    "title": "Bronze Heart for 8th Anniversary,Wedding Anniversary Gift,Personalized 8th Anniversary Gift,Two Steel Hearts,8th Anniversary Gift for Wife",
    "description": "Celebrate your 8th wedding anniversary by making a sincere tribute to your love. Our \"Connected Hearts\" sculpture is made of solid iron and covered with a bronze patina. Personalize it with your names, wedding date, or a special message to celebrate this important occasion together.This unique bronze anniversary gift is carefully packaged in a beautiful gift box, making it a thoughtful and meaningful gift for your spouse or for another special couple in your life. Once unwrapped, it will become a wonderful home decor to remind you of the love and commitment that brought you together and continues to grow stronger every year.No matter where it is placed - on a mantelpiece, bookshelf or bedside table - our Connecting Hearts sculpture will be a wonderful reminder of the special bond between two people. Cherish your love story with this elegant and timeless piece that will bring warmth and joy to your home for years to come.Overall dimensions13.5 cm х 10.5 cm х 9 cmAll our products are made to order with special attention in our workshop. These are absolutely unique handmade products.",
    "reviews": [
      "Came very quick and is really nicely built thank you",
      "Thank you Andrew!  It’s perfect!",
      "My wife loves it very happy"
    ]
  },
  {
    "productId": "NpBXGKZaKk",
    "url": "https://www.etsy.com/listing/821925442/personalised-wax-melt-valentine-gift-for?click_key=50588c1d08c0a25a597df727a63c98b8242e1535%3A821925442&click_sum=627d116b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-15&etp=1",
    "title": "Personalised Wax Melt, Valentine Gift For Her, Mothers Day Present, Birthday Gift For, Christmas Gift For Friend, Stocking Fillers For Women",
    "description": "A personalised gift makes it all the more meaningful. Our custom wax melts can include names, initials or why not send that special someone a personal message such as ‘love you’? And let’s not forget mum - a thoughtful set of wax melts with your preferred choice of scent and colours.Instructions: Select 'scent', and 'number of letters' required for your word/phrase/sentence. If its not included in the drop down box please message me. Ensure you complete instructions required in personalisation box. Please answer all questions in the same box -EG. -1. Sarah2. Pink, blue & red (UP TO 3 COLOURS)3. With Flowers.PLEASE NOTE: REQUESTED COLOURS ARE SUBJECT TO AVAILABILITY AND MAY IN SOME CASES DEFER FROM CHOSEN OPTION. YOU CAN CHOOSE ANY COLOUR APART FROM SILVER & ROSE GOLD.",
    "reviews": [
      "Absolutely perfect, my mum loves it!",
      "So cute! The colours are lovely and the scent is great!!",
      "Arrived on time and packaged really well, very happy with this purchase"
    ]
  },
  {
    "productId": "AznCymdUUV",
    "url": "https://www.etsy.com/listing/1438733237/custom-leather-belt-custom-engraved-mens?click_key=f3b67d0bf0ed3d9d1fb45c2b9e6f45b018e426d0%3A1438733237&click_sum=7059b914&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-16&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Valentines Gift for Him, Boyfriend Valentines Gift Ideas",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift IdeasThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift Ideas",
    "reviews": [
      "Be mindful of sizing.  I ordered based on jeans waist size and it was too small for the recipient. While we're stuck with that one, the seller offered to make a new one for only $15. Hope seller adds measurement details to their listing.\nGreat belt!",
      "This was an anniversary present that looks amazing.",
      "My boyfriend loves it! It is great quality and durable. The perfect gift!"
    ]
  },
  {
    "productId": "NIgaZffWdX",
    "url": "https://www.etsy.com/listing/1646063878/embroidered-in-my-era-custom-comfort?click_key=7f5147a63a01ebe6023b21efb392e63f6af9f427%3A1646063878&click_sum=a7617dce&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-9&pro=1&sts=1",
    "title": "Embroidered In my era Custom Comfort Colors® Sweatshirt, Custom Auntie Sweatshirt with Kids Names, Personalized Gift for Auntie",
    "description": "💖💖💖 CUSTOM EMBROIDERED SWEATSHIRT PERSONALIZED AUNTIE CREWNECK WITH KID'S NAMES THE PERFECT GIFT🎁 Looking to add a touch of nostalgia to your aunt's wardrobe?🎁 Want to surprise your aunt with a unique and customized gift that celebrates her role as an aunt?🎁 Searching for a special and sentimental gift that showcases the bond between your aunt and her kids?💕 Our Embroidered Sweatshirt with a Personalized Aunt Crewneck featuring the names of her kids would make a truly unique and thoughtful birthday gift for a special aunt.[COLOR AVAILABLE]✅ Comfort Colors: Blue Jean, Blue Spruce, Butter, Chalky Mint, Chambray, Crimson, Denim, Flo Blue, Grey, Light Green, Orchid, Pepper, Seafoam, Terracota, WhiteSTORE INFORMATION▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ 848 San Isabel St, Hartsel, CO 80449, USA✅ Design proof (for customized products or if you request): 1- 2 business days (Outline and text embroidered products) | 2 - 3 days (for fully embroidered products)➤ Manufacturing & shipping address: 848 San Isabel St, Hartsel, CO 80449, USA➤ Package arrives in 3-5 days (After design proof + embroidery for customized products)[COLOR AVAILABLE]✅ Comfort Colors: Blue Jean, Blue Spruce, Butter, Chalky Mint, Chambray, Crimson, Denim, Flo Blue, Grey, Light Green, Orchid, Pepper, Seafoam, Terracotta, WhiteORDER GUIDE:▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤Step 1: Click and select on the list to see more details about the product, including size, color, and any possible customization options.[COLOR AVAILABLE]✅ Comfort Colors: Blue Jean, Blue Spruce, Butter, Chalky Mint, Chambray, Crimson, Denim, Flo Blue, Grey, Light Green, Orchid, Pepper, Seafoam, Terracotta, White➤Step 2: Review your cart to make sure you have selected the correct item and quantity, then click the \"Proceed to Checkout\" button.➤Step 3: Enter the shipping address information and fill out the personalization box.➤Step 4: Click the \"Place Order\" button to complete your purchase.(Add twice to cart for two couples product)➤Step 5 : Check your message box on Etsy within 1-3 days if it is a custom product to receive design proof.The order will be produced and sent after all your questions have been processed (e.g., design edits, photo replacements, customizations, text edits, etc.).PERSONALIZED GUIDE:▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔Custom sweatshirts, hoodies, and tees will usually have four embroidery positions:➤On the chest: Left chest (above the heart), right chest, middle chest.➤On the sleeve: Left sleeve or right sleeve (you can customize both, one side is free).➤On the back of the shirt: In the middle.➤In the hood for hoodies.If you want to embroider any of these positions, please place an order and let us know in the Personalized box or via an Etsy message.Embroidery thread color and embroidery icon: You can flexibly choose the color of the embroidery thread or embroidery icon. If a specific color or icon is not available, you can send it to us via a message.NOTES WHEN PURCHASING▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔✅ Check your message within 1-2 days after ordering to receive design proof for personalized products✅ The big discount will end soon, get your offer early.✅ Custom products need to send clear, sharp images or according to image instructions.✅ You can change the embroidery thread color of each embroidery position, text or icon- You can also request different embroidery positions (Ex: hood on hoodie, back sweatshirt, both sleeve) for more embroidery positions there will be a nominal fee, please message us.- Order Cancellations are accepted for 12 hours after your purchase.PRODUCT AND BRAND DETAILS▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ Comfort Colors® brand➤ Unisex & Classic fit➤9.5 oz./yd², 80/20 ring-spun cotton/polyester, 30 singlesGarment dyed for that lived in feel and almost no shrinkage at home.3-end cotton face fleece made with 100% cotton threadsRelaxed fit1x1 rib collar, cuffs and waistbandRolled forward shoulderBack neck patch for easy customizationBack neck twill tapeSide seamsSignature twill labelMade With Respect Proud member of the U.S. Cotton Trust ProtocolMade with OEKO-TEX certified low-impact dyesOur clean pigment dye colors are salt freeORDER SUPPORT▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ In case of any change after purchase, feel free to messenger us at Etsy seller through the \"Meet your sellers\" message, we will update it for you if the shirt did not embroider yet.➤ Some frequently asked questions will help you during and after the ordering process.➤ Messages are free. We are always ready to answer your questions.➤ For return orders:Only receive wrong embroidery, embroidery error, wrong size due to our store.- Just need the embroidery order missing some parts, wrong shirt design (10% -50%)When the design is done but you still want to cancel (70% refund)- In case you provide the wrong shipping address: We will charge a shipping fee of 30% of the order value or the shipping fee for the order (the value of the label we buy)- The order has a design but want to change it: please help me pay an additional $10 for the new design.Because all designs have a fee to buy.- For embroidery on the sleeve: I only embroider one sleeve, if you want to embroider both sides, please pay me $10.- Design implementation time: 1-3 daysLet us know when you'd like to wear an oversized piece so we can design it for you.THANK YOU FOR YOUR ORDER! 💕",
    "reviews": [
      "I love my sweat shirt! I get cold a lot so it’s nice and cozy. It made out of a very durable fabric although there is like no stretch so I definitely recommend a size up if you need a looser fit.",
      "I love it, very warm and cozy.",
      "Customer service was amazing!!! They helped to make the sweatshirt perfect, even when there was a mix up everything was fixed and in order in a timely manner. Sweatshirt came out exactly how I wanted it."
    ]
  },
  {
    "productId": "AagqFXNdex",
    "url": "https://www.etsy.com/listing/1663942846/personalized-bunny-money-holder-easter?click_key=c149e4840087cca0b4dcdace2ff62bfc3520cf03%3A1663942846&click_sum=10926fc7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-10&pro=1&bes=1",
    "title": "Personalized Bunny Money Holder, Easter Basket Stuffer,Easter Gift,Personalized Gift,Easter Money,Unique Easter Gift,Easter Gift Tag",
    "description": "Hop into the joy of giving with our Bunny Money Holder!This adorable, handmade creation is the perfect way to present cash!Crafted with love, it adds a playful touch to any occasion.Compact and charming, make your gifts memorable with this whimsical bunny design.********This listing is for a 1/4\" laser cut easter tag with laser engraved name or initials********Size: 4x6 inchesStyle: 1/4\" Birch Wood, Laser EngravedEach tag comes tied with black suede leather lace string!This product is handmade and made to order.Due to use of natural wood each order will slightly differ.**All sales are final**",
    "reviews": [
      "Sooo cute - very happy with this purchase! The seller was very responsive to my questions and shipping was fast!",
      "This is absolutely adorable! And the seller is very responsive and sweet! So glad I purchased!",
      "Great item will buy again",
      "Great item will buy again"
    ]
  },
  {
    "productId": "xNVlnpeAWl",
    "url": "https://www.etsy.com/listing/1586079915/mama-embroidered-keepsake-sweatshirt?click_key=eca397d8ec359313b3dcd5ce366dbf78e7d148e4%3A1586079915&click_sum=825a33dd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-11&pro=1&sts=1",
    "title": "Mama Embroidered Keepsake Sweatshirt With Baby Outfit Applique| Personalized Sweatshirt | Mothers Day Gift Birthday Gift",
    "description": "A new and fun way to celebrate being a Nana/Mama/Gigi or anything else! Send us a garment and we will turn it into a wonderful work of art you can wear!Common items include baby pajamas, shirts, pants, just about any piece of clothing works! Please message us if you aren't sure and we can figure out a solution together!We can do just about any word, please let us know in the personalization box which word you want!Add On Listing to add a name on the cuff.https://www.etsy.com/listing/1322155869/name-on-sleeve-add-onNeed your purchase gift wrapped with an elegant box with a big bow and gift message engraved in the box?https://www.etsy.com/listing/1455178773/gift-wrapping",
    "reviews": [
      "Turned out exactly as pictured!",
      "Fantastic speed, great quality and a perfect gift for my wife to celebrate our 2nd year as parents.",
      "The stitching is great and very high quality. They were able to make my order exactly how I wanted."
    ]
  },
  {
    "productId": "PXEbAj9mzh",
    "url": "https://www.etsy.com/listing/1265025474/anniversary-gift-for-him-personalized?click_key=3e22f7dddd80c93e04fbaa9843e8673b4e3382a7%3A1265025474&click_sum=a0e62b98&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-12&pro=1&sts=1",
    "title": "Anniversary Gift for Him, Personalized Toiletry Bag, Engraved Dopp Bag, Leather Dopp Kit, Boyfriend Gift for Men, Gift for Dad, Gift for Him",
    "description": "Anniversary Gift for Him, Personalized Toiletry Bag, Engraved Dopp Bag, Leather Dopp Kit, Boyfriend Gift for Men, Gift for Dad, Gift for HimChristmas GiftGift for HimGift for HerPersonalization: I make the engraving you how type on the personalization box. Please contact us for special personalization or logo orders. Take advantage of extra discount opportunitiesSize: 9x4x4\" inchesColors:BLACKCOGNACCHOCOLATTEPersonalization:Please select your font style and write your names or initials to the personalization box",
    "reviews": [
      "Bought as a gift with some personalization, and my partner liked it!",
      "Shipping was delayed by 10 days when I paid for priority. It was a delay due to weather so plan accordingly if it’s a gift. \n\nBut the item was good! The leather is great, my boyfriend loved it",
      "Great gift! The bag looked great and works well"
    ]
  },
  {
    "productId": "uwkFCheAdR",
    "url": "https://www.etsy.com/listing/936397811/14k-gold-initial-birthstone-rings?click_key=4bae0981f8814b9c67c7dd8adba2e3992a7ac35d%3A936397811&click_sum=cd2d30bd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-17&pro=1&frs=1&etp=1&sts=1",
    "title": "14K Gold Initial Birthstone Rings, Personalized Gift, Unique Baguette Birthstone Bands, Family Ring For Grandmothers, Best Mother's Day Gift",
    "description": "What is the perfect way to dress up any outfit or add your own flair? Accessorizing with jewelry, of course!From sparkling zircon necklaces and fashionable bracelets to stackable rings, SilverCityByEva has the perfect jewelry piece to accentuate your wardrobe, your lifestyle and your budget.♥ Personalized piece for your self or for someone special in your life...Baguette Birthstone ring with your desired 1-2-3-4-5-6 birthstones; this family birthstones ring makes perfect personalized gift♥Family Birthstone Ring, Dainty Gemstone Ring, Personalized Birthstone Ring, Birthstone Ring, Diamond Ring, Birthstone Gifts, Mothers Jewelry★ PRODUCT DETAILS;* Band Width: 4mm* Gemstone Size: 4MM*2MMmm for each stone.* Material Options: 925k Sterling Silver & Rose Gold Plated & Gold Plated Or 14K Solid Gold, 14K Solid White Gold, 14K Solid Rose Gold* Birthstone Options: You can see the birthstone chart in the last photo of the listing.► HOW TO ORDER;Please select your preferred MATERIAL, RING SIZE and BIRTHSTONE QUANTITY from the menu while adding to card.Please write your preferred BIRTHSTONES AND RANKING in the note box.WHY ∙ YOU ' WİLL∙ LOVE ∙ IT• It's dainty and can be worn every day...• A special piece you'll treasure...• High quality materials and attention to detail...Attention International Buyers!!!The recipient is the importer of record and must comply with all laws and regulations of the destination country. Orders shipped outside of the United States may be subject to import taxes, customs duties and fees levied by the destination country. The recipient of an international shipment may be subject to such import taxes, customs duties and fees, which are levied once a shipment reaches the recipient’s country. Additional charges for customs clearance must be fulfilled by the recipient; SilverCityByEva has no control over these charges, nor can SilverCityByEva predict what they may be.International Returns:You are justified in refunding only the item price.",
    "reviews": [
      "Special ring which was beautifully made.",
      "This is the second set of rings we have bought from here. The first rings were beautiful and we needed another stone added so of course we ordered another set from here because we were so happy with the first one. Quality rings beautiful colors. Very happy",
      "Seller is responsive if there’s any issues and the ring is pretty."
    ]
  },
  {
    "productId": "0NVwcQmxDo",
    "url": "https://www.etsy.com/listing/1309998673/sister-gift-personalised-gift-sister?click_key=467c4c40b33bed66ba644bb1205619283ae8abce%3A1309998673&click_sum=98451b9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-18&pro=1&etp=1&sts=1",
    "title": "Sister Gift - Personalised Gift Sister print,  gifts for her, Sisters Custom Birthday gift , Birthday gift for sister",
    "description": "Sister Gift - Personalised Gift Sister print, gifts for her, Sisters Custom Birthday gift , Birthday gift for sisterIntroducing the Sister gift! This watercolour illustration is the perfect way to show your Sister some love. You can choose from a variety of personalisation options to make it truly unique.Sisters are the best, aren't they? They're always there for a cuddle when you need it, and they always have the best advice. Show your Sister how much she means to you with this special print. It's sure to make her smile every time she sees it.*** Details ***At The Design Parlour, we understand that when it comes to art, quality is important. That's why we only print on high-quality satin pearl lustre 300gsm paper, with perfect resolution. We offer the highest quality large art prints at affordable prices, so you can enjoy your favourite pieces without spending a fortune. We also use 10 high-quality pigment dye inks to produce an incredible array of colours with multiple tones of black and grey. This gives black and white prints unrivalled detail. So, you can be confident that when you order from us, you're getting the best of the best.*** Sizing Options ***- A5 - 5.8 x 8.3 inches (14.8 x 21 cms)- 8 x 10 inches (10.32 x 25.40 cms)- A4 - 8.27 x 11.69 inches (21 x 29.7 cms)- A3 - 11.7 x 16.5 inches (29.7 x 42 cms)- Digital File will be a high-quality pdf sent via email if a specific size is required please let us know and we can design on that size otherwise it will be an A4 digital file.*** Customisation ***We're happy to work with you on customisation to make unique prints.There's nothing we enjoy more than helping our clients create one-of-a-kind prints.Whether you have a specific vision in mind, or you need some inspiration, we're here to help you make your mark.*** Shipping Info ***We want to make sure that your prints get to you safe and sound. That's why we ship all of our prints via Royal Mail. And to make things even better, we offer free postage for all orders using the 48hr Royal Mail Service. But if you need your prints even faster, we also offer upgrades for 24 hour and guaranteed delivery. So, no matter what your shipping needs are, we've got you covered.❤ See more of Art Prints -www.etsy.com/uk/shop/TheDesignParlour➡ Follow the shop to stay up to date with all our latest products.❤ Follow us on Instagram @the_design_parlourIf you have questions regarding our print options, please message us and we will be happy to help.Visit our Shipping & Policies page for additional information.------------------------------------------------------------------------------PLEASE READ THE FOLLOWING:Frame is for display purposes only, the item includes the print only.All copyright and reproduction rights are retained by the artist.Artwork may not be reproduced by any process without the express written permission of the artist.Digital File is for personal use only.------------------------------------------------------------------------------❤ Follow us on Instagram @the_design_parlourIf you have questions regarding our print options, please message us and we will be happy to help.Visit our Shipping & Policies page for additional information.------------------------------------------------------------------------------PLEASE READ THE FOLLOWING:Frame is for display purposes only, the item includes the print only unless Frames are selected.All copyright and reproduction rights are retained by the artist.Artwork may not be reproduced by any process without the express written permission of the artist.------------------------------------------------------------------------------",
    "reviews": [
      "Great quality, got picture for my sisters birthday, she loves it, Would definitely order again :)",
      "Image was scarily accurate to the description provided, highly recommended, and amazing customer service.",
      "I had a printing issue with my order the lady took a while to message back but once she did and was very quick to get the issue sorted. The product itself is well made and would buy again",
      "Thank you for your kind words.  Sorry about the delay in replying, So pleased you were happy with our product and look forward to hearing from you again. x",
      "Absolutely perfect, my sister loved it",
      "Thank you for your kind words. So pleased you and your sister were happy with our product. x"
    ]
  },
  {
    "productId": "GqaVKQILFs",
    "url": "https://www.etsy.com/listing/935529054/personalized-leather-luggage-tag-custom?click_key=9ab76561cbe5ebd28de8d60bb2c5065c38b5e3f9%3A935529054&click_sum=a777fa5d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-19&pro=1&etp=1&sts=1",
    "title": "Personalized Leather Luggage tag, Custom luggage tag, Custom Leather Travel Tag, wanderlust gift, Wedding Favor tags, traveler's gift tag",
    "description": "Personalized Leather Luggage tag, Custom luggage tag, Custom Leather Travel Tag, wanderlust gift, Wedding Favor tags, traveler's gift tag- Each leather tags are handcrafted by expert artisans with quality leather made to last.- Travel in style with the personalized luggage tags.- They are a great gift for weddings, Birthday, christmass or anuy other special occasions to keep your loved ones' luggage safe and classy.Spoiler Alert! This is not a regular Leather Luggage tag. Its the real one. They are hand cut, hand stitched and hand finished.Please visit the link below to access our entire collection:https://www.etsy.com/shop/LeatherMilano?ref=seller-platform-mcnavMatching Passport Covers sold seperately. Visit the link below if you are interested in Matching Passport Covershttps://www.etsy.com/listing/934920042/personalized-passport-cover-leather?ref=listings_manager_gridFEATURES:🔸Stylish and practical gift to your loved ones and yourself!🔸Vintage inspired design combined with the distressed leather gives a rich classy look.🔸 Strong structure with suede feeling finish.🔸They are a great gift for the special man, woman, business traveler or anyone that wants to keep their luggage safeCOLOR OPTIONS:🔸Our one of a kind collection features one of the richest color options in the market.🔸Our handmade luggage tags is available in Black, Gray, Brown, Red, Dark Tan, and Light BrownSIZE:🔸 3\" x 4\"MATERIALS:🔸 Constructed from 3 oz. 100% vegetable tanned cow leather🔸 Hand stitched using special thread🔸 The edges are beveled, waxed and burnished for a finished lookPERSONALIZATON:You can order with Name/Initials, with a phrase, with Both or \"No Personalization\".- If you wanna add a Date, Heart, a compass that is perfectly fine.- Please provide your personalization requests in the \"Add an optional note to seller\" box during checkout.- You can simply leave your engraving instructions there and you are all set!Character Limits: Front: 6 letters Max. The Engraved Message can be either name or initials. For the custom logo laser option we beatifully laser engrave the logo / image outline on the front of the tags*We engrave what the customer provides; therefore we kindly remind you that LEATHER Milano is not responsible for any typo :(QUICK SHIPPING:Orders ship Next Day!💌 UNITED STATES - USPS First Class Mail• 3 - 5 Business Days💌 Canada Post Standard Tracked Mail• Typically takes 3 - 10 Days",
    "reviews": [
      "Wow! The custom luggage tag shipped within a few hours of my order.  It arrived super quickly and my girlfriend loved it!  Really great seller",
      "Great product, especially foe the price.  Definitely recommend",
      "I didn't have a need for customer service but, response to my order was wonderful.  I ordered and had my luggage tags in less than 1 1/2 weeks.  They are very well made and will be perfect for our needs.",
      "These nametags look very durable.  I really like being able to personalize them."
    ]
  },
  {
    "productId": "HvysvkAhcz",
    "url": "https://www.etsy.com/listing/1340561174/art-dice-inspiration-for-drawing-and?click_key=f802235ef51074f8e11481bb67562297ecdbd516%3A1340561174&click_sum=57596a9c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-20&etp=1&sts=1",
    "title": "Art Dice - Inspiration for drawing and painting / Overcome artist's block. Gift for artists, teachers. Classroom or studio",
    "description": "Art Dice—the solution to Artist's Block. When faced with a blank canvas, it can be hard to know where to start. Whether you’re an artist, a teacher, or you just want to dabble with drawing or painting, Art Dice can help you find inspiration, develop your skills, vary your style, or collaborate creatively with others. With thousands of combos, you’re bound to encounter something unexpected and different. So roll the dice. Create fearlessly. You never know what’s inside of you until you try!• INCLUDES: 9 color-coded wood dice (1 inch with easy to read text). Just roll, brainstorm, & create!• PERFECT SOLUTION TO ARTIST’S BLOCK: Whether you’re an experienced artist or you’ve never picked up a paintbrush — with thousands of combinations, you’ll never fear a blank canvas again!• DEVELOP YOUR SKILLS & CREATIVITY: Art Dice encourages you to break out of your comfort zone and vary your medium, style, subject, mood, texture, setting, and color.• PLAY ALONE OR TOGETHER: Can be played alone, with friends and family for a fun family game night, or to encourage creativity and collaboration in the classroom. Connect through art!• MULTIPLE WAYS TO PLAY: Full instructions include variations for creating a series, drawing in speed mode, making collaborative pieces, and teaching demonstration• GREAT GIFT: Makes a perfect gift for artists, teachers, or art students. Works great for novice or experienced artists.",
    "reviews": [
      "These are so fun and are a great way to fight artists block, and are a fun way to create content if you're looking for easy content creation ideas. It's easy to use just one dice or several at a time depending what your needs are. These would be awesome for art classes, sub plans, or creating lesson plans! The only reason for 4 stars is that the paint on some of the die faces was rubbed off right out of the box. Maybe they need a better sealant/top coat or maybe some paper between them in the box during shipping, just because they are a little pricey I would expect them to arrive in better condition. other than that, I love them and will use them for years to come!",
      "one two three, very good",
      "These were a gift to an artist and she loved them.",
      "Made a great gift - highly recommend!"
    ]
  },
  {
    "productId": "isUYKifMSf",
    "url": "https://www.etsy.com/listing/612196166/family-birthstone-mothers-bracelet?click_key=4e69349f780bdedf34ed138cd27e75b1664d8495%3A612196166&click_sum=d4ede8a0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-21&etp=1&sts=1",
    "title": "Family Birthstone Mother's Bracelet - Custom Birthstone Bracelet - Mothers Day Gift - Personalised Jewelry Gifts - Birthday Gifts for Her",
    "description": "❤︎ Family Birthstone Bracelet.This listing is for a personalised European crystal birthstone bracelet.We have a crystal to represent each of the birthstones for each month of the year :☆ January - Garnet☆ February - Amethyst☆ March - Aquamarine☆ April - Diamond☆ May - Emerald☆ June - Light Amethyst☆ July - Ruby☆ August - Peridot☆ September - Sapphire☆ October - Rose Quartz☆ November - Topaz (yellow topaz)☆ December - TurquoiseYou can select the number of birthstones you would like on the bracelet from the options provided - these can be birthstones to reflect your family members, friendship group, couples or anyone you choose.The bracelet pictured features the birthstones for March, September and October. It is silver plated.The bracelet measures 6 inches in length and have a 1.5 inch extender chain, allowing the bracelet to be worn at any length between 6 and 7.5 inches.If you would like a longer (or shorter) bracelet, this is no problem. Simply add a note onto your order with the length of bracelet you would like and we will make this for you - ie, if you would like the bracelet to be able to worn up to 8 inches, we would make the bracelet 7 inches with the 1.5 inch extender chain.❤︎ PersonalisationPlease write the months you would like in the personalisation box. We will make the bracelet with the crystals in the order in which they are listed in the box.❤︎ Made From :This bracelet is made from silver plated metal - ie a cheaper base metal (brass) plated with a coating of silver.As with ALL plated jewellery, the silver plating will wear off eventually. The only way to avoid the plating wearing away (ie losing its silver colour) is to buy pure silver or sterling silver - which at the current time is expensive and it is just not possible for us to offer sterling silver at anything like this sort of price point.We do include a care instructions sheet with some tips to help prolong the lifespan of your jewellery.❤︎ PackagingAll bracelets are neatly wrapped in tissue paper and then placed in a pretty organza gift bag along with a 'birthstone gift card' - like the one shown in the fourth picture.If you like, you can also choose to upgrade to a gift box instead of the organza bag.",
    "reviews": [
      "Fast delivery and well made",
      "Exactly as described and shown on photos. Lovely little bracelet.",
      "Thank you.",
      "Lovely, delicate design. Good distance between gems. Colours are great.",
      "Thank you.",
      "Really lovely item and my friend really liked it",
      "Thank you."
    ]
  },
  {
    "productId": "gpKA4hqOXe",
    "url": "https://www.etsy.com/listing/1077219794/choose-your-own-flavored-lip-balm-little?click_key=97ffca70e5a2cc88a91dfdcac787bdf4e8b67827%3A1077219794&click_sum=f163984e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-22&etp=1&sts=1",
    "title": "Choose Your Own, Flavored Lip Balm, Little Gifts Ideas, Party Favors, Ready to Ship",
    "description": "Pucker up baby!Choose your own flavored lip balm...mix and match how you want. Oh, the possibilities!Handmade lip balm made by yours truly. I feel like I have perfected my recipe it to be just how I like it. Smooth and soft. And it never gets grainy...eww. I can't stand that! They come in a handful of flavors and I'm constantly making new ones...so stay tuned!Ingredients: Organic Beeswax, Jojoba Oil, Sweet Almond Oil, Vitamin E, Therapeutic-Grade Essential Oils, and/or Flavor oil",
    "reviews": [
      "Smooth. Great scent. Fun and my lips are moisturized",
      "My girlfriend absolutely loves these. She says they have a great taste/smell and make her lips feel wonderful. I will definitely be buying more.",
      "Awesome product. Love the smell. Feels good on the lips.",
      "All the lip balms I ordered are so smooth and wonderful"
    ]
  },
  {
    "productId": "fDlEdkNmfw",
    "url": "https://www.etsy.com/listing/237967205/6th-anniversary-gift-hand-forged-wabi?click_key=47c139432f10201620abd6462004f0f5a2d71963%3A237967205&click_sum=e1d03f40&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-23&frs=1&etp=1",
    "title": "6th anniversary gift hand forged WABI SABI lidded BOWL personalized gift iron anniversary gift 11th anniversary",
    "description": "Makes a bold, graceful statement!  Let this lidded bowl speak for itself as a sculptural piece on its own while it houses your cherished treasures.  Each bowl is slightly different, embracing wabi-sabi, the Japanese aesthetic that celebrates imperfection.A unique 6th anniversary gift (iron anniversary), 11th anniversary gift (steel anniversary), wedding gift or Mother's Day gift.This listing is for a WABI SABI lidded BOWL with or without personalization.With Personalization:Have us stamp initials, a date or a message into the steel with 3/16\" tall capital letters and numbers. Under \"Number of Characters\", select the option that suits your text (\"Up to 10 characters\", \"11 to 20 characters\", etc). The text will line the outside edge of the lid unless you specify another desired location that we agree upon.***please include your personalization in the box provided***Without Personalization:Select \"no personalization\" under the \"Number of Characters\".  Your lid will have a small dot stamped into it that is placed just so to line up with the dot on the bowl.Each piece is created out of mild steel that has been heated in the forge and hammered into shape on the anvil by Ruben Irons, Artist Blacksmith in the back woods of Nova Scotia, Canada. Unique marks of character speak to the ancient craft of blacksmithing and the subtleties of the particular piece of metal.  The bowl has a raw beeswax finish to preserve the industrial steel grey color.Each is one-of-a-kind with overall measurements remaining similar.  With its lid on, this bowl sits approximately 4\" tall from base of bowl to top of knob.  It measures approximately 6\" across.  The flattened bowl bottom is about 2.5\" in diameter, allowing for a stable base.  The bowl is made out of 1/4\" plate with the lid hammered out of 1/8\" plate.  The piece weighs approximately 3 lbs.Not food safe.  To preserve beeswax finish, avoid moisture.To have this item shipped outside of North America, please send us a note with your shipping address and we will respond with a shipping quote. From there we can create a listing just for you.For full information on our shop policies:https://www.etsy.com/ca/shop/RandRHandmade/policy?ref=shopinfo_policies_leftnav",
    "reviews": [
      "I couldn't be more pleased. The quality and workmanship is unmatched. This is exactly what I pictured. The custom work and request are perfect. Would highly recommend. Had a great experience all the way around.",
      "Perfect! We really like the final product! Great gift for my wife!",
      "Such a lovely bowl! It came just as ordered. I purchased this for my husband for our 6th anniversary, and he loves it! Such quality work!",
      "Beautiful work. Exactly what I wanted"
    ]
  },
  {
    "productId": "bfpRWNIojd",
    "url": "https://www.etsy.com/listing/661679011/personalized-leather-dopp-kit-mens?click_key=b4d0eb47d68a64718e76382eeef887a994d68a14%3A661679011&click_sum=4ab86ce0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-24&pro=1&etp=1&sts=1",
    "title": "Personalized leather dopp kit, mens leather toiletry bag, mens dopp kit, groomsmen gift mens toiletry bag with a name stamp,",
    "description": "✦We can guarantee a timely arrival if you send a message with the deadline prior to ordering.Give it a try, even if it's a matter of a week.________________________________________________________________________________________________________________Growing is forever. This is my latest creation so far.These leather dopp kits are every bit as great as you could think they are.I would like to emphasize on this little moment:The personalization is hot stamped (that's an old school technique and it's hard to do, and it's not laser engraved). Stamped leather smells great, and doesn't have an unpleasant laser burned smell).It's a man against the machine thing, so it's really important.✦SizeStandard:8,5\"x4,5\"x3,5\"Large (I'd prefer to call it huge, but it sounds a bit rash for an official name)9,5\"x6,5\"x4,5\"✦LeatherI use distressed top grain cowhide leather, of the best quality. It's solid, but very soft.The distressed nature allows it to age beautifully, writing down the life story of it's owner.✦MakingYou are in the maker's shop. These bags are cut and sewn from the very scratch.You receive an object made with warmth and personal care, coming from a small studio, where people laugh, joke, and listen to the good music.✦PersonalizeIt is branded with a custom name/initials.Branding can be done on the outside and/or on the inside.While adding an item to the cart,Choose option \"1 stamp\" if you only want it personalized on the outside or on the inside.Choose option \"2 stamps\" if you want it personalized both on the outside and on the insidePlease provide information about names, letters, monogram style, stamp color(plain/gold), personalization strip color in \"note to the seller\", at the checkout.✦ShippingUS: around two weeks since the day of your order. Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.Canada: around three weeks since the day of your order.Europe: between two and three weeks since the day of your order.Australia: between three and five weeks since the day of your order.Rest of the world: between two and four weeks.Multiple items are shipped for the price of a single one - pay for shipping only once!",
    "reviews": [
      "Flimsier then expected and arrived late.",
      "Beautiful! I ordered this as a gift for my husband. Highly recommend!",
      "Great quality! My husband and brother in law loved them!",
      "Gave this as a Christmas gift and it was perfect! The seller was great at responding to me in a timely manner when it came to any questions I had. 10/10 recommend!"
    ]
  },
  {
    "productId": "YsymPAcgdA",
    "url": "https://www.etsy.com/listing/1577051388/personalized-handmade-belt-for-dad?click_key=68415454c22b496c8179f0281473f55504428345%3A1577051388&click_sum=83f89f2f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-13&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Handmade Belt for Dad, Valentines Gift for Him, Gift for Dad, Custom Leather Belt for Men, Personalized Men's Belt",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Personalized Handmade Belt for Dad, Christmas Gift for Dad, Gift for Husband, Custom Leather Belt for Men, Personalized Men's BeltThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift Ideas",
    "reviews": [
      "Great belt with a lovely personalization.",
      "It was a great gift.",
      "Love this! It’s just as listed and comes quickly!",
      "Extremely pleased with my purchase."
    ]
  },
  {
    "productId": "nweOXGjyk0",
    "url": "https://www.etsy.com/listing/1584833189/fall-gift-basket-with-bottle-valentines?click_key=a841b03ac5b9416636aaac26a2b7851cff12e83c%3A1584833189&click_sum=060231d7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-14&pro=1&bes=1&sts=1",
    "title": "Fall Gift Basket with Bottle | Valentine's Gift Box with Blanket | Hygge Gift Set | Personalized Gift | Water Bottle",
    "description": "100% satisfaction guaranteed❤️ Free returns❤️ Hand packed with love in Florida❤️ Give your loved ones the perfect gift with Bella Vibes Luxury Gift Box ❤️Inside this thoughtfully curated box, they will find everything they need to feel cherished and cozy. Show your loved ones just how much they mean to you with Bella Vibes Gift Box.𝐆𝐈𝐅𝐓 𝐁𝐎𝐗 𝐈𝐍𝐂𝐋𝐔𝐃𝐄𝐒♥Cozy Blanket: 50\"x60\" Knitted Throw Blanket serves not only as a superb accent piece for couches and beds, but also keeps the recipient of your gift nice and snug when temperatures drop!♥ Water Bottle Vacuum : 17 oz Soft Matte Stainless Steel Water Bottles. Enjoy your coffee, tea, juice, and milk with fun color-changing cups.♥Chocolate: Let their mouths water with a sumptuous surprise they won't soon forget - a piece of luxurious chocolates!♥ Hand-poured Soy Candle with special matches: Soy Candle with special matches makes an amazing gift or addition to any home décor set up—so go ahead and give that extra bit of thoughtfulness to your special someone today!♥A6 Leather Notebook with pen:  They'll thank you whenever they use it — get yours today!♥Greeting Cards with Envelopes-if you want-: Greeting Perfect to send to loved ones - family, friends, and colleagues alike - these cards will add an extra layer of care and appreciation to your gift-giving.♥♥♥ Please tell if you want to a greeting card. You can add personal message for the card▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬sunshine gifts, with love, heart, mug, sending sunshine gifts, hug in the box, thinking of you care package, best friend birthday gift for her, care package for her, care package, cozy gift, extra cozy gift, hygge gift box, hygge gift basket, gift basket for her, gift basket for him, hygge gift ideas, gifts for women, fall gifts for team, corporate gifts, appreciation gift, gifts for her, holiday gifts, holiday gift basket, valentine's gifts, valentine's day gift box, holiday gifts for women, holiday gifts for men, corporate gifts, employee gift box, self care gift basket, care package, get well care package, just because, happy holidays gift, valentine's day gift basket, best gifts for her, gift basket for mom, gift box for best friend, you're my sunshine gifts",
    "reviews": [
      "Very well put together and the candle smells so good. Thank you💕",
      "My sister-in-law absolutely loved it! Thank you guys so much!",
      "Iteam was just as described."
    ]
  },
  {
    "productId": "G9erseJSDQ",
    "url": "https://www.etsy.com/listing/1360383391/personalized-leather-dopp-kit-groomsmen?click_key=4a1650c3c083fd8f32ec986ca73f7f0ae12a3770%3A1360383391&click_sum=a10861e9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Leather Dopp Kit Groomsmen Gift for Him Leather Travel Bag Leather Toiletry Bag Anniversary Gift Christmas Gift Leather bag",
    "description": "XL Personalized Leather Dopp Kit Groomsmen Gift for Him Leather Travel Bag Leather Toiletry Bag Anniversary Gift Christmas Gift Leather bagOur Personalized Leather Dopp Kit allows you to keep your toiletries, cosmetic and hygiene items organized in one spacious place.The minimalistic design of our Dopp kit makes our product timeless while the quality of our Dopp Kit makes our product luxurious. The single handle on the side of our Toiletry Bag with the strong and smooth zippers makes our product functional excellently. Not only that, but you can make your Dopp kit more unique by personalizing them. We can engrave your Logo or a handwritten name and initials.Your loved ones like your husband, brother, father, uncle, friends, groomsmen would appreciate receiving a personalized high quality Dopp kit that is elegant looking and is practical to use on special occasions such as Anniversary, Wedding, Christmas, Birthday or Father’s Day. You might gift them or treat yourself with our Personalized Leather Dopp kit that is going to last you a lifetime.Exceptionally high-quality Leather Dopp Kit is a priority for us. As you begin using our product, you may notice the leather improves its appearance by taking on a more aged and mature look over time, which is a sign of good quality leather. We always but always ensure each of our products one by one with no exception before shipping them. Therefore, we are certain of our Leather Dopp Kits, and we make you a promise of a lifetime warranty. You may easily get in contact with us directly if required.XL Personalized Leather Dopp Kit Groomsmen Gift for Him Leather Travel Bag Leather Toiletry Bag Anniversary Gift Christmas Gift Leather bag",
    "reviews": [
      "This product is great quality!",
      "Product was great quality and just as described",
      "The item is exactly as pictured. Excited to gift this!"
    ]
  },
  {
    "productId": "LlfZGzDjnh",
    "url": "https://www.etsy.com/listing/1033825492/custom-photo-on-wood-engraved-photo-on?click_key=186a7fb9c4b6c71174d8b952d7f4473356bc8015%3A1033825492&click_sum=58c8e236&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690478-11-16&pro=1&frs=1&bes=1&sts=1",
    "title": "Custom Photo on Wood, Engraved Photo on Wood with Watercolor Style, Custom Wall Art, Personalized Portrait from Photo as Long Distance Gift.",
    "description": "🧡 HAPPY VALENTINES DAY 🧡🎉 SPECIAL CUSTOM GIFTS FOR YOUR LOVER 🎉Capture memories with a Custom Watercolor Wood photo, the perfect personalized gift for any occasion. Ideal for anniversaries, birthdays, and Valentine's Day.Before You Buy;Customizations are permanently burned on solid wood that has a thickness of 0.5''.t measures 8.50''x12''Has a wall hanger.It is sent with metal legs for tabletop display.The Custom Watercolor Woodfoto is a distinctive keepsake that beautifully blends the rustic charm of natural wood with the soft, artistic touch of a watercolor effect. This unique piece of art is not just a gift, but a timeless treasure that encapsulates precious moments in an elegant and personalized manner. Each Woodfoto is crafted with meticulous attention to detail, ensuring that your chosen photo is transformed into a stunning watercolor masterpiece printed directly onto a high-quality wooden canvas.Ideal for both men and women, this personalized picture gift is versatile enough to suit adults and teens alike, making it an excellent choice for a partner, friend, or family member. Whether it's to commemorate a 45th birthday, celebrate an anniversary, or as a heartfelt present for Valentine's Day or New Year's Eve, the Custom Watercolor Woodfoto stands out as a thoughtful and original gift.The process of personalization is simple yet profound. You select a cherished photo, and our skilled artisans will convert it into a watercolor-style image before printing it onto wood. The final product is not just a picture but a piece of art that tells a story and evokes emotion. The natural wood grain adds a unique texture to each piece, ensuring no two Woodfotos are exactly alike.The Custom Watercolor Woodfoto also serves as a versatile decor piece that can effortlessly adorn a mantle, bookshelf, or wall, adding warmth and personality to any space. It's an exceptional choice for those who value the combination of natural materials and personalized elements in their home decor.Given its personalized nature, this Woodfoto is a meaningful keepsake that can be cherished for years to come. It's an ideal gift for various occasions, such as birthdays, anniversaries, Valentine's Day, or even as a thoughtful gesture to show someone you care any day of the year.In summary, the Custom Watercolor Woodfoto is more than just a gift; it's a celebration of love, friendship, and the special moments that make life worth cherishing. It's a way to hold onto those fleeting memories and display them in a format that is as unique as the moments themselves. When you give a Custom Watercolor Woodfoto, you're not just giving a gift; you're giving a piece of your heart.",
    "reviews": [
      "Great product. Thank you very much.",
      "It’s an amazing quality and it’s absolutely beautiful",
      "It’s gift wrapped so I won’t actually see it until my partner opens it in a week. The seller was friendly and communicated well during the entire process. I trust this seller for good quality products.",
      "Item met all expectations! Fiancée loved his gift!"
    ]
  },
  {
    "productId": "xQzqpHEmMo",
    "url": "https://www.etsy.com/listing/768504599/personalised-engagement-gift-for-couple?click_key=798af0a550bba1b5bc289a44c5d6099aef9c4280%3A768504599&click_sum=86662ae1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-25&etp=1",
    "title": "Personalised Engagement Gift for Couple, Engraved Map Engagement Gift, Engagement Candle",
    "description": "Our engraved engagement gift candle shows a map of where the couple got engaged. It also includes their names and engagement date, making it a great gift for a couple who just got engaged. You can also add a personalised message to the reverse side free of charge. Pretty packaging and free matches included with each engagement gift candle.Make the perfect engagement gift with our amazing range of little extras:LUXURY GIFT WRAPElevate your engagement gift's presentation with our signature Kindred Fires gift bag. Select 'this order is a gift' on the cart page and add gift wrapping to your order. We’ll pack your goodies inside the bag ready for the recipient to open upon delivery.WICK TRIMMER & SNUFFER SETThe perfect duo for candle lovers - our wick trimmer and snuffer set is crafted to help care for your candles, ensuring longevity and optimal burn.https://www.etsy.com/uk/listing/1661102691/wick-trimmer-and-snuffer-set-giftBATH SALTSRelax and unwind with our essential oil bath salts. A soothing mix of salts, natural oils and rose petals expertly blended and presented in a glass bottle with gold foiled label.https://www.etsy.com/uk/listing/1646926082/dead-sea-himalayan-bath-salts-essentialCANDLE FRAGRANCES:TRANQUILITYA calming, fresh scent reminiscent of relaxing spa days. This candle's aroma is light yet indulgent. Tranquility beautifully combines fresh citrus with eucalyptus on a clean floral base.PASSIONFRUIT PALMThis enticing, uplifting fragrance radiates summer confidence. Passionfruit Palm is a complex blend of passionfruit and pineapple combined with a floral bouquet on a musky base.BLACK VELVETAn indulgent, alluring scent that transports you to a night of adventure. Black Velvet combines exotic spices with an intense blend of jasmine and oud on a woody base.SUNLIT ROSEDrift through a charming English garden filled with the scent of the majestic rose. Distinctly feminine, Sunlit Rose is a heady combination of rose and violet on a bold base of amber and vanilla.SECRET BEACHAn exotic escape, Secret Beach is reminiscent of a tropical ocean breeze. Fresh orange and soft peach rest on a creamy coconut and vanilla base. Close your eyes and let yourself drift to a place that’s just yours.PINK JASMINEA sweet, feminine fragrance that creates a serene and joyful mood. Pink Jasmine has a bold base of amber and vanilla with sweet notes of pear, peach and jasmine.SPICED ORCHARDInspired by the nostalgia of woodland walks and sugared treats, Spiced Orchard is a fragrance that celebrates all things Autumn. Brimming with warming spices, vanilla, and apple.WINTER FORESTSnow covered boots crunching on shimmering ground, surrounded by tall pine trees and icy skies. This is Winter Forest, a rich blend of alpine wood and balsam together with warming notes of cinnamon and clove.FESTIVE SPICEA spiced festive essential oil blend. Combining sweet orange extract, clove bud and cinnamon bark, Festive Spice evokes cosy memories of wood fires and mulled wine on dark winter’s nights.MOONLIT WONDERAll the glamour and luxury of a magical Winter’s night are evoked by this rich, indulgent fragrance. Moonlit Wonder combines shimmering juniper with warm amber on a musky, patchouli base.WANT TO SEE MORE ENGAGEMENT GIFTS?Take a look at our engagement gifts page here:https://www.etsy.com/uk/shop/KindredFires?section_id=28131897CHECKOUT OUR NEW HOME FRAGRANCE SECTION:https://www.etsy.com/uk/shop/KindredFires?section_id=45470990",
    "reviews": [
      "I asked them to put the star on a specific spot. They got back to me right away and it was just what I asked.",
      "The candle is well made and smells amazing.",
      "This was my second time purchasing this candle as an engagement gift - it’s perfect! \nThe candle was mishandled by the shipping carrier and arrived damaged but the seller seamlessly arranged for a replacement to be sent",
      "I have bought multiple. They are amazing."
    ]
  },
  {
    "productId": "NirwiawuNF",
    "url": "https://www.etsy.com/listing/1357481261/valentines-day-gifts-gift-for-boyfriend?click_key=4ec2f1157d102b39c01e4b8e6904c64e0f5604fd%3A1357481261&click_sum=2975676b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-26&etp=1",
    "title": "Valentines Day Gifts, Gift for Boyfriend, Gifts for Her, Personalized Wood Engraved Picture Frame, Boyfriend Gift, Valentines Day Card",
    "description": "Our personalized engraved photo blocks make the perfect gift for your boyfriend whether it's for Christmas, a birthday or just because.We thrive on simplicity and a minimalist vibe, the details are in the memory.♥♥♥♥DETAILS♥♥♥♥We pride ourselves in the details. Each piece is handmade by us, for you.♥ 8x6\" birch wood board♥ Engraved with the quote of your choice♥ Personalized with your details♥ 2 strong gold magnets to hold photo♥ Holds a 3x4\" photo (we suggest cutting a 4x6\" photo down)♥ Comes with a peg for easy displaying♥♥♥♥SHIPPING♥♥♥♥We ship all items next day to help you give a timely meaningful gift, when it means the most to your friend and loved ones.♥♥♥♥Thank you for supporting our small business! It literally means everything to us♥♥♥♥",
    "reviews": [
      "Will definitely order again! Perfect for gifts!",
      "The picture frames are beautiful! The perfect gift for a father of the bride!",
      "Lovely high quality item. Came out exactly how I wanted it to and it shipped quickly. Gave it to my partner for Valentine’s Day and he loves it so much. Highly recommend!",
      "I loved! Looks exactly like picture fast shipping"
    ]
  },
  {
    "productId": "doKLgvxRAa",
    "url": "https://www.etsy.com/listing/593624689/personalised-solid-copper-wallet-photo?click_key=0afcbe278936e60d442f44608493601d7a36f679%3A593624689&click_sum=bdf45ebf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-27&frs=1&etp=1&sts=1",
    "title": "Personalised Solid Copper Wallet Photo Card, Wallet Insert, Wallet Card",
    "description": "Always keep a cherished memory, moment, or person near you with this distinctively personalised 'Solid Copper Wallet Photo Card.'This highly customisable wallet card inlay serves as an excellent gift for someone special.Crafted from a credit card-sized sheet of copper suitable for wallets, the card is printed directly using highly durable inks and sealed with varnish to prevent tarnishing.The ideal sophisticated and heartfelt present for a loved one. Simply provide us with a photograph and your very own unique message, and we'll handle the rest.Customer Notes/PersonalisationPERSONALISATION - After placing an order, please send us a message with your photo.MaterialsConstructed from a 0.9mm thick sheet of solid copper or steel. The image is printed directly onto the metal using special hard-wearing and waterproof inks, and a clear varnish is applied over the image to further enhance the quality and prevent the copper from tarnishing.DimensionsW84 x H54mm x D0.9mmThe perfect card size for a wallet insert.",
    "reviews": [
      "I bought this for my husband as an anniversary present and he absolutely loves it!",
      "I am very happy, it’s just like I was waiting for",
      "I love it. It is a perfect anniversary gift"
    ]
  },
  {
    "productId": "rtuXbhYOLf",
    "url": "https://www.etsy.com/listing/913639685/secret-message-bracelet-hidden-message?click_key=f213dc97d5aa7fa1beb5771b36e7facf46d37488%3A913639685&click_sum=617f4831&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-28&frs=1&etp=1&sts=1",
    "title": "Secret Message Bracelet, Hidden Message, Personalised Real Leather Bracelet, Personalised Gift for Him, Gift for Her, Gift for Boyfriend",
    "description": "These stunning, handmade leather bracelets make the perfect gift for any loved one.  They are made with high quality, genuine leather and are very comfortable & easy to wear. The bracelets are secured with a magnetic, antique bronze clasp for extra comfort and security. Available in 3 different sizes, these comfortably fit all wrists.These bracelets are extremely meaningful, special and unique - each bracelet is made to order and will no doubt be a gift they can cherish for years. We are able to engrave any personal message, name, initials etcWe aim to process all orders within 1-2 days and can be packaged in a beautiful gift box (available at checkout).Please note - our bracelet lengths stated show the total length of the bracelet, including the clasp.>> SHIPPING <<✓ Once we have all the information required to progress, we typically dispaych your items within 2 working days!✓ FREE FIRST CLASS UK shipping (approx. 1-2 working days)✓ WORLDWIDE shipping - choice of services including EXPRESS delivery---------------------------------->> Buy With Confidence <<* We are more than happy to provide you with a design proof so that you can rest assured that you are happy with the design and layout of your custom made bracelet. Just send us a note and we will be more than happy to help.>>Our Other Items!<<For Personalised Cufflinks click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30037420For Personalised Cufflinks and Tie Clip Sets click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30037430For Custom Made Real Leather Bracelets click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30037434For Engraved Coat Hangers click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30055061For Personalised Ring Boxes click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30055063For Real Leather Bookmarks click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30101234For Personalised Wooden Necklace Pendants click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30136260For Paper Cut Artwork click here -https://www.etsy.com/uk/shop/LittleWoodpeckerUK?section_id=30164954Please note there may be some variations to our gift box (available at checkout). designs from time to time.",
    "reviews": [
      "My pilot husband loved the custom inscription. Thank you",
      "This is a super gift. Lovely soft strong leather.Very strong magnetic clasp. And beautifully inscribed. The seller was extremely helpful when I realised I’d missed something out and the bracelet was delivered very quickly. Will definitely be ordering again .",
      "Bought this for my partner, he's gonna love it. Very masculine and will really go well with the other leather bracelet I also bought him. Excellent quality and is a lovely keepsake with writing of your choosing on the inside of the bracelet. Great value for money and prompt delivery. 5 Star Rating",
      "Lovely bracelet, thank you very much"
    ]
  },
  {
    "productId": "micDSKAcEA",
    "url": "https://www.etsy.com/listing/575095848/personalized-cutting-board-personalized?click_key=65e9bc26482581924ad56ab24a03918cae010581%3A575095848&click_sum=056a5a5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-29&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Cutting Board, Personalized Wedding Gift, House Warming Gift, Engraved Cutting Board, Anniversary Present, Paddle Cutting Board",
    "description": "Personalized cutting boards are not only practical, but make an excellent wedding or bridal shower gift. We offer both paddle style and rectangular style for your choosing. Our cutting boards are laser engraved for a permanent finish. We do not use vinyl or stickers.WHAT'S INCLUDED?★ One laser engraved cutting board in your choice of walnut, cherry or bamboo. Our walnut and cherry boards in this listing are shipped uncoated in their natural wood finish. We recommend applying a food safe mineral oil prior to use to preserve the life of the board.★ Note - Due to the nature of real wood products, the actual shade and color of the engraving may vary slightly.★ORDERING NOTES★❶ Please see all photos for design and product options.❷ Double check all information before submitting order.★ Include any information needed for personalization. Example (Names, Date, etc.) If you would like to omit any portion of the design, please specify the change in the personalization field.Any information not included may be omitted.❸ Double check shipping address (make sure to include apartment number if applicable)★PRODUCTION AND SHIPPING★We pride ourselves in delivering your custom product to you in timely manner. We always do our best to ship orders as quickly as possible.If you need your items sooner, please add our rushed production listing. This listing ensures your order ships within 1-2 business days. We are not able to guarantee exact delivery dates.https://www.etsy.com/shop/FlowertownWeddings?section_id=19062302",
    "reviews": [
      "absolutely beautiful work would definitely purchase again from the business!",
      "They definitely exceeded my expectations. Excellent quality. The delivery was much faster than they said, which for me was Wow!!! I'm fascinated with the material, the size, the design, the quality, the excellent engraving, everything, everything, everything. 5+++++",
      "LOVE! I purchased this for my best friend who is getting married soon and it came very fast. The quality is amazing and the engraving came out so perfect and clean. I am very pleased with how it has turned out. 10/10! I will be ordering again in the future."
    ]
  },
  {
    "productId": "vzSjvNcnIK",
    "url": "https://www.etsy.com/listing/998817484/personalized-engraved-fishing-lure?click_key=b28bbdaf3959dd8926a4a54eb7e5de6caca39820%3A998817484&click_sum=67dba208&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-30&pro=1&etp=1&sts=1",
    "title": "Personalized Engraved Fishing Lure, Fishing Gifts for Him, Personalized Gift, Gift for Boyfriend, Fathers Day Gift, Retirement Gift Husband",
    "description": "Personalized Engraved Fishing Lure for your loved one!These fishing lures make the perfect personalized special gift for your loved one!We use top of the line laser technology to ensure precise detail and long lasting engraving.Fishing Lure Features:2.5\" length X 1\" heightSteelLaser Engraving*This is a real fishing lure with sharp hooks included**This hook should only be handled by adults - open carefully*THE HOOK DOES NOT COME ATTACHED - Must put on yourself.Up to 3 lines with 25 characters on each line including spaces.",
    "reviews": [
      "Absolutely perfect. Cute and simple gift",
      "Good item I recommend this item",
      "Great buy ... definitely recommend!"
    ]
  },
  {
    "productId": "bWkUXHjsBx",
    "url": "https://www.etsy.com/listing/679369743/personalized-mahjong-bag-personalized?click_key=d1c029aa238667ffa4b0bdbe8bd1bd47298f0f38%3A679369743&click_sum=4afd1199&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-31&frs=1&etp=1&sts=1",
    "title": "Personalized Mahjong Bag - Personalized Zipper Pouch - Pouch Bags - Game Pouch - Game Bag - Personalized Game Case - Custom Game Bag",
    "description": "This charming personalized multi functional mahjong game bag keeps all your essential mahjong winnings neatly contained. Featuring mahjong tiles and your name, this personalized game bag makes a perfect addition to any mahjong lovers game room, and makes a great gift for anyone who loves to play mahjong! To personalize the mahjong bag simply enter the text as it will be printed on the bag. The mahjong bag is made of a machine-washable light-beige polyester-cotton blend that has a textured linen or soft canvas/burlap feel. The bag measures 9.25\" W x 6\" H and has a black zipper closure on top. The personalization is done with a method that puts the image inside the fabric so you do not feel the design and allows the pencil bag to stay super soft. The image is only on one side of the bag. Due to the personalized nature of this item, we are not able to accept returns unless the item is damaged.❤ Great small storage bag for mahjong enthusiasts❤ Personalized Bag - You add and can see the text.❤ Bag measures 9.25 X 6 inches, made of a poly-cotton blend with a textured linen and soft canvas feel.❤ Bag is printed and ships from our facility in Houston, TX.❤ Image is embedded in the fabric so the entire bag stays soft. Bag can be machine washed and dried.❤ Thank you for visiting my shop ❤",
    "reviews": [
      "Great personalized gift. This was for a friend.",
      "I love this bag! Someone bought one for me, and now I’m buying one for another friend!",
      "Great product, super happy. My mom is going to love it!",
      "Gorgeous item with super fast shipping"
    ]
  },
  {
    "productId": "azVswtqqyD",
    "url": "https://www.etsy.com/listing/398529169/personalized-map-heart-map-print?click_key=6dd5648e0fe1811b96d89ff83f560c4493f58b33%3A398529169&click_sum=8fbe3492&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-32&frs=1&etp=1",
    "title": "Personalized map, Heart map print, Anniversary gift, Map print, Custom wedding gift, Paper Anniversary, Map Art, Engagement gift",
    "description": "A vintage map art print digitally customized to your choice of locations in the world.You can choose two locations and I will customise them in to a unique book fold design to give the appearance of an open book with one map on each half.This personalized custom print is ideal for giving on a huge range of occasions.Perfect for that first wedding anniversary (Paper), birthdays, Christmas, graduation, housewarming, engagement – the choice is only limited by your imagination.I have several hundred vintage maps in my collection for you to choose from.NOTE: Frame shown is for display purposes only and not included as part of item.Please see my framed personalized map options here:https://www.etsy.com/shop/cartographika?section_id=19237762Here's everything you need to know:Your custom map artwork is printed on 8\" x 10”, 11\" x 14”, 12\" x 18\" or 16\" x20\" ultra premium fine art paper.We only use high quality archival inks and our paper has the ultimate thickness and feel with a slight watercolor texture.PLACING YOUR ORDER======================WHAT YOU RECEIVE WITH YOUR PURCHASE:A customized digital map art print that I design and create for you following your approval on a fine art paper. Frame is not included.Once you have made your selection complete your purchase by selecting Add to Cart and in the “Message to Seller” section at checkout simply tell me the following:1. Your two preferred locations:It can be a village, town or city – you choose!Please note I am generally unable to offer maps of specific addresses, streets or buildings.Most of my maps were printed before the 1950's - please bear in mind areas that have since been renamed or developed may not always appear on vintage maps.If in doubt please message me before placing a firm order to avoid disappointment.2. Your preferred text:It can be a name, date, quote, poem, line from a song, anything special & relevant to you.All text is created in an adapted font from an old 1930's typewriter and is used in my example photographs, but you can choose from 4 other fonts, just make your selection from the dropdown menu at checkout.Once I receive your order I will prepare a proof for you to review within 3 (business) days.Please be aware your order will not be printed or shipped until you have approved your design.All communication is conducted strictly via Etsy Messages to avoid any confusion.To send or reply to messages using Etsy Messages you need to either be logged into your account or using the Etsy App on your mobile device.My number one priority is for you to be happy with your purchase.Once you approve your map design I will carefully prepare and package your print for you.POSTAGE AND PACKAGING==========================Orders are packaged based on the product being shipped. Our smallest prints ( 11\" x 14\" and smaller ) are shipped in flat boxes.All items are fully insured and you have additional protection under the Etsy buyer protection scheme.QUESTIONS?============If you have any questions please don't hesitate to message me through Etsy or for more information please see the shop policies section here:https://www.etsy.com/uk/shop/cartographika?ref=profile_shopname#aboutNOTE: Frame shown is for display purposes only and not included as part of itemPlease see here for my framed options:https://www.etsy.com/shop/cartographika?section_id=19237762",
    "reviews": [
      "The seller was very communicative and sent a proof before printing to ensure everything met your expectations. I will definitely order again!",
      "Came in perfect condition and the seller was very helpful and communicative! Would definitely recommend 🥰",
      "Super nice customer service, love the gift!",
      "Exactly as pictured, I bought it for a wedding and it will be the perfect gift!!"
    ]
  },
  {
    "productId": "bRfoSsXh6N",
    "url": "https://www.etsy.com/listing/578959470/bridesmaid-tote-bags-maid-of-honor-tote?click_key=8511a08d9a76697ecbb52974fcf038e0f08746ae%3A578959470&click_sum=ef0d2b0e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-33&pro=1&etp=1&sts=1",
    "title": "Bridesmaid Tote Bags, Maid of Honor Tote, Personalized Bridesmaid Bags, Bridal Party Bridesmaid Gifts",
    "description": "This Bridesmaid Tote is Perfect for your Wedding Party!Surprise your Maid of Honor and Bridesmaids with this Perfect Gift!!Don't forget to get one for yourself!✨PREVIEW NAME OR TEXT✨https://app.fontvisual.com/showcases/5a07ffb5-10a1-410c-98e5-76da01f013f7♥ HOW TO ORDER ♥1) Select options for any Dropdowns (see photos for options)2) Enter information in the Personalization Box3) Click \"ADD TO CART\"4) Go back to listing and repeat as needed5) Confirm Shipping Address and Complete Checkout!♥ SIZING AND ITEM DETAILS ♥▹ Listing photos contain sizing, details, and color options.▹ Monogram is professional vinyl transfer.▹ Text is all lowercase; no special characters or capitals.♥ PROCESSING & SHIPPING ♥▹Shipping (re-shipment fee) must be purchased for packages returned due to incorrect address to be mailed again.▹ You will be emailed with shipping confirmation and tracking once your order ships.✧ PROCESSING ✧• Times vary by design style.• Please message us for accurate turnaround on a specific item.✧ SHIPPING ✧• Times are typically between 2-10 business days:• Shipping times are ESTIMATES ONLY; actual delivery time can be faster or may be delayed.• Holidays, natural disasters, and other special circumstances can delay delivery.• We are not responsible for shipping delays, and do not guarantee any specific delivery date.♥ CARE INSTRUCTIONS ♥▹ See package insert for all care instruction.♥ DISCLAIMER ♥▹ Verify all information including spelling and address before ordering.▹ Due to the nature of our items, we are unable to accept returns, exchanges.▹ Cancellations and changes can not be made to orders once purchased due to fast processing times.▹ Colors can vary from screen monitors to physical products.▹ For any Rush Order, we must be messaged for accommodation and purchase Rush Upgrade BEFORE ordering.▹ We are not liable for delays due to missing information, shipping delays, or any deadlines.▹ Read shop \"POLICIES\" for more information.♥♥ Any other question or concern, please message us directly! ♥♥",
    "reviews": [
      "Very happy with my purchase .",
      "Fast turn around , so excited",
      "Excited to give this to my bridesmaids"
    ]
  },
  {
    "productId": "uvYguNf9RU",
    "url": "https://www.etsy.com/listing/274110996/whiskey-stones-set-of-3-with-pouch?click_key=215b28d72f01a31a4c347be9550f30aa2d75468f%3A274110996&click_sum=5d76f147&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-34&frs=1&etp=1&sts=1",
    "title": "Whiskey Stones, Set of 3 with Pouch - Personalized, Engraved, Laser Etched - Monogram, Initials",
    "description": "SIZE: These stones are about .7 inches on all sidesPLEASE NOTE!: These DO NOT come with tongs included, but if we have extra we will send them along for free.This listing is for a set of 3 personalized and engraved whiskey stones.  It comes with a small black velvet pouch for storage.  These engraved stones' resulting initials are in a dark black color, per the listing image. Please note: due to the volume of sales that we do on this item, we have to source them from multiple suppliers, which sometimes leads to variation in hue. If the precise shade of gray of the stone, or the precise shade of black/grey of the lettering is important to you, please contact us first. We will be happy to show you a picture of the exact stones that we currently have in the shop.For stones with images on them, see our other listing:https://www.etsy.com/listing/748719249/whiskey-stones-set-of-3-with-pouch-9Usually ships in 2-3 business days. Place your order now and in your order notes describe what you want engraved on each stone. Our designers use a standard font that works on these stones and they are sent directly to production, no proof required. Please let us know if you would like something other than text in your buyer's notes and our graphic specialist will get back to you with a digital proof.These sipping stones are dark gray cubes of solid granite that will keep your liquor chilled without diluting it. Unlike ice, sipping stones are odorless and tasteless. Adding sipping stones to your favorite bourbon or scotch will keep the spirit cold longer without affecting its taste.Whiskey stones are the perfect gift for the refined connoisseur of spirits.This stone's edges are slightly rounded as to not scratch the bottom of the glass.Customs and import taxesBuyers are responsible for any customs and import taxes that may apply. We’re not responsible for delays or charges due to customs.PLEASE WASH THOROUGHLY BEFORE USE!Care:-Rinse the stones in warm soapy water- Let dry completely- Place in freezer for at least 4 hours",
    "reviews": [
      "It is a very good quality item",
      "great! they turned out so well!",
      "The engraving was clean and it came super fast."
    ]
  },
  {
    "productId": "IeFjFLDNhq",
    "url": "https://www.etsy.com/listing/1013986230/gift-for-newly-engaged-couple-print?click_key=ae1377ec2aca5f4ef695e8e876b102e89350612c%3A1013986230&click_sum=213b0aaa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-35&frs=1&etp=1&sts=1",
    "title": "Gift for Newly Engaged Couple Print, Watercolour, Personalized Engaged Gift, Engagement Map Gift, Gift for Husband, Map Print, Wall art",
    "description": "A personalised map print is the perfect engagement gift for newly engaged couples, friends, family, or your forever partner.Other gifts may be forgotten, but a custom map gift will be remembered for years to come.A personalized location print captures your special moments and most treasured memories, designed to match your home decor and style.Gift ideas and tips:If you’re looking for… an engagement gift for your friend, engagement gift for couple,  engagement gift for your son or an engagement gift for your daughter:Use wording such as: Engaged, Engagement, She Said I Do, He Said I Do, ‘I Do!’___________________________________❯ PRODUCT AND SIZE DETAILSDIGITAL DOWNLOAD is a PNG file sent to your email, for you to print at your leisure.UNFRAMED PRINTS are available in a range of sizes and printed on 200gsm premium matte paper with archival inks. No frame is included.FRAMED PRINTS are sustainably-sourced timber frames and printed on 200gsm premium matte paper with archival inks.CANVAS PRINTS are printed on high quality canvas attached to a sustainably-sourced wood frame, mounting kit is included.___________________________________❯ SHIPPINGWe offer free standard tracked shipping worldwide, express shipping is available for some products upon request. All products are shipped in protective packaging and strong boxes/tubes to ensure no damage during transportation. We use a range of shipping providers based on destination, with most orders fulfilled in the receiving country to reduce our carbon footprint and ensure fast delivery. Please refer to shipping estimate times in the delivery section of this page.*As always, during Covid-19 there may be delays that are out of our control.___________________________________❯ DESIGNAs every location is unique, some may not look the same as shown due to terrain/roads. We will do our best to work through your design with you. For remote locations we suggest our circle or watercolour maps___________________________________❯ RETURNS & EXCHANGESAs this product is made to order, we only accept returns for products damaged upon arrival. Please contact us with any issues regarding your order and we will do our best to help!___________________________________❯ SHOP OUR STOREwww.etsy.com/shop/Markyourmoment",
    "reviews": [
      "Loved the final product :)",
      "Amazing and so special, she was great to work with!",
      "Love that I got a preview prior to shipping. Highly recommend- perfect customized gift and excellent customer service. The shipping was pretty quick too!",
      "Great idea for a wedding gift!"
    ]
  },
  {
    "productId": "O9wDXIpfEz",
    "url": "https://www.etsy.com/listing/517648654/personalised-drink-coasters-alcohol?click_key=cda2a4d669aeee7d6f3dccdf5597f7d7c2d37ff4%3A517648654&click_sum=295284ed&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-36&etp=1&sts=1",
    "title": "Personalised Drink Coasters, Alcohol Drinks Gift, Christmas Present, Bridesmaid Gift Bag, Drink Mat With Name, Stocking Filler, Family Gifts",
    "description": "These personalised drinks coasters feature your friend's or family's names, and their favourite drinks. They work for Christmas gifts for the family, for bridesmaid gifts, or for secret santa presents!I have A LOT more drink designs, this page just shows a small selection. Please see all my drink coasters here:https://www.etsy.com/uk/shop/giftingmoon?ref=seller-platform-mcnav§ion_id=21387976Add your coasters one at a time to your cart, and check out once you've finished selecting them all. Make sure you double-check your spelling of the names as the coaster will be printed as per your spelling.There is also a choice of Hard Backed or Cork Backed coasters - the Hard Backed Coasters are 9cm Square (3.54\") by 0.3cm (0.12\") deep, the Cork Backed coasters are 9.5cm (3.74\") square by 4mm (0.16\") deep. Both have an MDF core, and rounded corners. The images on the coasters are sublimated on using a special coating and inks and paper, so they are very durable, and can be wiped clean with a damp cloth.If there's any drinks that you can't find a match for in my shop, please message me to ask if it's possible.*I try to make the photos show the colours as best as possible, but all screens may display colours a little differently.*REFUNDS/RETURNS - this product is personalised (custom-made), so it is NOT eligible for refunds or returns, unless there is something wrong with the item (e.g. if it's damaged or I've made a spelling mistake). You can't return it just because it arrives late due to postal delays, so please order with plenty of time to spare. If there's any problems with the product do get in touch, I will always correct damage / my mistake if I've made one.",
    "reviews": [
      "Lovely little gift to give",
      "Gave it to my friend as a gift she absolutely loved it",
      "Fantastic product would recommend thank you 😊",
      "Birthday present for my cousin she's going to love it especially with the bottle of gin!! Thanks"
    ]
  },
  {
    "productId": "rQlXPGImop",
    "url": "https://www.etsy.com/listing/1279672331/custom-crayons-crayon-name-set-for-kids?click_key=06b69f662712b304800140e80e34e14f434a9739%3A1279672331&click_sum=5bc12311&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-37&etp=1&sts=1",
    "title": "Custom Crayons - Crayon Name Set for Kids, Alphabet Name Crayons in a Gift Box, Crayon Toy, Birthday Gift Kids, Holiday Stocking Stuffer",
    "description": "Rainbow crayons are the perfect addition to your holiday gift idea for the family and custom art supplies for kids. Make your birthday presents pop with color with our personalized crayons! If you are a teacher looking for a holiday present for students, a custom crayon name set is a colorful surprise.Our high-quality, best-selling Original Rainbow Crayon® Name Sets are the perfect birthday, thank you, or stocking stuffer!  We ship fast with FREE domestic shipping on orders $35 or over!The Original Rainbow Crayon® was the first shop to create a personalized crayon name set and have been a part of the Etsy community since 2007.As Seen In:*Magnolia Journal*Martha Stewart*Business Insider*The Washington Post*NBC News*Forbes*The Drew Barrymore Show*Etsy Design Awards Finalist- Kids Category*Good Morning America*Today*USA Today*Redbook Magazine*Midwest Living*US WEEKLY*Best Products*People*Buzzfeed*Southern Living*Parents Canada*Cool Mom Picks*Today's Brideand more!This listing is for 1-4 Rainbow Crayon letters in a gift box with the name or word stamped on the front of the box. Additional letters can be added when checking out from the drop down menu.**PLEASE READ ALL INFORMATION BELOW FOR BOX SIZES v. NAME SIZES. There are 3 different sizes of boxes we use depending on how long the name is.Please mention the name or word you would like in the \"message to seller\" when checking out.Up to 5  letters fit best in the standard, long box (approx 8\"x2\" -as shown in \"JAYLA\" listing photo).6-8 Letters fit in the wider, rectangle box in two rows (approx 5.5\" x 4\"). See photo of CAMERON or PENELOPE in the listing for box size.Due to limited space in the jewelry boxes, any name over 8 letters will be placed in a larger, (third size) 5\" x 7\" box and finished with the stamped name and rainbow yarn. We do our best to fit everything in the standard two sizes of jewelry boxes, but want to ensure safe shipping and prevent letters from breaking (especially names with letters M,W,N, which are wider).Our Original Rainbow Crayon® Letters measure approx. 1.5-2\", but will vary depending on the actual letter (\"M\" will be wider than the letter \"L\" for example)  - Not recommended for children under 4 due to parts that could break off.Colors for crayons will vary. Please click though photos to see the range of our work. Arrangement of color combinations will differ from set to set with variations of darks and lights. We do our best to accommodate color requests.Outside yarn/string on the box is typically rainbow colored or red/white combo depending on the time of year and is subject to change.**We are the Original Rainbow Crayon® shop on Etsy and the first shop to sell a handmade crayon. Thank you for supporting handmade! ***Follow our handmade crayon shop on  Instagram (@art2theextreme) for more Christmas gift ideas for kids and packaging examples of both sizes of boxes! **",
    "reviews": [
      "Perfect personalized holiday gift for the kids!",
      "Perfect personalized holiday gift for the kids!",
      "Perfect personalized holiday gift for the kids!"
    ]
  },
  {
    "productId": "GxzvEeybJZ",
    "url": "https://www.etsy.com/listing/1157986759/leather-toiletry-bag-personalized?click_key=7ab67ad9805ce49f26ce87514696ebc695cafe22%3A1157986759&click_sum=690e1a4c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-38&pro=1&etp=1&sts=1",
    "title": "Leather toiletry bag personalized groomsmen gifts leather dopp kit personalized gift for him mens dopp kit for men, unique letters",
    "description": "✦We can guarantee a timely arrival if you send a message with the deadline prior to ordering. Get this toiletry bag on time! You can call it dopp kit as well. As long as does its gift job ( or groomsmen gifts job). Yes, plenty of gift work can be done with these ABSOLUTELY GORGEOUS bags. Yes, you just read a SEO text, yikes!Give it a try, even if it's a matter of a week.________________________________________________________________________________________________________________Growing is forever. This is my latest creation so far.These leather dopp kits are every bit as great as you could think they are.I would like to emphasize on this little moment:The personalization is hot stamped (that's an old school technique and it's hard to do, and it's not laser engraved). Stamped leather smells great, and doesn't have an unpleasant laser burned smell).It's a man against the machine thing, so it's really important.✦SizeStandard:8,5\"x4,5\"x3,5\"Large (I'd prefer to call it huge, but it sounds a bit rash for an official name)9,5\"x6,5\"x4,5\"✦LeatherI use distressed top grain cowhide leather, of the best quality. It's solid, but very soft.The distressed nature allows it to age beautifully, writing down the life story of it's owner.✦MakingYou are in the maker's shop. These bags are cut and sewn from the very scratch.You receive an object made with warmth and personal care, coming from a small studio, where people laugh, joke, and listen to the good music.✦PersonalizeIt is branded with a custom name/initials.Branding can be done on the outside and/or on the inside.While adding an item to the cart,Choose option \"1 stamp\" if you only want it personalized on the outside or on the inside.Choose option \"2 stamps\" if you want it personalized both on the outside and on the insidePlease provide information about names, letters, monogram style, stamp color(plain/gold), personalization strip color in \"note to the seller\", at the checkout.✦ShippingUS: around two weeks since the day of your order. Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.Canada: around three weeks since the day of your order.Europe: between two and three weeks since the day of your order.Australia: between three and five weeks since the day of your order.Rest of the world: between two and four weeks.Multiple items are shipped for the price of a single one - pay for shipping only once!",
    "reviews": [
      "Excellent quality and fast delivery",
      "Excellent quality and fast delivery",
      "Bought for my boyfriend for Christmas and he loves and uses it all the time"
    ]
  },
  {
    "productId": "RRdIhPArOV",
    "url": "https://www.etsy.com/listing/1368355296/personalized-bbq-tshirt-smokehouse-bar?click_key=c2e2c208f7869b3306cc02f0c4344eb15d42ddd6%3A1368355296&click_sum=276e7c06&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-39&pro=1&etp=1&sts=1",
    "title": "Personalized BBQ Tshirt - Smokehouse Bar & Grill, Custom Meat Smoker Tshirt, Gift for Meat Smoker, Funny Grilling Accessory, Grilling Tshirt",
    "description": "This custom tshirt is the perfect gift for anyone who loves smoking meat...personalize it with the recipient's name and hometown!------------- FIT -------------This is a great staple t-shirt that complements any outfit. It's made of a heavier cotton and the double-stitched neckline and sleeves give it more durability, so it can become an everyday favourite. Please refer to the sizing chart in the product photos for exact measurements.------------- FABRIC -------------• Solid colours - 4.5 oz., 100% preshrunk ring-spun cotton• Heather Grey - 4.5 oz., 65% polyester, 35% ring-spun cotton------------- FEATURES -------------• Seamless ¾\" rib knit collar• Double-needle stitched sleeves and bottom hem• Tear away label and double-satin label------------- CARE INSTRUCTIONS -------------• Wash inside out• Machine wash in cold water• Tumble dry at low heat or hang dry for best resultsDO NOT: Bleach, dry clean or iron over design------------- SHIPPING  -------------• This item is made to order and will be processed in 1-3 business days and take 2-5 business to be shipped to its destination**Please feel free to message the shop with any questions!**",
    "reviews": [
      "My husband is going to love his Smoke House T-shirt!  Thank you!",
      "Such a cool shirt, perfect size and everything spelled correctly too. My boyfriend loves it.",
      "Great quality. Nice shirt overall"
    ]
  },
  {
    "productId": "DvPBaKneNF",
    "url": "https://www.etsy.com/listing/1236629988/personalized-drumsticks-in-wooden?click_key=b6910078485e8084bc26cbe52a9cacda601860e5%3A1236629988&click_sum=0372b8a6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-40&etp=1&sts=1",
    "title": "Personalized Drumsticks In Wooden Giftbox - Engraved Drumsticks -  Drummer Gift",
    "description": "Gift your favorite drummer this engraved drumstick set: both drumsticks and the wooden box can be engraved with a completely custom message! Wish them luck, quote their idol or commemorate your inside joke. It will put a smile on their face every time they play.Choose between different frame designs and fonts (shown in the last two pictures).---- How To Order ----1| Select your option for the wooden giftbox2| Select a font for your engraving3| Add your personalization & frame choice in the text box below the drop down menus(NOTE: If you do not choose a frame, we will use the frame pictured in the product photos.)4| Proceed to checkout---- Product Details ----- Wooden box dimensions (outside):Length: 43cm // 16.93 inchWidth: 7cm // 2.76 inchHeight: 3.5cm // 13.78 inch- Drumstick size: 5A- Material: MapleWithout engraving, the product is shipped within 2 business days. Shipping of a product with engraving can take up to 3 business days.Tracking info is included with all our shipments.We offer express shipping: if you're interested, please contact us for more info and pricing.",
    "reviews": [
      "Item was perfect! Thank you for the work and wonderful communication!",
      "Love, love, love! BEST Personalized gift ever!",
      "The box and the sticks are absolutely beautiful. My boyfriend loved them and even teared up. We had an issue with the package getting stolen when transporting, and the seller was absolutely incredible and helpful with getting it resolved. So personable and kind. They made a stressful experience bearable!"
    ]
  },
  {
    "productId": "hnpuknzfOm",
    "url": "https://www.etsy.com/listing/986843242/personalized-leather-dopp-bag-distressed?click_key=eeb865d70109d1ebf1ff4c3d1ed30f3ba2922d4c%3A986843242&click_sum=f37c276c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-41&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather Dopp Bag, Distressed Full-Grain Leather Men's Travel Kit, Boyfriend/Husband/Anniversary Mother's/Father's Day Gift",
    "description": "Elevate your travel with our Personalized Distressed Leather Dopp Kit Bag. Made with 100% full-grain leather, the highest quality grade of leather, this bag is the perfect companion for any man on the go. The top layer of cowhide leather includes all of the natural grain, giving it an authentic appearance that only gets better with time. The leather also has a natural smell that adds to its appeal.This stylish bag comes with a handle for hanging anywhere you desire. The interior is lined with nylon linen, providing a protective barrier against oil and cream spills. It's easy to clean, too! The bag also features three pockets on the inside, one of which has a zipper, for added convenience and organization.Make it personal by adding a special touch. Surprise your father, son, boyfriend, or husband with this thoughtful gift that can be engraved with their initials on the front or text inside. We offer two different sizes, Standard (8\"x4\"x4\") and Large (9\"x4.5\"x4.5\"), and two color options, Brown and Chocolate Brown. Don't forget to select your preferences at checkout.To make sure you receive your Dopp Kit Bag in a timely manner, we offer shipping upgrades at checkout. If you have any special requests for engraving options or placement, please let us know in the personalization section. If you would like your initials or text to be engraved in all capital letters, please specify so in the personalization section.STANDARD SHIPPINGUNITED STATES - USPS First Class Mail• 3 - 5 Business Days• Includes TrackingCANADACanada Post Standard Mail• Typically takes 3 - 8 Days• Includes Tracking.",
    "reviews": [
      "He liked the item, thank you",
      "Bought for my boyfriend’s birthday as he’s been wanting a nice, high quality bag for travel. Absolutely amazed by the quality and fast shipping. Will purchase from seller again!",
      "Highly recommend! It shipped arrived 2 days after I ordered and it was personalized! Really nice quality!"
    ]
  },
  {
    "productId": "CGnNveLDSS",
    "url": "https://www.etsy.com/listing/575254502/6th-anniversary-gift-iron-bowl-with?click_key=7141b57c6f177602e797ac5f848c93608c463214%3A575254502&click_sum=d01e90e1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-42&frs=1&etp=1&sts=1",
    "title": "6th Anniversary Gift - Iron Bowl with personalised message - Iron jewellery dish for her - Hand Forged metal catch all dish for him",
    "description": "Our customers love this beautiful medium sized Iron Bowl. It's the perfect 6th Iron Anniversary gift for your Husband or Wife. Great size for watches, keys, jewellery, loose change... The perfect catch-all.We use a Victorian Fly Press, easily the oldest member of our forge, to form and shape the red hot metal, the result is a stunningly modern and contemporary look, and our customers love it!Prefer a more traditional hammered Bowl?https://www.etsy.com/listing/1063200798/Each metal Bowl has a flattened base for stability and will sit neatly on your nightstand, mantlepiece, office desk or entrance table.Got something you'd really like to say? You can customise your Bowl with up to 100 characters of text, this could be a special date or a thought provoking message - your choice! We use individual vintage punches to stamp your message on the Bowl.Can't wait? Check out our ready to ship Anniversary Bowlshttps://www.etsy.com/listing/1054710611/Select 'Natural' text for a subtle, beautifully understated  look , the text will be the same colour as the bowl. To make your message stand out select 'Highlighted' - We use a metal infused light grey wax to really make a statement.The forged Bowls are treated with several coats of 'Renaissance Wax' to create an attractive and protective patina. The real beauty of the iron shines through.Each Bowl is 'signed' on the base using the Coach House Forge makers mark. Interestingly, each bowl rings like a bell if tapped on the rim - used to announce dinner time in our house!Bowl dimensions:* 5 1/2\" (140mm)  in diameter.* 1 1/4\" (35mm) high.* Forged from 1/8\" (3mm) iron stock.* Weighs approx. 1Ib (400g).⚒️Keep your bowl looking its best with our own Coach House Forge Care Kit 💖https://www.etsy.com/listing/1287439488Want a larger bowl? Please follow the links:https://www.etsy.com/listing/558789713/https://www.etsy.com/listing/616933545/✒️HOW TO ORDER :✔ To add your own text to a bowl; compose your message and count the number of letters, symbols and numbers, then select the correct option at checkout i.e. if your message has 15 characters select the 11-20 character option.✔ Select whether you'd like your text highlighted or not ( please refer to the photo gallery for a view of the 2 options)✔ Send us your personalisation using the Personalisation Tab on the listing page.✔ We will stamp your message along the *inside rim* of the bowl unless otherwise instructed.>> If your message is over 100 characters long please contact us for a custom quote, or, just contact us with your request and we'll get back in touch with you.*  Select whether you'd like your text left Natural or Highlighted.If your message is over 100 characters long please contact us for a custom quote.Alternatively, just contact us with your request and we'll get back in touch with you.Whether it's simply a special date, set of initials, or a inspirational quote the choice is yours! Choose wisely, its permanent!_________🌍📦 SHIPPING & MAKING TIMES 🚚✈️[⌛ Business  Days] Processed in 1-3 days♚ Shipped within the UK 1st class TRACKED 1-2 days🌍 Shipped World-Wide using standard tracked postage, 5-10 Days.For shipping to other international destinations please contact us for a price.Options of tracked & express shipping available at the checkout.⚠️ If you choose expedited shipping please provide your 📞 Mobile number for the manifest or to receive text updates.NB: Expedited shipping options don't quicken the manufacture time although we do our best to prioritise those who have.❌ Estimated shipping times are not guarantees=================This listing is for 1 bowl.In-door use only.Please note: the metal may exhibit differences in colour and texture, which makes  it completely unique: No two are ever alike, that's the real beauty of handcrafted metal!",
    "reviews": [
      "Great gift for a 6th Anniversary.  It's a good little memnto and useful as well. Company did a great job ensuring iit met the requested delivery target!",
      "So good to hear, Laurie! Thank you so much for the great review.",
      "Very nice! Just as I ordered",
      "Good. Thanks, Jake.",
      "Fast turn around, exactly what I wanted. Sure to be a dynamite gift.",
      "Quick delivery despite it being Xmas holiday season. Quality item in nice packaging."
    ]
  },
  {
    "productId": "2xTuFOclws",
    "url": "https://www.etsy.com/listing/1506867825/custom-pet-mug-personalized-dog-mug-dog?click_key=753044c2263b770c372dd49c92e074005454bcab%3A1506867825&click_sum=99998b4b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-43&pro=1&frs=1&etp=1",
    "title": "Custom Pet Mug Personalized Dog Mug Dog Coffee Cup Personalized Pet Mugs Custom Cat Mug Dog Dad Mug Dog Mom Mug Dog Gift Cat Gift",
    "description": "Start your day with a heartwarming smile and a warm cup of love with our Personalized Pet Drawing Mug. Order now and let us transform your pet's photo into a cherished work of art that will brighten your mornings and warm your heart!If you're interested in ordering a custom pet mug, simply place your order and message me with a clear photo of your dog or cat and I'll take care of the rest. You'll have one-of-a-kind pet mug that not only looks great but also showcases the special bond you have with your pet.🐶  HOW  TO  ORDER  🐶1. Select your Color from the drop-down menu.2. Choose your size and number of pets.3. Type in you pets name and the font you would like. ( Default font: Handwriting)4. Please send a photo after you've made the payment via Etsy messages.5. Within 24 hours we will send you a high-resolution PNG file as a preview.6. After your confirmation, we will print it and ship it to your address. 😊🐶 PHOTO - GUIDELINES 🐶- Select a high-resolution photo of your pet. Photos with your pet sitting up in front of the camera will work great.- Lighting is important. Please send photos that are taken on a sunny day or in a well-lit room. We will need to see the specific details of your pet.- A close-up of your pet sitting or standing is best. This will create a higher quality result compared to your pet lying down.🐶 PERSONALIZED PET MUG FEATURES 🐶- MICROWAVE-SAFE - Mug can be safely placed in microwave for food or liquid heating.- DISHWASHER-SAFE - Suitable for dishwasher use.- VIBRANT COLORS - The latest printing techniques provide bright and crisp colors.🐶  AVAILABLE  SIZES  🐶- 11 oz- 15 oz- 20 oz🐶 RETURN POLICY 🐶Unfortunately, since this is a custom pet portrait, we can't offer returns. If there's a production defect, please contact us.©Printedways / All designs associated with these listings are created by and property of Printedways. Digital files associated with these listings are for personal use only and should not be duplicated or shared in any way",
    "reviews": [
      "I have friends who’ve purchased, but I haven’t been able to get a picture of my nieces’ fur baby to finish this transaction.",
      "The process was simple and fast. The printed mug looks beautiful and is a great gift for anyone. The shipping did not took long either which is always greatly appreciated. The costumer service was great and I will definitely be ordering more from things from this shop.",
      "Turned out wonderful! Seller was very responsive to messages. Highly recommend.",
      "The dog is perfect! I loved that it was crisp!"
    ]
  },
  {
    "productId": "XiTeMFkZlW",
    "url": "https://www.etsy.com/listing/944693827/this-nanny-belongs-to-grandmother-nana?click_key=223f15e894253f1e538869f70053551d049156c0%3A944693827&click_sum=aa74d4fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-44&etp=1",
    "title": "This Nanny Belongs To, Grandmother Nana Grandma Gift, From Kids, Granny, Mothers Day Gift, Gift for Her, Personalised Engraved Gift, Birthda",
    "description": "Engraved personalised keyring. This Nanny/Nanna/Nan/Grandma (etc) belongs to...Please ensure that you leave the required names for the tags on the notes to seller at checkout.Disc is approx. 30mm and name tags 40x10mm. They are made from stainless steel.PACKAGING OPTIONS:All orders will be attached with twine to our logo backing cards, wrapped in tissue paper, sealed with a sticker and popped inside a lovely organza bag already to gift as standard.Alternatively you can purchase one of our beautiful white gift boxes via the relevant shipping upgrade.",
    "reviews": [
      "Great item and delivered very quickly. Would have been great to have a note on the outside of the packaging to say which item it was I bought multiple.",
      "Great item and delivered very quickly. Would have been great to have a note on the outside of the packaging to say which item it was I bought multiple.",
      "Great item and delivered very quickly. Would have been great to have a note on the outside of the packaging to say which item it was I bought multiple."
    ]
  },
  {
    "productId": "riXWJHzLUg",
    "url": "https://www.etsy.com/listing/1264969441/letterpress-stationery-card-w-envelope?click_key=f4cc6fa6bcf65d45803049e3187babbc363662bd%3A1264969441&click_sum=9504f644&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-45&pro=1&frs=1&etp=1&sts=1",
    "title": "Letterpress Stationery Card w/ Envelope | 4.25x5.5\" | Custom | Notecards | Business Stationery | Gifts for Her | Personalized | Wedding Gift",
    "description": "• Premium, thick, 110# white cotton paper• Measurements: A2 Card (4.25x5.5”)• Comes with matching white envelopesEach card is hand printed and embossed with an impression using a 19th century letterpress.These personalized letterpress cards can be printed with a name or a business logo. Choose the number of cards with envelopes you'd like in your set from the drop down menu as well as whether you'd like the return address printed on the envelopes.The Ordering Process1. Chose your ink color from the first drop down menu2. Choose your card quantity from the second drop down menu3. Fill out the personalization with the required values.• A digital proof will be sent for your approval before the cards are made• Ships in 1-2 weeks",
    "reviews": [
      "Loved the cards and quality of the letterpress!",
      "Gorgeous product, great communication, fast shipping, high quality. Can't recommend this shop enough :) We are so excited to use these for our wedding thank you cards. Thanks Mackenzie!",
      "Mackenzie has EXCELLENT customer service. She responded very quickly to my questions. The resulting stationery is beautiful and beyond elegant and classy. Simply GORGEOUS!",
      "The quality is what I hoped for. Really great. I’ll be proud to use this to write personal notes!"
    ]
  },
  {
    "productId": "hfNSEDtxgZ",
    "url": "https://www.etsy.com/listing/1225598183/blanket-hat-set-personalized-plush-minky?click_key=809b765d9606eaf7a18720437e45f9deaf63db8d%3A1225598183&click_sum=d4ed11d6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-46&pro=1&etp=1&sts=1",
    "title": "Blanket & Hat Set - Personalized Plush Minky and Baby Hat",
    "description": "Classic, adorable, and perfectly giftable, this personalized blanket and hat set is perfect for baby shower gifts, coming home outfits, newborn hospital photos, or for everyday use.This listing is for a personalized set that includes 2 items:1 WHITE plush minky blanket with color text1 COLOR stretchy jersey hat with white textChoose your font and color from the drop down menus. The text color on the blanket and the background color on the hat will be in the chosen color. If you want other color options please see our shop and order from our other listings. Hope this helps!Font preview (type into your browser): www.sugarhouseshop.com/products/previewThe Paige set is in ballet pink with the \"Apricots\" font.----- ITEM DETAILS ------ Plush Minky blanket measures 30\" x 40\"- Blanket has white background with color text- Buttery-soft jersey hat fits newborns, but will stretch up to 3-6 months- Items are easy to launder and maintain their softness after washing- Vibrant, permanent colors will not fade- Durable and machine washable (see care instructions below)----- HOW TO ORDER -----Select your color and font from the drop down menus, then leave us a comment in the personalization box with the name you would like printed on your blanket and hat. Please note we are limited to 12 characters for this set.Please double check spelling and enter your name exactly as you'd like it printed. For example, if you would like all lowercase or all uppercase please type that in your comments.You can preview your baby's name with the different font and color options here:www.sugarhouseshop.com/products/preview----- PROOFING POLICY -----We will print your order exactly as entered. Please review spelling carefully.Because each font and name combination varies, please double check the preview page on our website to make sure you are happy with the font choice before completing your purchase here on Etsy. We do not send proofs unless requested.----- CARE INSTRUCTIONS ------To keep the fibers soft and silky over time, it is very important to avoid fabric softeners when washing this blanket. Many laundry pods contain softeners, and we recommend not using laundry pods for this item.Blanket care:- Wash with detergent only, no fabric softeners- Wash with like colors only (whites)- Tumble dry low and remove promptlyHat care:- Spot clean or machine wash with no fabric softener- Wash with like colors- Lay flat to dryBlankets are designed and finished at our shop in Utah using imported materials. 100% polyester minky.Hats are made at our shop in Utah. 95% polyester 5% spandex double brushed jersey.",
    "reviews": [
      "Soft blanket the hat is cute",
      "Looks great and just as described",
      "It was a gift and the mother and father love it",
      "Loved my items, thanks so much!"
    ]
  },
  {
    "productId": "uf7EgxBHQY",
    "url": "https://www.etsy.com/listing/1249219263/floral-daisy-girls-personalized-name?click_key=666609ec95b93f6893d52fa90415943cec718a91%3A1249219263&click_sum=d3b194bf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-47&pro=1&etp=1&sts=1",
    "title": "Floral Daisy Girls Personalized Name Sunglasses | Toddler Gift | Kids Gift | Babies Gift | Personalized Kids Sunglasses With Leather Case",
    "description": "Personalized Kids Sunglasses🔴IMPORTANT NOTE: This listing is for a single  UV Lens Kids Sunglasses of your choice.Details🖤Handmade Item🖤Black Letters on White beads🖤Materials: UV Lenses - Sturdy Plastic🖤Size:  Lens Width: 50 mmLens Height:52mmTotal width:132mmBridge width:10 mmLeg length :125 mm🖤Made to Order🖤All sunglasses come with modern beautiful leather case.✨ AN ADULT SUPERVISION HIGHLY RECOMMENDED FOR KIDS UNDER 3 DUE TO SMALL PARTS (CHOKING HAZARD)💎 Please double check spelling and all details of the order before placing your order. Since each sunglass is custom made, all sales are final and no refunds will be issued. Please enter personalization details( on personalization box). The maximum of 12 letters for each sunglasses.Please let us know if something arrived damaged or there any problem. We will immediately take an action to correct the issue. Customer Satisfaction is our priority🔷Our Personalized sunglasses Perfect for a vacation , beach, birthday gift or party, spring , summer , and photoshoot.Thank you",
    "reviews": [
      "Bought these for my flower girls and they absolutely loved them!",
      "Can’t wait for my girls to wear these !!",
      "Can’t wait for my girls to wear these !!"
    ]
  },
  {
    "productId": "iKUWsMlxVk",
    "url": "https://www.etsy.com/listing/1128727513/personalized-turkish-towel-personalized?click_key=8b59eb252e501016ecb36104dfe1f87f049119f4%3A1128727513&click_sum=5bf6ad40&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-690479-11-48&pro=1&etp=1&sts=1",
    "title": "Personalized Turkish Towel, Personalized Gifts, Beach Towel, Bachelorette Party, Gift For Her, Bulk Towel, Cotton Towel, Bridal Shower Gifts",
    "description": "Turkish Towel, Personalized Gifts, Mothers Day Gifts, Beach Towel, Tea Towel, Bachelorette Party, Gift For Christmas, Beach Blanket, Bulk Towel, Bath Towel, Wedding Favors, Cotton Towel, Beach Blanket, Party TowelsSize:Beach Size: 40x70 inch(100x180 cm) the size change +-2 inchWeight: 400-420 grams.Hand Size: 20x40 inch(50x100 cm)Weight :100-110 gramsMaterial:CottonThere are small  tonal differencess.HOW TO ORDER:First, specify whether it is embroidered or not.As a second step, if you wish and want to embroider, write the name you want in the personalization box and add it to the shopping cart.---------------------------------------------FREE SHIPPING OVER $35---------------------------------------------------*****I CAN DO YOUR EMBROIDERY .*****PLEASE ADD YOUR EMBROIDERY DETAILS CLEARLY.(FONT AND THREAD COLOR)****** PLEASE ADD YOUR ADDRESS .I DONT ACCEPT POBOX. IF YOU ADD POBOX YOUR TOWELS MAY LOST. THE BUYER ARE RESPONSIBLE THEIR ADDRESS.****** IF YOU HAVE ANY PROBLEM YOUR PRODUCTS PLEASE CONTACT TO ME 7/24.CARE INSTRUCTIONS*Please soak the towels 12 hours in cold water before the first use*Dry them with sun light*Please do not touch them heavy chemicals*Your towels will be more softener after 2-3 washing*Please wash them maximum 86 Fahrenheit (30 degress)*Embroidery towels may have puckering. It will straighten out when ironed.( In order not to reflect the increase in shipping prices to you, we wrap the packages very tightly. We advise you to be careful when opening packages.)TURKISH TOWELS are not thick as traditional towels. They are thinner than towels. But absorbent ,take less space and dry quick.THANK YOU FOR YOUR INTEREST.",
    "reviews": [
      "Great communication. Product is recommended.",
      "Great price, Great Customer service, Great product.",
      "Thank You 💖",
      "Feels higher quality than other similar towels I’ve purchased",
      "Thank you very much💖",
      "I really like how well these towels washed the first time. Very soft and a bit thicker than I expected but still trim as desired."
    ]
  },
  {
    "productId": "jqOUvKoUqR",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=b97adf86363e0fc14dd06068ee8522166ca01dda%3A747068567&click_sum=729c7c18&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Would recommend this is a great gift",
      "I paid extra for this to be delivered by Christmas--and it came early :) Great responsiveness and its beautiful.",
      "The best! A great housewarming gift"
    ]
  },
  {
    "productId": "oeqGVJcbZj",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=4dae50a9961c37400fd46a7c164b6518c8ae7419%3A1115114382&click_sum=4992e3e9&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "ESMvfFTNlC",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=e548e83554b5e6118a62c2817ccecfeb285da635%3A654638870&click_sum=492ef43e&ref=search_recently_viewed-3",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "FNA7YoGaao",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=4e1c8e45fb591d48ec286029b5e241ead3b187d9%3A1355783916&click_sum=acd7651a&ref=search_recently_viewed-4&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!",
      "This amazing hand sketch really captures the soul and spirit of the loving couple - thanks to the wonderful work of M Gokhan who was able to  catch every nuance of expression in the original photo  - a beautiful memory to cherish!!"
    ]
  },
  {
    "productId": "pjlUyLgxxS",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=a6509e05694cdc61b98070d54e2720aae4be2748%3A1411614241&click_sum=1372f2b4&ref=search_recently_viewed-5&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "qRgAovS6Un",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=9d6775a0a9bd2a2ef3ad8ad9f89de16baa1c665c%3A999136086&click_sum=8c6f3545&ref=search_recently_viewed-6",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  }
]
