[
  {
    "productId": "cfXEFUrkIF",
    "url": "https://www.etsy.com/listing/865745504/personalized-family-name-metal-sign-last?click_key=f0239bf09ce21d034b91e6bcad5b960e99575efa%3A865745504&click_sum=b5d07af3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-1&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, Anniversary",
    "description": "01.07.24 Update! Thanks to our amazing clients we had an increase for December of over 50% vs last year! It caused a few delays in shipping with us and UPS but as of 01.10.24 we'll be back to our 24hr shipping as usual!!Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, AnniversaryUSMC Veteran owned/ran shop, cutting and hand finishing steel made right here in the USA from a 200 year old family owned steel mill!Our full line of monograms:https://www.etsy.com/shop/Crosswoodworks?ref=seller-platform-mcnav§ion_id=26441026Monograms are NOT created the same, please, please look at the lines in the design for character, smooth flowing lines, depth of wider areas back to thinner areas. I customize EACH and every one, even tho they look like the others, they are not. When you look at the details, you will see the difference, even in the computer generated version which I'm using first to get these listed for my clients as fast as possible! Multiple fonts coming in block, script, serifs, modern. Hundreds of new designs over all in 2023 for monograms, address plaques, name plaques, ornaments, bottle openers, verses, phrases, all in multiple fonts for each phrase in multiple finishes, all cut and shipped via UPS (the most dependable, fastest, damage free carrier we have ever used) within 24 hours or the following business day when ordered by noon!!NO MORE WAITING FOR WEEKS!! CUTS AND SHIPS SAME OR NEXT DAY WHEN ORDERED BEFORE NOON!! WE ARE CHANGING 95% OF THE FOCUS OF PRODUCTION AT THE SHOP TO STRAIGHT FORWARD METAL PIECES WITH THREE MAJOR DETAILS:1. Extremely fast cut and ship that no one else offers2. 10\" - 96\" sizes that no one else offers3. Focus on excellent quality that our clients have come to expect in every hand finished piece that we touch. We do ourabsolute best to earn your respect, and your business.For Monograms, please ensure that you fill in all of the appropriate info for each style design.Finish note: All finishes except for Rust are sealed with a 20 year uv/weatherproof industrial powder coat for interior/exterior/seaside/desert/ use in any environment you can imagine. Rust is true rust, not sealed.Dark steel patina and rust vary in color on every piece.We cut EVERY single piece out of 14 gauge cold roll carbon steel, from family owned steel mills right here in the U.S.A",
    "reviews": [
      "Amazing product.  Heavy duty.",
      "It is really nice we like it Thank You.",
      "Beautiful love it very much",
      "Wonderful design and quality craftsmanship. I got it for my husband to celebrate our 8th anniversary and he thought it was so awesome and he truly loves it. He said he hasn't seen nothing like it."
    ]
  },
  {
    "productId": "sDCUOKGtRe",
    "url": "https://www.etsy.com/listing/865745504/personalized-family-name-metal-sign-last?click_key=f0239bf09ce21d034b91e6bcad5b960e99575efa%3A865745504&click_sum=b5d07af3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-1&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, Anniversary",
    "description": "01.07.24 Update! Thanks to our amazing clients we had an increase for December of over 50% vs last year! It caused a few delays in shipping with us and UPS but as of 01.10.24 we'll be back to our 24hr shipping as usual!!Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, AnniversaryUSMC Veteran owned/ran shop, cutting and hand finishing steel made right here in the USA from a 200 year old family owned steel mill!Our full line of monograms:https://www.etsy.com/shop/Crosswoodworks?ref=seller-platform-mcnav§ion_id=26441026Monograms are NOT created the same, please, please look at the lines in the design for character, smooth flowing lines, depth of wider areas back to thinner areas. I customize EACH and every one, even tho they look like the others, they are not. When you look at the details, you will see the difference, even in the computer generated version which I'm using first to get these listed for my clients as fast as possible! Multiple fonts coming in block, script, serifs, modern. Hundreds of new designs over all in 2023 for monograms, address plaques, name plaques, ornaments, bottle openers, verses, phrases, all in multiple fonts for each phrase in multiple finishes, all cut and shipped via UPS (the most dependable, fastest, damage free carrier we have ever used) within 24 hours or the following business day when ordered by noon!!NO MORE WAITING FOR WEEKS!! CUTS AND SHIPS SAME OR NEXT DAY WHEN ORDERED BEFORE NOON!! WE ARE CHANGING 95% OF THE FOCUS OF PRODUCTION AT THE SHOP TO STRAIGHT FORWARD METAL PIECES WITH THREE MAJOR DETAILS:1. Extremely fast cut and ship that no one else offers2. 10\" - 96\" sizes that no one else offers3. Focus on excellent quality that our clients have come to expect in every hand finished piece that we touch. We do ourabsolute best to earn your respect, and your business.For Monograms, please ensure that you fill in all of the appropriate info for each style design.Finish note: All finishes except for Rust are sealed with a 20 year uv/weatherproof industrial powder coat for interior/exterior/seaside/desert/ use in any environment you can imagine. Rust is true rust, not sealed.Dark steel patina and rust vary in color on every piece.We cut EVERY single piece out of 14 gauge cold roll carbon steel, from family owned steel mills right here in the U.S.A",
    "reviews": [
      "Amazing product.  Heavy duty.",
      "It is really nice we like it Thank You.",
      "Beautiful love it very much",
      "Wonderful design and quality craftsmanship. I got it for my husband to celebrate our 8th anniversary and he thought it was so awesome and he truly loves it. He said he hasn't seen nothing like it."
    ]
  },
  {
    "productId": "cZKfoOiXIl",
    "url": "https://www.etsy.com/listing/1580151882/personalized-custom-name-blanket-3-sizes?click_key=74582476981d350039d11ccd9b921321dabab721%3A1580151882&click_sum=05e6006e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-2&pro=1&bes=1&sts=1",
    "title": "Personalized Custom Name Blanket, 3 sizes Fleece/Sherpa, 30+ Colors, Baby/Girl/Boy/Adult Blanket, Custom Gift, Personalized Blanket",
    "description": "Wrap Your Loved One in Warmth and Magic: Custom-Printed BlanketsEvery child and grownup deserves the warmth and comfort of a soft, cozy blanket that's uniquely their own. Our custom-printed blankets are designed to make bedtime and cuddle time extra special. Crafted with the softest materials and customizable with your loved one's name, these blankets are more than just a source of warmth; they're a canvas for dreams and imagination.Our blankets are printed in the United States onto a super soft minky fleece fabric that will stay plush and vibrant through a lifetime of washings.With our state-of-the-art shop, we can turn around orders in 1 to 3 days. Pick your perfect pairing of color and font style, supply the name, and you'll have an amazing gift that's truly one-of-a-kind in about a week!Notes* Our blankets are printed on one side, and the reverse side is a clean white color.* We will try to reach out if we notice any obvious typos or mistakes in our customization selections.* Machine wash cold, and tumble dry on low heat",
    "reviews": [
      "Great quality, quick shipping, much softer than expected. They look amazing!",
      "Great product, i would definitely recommend",
      "I got this as a gift for my son and he absolutely loves it. It arrived very fast and is great quality. Definitely recommend."
    ]
  },
  {
    "productId": "sAcC9UnHVH",
    "url": "https://www.etsy.com/listing/1297147140/personalized-controller-stand-headphone?click_key=28aff91961cac30caeae6e16eb98fdfab36f2d88%3A1297147140&click_sum=8b1c6965&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-3&pro=1&frs=1&sts=1",
    "title": "Personalized Controller Stand, Headphone Holder, Boyfriend Birthday Gift, Husband Anniversary Gift, Brother Gift from Sister, Man Gifts",
    "description": "The Personalized Wooden Controller Stand is a versatile desk organizer. A stand where you can put your controllers.♥ The Wood Controller Stand is a wonderful present for those who are gamers.✦ Compatible with all controllers. ✦All of our products are handmade so every piece of wood is UNIQUE!This is a high-quality Wooden Controller Stand made of natural birch plywood.This is laser engraved, not printing or painting.Wood is oiled and colored with organic natural oils. The texture of the product does not deteriorate. When you touch it, you feel the texture of wood.Select your design and fill in the personalization section.If you would like a custom design please contact us through Etsy Messages after your purchase. (Logo, Handwriting, Quote)Personalized Controller Stand, Headphone Holder, Boyfriend Birthday Gift, Husband Anniversary Gift, Brother Gift from Sister, Man Gifts",
    "reviews": [
      "Very nice, easy to assemble and arrived quickly",
      "Can’t wait to give this to my boyfriend. It’s great quality",
      "Fiancee birthdaypresent ! He’ll love",
      "My boyfriend loves it, it's beautiful and well made. Arrived much faster than I expected!"
    ]
  },
  {
    "productId": "qXkjOLNeCw",
    "url": "https://www.etsy.com/listing/703572695/leather-tote-bag-personalized-tote-bag?click_key=f396135ae9d1848efb2b07ff215946d52f6fdea7%3A703572695&click_sum=d1ff7af1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Leather tote bag, Personalized tote bag, Personalized leather tote bags for women, Top grain leather handbag tote personalized (or not)",
    "description": "✦We can guarantee a timely arrival if you send a message with the deadline prior to ordering.Give it a try, even if it's a matter of a week.________________________________________________________________________________________________________________✦ These leather totes are every bit as great as you could think they are.We make these totes from the very scratch. We choose exceptionally beautiful leather and step by step, it's gently transformed into one of your most durable everyday accessories.✦The inside doesn't have any pockets or linings - it's just the great leather, with no elements to break and tear.✦Sizes are shown and detailed in the listing pictures.✦LeatherI use distressed top grain cowhide leather, of the best quality. It's solid, but very soft.The distressed nature allows it to age beautifully, writing down the life story of it's owner.✦MakingYou are in the maker's shop. These bags are cut and sewn from the very scratch.You receive an object made with warmth and personal care, coming from a small studio, where people laugh, joke, and listen to the good music.✦Personalize. Because it's free!The bag is branded with a custom name/initials/monogram.Branding can be done on the outside and/or on the inside.Please provide information about names, letters, monogram style, stamp color(plain/gold), personalization patch color in \"note to the seller\" at the checkout, or in the \"Personalization\" field before the checkout.Please note that personalized bags cannot be returned. But as you can see from our customer's feedback, there would be no reason for the return.✦ShippingUS: more or less two weeks since the day of your order. Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.Canada: around three weeks since the day of your order.Europe: between two and three weeks since the day of your order.Australia: between three and five weeks since the day of your order.Rest of the world: between two and four weeks.",
    "reviews": [
      "Wonderful product! Would buy again",
      "I love my bag so much!",
      "Great item … quality and service was great."
    ]
  },
  {
    "productId": "RphaovvUin",
    "url": "https://www.etsy.com/listing/1466485536/personalised-memory-film-acrylic?click_key=fbfc164a447a74d8c32eb37d09c0354409e085e8%3A1466485536&click_sum=f564019b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalised Memory Film Acrylic, Personalized Camera Roll Gift Our First Trip, Couples Gift Bestfriend Gift, Meaningful Valentines Day Gift",
    "description": "PLEASE CUSTOMIZE YOUR DESIGN:-Choose the plaque size: 4.6 × 8\" or 4.6 × 10\"-Choose your stand: Wooden, Acrylic, Mini Easel-Message us your photos you want to see in design.We create custom and handmade clear acrylic gifts for your most special days! This designs are a complete game-changer! Acrylic is a great material to place on your desk for long years since it is lighter than glass and it keeps its transparency and shines over time. Further, you can use it safely with children, since it does not break like glass, nor contains any harmful chemicals.What Will You Get In Your Package?-A clear acrylic plaque with your personalized design-StandDo you have further customization ideas? Or do you have more questions about personalization, customer service, or shipping? Just contact us via Etsy message. We would be more than happy to help you :)Why Should You Choose Us?• High Quality - We use high-quality products in every production step. We check every package just before the shipment one by one!• 100% Personalization & Customer Satisfaction - We arrange all the orders individually. We apply all the changes to the designs you require to get 100% customer satisfaction. We do not send any of the designs to production if the customer did not approve them.• Fastest Service - Since we are a local shop, the shipment doesn’t last more than a few days!• 24/7 Customer Service - We are always here to assist you! We do not care about the day or the hour. Do you have questions? Just send us a message, we will reply to it in a few hours :)",
    "reviews": [
      "Absolutely unbelievable product!!! The quality is amazing. I placed my order on a Friday & my order arrived the following Tuesday…. To IRELAND might I add!!",
      "This is great. The pictures look amazing!",
      "Turned out amazing. I love it",
      "This product is such a fantastic gift, I’ve ordered two now & gotten the same fantastic shipping, communication & quality!"
    ]
  },
  {
    "productId": "OzWuggWzHm",
    "url": "https://www.etsy.com/listing/578732817/rose-personalized-blanket-custom-baby?click_key=229829fda16fd3d34b28e7c0a52cd7c0891a2112%3A578732817&click_sum=fd4f6c8d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-2&pro=1&frs=1&etp=1&sts=1",
    "title": "Rose Personalized Blanket, Custom Baby Blanket, Baby Shower Gift, Rose Nursery Blanket, Crib Blanket, Newborn Photos Prop, BB10",
    "description": "Baby BlanketThis blanket makes a perfect keepsake and baby shower gift for a mom to be.They are perfect for Hospital Gifts, Birth Announcements, Birthday Gifts, Christmas and just snuggling those precious babies.DETAILSDesign: Printed On One Side. Designs are printed using high quality inks that will not fade or peel. The fabric stays silky smooth against skin. This is NOT embroidery or vinylCare: Machine Wash; Tumble DryAvailable Materials: Fleece / Minky / Sherpa (dependent on size)Please Note: All sizes have a variance +/- 1\"-2\" due to heat causing shrinking when pressed.DISCLAIMER: Periodically tiny microfiber dots may occur – this is a natural occurrence in the fabric (mostly seen in fleece). They typically appear black, blue, orange or yellow in color. Once the fabric is washed, they usually are less visible. This is common in sublimation - caused by natural fiber particles!Please note with preconstructed items, exact symmetry is not guaranteed.*Please review photos for size references!*CUSTOM ORDERSI LOVE creating new designs but for a design that I do not currently offer please contact me before ordering to see if can create your request.HOW TO ORDER1. Choose the Size & Material for the drop down menu above (see photos for references)2. Add your Personalization requests (include the name(s), font, and color)3. Click \"Add to Cart\"4. Enter your payment information, shipping address, *DOUBLE CHECK EVERYTHING* and click \"Order\"5. Sit back and wait for your special package in the mail!RUSH ORDERSIf you are in a rush, I do offer an express production option.Please add this listing to your order-https://www.etsy.com/listing/498793304RELATED LISTINGSInterested in more personalized baby gifts? Look through the following listings to complete your order!https://www.etsy.com/shop/DashingFoxCoFAQS:.What material is most popular?Jersey is our most popular for baby swaddles because they're stretchy and are not thick.  Minky and Sherpa are our most popular for a standard baby blanket because of the softness and thickness.Are these personalized?Yes, the babies name will be changed to the one that is left in a note for me during checkout. If you would not like a name to be added you can leave the note blank or simply leave \"No Name.\"Do you do custom designs?Absolutely! I love to make custom designs. Please contact me before ordering to make sure that I am able to produce the design you would like.Can the blanket be made in a different color?Sometimes, The text and parts of some designs can be made with a different color. Watercolor floral is not able to be changed however I can try to create something with floral in the color you are looking for. Please contact me before purchasing to make sure I can make the adjustments you would like.Can my order be rushed?Yes, if you need your order rushed, I do offer an express production option to have your order shipped quicker. Just apply it to your order:https://www.etsy.com/listing/498793304Can the fonts be changed?Absolutely!! Just include a note for me during checkout.What is Minky?Minky is a special type of plush fabric that is often used to make baby blankets, baby clothing and baby accessories. Minky fabric is like fleece – but softer and thicker.What is Jersey?It is a 100% lightweight polyester material that stretches. Perfect for swaddling. Features rounded corners.What is Fleece?Fleece blankets are made of 100% Polyester. It is a thinner blanket but provide a very vibrant print.What is Sherpa?Sherpa is an Ultra Plush blanket. It is a 100% polyester with a faux fur fabric on the back. The faux fur side is available in white. Tan back is available by request only.Will I receive a proof?We do not supply a proof of your personalized design as standard to ensure we do not delay your order, however if you would like to see the design before we create it please request this along with your personalization when you place your order. If requested we will not proceed with your order until you are 100% happy with the design. Please ensure you factor in extra time for this, as edits may delay your order.ADDITIONAL NOTES▹ Please keep in mind when ordering that color settings on monitors and lighting in product photography vary so the product might differ a tad from what you see on screen.▹ I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.▹ If you have any questions, please use the “Message Seller” button next to the price and I’ll get right back to you.Remember to select the ♥ FAVORITE button to save this product for later!Thank you so much for shopping at DashingFoxCo!https://www.etsy.com/shop/DashingFoxCo© 2019 DashingFoxCo",
    "reviews": [
      "It’s a Great item, fast shipping.",
      "We were satisfied with the product.",
      "Beautiful! Baby girl will love it. So soft!!"
    ]
  },
  {
    "productId": "t4rltykZfh",
    "url": "https://www.etsy.com/listing/1244790241/established-date-books-last-name-stamped?click_key=2af4e6efb8741fe3c34abf068c3e9f26eede3fbe%3A1244790241&click_sum=eea004c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-3&etp=1",
    "title": "Established date books, last name stamped books, wedding gift, bridal shower gift, farmhouse bookstack, stamped stacked books, bookstack",
    "description": "A set of 3 stamped stacked books with \"the/(last name)/est. (date)\" wrapped and tied in a bow with brown twine. With or without greenery on top!PLEASE READ:I use new and old REAL PAPERBACK BOOKS.  I do not paint them the cover is just removed. They all distress differently.  Every stack of books will look different.  No two are alike.  They vary in color and slightly in size.  There may or may not be wording on the top and or bottom book.  Reach out to me if you have a special request for this. Please keep in mind I hand stamp every book.  They are not meant to look perfectly stamped.  They are perfectly imperfect:) and a wonderful addition to your farmhouse/vintage decor.When adding the personalization (last name and the date) please type it as you would like it.  For example, if you want the last name with a capital letter please type it that way.  If the last name is capitalized I will make the t in The capitalized.  The same for the date please type it as you would like it.  For example, type 06.01.20 or 6.1.20.  Please be specific.  Message me with any questions to clarify!Size:*Please note that I use random new and old books and the sizes vary slightly.These are approximate measurements.Length: 6.75\"Width: 4.25\"Height: 2.5-3\"*If time allows I do take custom orders.  Message me to check!",
    "reviews": [
      "Beautiful work and quick shipping!",
      "Great product and came quickly!",
      "It turned out so pretty!",
      "Love this.  Going to be a great gift"
    ]
  },
  {
    "productId": "xImJ7CDQuj",
    "url": "https://www.etsy.com/listing/1580678346/personalised-ballerina-musical-carousel?click_key=31899779615f0a96898b8b1ddd8a05f756da576c%3A1580678346&click_sum=57208d0f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-4&pro=1&etp=1",
    "title": "Personalised Ballerina Musical Carousel Wooden, Christmas Music Box, Wooden Horse Musical Carousel, Anniversary Memorial Gift, Gift For Baby",
    "description": "Introducing our Handmade Personalised Ballerina Musical Carousel Wooden, a custom heirloom music box and engraved keepsake gift perfect for baby showers, new moms, and baby girls. Made from high-quality beech wood, this beautiful carousel measures 11cm wide x 18cm high and features a delightful ballerina or horse etched design.Available in a My First Christmas, Family Design or keep it simple and non-personalised. Each carousel is perfectly packaged in a gift box.Our Personalised  Musical Carousel Wooden is carefully handcrafted with attention to detail. We only use high-quality beech wood, ensuring long-lasting durability and a beautiful finish. The personalization process is done using timeless script and serif fonts, guaranteeing an elegant and enduring engraving. Packaged in a gift box, our carousels are meticulously inspected before shipping to ensure they arrive in perfect condition, ready to be treasured for years to come.-Product details:Cross mountain train:Size: 4.3*4.3*5.1 inchesMusic: Castle in the SkyFeatures: music + train rotationChristmas train:Size: 4.3*4.3*5.1 inchesMusic: Merry ChristmasFeatures: music + train rotationEiffeltowerSize: 4.3*4.3*6.2 inchesMusic: MeetFeatures: music + trolley rotationFerris wheelSize: 4.3*4.3*5.1 inchesMusic: Castle in the SkyFeatures: music + ferris wheel rotationwhirly:Size: 3.9*3.9*6.7 inchesMusic: Castle in the SkyFeatures: Music + Trojan rotationBallerina:Size: 4.3*4.3*6.7 inchesMusic: Castle in the SkyFeatures: Music + little girl spinMagic Castle:Size: 4.3*4.3*5.9 inchesMusic: Castle in the SkyFeatures: Music + trolley rotationBig Ben:Size: 4.3*4.3*5.9 inchesMusic: CanonFeatures: Music + trolley rotationBirthday cake:Size: 4.3*4.3*5.5 inchesMusic: Happy birthdayFeatures: Music + Cake RotationChristmas snowflakes:Size: 4.3*4.3*6.5 inchesMusic: Merry ChristmasFeatures: Music + Snowflakes and Sled SpinsBear Seesaw:Size: 4.3*4.3*5.5 inchesMusic: Castle in the SkyFeatures: Music + Seesaw startTriumphant Arch:Size: 4.3*4.3*5.9 inchesMusic: CanonFeatures: Music + trolley rotation",
    "reviews": [
      "Beautiful piece of art work. My friend loved this gift.",
      "The item was just what a little girl wanted. The music was soothing. The shipping was faster than given and once I wind it up I simply relaxed to watch the items circle. I am a lover of music boxes and this one met my expectations. This is a gift for our new addition by adoption.",
      "Cute. It wa a gift.  Thought it was enclosed like a snow globe ( don’t know how I missed that)"
    ]
  },
  {
    "productId": "rQsiJlDHwP",
    "url": "https://www.etsy.com/listing/1500262076/custom-wedding-gift-ring-dish-date-and?click_key=88bb3b54046a37c907fa07aae75f31b69c54fa81%3A1500262076&click_sum=6685d6a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-5&etp=1&sts=1",
    "title": "Custom Wedding Gift /  Ring Dish / Date and Initials / Wedding Gift / Personalized Gift / Personalized / Engagement Gift /",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Love, love this ring dish!!  It’s my “go-to” gift for those extra special in my life.",
      "Bought this for my cousin as an engagement present! She loves it! This company is amazing, I have ordered other dishes from them too, and just love their company and customer service.",
      "super cute and like the picture shows:)"
    ]
  },
  {
    "productId": "AUMJApncwD",
    "url": "https://www.etsy.com/listing/968838340/personalised-name-definition-grey-satin?click_key=ad7a0d3025f63ebfa89fd1f5ad8e5e8dff1ce916%3A968838340&click_sum=f7bd5209&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-6&etp=1&sts=1",
    "title": "Personalised Name Definition Grey Satin Mug Laser Engraved Gifts Ideas Presents For Mum Dad Birthday Christmas Mothers Fathers Day",
    "description": "Our Personalised Name Definition Grey Mug is the perfect gift idea for any occasion and can be engraved with any name and definition below.Personalise this mug with any name, and 3 points below. The word \"noun\" is a fixed part of the design and does not need to be added to the text when ordering.Filled with their favourite hot drink, you can be sure that this gift will be treasured for a long time.All of our mugs are laser engraved, meaning that the print will never wash off, as can happen with some printed mugs. This mug has been manufactured and coated especially for you. Each mug is individually inspected to ensure the highest standards in quality control before printing your design.Although this mug has been tested to withstand up to 50 dishwasher cycles, performance can vary dependent on temperatures, detergent and any abrasion the mugs may be exposed to in different dishwashers.To prolong and maximise the life of the decorated mug we recommend hand washing with a non-abrasive sponge or cloth.",
    "reviews": [
      "Great item for sure !",
      "Wow! Very quick delivery on this bespoke mug. Wanted something a bit special for my besties 60th birthday and this is it! A bit smaller than I thought it would be but it’s no be deal and doesn’t take away the quantity. Thank you so much.",
      "very nice mug with a nice finish. first one i ordered broke, handle came off when i was washing it so did order a second one"
    ]
  },
  {
    "productId": "RKHxthXosm",
    "url": "https://www.etsy.com/listing/736473871/leather-phone-stand-for-desk?click_key=52fec3eb9c2811bda894a516c18ee1e7dc1724df%3A736473871&click_sum=2a5d71dc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-7&pro=1&etp=1&sts=1",
    "title": "Leather phone stand for desk, personalized iphone holder, tablet stand in multiple colors. Engraved ipad gift for her, iphone stand",
    "description": "This elegant leatherette smart phone or tablet stand is the perfect accessory for any desk, night stand or kitchen counter.They come in a variety of colors and font choicesThey are  3.5\" x 2.5\".These are extremely sturdy and perfect for watching videos, reading kitchen recipes, face-timing and so much more!**** Cover photo is the Pink color choice******To order: Simply choose your color and Font and leave your personalization in the 'Personalization Box' and/or the 'Notes to Seller' at checkout:",
    "reviews": [
      "Love these phone stands.  They work great when watching a movie, and they remind my husband where his phone is.",
      "Nicely done! Just as shown.",
      "Went as it should have. Arrived on time.",
      "Loved it so much we bought two more. Great viewing angle. Easy to use and carry around the house or take on trips."
    ]
  },
  {
    "productId": "HWNOQGYPen",
    "url": "https://www.etsy.com/listing/1488795378/personalized-bookmark-custom-bookmark?click_key=3c8ab2ca03a3b94652d9a6cb48f41f93c6e19365%3A1488795378&click_sum=2ea8ad88&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-8&etp=1&sts=1",
    "title": "Personalized Bookmark | Custom Bookmark | Custom Pet Photo Gift | Dog Mom Present | Personalized Dog Magnetic Bookmark",
    "description": "***Only the heads/faces will be included in the bookmarks***Please send your photo(s) via Etsy messenger after completing your order. There will not be a way for you to upload it during the checkout process.***Dog moms, pet parents, and readers - If you're searching for a unique and heartwarming gift that perfectly captures the essence of your beloved furry friend, you've come to the right place.Each bookmark is lovingly handcrafted based on a photo of your precious pup, transforming it into an adorable 2-inch by 2-inch (approx.) magnetic bookmark that will keep your place in your favorite book. Please keep in mind, we do not make any edits to the photos; we only crop them. To ensure the best result, please choose a high-quality photo with good lighting that showcases your dog's face in all its glory. The photo will print as is. We will crop out the background and isolate your dog's face from the photo.Our bookmarks are printed on glossy photo paper and are laminated to make them waterproof and scratch-resistant. The magnetic feature ensures they securely grip the page without slipping or damaging your precious books. Plus, they make wonderful gifts for fellow dog lovers, friends, family, or even yourself!Hello, We currently only accommodate proof requests for orders of 5+ bookmarks since they would all be on the same page and would not affect the production time of other orders. Multiple bookmark orders are printed on one page in order to be eco-friendly and not waste material. For this reason, if one order requests a proof and does not respond timely, it will delay the production process for multiple other orders. Unfortunately, this was our experience when accepting proof requests where we would not receive a response until days later 90% of the time, so we have pivoted away from proof requests in order to best meet our customers' needs. If you receive your order and have any quality-related issues, please do not hesitate to reach out.At FritoPaw, we take pride in our attention to detail and commitment to customer satisfaction. We pour our passion for pets into each bookmark we create, ensuring a high-quality, long-lasting keepsake that will bring joy to your reading moments for years to come.Grab yours now and embark on a whimsical journey through the pages of your favorite books, accompanied by the face of your beloved canine companion. Shop with confidence at FritoPaw – where creativity, quality, and canine cuteness converge.",
    "reviews": [
      "Very adorable bookmark! I loved the quality. The magnet was displayed very professionally.  My dog lovers are going to be ecstatic!",
      "So cute and arrived quickly. Thank you!",
      "My husband loved it! It was so cute!",
      "Great gift for the avid *traditional* (paperback or hard cover) book reader. Came out better than expected and my gift recipients LOVED them."
    ]
  },
  {
    "productId": "AUrAdfcgyg",
    "url": "https://www.etsy.com/listing/1131818146/custom-portrait-from-photo-sweatshirt?click_key=def16300b5f25b5e7f198144eccfc1e9800221ad%3A1131818146&click_sum=c50f9741&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-5&pro=1&bes=1&sts=1",
    "title": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait",
    "description": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait***Please send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )ORDER INSTRUCTIONS** Check and Review all Photos.**Select Your sweatshirt Size and sweatshirt Color from drop down menus.** Choose Your Quantity you want.**Click ADD TO CART. And, you can go back to add more product color for your family members or You can complete the checkout process.**Please Click “Proceed to Check Out”**Finally, Your order will be ready to ship 3-5 Business Day.**** send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )Due to the nature of the fabric as well as your monitor or mobile screen colors may differ slightly.We do accept cancellations in first 12 hours. Refunds and Exchanges are not accepted.All information is provided in the Item description as well as the photos attached to each listing.The price is for individual sweatshirt, not a setWe do vinyl heatpress printing, not screenprint o embroideryFABRIC8 oz.(US) 13.3 oz.(CA), 50/50 preshrunk cotton/polyesterHeather Sport colors: 60/40 polyester/cottonAir jet yarn = softer feel and reduced pillingDouble needle stitching at shoulder, armhole, neck, waistband and cuffs1 x 1 rib with spandexQuarter-turned to eliminate center creaseSafety Green: Compliant with ANSI / ISEA 107Tearaway labelCARE INSTRUCTIONS• DO NOT iron directly on Heat Transfer Graphic. Iron on low heat with shirt inside-outNever iron directly over design• DO NOT dry clean• Machine wash COLD with mild detergent• Turn inside out when washing• Dry on low setting or hang to dry• No chlorine bleach• Wait 24 hours before first wash*Do not use bleach",
    "reviews": [
      "My boyfriends loves it and won’t stop wearing it.",
      "Great! Thanks for the quick turn around also!",
      "Perfection! Will be making future purchases🫶🏽",
      "My best friend and I loved our custom sweaters🫶🏽"
    ]
  },
  {
    "productId": "nJRjXRISLV",
    "url": "https://www.etsy.com/listing/1321181024/nana-embroidered-sweatshirt-gift?click_key=ebc442ab8a36e284f86913a24bc28e4d4a32cc29%3A1321181024&click_sum=71078e6d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-6&pro=1&bes=1&sts=1",
    "title": "Nana Embroidered Sweatshirt Gift | Personalized Sweatshirt | Christmas Gift | Winter Apparel | Floral Nana Shirt |  Birthday Gift",
    "description": "From our family to yours celebrate being a Nana/Mimi/Gigi/Gaga/Gram in comfort and style!There are three florals to pick from on this listing, we have many other florals and print patterns available in our other listings as well!Pictured:Pink/Red FloralBlue/White FloralThese Personalized Sweatshirts are one of the most popular Christmas gifts, consistently an Etsy Best Seller and Style pick!These make excellent gifts to go along with Mama shirts for baby showers, baby announcements, or just to let the grandmas in your life know they are special!We can do just about any word, please let us know in the personalization box which pattern and word you want!Add On Listing to add a name on the cuff.https://www.etsy.com/listing/1322155869/name-on-sleeve-add-onNeed your purchase gift wrapped with an elegant box with a big bow and gift message engraved in the box?https://www.etsy.com/listing/1455178773/gift-wrappingCheck out our other listings!Collegiate Customizable Sweatshirthttps://www.etsy.com/listing/1397420577/mama-embroidered-sweatshirt-gift-mothersMatching Christmas Sweatshirtshttps://www.etsy.com/listing/1336902071/matching-family-christmas-sweatshirtsEmbroidered Floral Mama Sweatshirthttps://www.etsy.com/listing/1289626644/mama-sweatshirt-custom-embroideredDoodle Mamahttps://www.etsy.com/listing/1331596443/doodle-mama-sweatshirt-floral-doodleBlue Floral Mama Sweatshirthttps://www.etsy.com/listing/1315419355/mama-sweatshirt-gift-fall-apparel-floralAnimal Print Mama Sweatshirthttps://www.etsy.com/listing/1313325697/mama-sweatshirt-custom-embroideredToddler/Kids Dude Sweatshirthttps://www.etsy.com/listing/1314111750/dude-sweatshirt-dad-and-dude-sweatshirtMini Floral Toddler/Kids Sweatshirthttps://www.etsy.com/listing/1314103336/mini-sweatshirt-mama-and-mini-sweatshirtDad Sweatshirthttps://www.etsy.com/listing/1311809610/dad-sweatshirt-custom-embroideredPanthers Spirit Sweatshirthttps://www.etsy.com/listing/1292041514/panthers-spirit-shirt-custom-embroideredTigers Bella + Canvas Spirit T-Shirthttps://www.etsy.com/listing/1261203758/tiger-spirit-shirt-custom-embroideredTigers Spirit Sweatshirthttps://www.etsy.com/listing/1258326070/tiger-spirit-shirt-custom-embroidered",
    "reviews": [
      "Had Very good customer service.",
      "Item was exactly as pictured. I even asked for a different word on the front. Customer service was fast, helpful, and kind",
      "Item was exactly as pictured"
    ]
  },
  {
    "productId": "niblyRKpqQ",
    "url": "https://www.etsy.com/listing/1667224059/embossed-bride-sweatshirt-personalized?click_key=ddb6154bb83e8d7de669edc897a6669bb001e55a%3A1667224059&click_sum=f10da493&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-7&pro=1&frs=1&bes=1",
    "title": "Embossed Bride Sweatshirt - Personalized Gift For - Engagement Gift - Bridal Shower Gift #ED01",
    "description": "This bridal sweatshirt is an ideal present for an engagement party or bridal shower. Designed for the future bride, it offers a comfortable yet stylish option for her wedding preparation activities. The sweater features a minimalistic design and offers a personal touch with the option to customize the sleeve with the couple's initials.Product details:- Crewneck Sweater- 50% cotton, 50% polyester- Available sizes S, M, L, XL- Available colors White, Black, Ash, SandPersonalization:Customize the sleeve with the couple's initials",
    "reviews": [
      "Super soft and came in a very timely manner. Absolutely love it",
      "Beautiful shirt, fast shipping.\nHighly recommend",
      "great quality and shipped fast!",
      "My daughter will love this!"
    ]
  },
  {
    "productId": "L9ulRLBept",
    "url": "https://www.etsy.com/listing/1665939928/personalized-pocket-knife-for-groomsmen?click_key=9e0c373830ef870ae5d71c0fbb4ba3ef62ed2563%3A1665939928&click_sum=cd9be726&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-8&pro=1&sts=1",
    "title": "Personalized Pocket Knife for Groomsmen,  Fathers Day Gift, Groomsmen Knives, Engraved Groomsman Knife, Groomsmen Proposal, Custom Knife",
    "description": "Personalized Pocket Knife for Groomsmen,  Fathers Day Gift, Groomsmen Knives, Engraved Groomsman Knife, Groomsmen Proposal, Custom KnifeThere's nothing better than a personalized knife as a gift for the hardworking, outdoorsy man in your life! Engrave their name on it for an extra touch. You can even engrave the year they were born or their initials. The possibilities are endless with our custom engraved knives!FAST SHIPPING !!!PLEASE NOTE! There might be small delays in delivery during the holiday season.If you buy 6 or more knives you will get FREE FedEx Economy Shipping Option (Guaranteed 2-5 days)2-6 (days) In USA3-6 (days) In EuropeKnife Specification:- Steel parts Color: Black (default) ; dark grey available on request-Blade Material:  440C-Blade Length: 8.9cm - 3.5 inch-Length Overall: 22cm - 8.7 inch-Transport length : 12cm - 4.7 inch-Blade width: 2.8 cm (at the widest point) - 1.1 inch-Blade thickness: 0.25cm 0.01 inch-Hardness: 58 HRC-Net weight: 169 g - 5.7 Oz-Handle material: Steel + WoodEngraving:-For Handwriting order send us your photo of handwriting into the messages-18 font types-For special font type feel free to ask-Mock up on request (Message me anytime)(Personalized pcs are shipped from Slovakia)ATTENTION: WOOD HANDLES CAN BE DIFFERENT PATTERNS IN EACH ORDER!!!PLEASE NOTE:YOU MUST BE 18 YEARS OR OLDER IN ORDER TO PURCHASE KNIVES. WE ARE NOT RESPONSIBLE FOR ANY ILLICIT PURCHASE, THANKS",
    "reviews": [
      "Purchasing this knife was an excellent decision for a gift! The\nquality exceeded expectations and perfectly aligned with the detailed\ndescription. I wholeheartedly recommend this product to others.",
      "I think my husband has told me “This is a really great knife” at least twice a day since receiving it for Valentine’s day. He genuinely loves it, so much so that he’s planning on gifting one to his friend who is getting out of the Navy. Nothing makes me happier than seeing him happy. It’s well crafted, sturdy, and pretty to look at. Shipping was quick which is a bonus!Definitely recommend!",
      "Excellent Customer Service!  Accommodated a change in product due to supply and date needed - went above and beyond to ensure I had my order in time for my wedding!  Craftsmanship was impeccable - the knives were beautiful with precision engraving and wrapped nicely, as they were gifts!  I will shop here again and highly recommend others to as well!",
      "It was a wonderful gift!"
    ]
  },
  {
    "productId": "auKzNlrZOT",
    "url": "https://www.etsy.com/listing/867616643/combined-birth-month-flower-bouquet?click_key=17ad20c8b3021a147db1bdd0c3e636b48de420a9%3A867616643&click_sum=461cfeac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-9&pro=1&etp=1&sts=1",
    "title": "Combined Birth Month Flower Bouquet Necklace, 48 different flowers to choose, Mothers day Jewelry Gift, Best Friend, Birthday Present",
    "description": "Celebrate the beauty of life with our Combined Birth Flower Necklace! Featuring the unique blooms associated with your birth month and your loved ones, this stunning piece is the perfect way to honor the special people in your life. Handmade with care, this necklace is crafted from high-quality materials and comes with a delicate chain. Whether you're looking for a meaningful gift or a stylish accessory, this birth flower necklace is sure to make a lasting impression. Order yours today and wear your love for those closest to your heart!Personalize this piece with your own meaningful message. Personal, timeless pieces you’ll never want to take off - it is made to keep your sentiments close.All of our jewelry are hypoallergenic. We wish to create timeless, versatile pieces that everyone can enjoy and cherish, so we completely removed lead and nickel from our production.We carefully package individual items with our original jewelry cards and gift box, and we are happy to write a handwritten gift message for you if the occasion calls for it. Please simply leave us your instructions in the note section at checkout.--------------------------Details:• Disc measures 15mm or 18mm• 1.5mm Stainless Steel, 18K Gold Plated, 18K Rose Gold Plated Chain 18\"OR• Sterling Silver s925 and 14k Gold Filled• Disc measures 16mm• 1.5mm Sterling Silver S925 or 14K Gold filled Chain with Spring Clasp.• Handmade to order, please allow 1-3 days for us to make your item before shipping.• Jewelry comes on a card inside a box, then placed in a cotton filled, Torianic stamped box.---------------------------How to Order:Step 1Choose colorStep 2Choose number of charms and side to be engraved-1 Charm front engraved means 1 disc, front side engraving only (not how many flowers.)-This listing is for combined flowers. If you purchase more than 1 charm, please indicate combined flowers on each charm.-We recommend limit your flowers to 2-3.-If you don't indicate the style of your flower by default we will place the style # 1-Necklace length: 16,18 or20. *Default Length is 18 InchesStep 3Add your personalization (following the instructions in step 2)• BULK ORDER AVAILABLE - please contact us for details *Step 4Add to Cart.SAMPLE:Front: Birth flower style 1 Morning Glory, Birth  flower style 1 CosmosBack: i love youNecklace length: 16\"IF YOUR ORDER HAS MORE THAN ONE PENDANT, you must be specific with your order.Example of ordering 2 CHARMS AT THE SAME CHAIN.CHARM 1: Front: Birth flowers style 1 Morning Glory, Birth  flowers style 1 Cosmos. Back: i love you mom. Necklace length: 16\"CHARM 2: Front: Birth flowers style 1 Morning Glory, Birth  flowers style 1 Cosmos. Back: we love you grandma. Necklace length: 16\"Example of ordering 3 NECKLACES, EACH WITH 1 charm:Necklace 1:Front: Birth flowers style 1 Morning Glory, Birth  flowers style 1 CosmosBack: i love youNecklace length: 18\"Necklace 2:Front: Birth flowers style 1 holly, Birth  flowers style 1 roseBack: momNecklace length: 18\"Necklace 3:Front: Birth flowers style 2 rose, Birth  flowers style 2 lilyBack: grandmaNecklace length: 18\"* If you want another Necklace length Just let us know in the personalization box* If you have any further questions , Please contact us anytime.-------------------------------SHIPPING  (Estimated)- Domestic (U.S.) Standard: 2 - 5 business days- Domestic (U.S.) Priority: 1 - 3 days- International Standard: 7 - 21 business days (1 - 3 weeks)------------------------------See our other listings:https://www.etsy.com/shop/torianicjewelry/Follow us on Instagram for sale alerts, new product announcements, giveaways, and customer features @torianicjewelryThank you for visiting our shop.",
    "reviews": [
      "Beautiful necklace. Not cheap one",
      "Well made and shipped quick",
      "It is a wonderful necklace!",
      "My best friend loved this gift. Matching necklaces for both of us! I definitely plan on buying a pair for me and my sister. :)"
    ]
  },
  {
    "productId": "VBxEJbITvQ",
    "url": "https://www.etsy.com/listing/1545739061/bubble-name-necklace-bubble-letter?click_key=e7b43757110def10023607ad2cc35459c9fe9c11%3A1545739061&click_sum=a3f512a9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-10&pro=1&frs=1&etp=1",
    "title": "Bubble name necklace, Bubble letter Necklace, Personalized Silver Jewelry, 3d Balloon Letter, Gold name necklace, Balloon name necklace,AU37",
    "description": "Introducing our stunning Bubble Name Necklace, a personalized piece of jewelry that adds a touch of whimsy and style to your everyday look. Each letter is carefully crafted in 3D, mimicking the shape of elegant balloons floating gracefully in the air. Made from high-quality, no tarnish Gold Filled material, this custom name necklace is not only eye-catching but also durable, ensuring that it will be a treasured keepsake for years to come. Treat yourself or someone special to this one-of-a-kind, personalized bubble jewelry that captures the essence of individuality and charm.Personalize the Silver Name Necklace with Balloon Letters with any name or word up to 12 characters.Create a unique and meaningful 3d Balloon Jewelry piece with the name of your loved one. a wonderful unique Christmas gift❤️ Product Specifications ❤️Material       : 10k – 14k Solid Gold ( %100 Real Gold)Material 2    :  Sterling Silver and 14k Gold Filled and 14k Rose Gold Filled  A 0.5 micron thick layer of solid gold on Sterling SilverBalloon Name Size : 0,39 x1,18 inch / 7,5 X 30 mmNecklace size : 14\" 16\" 18\" 20\"   + 2\" extension is available on all productsPackaging : With good quality gift box, suitable for gift• All orders are packaged in jewelry boxes READY TO GIFT ✌• All items are lovingly handmade ♥• It takes a little extra time to create custom items• Production times are about 5-7 working days.♦ MAINTENANCE RECOMMENDATIONS ♦We have taken every precaution for you.All our products are handmade, made of real 14k - 10k solid gold.Other option is an 14k gold-filled and Rose Gold Filled  a 0.5 micron thick layer of solid gold on Sterling SilverNo maintenance instruction required, you can wear it with love ♥You can easily use it in the pool, Sea, ocean and Shower",
    "reviews": [
      "Exactly like shown, very cute, would buy again",
      "Thank you :)",
      "So cute! Right what I was looking for!",
      "Thank you :)",
      "I love the look. It’s so cute",
      "Thank you :)",
      "Seller was super kind and didnt hesitate to answer my questions. My boyfriend and I love the necklace, and I am debting getting myself one too now!",
      "Thank you :)"
    ]
  },
  {
    "productId": "fNtHTjiJgm",
    "url": "https://www.etsy.com/listing/956119765/where-we-met-map-where-it-all-began?click_key=2b7539503af4556e5f9e06e8a258c2f4bec9b717%3A956119765&click_sum=2d60d5b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-12&frs=1&etp=1",
    "title": "Where We Met Map /Where it all began /Couple Map/ Gift for her/ Gift for him/Personalized Map/ Custom Map/Anniversary Gift/ DIGITAL DOWNLOAD",
    "description": "This listing is for a digital download!***RUSH ORDER? Use the 12 HRS OR LESS Option -https://www.etsy.com/ca/thelittlepen/listing/1111706723***NO product will be shipped. This customized print will be sent digitally via EMAIL within 1 business day of purchase and comes in a .pngIf you would like it in another file type other than .png - please contact me and I can see if your preferred file type is possible.The standard sizes are 5x7, 8x10 and 11x14The perfect personalized digital print to remember the first place you met your partner! A perfect sentimental gift for your partner for your Anniversary, Birthday, Valentines Day or any other special occasion!Please choose one of the four style optionsHow it works:After you've placed your order and once your custom map is complete, I will email your custom map to the email address that you provided. Please note you may get a shipment notification from Etsy - kindly ignore it as this is a digital product. You can get it printed at places like Walgreens, Walmart, Staples, Costco or even at home! For best results, you can print on cardstock paper (non-glossy).*Does not come with a black border - frame is for demonstration purposes only*No refunds as this is a personalized digital item. However I would be happy to work to fix any issues!",
    "reviews": [
      "Thank you, It was the best gift ever!",
      "Very happy with my purchase! Thank you!",
      "Excellent quality! Exceeded my expectations.",
      "A great idea for a very original gift."
    ]
  },
  {
    "productId": "CpTMsbSGNp",
    "url": "https://www.etsy.com/listing/1381018664/stars-chart-as-valentines-gift-for?click_key=59d8c4a72774e7e59bbedc881fe00298b8675567%3A1381018664&click_sum=84d8ec9f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Stars Chart as Valentines Gift for Couples - Gift Star Map on Night Light - Personalized Constellation Map - 1st 5th 10th Anniversary Gifts",
    "description": "❤️ Valentine's Gift Night Light ❤️Stars will shine down on you and lighten your love like it does in the night sky.Our personalized nighy lights with star map is a unique and perfect gift with its one of a kind design prepared according to your special day.We create it with your date and location just like you want it to be.The stars will read your love and you will be the only one who will create this exquisite present.❗️ İmportant❗️Location or coordinates are required to create your unique star map. It could be a special place for you.If it's not provided by you, the location of the stars on this specific date will be used.Our night lights are the perfect gift idea for:Anniversary Gift, Birthday gifts,  Valentine's Gift, Weddings Gift, Engagements or anything else your heart desires!During the day, the lamp appears like a beautiful accessory and is already such an eye-catcher.In the evening, when it is enlightened, it seems almost a little magical!⋆ Certified non-toxic/baby safe oil finish is used to protect the wood base.⋆ LED's life span (average) - 50,000 hours.⋆ Works plugged-in⋆ It is NOT includes a wall charger. Any USB charger will function well*********2 to 4 days are required for order preparation. But typically, we make every effort to provide it as quickly as we can.Please note that APO and FPO addresses are not eligible for shipping.*********Damage and Lost PackageWhen it comes to our items, shipping, and delivery, we take all responsibility.If a product is damaged or lost during delivery, we will replace it as quickly as we can.*********Customs chargesUnfortunately, since it is governed by your nation's laws, we have no control over this.As a result, you should consider it while placing an order.",
    "reviews": [
      "love it!!",
      "Very cute and good gift",
      "My boyfriend loved this gift! I was surprised by how touched he was by it and how much he adored it! He usually isn’t an emotional person!",
      "Much bigger than I thought! Beautiful!"
    ]
  },
  {
    "productId": "yubxWioSXw",
    "url": "https://www.etsy.com/listing/640996406/personalized-wooden-watch-o-engraved?click_key=601f14d66ce23d9ba6d00ced99b1ab0577e2059b%3A640996406&click_sum=c802c8a9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-14&pro=1&frs=1&etp=1",
    "title": "Personalized Wooden Watch | Engraved Wood Watch | Groomsmen Gift | Anniversary Gift | Fiancé Gift Watch | Wedding Gift for Husband |",
    "description": "AVANTwatches | Elevate Your Style ™SALE: We just restocked our Etsy shop and we are doing something crazy which we will probably never do again! We are currently offering an Etsy exclusive discount of 60% OFF our most premium offering! We sell this same model watch on our website for over $200+ but if you order right now you have the chance to get it for just under $95! We really want to increase our presence on Etsy and what better way than literally offering the BEST deal on the platform! We don't know what will end first our inventory or this crazy offer 😅🧐Tired of the same generic wood watches on Etsy?Want a truly bespoke wood watch? Look no further!New York - Rose Gold (38MM)The New York collection is our most innovative timepiece to feature a real Wood dial. Inspired by our City and driven by passion we set out to break the mold of contemporary watch design. The result is an avant-garde timepiece with a breathtaking Ebony Wood dial.The real Ebony Wood dial is designed around a high quality Japanese Quartz movement, ensuring a one-of-a-kind timepiece to compliment your own unique style.The unique timepiece is masterfully crafted from only the highest quality woods, steels and leathers on the market. The remarkable attention to detail and unquestionable craftsmanship makes the New York (38mm) series a stand alone collection.👐 Hand Made in small quantities to ensure the highest quality!Design Details:Case: Rose Gold (38mm)Dial: Premium Ebony WoodMovement: High Quality Japanese QuartzBattery Powered: lifetime 2 - 3 years (easily swappable)Strap: Top Grain Italian Leather Strap (20mm)Glass: Sapphire Crystal (Scratch Resistant)Water Resistance: Up to 5ATM - 50 Meters (Rain Resistant)Each watch features a Wooden Dial which is sourced from 100% real Ebony Wood.Be Bold. Be Unique.🌲No two can ever be the same, each watch features its own unique wood grain, color and character which ensures that you always stand out.Personalize Your Order:➤ Make your gift or keepsake truly memorable with our premium engraving service.➤ We use an industry leading laser engraver which produces the most accurate and detailed engravings on the market.➤ Worry Free Engraving: An engraving specialist will adjust the font and text for the perfect results!- For this model the leather strap can be engraved on both sides with a maximum of 12 words on each side. You can choose to engrave ether one or both sides!- Please let us know what you would like to engrave in the personalization tab, if you choose both sides please clarify what you would like on each side or we will split the engraving on your behalf.Complimentary with each order:✔️2 Year Warranty✔️ Premium Packaging (Gift Ready)✔️Free Shipping & Returns✔️24/7 Customer Support🚚💨Fast & Reliable Shipping:Your personalized order will be engraved and shipped out with in just 1-2 business days! As soon as the order is shipped you will receive an email notification with the tracking number.PS: We Have Over 1,300+ ★★★★★ Reviews & Counting - ✅VerifiedCustomer Service:Still not sure about your purchase and have some questions? Don’t worry we are here to accommodate any question or concern you may have. Just leave us a message and we will respond with in 24 hours 😊",
    "reviews": [
      "Great anniversary gift for my husband!",
      "Husband loved it. He was very pleased.",
      "Absolutely beautiful gift for my husband. Thank you!",
      "I am blown away by this product. It came so quickly and the quality is top notch. I cannot wait to give this to my fiancé on our wedding day!"
    ]
  },
  {
    "productId": "JbhNgfYmil",
    "url": "https://www.etsy.com/listing/1609882205/personalized-birthday-gift-for-her?click_key=3cf2b53b6160a623b3e6dcd98976b148177c88d8%3A1609882205&click_sum=048ab79d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-15&pro=1&etp=1",
    "title": "Personalized Birthday Gift for Her Friend Gift Box Set for Women Gift Idea Best Friend Birthday Gift Box Custom Name Birthday Gift Daughter",
    "description": "Personalized Birthday Gift for Her Friend Gift Box Set for Women Gift Idea Best Friend Birthday Gift Box Custom Name Birthday Gift Daughter𝗕𝗼𝘅 𝗜𝗻𝗰𝗹𝘂𝗱𝗲𝘀:- personalized glass cup with name or word (glass cup can be frosted or clear based on availability)- reusable straw- bamboo lid- premium soft socks- flower claw hair clip (random color to match socks)- gift card with personalized message➜ 𝙃𝙊𝙒 𝙏𝙊 𝙊𝙍𝘿𝙀𝙍1. choose greeting card2. choose socks color3. type font color (white or black)4. type recipient's name & your personalized message (optional)5. add to cart & checkout𝙿𝚕𝚎𝚊𝚜𝚎 𝚖𝚊𝚔𝚎 𝚜𝚞𝚛𝚎 𝚝𝚘 𝚍𝚘𝚞𝚋𝚕𝚎 𝚌𝚑𝚎𝚌𝚔 𝚝𝚑𝚎 𝚛𝚎𝚌𝚒𝚙𝚒𝚎𝚗𝚝’𝚜 𝚊𝚍𝚍𝚛𝚎𝚜𝚜 & 𝚛𝚎𝚖𝚎𝚖𝚋𝚎𝚛 𝚝𝚘 𝚜𝚒𝚐𝚗 𝚠𝚒𝚝𝚑 𝚢𝚘𝚞𝚛 𝚗𝚊𝚖𝚎.Our processing time is 3-5 business days and the default shipping method we use is ground mail via USPS.🏃‍♀️ If you are on a hurry please add this rush option and we will process your order in 48 hours or less:https://www.etsy.com/listing/1267146774/rush-my-order-ships-in-2-business-days📦 Upgrade shipping to Priority Mail:https://www.etsy.com/listing/1267144322/priority-mail-upgrade-via-usps🤍 More gift boxes here: https://www.etsy.com/shop/alostudioo/?etsrc=sdt§ion_id=45132698𝗗𝗘𝗧𝗔𝗜𝗟𝗦• socks available in 8 different colors (brown/green, black, ivory, purple, blue, teal, pink or gray)• personalized glass cup with name or word• font available in black or white• premium super soft socks with embroidered gold hearts, one size• personalized greeting card with your message (optional)• each gift box ships beautifully packaged ready for gift giving𝗠𝗢𝗥𝗘For help or assistance contact us via Etsy convos.𝐁𝐚𝐜𝐤 𝐭𝐨 𝐒𝐡𝐨𝐩:https://www.etsy.com/shop/alostudioo𝐅𝐨𝐥𝐥𝐨𝐰 𝐔𝐬:Instagram: www.instagram.com/alostudiooFacebook: www.facebook.com/aleishlajewelry",
    "reviews": [
      "The basket is Adorable and fun!",
      "Thank you Vicky for your order and review!",
      "The items were just as pictured/expected",
      "Thanks Courtney! :)",
      "My friend loved this gift so much! Great quality and super cute. Thank you!",
      "Thanks Natalie! We appreciate your order and feedback!"
    ]
  },
  {
    "productId": "vrNPDXjwAQ",
    "url": "https://www.etsy.com/listing/888926536/personalized-birthstone-bracelet-initial?click_key=f4b433a823d84fb2002f9a91c534e3549a1a3b22%3A888926536&click_sum=61088194&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-16&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Birthstone Bracelet Initial Mom Gift Christmas Gift Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet",
    "description": "Custom Birthstone Bracelet, Initial Bracelet, Unbiological Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet for WomenKeep your special dates in a unique, elegant and minimalist disc bracelet, embrace your siblings love with this perfect gift. It comes with a high quality plated diamond cut chain, which will shine from all angles.H O W . T O . O R D E R• Please choose the birthstone color from the drop-down menu, and provide the initial you'd like at the checkout.• If you do not see the information you're looking for, or have any questions. Feel free to message us, we are lightning fast with our responses :)I T E M ∙ S P E C I F I C A T I O N SDisc: approx. 0.47\"(12mm)Birthstone: 0.88\" x 0.21\"(22.5mm X 5.5 mm)Chain: adjustable up to 7.5\"(19.5cm).P R O D U C T ∙ M A T E R I A L- Charm & Chain: Gold Plated / Silver Plated / Rose Gold PlatedC A R E ∙ I N S T R U C T I O N SAlthough our jewelry are high quality with extra layers of coat for long lasting, yet plated jewelry should be cleaned periodically. To extend the life of your jewelry, it’s very important that you keep it dry (never bathe or spray perfume on your jewelry, chemical reactions with chlorine and other elements such as perspiration can lead to tarnishing). Remove jewelry when sleeping, exercising, or doing physical activities, as prolonged contact with sweat will cause the plating to wear away faster. Never use abrasives chemicals or products to clean your jewelry. After each wear, gently wipe each piece of jewelry clean of makeup and skin oils with a soft, lint-free cloth in order to avoid scratching. Since rose gold pieces are more sensitive because of copper usage (in order to turn the color from gold to rose gold), please care as instructed above.P R O D U C T I O N ∙ T I M EAfter receiving your order, we immediately start working on your jewelry, which will take 1 business day for us to make.A B O U T ∙ VI V O M I N I M A L I S TAt Vivominimalist, we are a team of happy people dedicated to handcrafting every order with excitement and love! We know this isn’t about us, but all about you. Thank you so much for allowing us to be a part of your special moment!O U R ∙ P R O M I S EWe believe that it is of the utmost importance to ensure that our customers are satisfied with their one-of-a-kind pieces. We hold our customers near and dear to our hearts and are more than willing to move heaven and earth to make sure your shopping experience is unforgettable!S H I P P I N G ∙ T I M E- DOMESTIC (U.S.): 2 - 5 days- INTERNATIONAL: 7 - 14 daysPlease note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to the shipping address.S T O R E ∙ P O L I C Yhttps://www.etsy.com/shop/vivominimalist/policy",
    "reviews": [
      "Great gift for a friend",
      "Great personalized gift, it was a big hit!",
      "This is the 3rd bracelet I've ordered and very happy to be giving this as a gift to a wonderful friend for her birthday."
    ]
  },
  {
    "productId": "XMOefwSiIT",
    "url": "https://www.etsy.com/listing/779017527/custom-birthstone-bracelet-initial?click_key=a791b5e5bf48e37934e1025f51bff0bac0ea3da0%3A779017527&click_sum=e0d4316d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Birthstone Bracelet, Initial Bracelet, Unbiological Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet for Women",
    "description": "Custom Birthstone Bracelet, Initial Bracelet, Unbiological Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet for WomenKeep your special dates in a unique, elegant and minimalist disc bracelet, embrace your siblings love with this perfect gift. It comes with a high quality plated diamond cut chain, which will shine from all angels.H O W . T O . O R D E R• Please look at the images above in the listing. We've have showed where to choose your desired initial for your necklace.• If you do not see the information you're looking for, or have any questions. Feel free to message us, we are lightning fast with our responses :)C H A R A C T E R ∙ S P E C I F I C A T I O N S★ Please leave us your desired initial and the number of birthstone at the checkout note.I T E M ∙ S P E C I F I C A T I O N SDisc: approx. 0.47\"(12mm)Birthstone: 0.88\" x 0.21\"(22.5mm X 5.5 mm)Chain: adjustable up to 7.5\"(19.5cm). Please let us know if you need shorter or longer chain at checkoutP R O D U C T ∙ M A T E R I A L- Charm Finish: Gold Plated / Silver Plated / Rose Gold Plated- Chain Finish: Gold Plated / Silver Plated / Rose Gold PlatedC A R E ∙ I S T R U C T I O N SAlthough our jewelry are high quality with extra layers of coat for long lasting, yet plated jewelry should be cleaned periodically. To extend the life of your jewelry, it’s very important that you keep it dry (never bathe or spray perfume on your jewelry, chemical reactions with chlorine and other elements such as perspiration can lead to tarnishing). Remove jewelry when sleeping, exercising, or doing physical activities, as prolonged contact with sweat will cause the plating to wear away faster. Never use abrasives chemicals or products to clean your jewelry. After each wear, gently wipe each piece of jewelry clean of make up and skin oils with a soft, lint-free cloth in order to avoid scratching. Since rose gold pieces are more sensitive because of copper usage (in order to turn the color from gold to rose gold), please care as instructed above.T U R N ∙ A R O U N D ∙ T I M E- All items are custom made to order. Our turn around time is 1 business day.S H I P P I N G- Domestic: 3 - 5 business days- International: 7 - 14 business daysPlease note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.",
    "reviews": [
      "Received the order quickly like in a week. Have ordered from this seller before was very pleased. Would definitely order again.",
      "My sister loved this gift! Thank you.",
      "Gift was a success! Highly recommended.",
      "Person who received gift loved it"
    ]
  },
  {
    "productId": "AhyFvgbvDC",
    "url": "https://www.etsy.com/listing/1535088081/custom-mama-sweatshirt-with-kid-name-on?click_key=c1306dcefb005c63cea8d7d596ee355b011d06bf%3A1535088081&click_sum=c30a227d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-10&pro=1&bes=1",
    "title": "Custom Mama Sweatshirt with Kid Name on Sleeve, Personalized Mom Sweatshirt, Minimalist Momma Sweater, Christmas Gift for Mom, Gift for Her",
    "description": "Custom Mama Sweatshirt with Kid Name on Sleeve, Personalized Mom Sweatshirt, Minimalist Momma Sweater, Christmas Gift for Mom, Gift for HerHello everyone! Welcome to TrendTeesApparel store. Here, you'll find a wide selection of affordable, high-quality personalized designs and unique creations perfect for your friends, family, coworkers, and loved ones. Our prints are created using the latest technological materials, ensuring exceptional quality. Each order is meticulously prepared using top-quality inks during the production process.T-shirts hold a special place in our hearts as they allow us to express important moments, memories, and sometimes words that are difficult to say. Whether it's Mother's Day, Father's Day, Halloween, Christmas, or Thanksgiving, our collection offers the perfect gifts for your loved ones.Finding the right size is crucial for a comfortable fit. We highly recommend reviewing the size chart available among the product photos. Please note that our t-shirts are unisex, and if you order with a regular women's size, it will have a more loose-fitting.To Make Your Ordering Process Seamless, Please Follow These steps:- Read all the relevant information and review the product photos.- Select the desired t-shirt type and choose your size from the first dropdown menu.- Choose the color of the garment from the second dropdown menu.- Click \"Add to Cart.\"- Interested in ordering more products? Simply click the back button and repeat steps 1-4.- Once everything is in your cart, select the shipping method, enter your correct address, and click \"Proceed to Checkout.\"For custom t-shirts, you'll find an additional section at the bottom dedicated to specifying the design details. Please enter your personalization details there.Our promised order processing timeframe is 1-2 business days, and we strive to ship on the same day whenever possible.During holiday seasons, there might be higher demand, but we'll make every effort to ship your order promptly. If you need your order earlier or have an approaching event, please add a note to the seller during the payment process. Shipping options include First-Class Mail, which takes 1-5 business days, and Tracked Priority Mail with a 2-3 business day delivery time.Attention! We kindly ask you to note that we do not accept returns or cancellations unless the products are damaged.Our t-shirts are specially made for your special day. If you have any issues or concerns regarding your purchase, please reach out to us directly so that we can ensure you receive exactly what you're looking for.- To keep your products in great condition, we recommend washing them inside out with similar colors.- Please use non-chlorine bleach only and tumble dry at a low setting.- Ironing is safe at a medium temperature, but please avoid ironing directly on the decoration.- Dry cleaning is not necessary.Thank you for choosing TrendTeesApparel. We strive to provide an exceptional shopping experience for you. If you have any further questions or need assistance, please don't hesitate to contact us. Happy shopping!",
    "reviews": [
      "I bought this for my daughter, and she loved it!",
      "Really cute and material is soft",
      "Ordered two of them as gifts, and they are adorable. The mothers will love them.",
      "The item was great! It’s a very cute gifts for mama’s. I do however wish the quality was a little more heavy feeling… but overall it is adorable."
    ]
  },
  {
    "productId": "NE1fECOcLc",
    "url": "https://www.etsy.com/listing/1589315828/personalized-charcuterie-board-cutting?click_key=319e38ad6d113b421134c6ff0f3de4bcc1dcbe26%3A1589315828&click_sum=9358e09b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-11&pro=1&frs=1&bes=1",
    "title": "Personalized  Charcuterie  Board, Cutting Board, Hostess Gift for Couple, Home Gift, Wedding Gift, Housewarming Gift, Unique Christmas Gift",
    "description": "🔹 Product Highlights 🔹Explore our Exquisite Marble Charcuterie Board Set – the Ultimate 11-Piece Addition to Elevate Your Entertaining Experience! This opulent set includes everything you need to create a stunning presentation of meats, cheeses, and appetizers.🔹 Key Features 🔹Meticulously crafted from premium marble and acacia wood, our serving board boasts a unique and sophisticated design. Measuring 15.5 inches in length, 11.75 inches in width, and 0.5 inches in thickness, it offers both durability and elegance. The set also comprises three ceramic bowls for dips and accompaniments, complemented by three wooden spoons and a four-piece cheese knife set, all made from top-quality materials.🔹 Personalized Laser Engraving 🔹Make it uniquely yours with our laser engraving option! Choose from a variety of designs and customize the red areas with a name, date, or special message. Our laser engraving ensures a lasting and personalized touch.🔹 Natural Wood Beauty 🔹Embrace the natural charm of acacia wood, featuring varying colors, markings, knots, and rustic details, making each board truly one-of-a-kind.🔹 Care and Maintenance 🔹To maintain the marble and acacia wood's beauty, hand wash the serving board and apply mineral oil for a polished finish. With proper care, this Marble Charcuterie Board Set will be a timeless addition to your entertaining repertoire.Why wait? Elevate your hosting game and leave a lasting impression on your guests. Add this exquisite set to your collection today!",
    "reviews": [
      "I ended up missing a few pieces of the item and the seller promptly had them delivered. Beautiful wedding gift for our friends",
      "The couple we sent it to absolutely loved it. It shipped quickly too!! Highly recommend!",
      "Looks perfect - just as ordered"
    ]
  },
  {
    "productId": "xYiVPGPKig",
    "url": "https://www.etsy.com/listing/723223131/personalize-groomsman-gift-set-of-6-men?click_key=dfe42db404fec384455f39ed992a5c81dd0b3e77%3A723223131&click_sum=04b4ecc0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-12&pro=1&bes=1&sts=1",
    "title": "Personalize Groomsman Gift Set of 6 Men Shaving Toiletry Leather Travel Bag Dopp Monogram Wedding Gift Groom Best Man Brother Father Husband",
    "description": "Dopp Kit - Pricing includes embroidery.Affordable gifts for the Groom, Fathers, or Groomsmen on your wedding day. Spacious to hold personal toiletries and belongings. Great as gifts and every day use.♥ Shaving Bag Details:· Material: PU Faux Soft Leather· Measurements: 8.5 x 6 x 4· Interior: Polyester Lining· Zipper Closure· Side Loop♥ Embroidery Options: Max 3 letters· 1 Letter, 2 Initials, or 3 Letter Initials (first, middle, last)♥ Add-On Rush Fees:· Ship within 14 days ($25)· Ship within 7 days ($50)♥ Note for 3 Letter Initials for Men· Men Initials should be in first, middle, last and will be embroidered same size across.♥ SHOP POLICIES:· By purchasing any listing from Love Meets Craft, all buyers acknowledge that they have read and understand the \"Item Details\" described in all listings and shop policies. Thank you.· All items are made to order.· Shop cannot be responsible for incorrect initials provided.• Due to variation between every monitor, smart phone and tablet display, the colors shown may appear different in person.· Personalized gifts do not qualify for returns. If there is a mistake, please contact us.· Customer satisfaction and happiness is our number one priority!♥ All images are property of Love Meets Craft",
    "reviews": [
      "Came faster than anticpated. They look amazing.",
      "Color and stitching look amazing. Made great gifts fast service! Would recommend and definitely order from again!!",
      "Loved the color of these for groomsmen!"
    ]
  },
  {
    "productId": "TEXaYxLEFM",
    "url": "https://www.etsy.com/listing/275810668/personalized-log-candle-all-wax-scented?click_key=3979853f69f924dabbbbc070d08288d9f3f13de4%3A275810668&click_sum=9050e899&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-17&etp=1",
    "title": "Personalized Log Candle (All Wax) Scented Soy Names Valentines Day, Boyfriend Gift, 16th Anniversary, wedding shower for him or her romantic",
    "description": "Our Love Log Candle set is a perfect way to preserve the tradition of when couples would carve their names date into a tree to symbolize strong, everlasting love.When adding a date you can start a fun tradition of lighting this candle together every year while your love grows strong just like a beautiful Oak tree.Choose a scent and enjoy the wonderful aroma even without burning it and your beautifully made Oak candle brings nature inside your home!If you decide to burn your candle do so with care and follow the special burning instructions included in your order.6\" tall × 3 1/2” wideAdd Tea light insert option to receive your candle with a plastic cup in-bedded in the candle to burn instead of burning actual candle.The tea light will be scented your choice of scent when ordering, or unscented if chosen.  We sell replacement tea lights also or you can order your candle with a 6 pack in options.*Each Candle is 100% Wax and created completely by hand.  They are poured, sculpted, carved, then colored so each one will be unique and no two are ever exactly alike making yours even more special.",
    "reviews": [
      "She absolutely loved it, came out great thank you",
      "Absolutely adorable gift idea! <3",
      "It turned out so good! It smells wonderful, looks great, and was a perfect gift for my boyfriend! Couldn’t be happier!",
      "Looks great, thanks so much"
    ]
  },
  {
    "productId": "RTLPFCsuJk",
    "url": "https://www.etsy.com/listing/811792213/personalized-wooden-recipe-book-binder?click_key=646bbdb3253c4038c9662f9c91e629ee3290a1ef%3A811792213&click_sum=4cfe3e08&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-18&pro=1&etp=1",
    "title": "Personalized Wooden Recipe Book Binder Custom Journal Cookbook Notebook Valentine's Day Bridal Shower Gift Daughter  Birthday Gift Gift Moms",
    "description": "Personalized Wooden Recipe Book Binder Custom Journal Cookbook Notebook Valentine's Day Bridal Shower Gift Daughter  Birthday Gift Gift MomsI am glad to see you in our store and are ready to offer you a wonderful recipe book, which can become a good helper in your kitchen, complementing the interior of your home, which will emphasize your refined taste.This beautiful wooden cookbook can also be used as a diary, drawing album, photo album, wedding album, guest book, wish book, diary, planner, keepsake book, adventure magazine or honeymoon. We offer 9 different types of paper and any engraving on the cover.Our store also has MANY OTHER NOTEBOOK OPTIONS:https://honeythewood.etsy.comYou can also use it as a unique gift. The structure of the wood looks different in every product. Never and no one can repeat your gift 100%. That is why it is a truly special gift.- FREE PERSONALIZATIONYou get free personalization of the front and back covers; you can make this book an unforgettable gift for any occasion, especially on the 5th wedding anniversary, where the traditional gift is a wood. I can engrave a few words or logo on the front or back of the notebook, just let me know. If you want to change the image on the cover shown here, just tell me in the “Notes to the seller” when placing the order the type of graphic material that you want, and also what you want to engrave.- PAPER:We offer 9 types of paper - Kraft, black, crystal white, dots, lined, milky white, watercolor cardboard with texture, recipe colored  pages and black and white recipe cards.All our paper is made without chemicals and bleaches!- MATERIAL:The cover of the recipe book is made of wood, Birch plywood of the premium quality, with a special coating for wooden products or without it (Natural color), which gives a unique color to wooden veins and deeply penetrates and protects the product.- COVER COLORSWe offer 5 colors for the cover. Please indicate the number of the color you need in the \"Notes for the seller.\" The color may be slightly lighter or darker than shown here, as it is a natural wood.Please note that only natural color is used for printing.- DIMENSIONS:- Available in three sizes: A4, A5 and A6. See photo No. 3 for accurate measurements. Please note that A4 comes without string elastic!- Each recipe book is supplemented by the paper of your choice (100 pages or 38 cardboard pages). If you need more, you can buy it by clicking on the link:https://www.etsy.com/listing/799359258/extra-block-of-paper-for-our-notebooksHOW TO ORDER:1.  Choose notebook size and papers.2.Personalization. Put all the engraving instructions in the “Add your personalization” box.3. Add the listing to your shopping cart4. Proceed to payment5. Make sure Etsy shows your correct delivery address and submit the payment to complete your order.- DELIVERY AND HANDLING INFORMATION:REMEMBER: production and shipping are 2 different processes. Each process has its own timeline.Track number will be provided.Usually delivery takes from 10 to 15 days, with standard airmail there are no clear dates, so we cannot guarantee the exact delivery date.*When you buy our product, you support Ukraine and our army, we make transfers of funds for support, and we want world peace!*- If you have any questions, please click “Contact the seller” next to the price, and I will answer as soon as possible!We wish you a happy shopping and all the best!",
    "reviews": [
      "Great Christmas gift for my daughter in law",
      "Very pleased. Made my wife super happy.",
      "Beautiful! My friend loves it!"
    ]
  },
  {
    "productId": "uOHmdRVwZO",
    "url": "https://www.etsy.com/listing/1596113752/mama-keepsake-sweatshirt-with-puff?click_key=9081aa743a79a10f15770a2984c8727007fd70a2%3A1596113752&click_sum=b976cf8f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-19&pro=1&frs=1&etp=1&sts=1",
    "title": "Mama Keepsake Sweatshirt with Puff Lettering, Personalized Kid Names on Sleeve, Mama Sweater, New Mom Gift, Maroon",
    "description": "The ideal present for a mom is our super soft mama sweatshirt! It boasts a minimalistic, embossed puff design that exudes both comfort and style, making it perfect for home and running around. To make it even more unique, personalize the left (outside) sleeve with the children's names, adding a special touch that mom will cherish.We offer a beautiful selection of sweatshirt colors and puff wording colors.SHOWN IN MAIN PICTURE - HEATHER MAROON w/ SILVER PUFFSizes: SM - 2XL (We do carry some colors in 3XL and 4XL)  Please ask be fore purchasing.Puff Colors: Black, Silver, Gold, White, NavySweatshirt Colors: White, Sand, Ash, Athletic Heather, Dark Heather, Black, Navy Heather, Maroon Heather (Looking for a different color?  Just Ask before ordering)Care Instructions:- Wash inside out.- Do not iron or dry clean as it will flatten the puff emboss.- Machine wash on cold.- Hang to dry or tumble dry on low.",
    "reviews": [
      "This was a great purchase!",
      "This was a great product",
      "I bought this as a gift for my best friend and she loved it!"
    ]
  },
  {
    "productId": "GxupRZ9swu",
    "url": "https://www.etsy.com/listing/1166420927/custom-photo-keychain-personalized-photo?click_key=5a71a27d76cbc4189d512e79f7e58780542c5168%3A1166420927&click_sum=a5ff56d4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-20&pro=1&etp=1&sts=1",
    "title": "Custom Photo Keychain | Personalized Photo Keychain | Anniversary Gift | Gift for Him | Gift for Her | Christmas gifts",
    "description": "Personalized Photo Keychain for family, friend and lovers.Do you want to get a matching plaque just for $8.5? Please add the below listing to your keychain order.https://cocobananadesigns.etsy.com/listing/1644535966/matching-plaqueWe don't provide the proof to reduce design cost and production time. If you need a preview or digital proof before the item made, it's available with a $3 fee. Please add the below item to your order.https://cocobananadesigns.etsy.com/listing/1635664660+ D E T A I L S +Material: High Quality 1/8\" AcrylicMeasurements: 2\" x 2.75\"+ C A U T I O N +* Digital proof(preview) is available with a $3 fee.* A high resolution photo is recommended in order to achieve a clear print. There is a risk of a pixelated image if the resolution is too low. You will get what you give us.* Feel free to ask if you have any special request.Thank you!",
    "reviews": [
      "The picture is clear and my boyfriend loved it!",
      "Good product. My fiancé loved it",
      "very cute my boyfriend loved it",
      "The quality was amazing and the seller was extremely kind!"
    ]
  },
  {
    "productId": "leWJzAfmoA",
    "url": "https://www.etsy.com/listing/1012644224/family-tree-wood-frame-fully-customized?click_key=973f07b1530f839a4a81ec0da57bd5921d195828%3A1012644224&click_sum=9bdb8c85&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-21&pro=1&etp=1",
    "title": "Family Tree Wood Frame - Fully Customized, Mother's Day, Father's Day, Grandma Gift, Mom Gift, Adoption Gift",
    "description": "The perfect sentimental gift for Moms, Dads, birthdays, grandparents, adoptions, new babies, Christmas, any occasion! The smaller size is meant for a mantlepiece or bookcase, the larger can go on the wall; please see the sizing below so you are 100% satisfied with what you are purchasing.  Cut, engraved and hand-assembled from 3 different types of layered wood (maple, walnut, and cherry), this one of a kind family tree art box is an heirloom-quality mantlepiece that will last for years to come. A light layer of shellac protects the wood from light stains and humidity. An easel stand is included.Important: Please read all details below to understand sizing, my processing times and shipping options.Sizing will depend on the number of names you'd like engraved. For example:Standard Sizing:1-3 names = 6\" x 6\" square3-12 names = 5.25\" x 8.25\"Interested in making it bigger? We now offer a size upgrade on all pieces!Choose \"XL\" for the following sizes:1-3 names = 8\" x 8\" square3-12 names = 7.25\" x 11.75\"13-25 names = 8\" x 18.25\"Note: I can also make 10, 11 or 12 names in the 8\" x 18.25\" size, look at the \"EX\" option.PERSONALIZATION:1. When ordering, please note what you'd like your personalized FRAME to say (up to 16 characters) if different from the choices given.2. Include a list of names you'd like engraved on each heart. One name per heart, no middle names please (too many letters do not look great).3. When listing names, please list in the order you'd like to see them from LEFT to RIGHT.4. Indicate if you'd like a paw print (or other) next to any of the names to indicate a fur baby family member or wings to represent the deceased.5. Please double check the spelling of names; once they are engraved, they are permanent and I cannot be responsible for spelling errors on your part.Future add-ons: If you are expecting additions to the family soon, I suggest ordering blank hearts built into your piece. You can purchase an engraved, adhesive heart later here:https://www.etsy.com/listing/1301022545/family-tree-add-on-heartHandmade in our home workshop in Ontario, Canada. Due to the handmade nature of this item, each one will be slightly different -- slight irregularities in the wood are normal, and sometimes slight scorching occurs during the engraving process.Production times: These will vary throughout the year and I will update the listing accordingly -- if you need this for a busy holiday like Christmas or Mother's Day, please pay close atention to the production + shipping time. If you need it quickly, please contact me directly so I can expedite it for you and add on a shipping upgrade (link below). All of my homemade products are shipped from Ontario, Canada so please consider this when calculating transit times.",
    "reviews": [
      "My husband loved his gift.",
      "Awesome! Product, my wife loves it",
      "The item was ordered as a gift for my mother in law’s birthday. She absolutely loved it! We included the names of children and grandchildren",
      "This present was a hit with my mother in law. Thanks for such a quality gift!"
    ]
  },
  {
    "productId": "siZerliPUR",
    "url": "https://www.etsy.com/listing/1010578477/etched-picture-rocks-glass-fathers-day?click_key=61a84ada7fdeed5dfa358473422a6300f47100f1%3A1010578477&click_sum=d38add34&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-22&pro=1&etp=1&sts=1",
    "title": "Etched Picture Rocks glass | Father's day, dad gifts, personalized whiskey glass, personalized glassware, custom portrait, unique dad gifts",
    "description": "STEP 1) CHOOSE GLASS TYPE FROM DROP DOWN LISTChoose from either a single Rocks, Can, Stemless Wine, Pint, Beer Mug, Coffee Mug OR choose a Set of Two Rocks Glasses.STEP 2) CHOOSE TEXT OPTION FROM DROP DOWN LISTAdd text in “PERSONALIZATION BOX” Please correct any spelling errors prior to submitting the order. Your order will be copy and pasted word for word from the “personalization box”. Please NO emojis and heart icons. 4 word max on glasses with text below and 10 word max on glasses with text on back.STEP 3) SUBMIT PHOTO AND ORDER NUMBER THROUGH “MESSAGE SELLER” ICONWe recommend images with high resolution, high contrast and good lighting. Photo etching results will vary from order to order based on the quality of the image provided. Feel free to reach out with any questions or concerns. Screenshots are too low of quality to etch nicely.STEP 4) FINAL PRODUCT IMAGEWe will snap a quick picture of the FINAL PRODUCT once your order has been produced. We provide a 24 hour review window for adjustments. If you are looking to change the image or make adjustments there is an additional $15 Re-make fee.All images, order details and final product review images will be sent through the ETSY conversation thread. (please NO EMAILS) Each glass we make is unique and custom made. We hope you love yours!*********************$15 RE-MAKE FEEIf you are unhappy with your order, we ask that you let us know before we ship the item. If you are looking to change the image or make adjustments to an order there is an additional $15 Re-make fee. *Note* If you have an item Re-made you will only receive one item. You will not receive both the original and the remake. We do not accept cancellations or refunds once the order has been shipped. If you are truly unhappy with the etching results please let us know prior to shipping the item.GLASS TYPE & APPROXIMATE PHOTO ETCHING DIMENSIONS*Etching size will vary depending on the dimensions of the photo.Stemless Wine (Etching size 3”H)Can Glass(Etching size 3”H)Pint Glass (Etching size 3”H)Coffee Mug (Etching size 2.5” H)Beer Stein Mug (Etching size 3”H)Rocks Glass (Etching size 2.5” H)Please DO NOT send screenshots of images. The quality is too low to etch nicely.Please DO NOT email us on GMAIL. Please send us all images and messages through the ETSY chat platform. We want to keep all order details on ETSY.Please DO NOT send nude or naked body photos.",
    "reviews": [
      "I bought one and it came out so great I ended up buying 3 more to make a full set to give to my husband for Christmas. He absolutely adored them as I did all photos of him and our new daughter. Customer service was so quick and helpful.",
      "Husband loved this for Valentines Day! Thanks so much!",
      "This was perfect and it was loved by all"
    ]
  },
  {
    "productId": "qmMCZgXNGL",
    "url": "https://www.etsy.com/listing/1076523876/birth-month-flower-personalized-outdoor?click_key=725c48aee3fc965b59d85eb806af3e426f1a6d56%3A1076523876&click_sum=37266873&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-23&pro=1&frs=1&etp=1",
    "title": "Birth Month Flower Personalized Outdoor Flower Pot, Personalized Gift for Her, Mother's Day Gift, Gift for Grandma, Flower Pot, Potter Plant",
    "description": "Our beautiful Birth Month Flower Personalized Outdoor Flower Pot is a perfect gift for grandmas or moms for Mother's Day or any special occasion. The custom birth month flower design will represent a floral bouquet of all her loved ones.𝙋𝙚𝙧𝙨𝙤𝙣𝙖𝙡𝙞𝙯𝙖𝙩𝙞𝙤𝙣 𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣:- Line 1 in Bold: up to 18 characters- Line 2 in Script: up to 24 characters- Names: Up to 6 names with up to 12 characters per name- Flower: Select the birth month for each name.- Optional Date: up to 8 characters𝙋𝙇𝙀𝘼𝙎𝙀 𝙉𝙊𝙏𝙀:Spaces and punctuation count as a character. If no personalization is wanted; please place a 𝑷𝑬𝑹𝑰𝑶𝑫 \".\" in the name's text box.𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- Plants not included- Flower pot features traditional design with raised rim and drainage hole- Item is highly recommended for outdoor use only because of drainage hole at the base- Beautifully crafted of fine-quality, heavy-weight, chip-resistant stoneware- Measures 7.25” H x 6.5” in diameter",
    "reviews": [
      "Quality exceeded my expectations! Can’t wait to gift!",
      "Thanks a lot for the gift",
      "This was a birthday gift for my mom and she loved it!",
      "Turned out even better than expected!"
    ]
  },
  {
    "productId": "gOcXqrKqeL",
    "url": "https://www.etsy.com/listing/956902557/personalized-toy-truck-customized-with?click_key=19df5abb9920b5599ed7349f57d6aaf1922a8e42%3A956902557&click_sum=e92ecf9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-24&pro=1&etp=1",
    "title": "Personalized toy truck, customized with your child's name on the side of the truck: birthday, Christmas, any event for children!",
    "description": "Personalized toy truck is customized with your child's name on the side of the truck: great gift for birthday, Christmas, any event for children!  You choose the image (baseball, football, soccer, basketball and more).  You choose the colors and then tell us what name you want on the truck.How can you be sure we have the name you want?  Because we make the toy to order... ANY name!  Tell us what you'd like, and we make it custom just for your child!This is a 1/87th scale toy truck.  For an idea of size, watch the video.  Please note that this toy is intended for ages 3 and up.While we cannot promise delivery dates, I am able to ship your order within 48 hours if you need it soon.  Message me when you order and I'll get it out as soon as possible.Thank you for visiting my store!",
    "reviews": [
      "It is awesome! It is the perfect gift!",
      "It's so awesome my son loved it",
      "So cute but somewhat annoying how easily the truck comes apart where the trailer attaches",
      "Great quality truck! Love the customization, thank you so much!"
    ]
  },
  {
    "productId": "wRNpKOmUVB",
    "url": "https://www.etsy.com/listing/1007552508/personalized-mens-bracelet-mens-leather?click_key=2d44426c9a4c926787e88b1eac877ae63a3c9e52%3A1007552508&click_sum=45a19c55&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-13&frs=1&sts=1",
    "title": "Personalized mens bracelet • Mens leather bracelet with kids names • Personalized gifts for dad • Gifts for men • Mens jewelry • dad gifts.",
    "description": "Surprise your loved one with a simple yet very meaningful gift. Each Bead can be personalized with your own unique message. Popular personalization include family names and special dates. The engraved Beads of our Men Braided Leather Beads Engraved Bracelet create a beautiful symbol of never-ending love. Whether you're a romantic at heart and want yours and your sweetheart, father, fiancée or husbands name stamped on this Men Braided Leather Beads Engraved Bracelet, or prefer having your son or daughter's name stamped across this wonderful piece, we are happy to provide you with a beautiful bracelet you can treasure forever.❥ Bracelet's specs:• Material: Genuine Nappa Leather• 925 Sterling Silver Charms• Length: Small wrist 6.5\" (Perfect for women's) - Standard Wrist (7.5\"\" - Large Wrist (8.5\") - Extra large (9.5\")• Charm Width: 10mmFor personalized engravings, please limit text (letters and numbers only) to a total of 9 characters or less. Entries must not exceed 9 characters.❥  Free Shipping:• United states:  3-5 business days.• Canada: 5-8 business days.• United Kingdom: 5-8 business days.• Australia: 7-10 business days.Be advised to check the estimated delivery time before placing your order, as we are unable to cancel your order once it has been processed. These are finale sale.If you have any questions, please feel free to contact me.Myriam♥",
    "reviews": [
      "Great quality. Comfortable. My husband loves it",
      "Looks really nice and fits well",
      "This is the second time I am buying the bracelet. I gifted this to my husband a year ago and he doesn’t take it off, I am buying a second one because the first one is starting to smell haha.",
      "My husband loved his bracelet!"
    ]
  },
  {
    "productId": "lFXwiKhaNP",
    "url": "https://www.etsy.com/listing/1617966287/personalized-makeup-bag-custom?click_key=6771335776ff09257c8331a93897af2a4c4464a7%3A1617966287&click_sum=bd3d381f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-14&pro=1&bes=1",
    "title": "Personalized Makeup Bag | Custom Embroidered Travel Cosmetic Bag | Valentines Day Gifts for Her | Bridesmaid Gifts | Birthday Gift for Women",
    "description": "Personalized Handheld Makeup Bag is a practical solution for your beauty essentials, with a touch of enduring personalization. Designed for easy access and storage, this bag features a large opening for quick touch-ups and a soft, cloud-like texture that adds comfort to your beauty routine.🌟Product Details🌟Material: Vegan leatherSize: 9.2\"L x 4.3\"W x 4.1\"H🌟Product Features🌟- Organized Compartments: Enjoy easy access to your cosmetics with multiple sections for specific items. The case includes compartments for eyebrow pencils, skincare products, makeup brushes, color essentials, and makeup setting items.- Spacious Design: With dimensions of 9.3\"L x 4.1\"W x 4.3\"H, this case provides ample space for your daily beauty essentials. The handle ensures convenient portability.- Durable Craftsmanship: Crafted from vegan leather, this bag is stain-resistant. The sturdy gold zipper and padded, quick-drying moisture-wicking lining add durability. Three elastic sliding mesh pockets are designed for makeup brushes and tools, and zippered areas for grooming tools like a small mirror. Two large common areas provide space for a variety of cosmetics.- Enduring Personalization: Elevate your beauty routine with enduring personalization through embroidery. Unlike vinyl stickers, our embroidery ensures a permanent and lasting customization that won't fade or fall off.- Practical Gift: Available in a variety of colors, our Personalized Handheld Makeup Bag makes a practical and thoughtful gift for various occasions – friends, family, women, bridesmaids, birthdays, holidays, and more.Experience organized beauty with our Handheld Makeup Bag – a functional companion for beauty on the go, personalized with lasting embroidery. Whether it's for yourself or as a gift, this case ensures a convenient and enjoyable beauty routine.🌟How to care🌟Apply Heat:Use a hair dryer or a heat gun on a low setting to apply heat to the leather surface. Keep the heat source at a safe distance to avoid causing any damage to the leather.Massage the Leather:While the leather is still warm, massage the affected area by pushing and rolling the leather from all sides. This aims to help the leather regain its original shape and lift the pressure mark.Cool Down Rapidly:After massaging, cool down the area rapidly. You mentioned using a cold iron or cooling element for this purpose. This step is intended to set the reshaped form.Push from Behind:If possible, work on the pressure mark from behind the leather. This can make it easier to push and manipulate the leather to remove the mark.🌟Social Media🌟Stay informed on all of our latest products and sales by following us on social media.Facebook: https://www.facebook.com/HundredHeartsDesignsInstagram: https://www.instagram.com/hundredheartsdesigns/🌟About shipping🌟DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.🌟Note for international shipping🌟-Please leave full name and contact number.-The customer is responsible for all duties and taxes.Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.For product value over this limit, there will be import taxes, fees, and customs duties (hereafter, \"Import Fees\"), levied by the customs office of your shipping destination, it could be around 10-25% in total, depending on regulations of local authority.As all of our products are personalized, we will not issue a refund to return-to-sender goods due to unpaid custom duty fee.-----------------------------------------------------makeup bag, gift for her, bridesmaids gifts, maid of honor gifts, cosmetics bags, personalized bag, Personalized Gifts, Wedding Gifts, Bridesmaid proposal, Bridal Party Gifts, Custom maekup bag, leather makeup bag, birthday gifts, girlfriend gifts, gifts for women. Christmas gifts, gift for friend, gift for mom",
    "reviews": [
      "I like the color and detail. Great bag!",
      "Customer service was great! Perfect gifts!",
      "It is beautiful 😍!  It's exactly what I wanted. Great quality.",
      "Good quality and the personalizations are a very nice touch."
    ]
  },
  {
    "productId": "COLFKExveo",
    "url": "https://www.etsy.com/listing/1599497040/custom-embroidered-dad-est-sweatshirt?click_key=a2f31e339b02fdb0a279910666b8ff16b631b334%3A1599497040&click_sum=4d0c1b10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-15&pro=1&bes=1&sts=1",
    "title": "Custom Embroidered Dad Est Sweatshirt with Kids Name on Sleeve, Personalized Gift for Dad, New Dad Hoodie for Fathers Day Birthday Gift",
    "description": "✨✨✨CUT OFF FOR VALENTINE DAY'SOur store can guarantee your order will arrive before Valentine's Day if you order before February 6th.UNIQUE GIFT IDEA FOR DAD, NEW DAD, FIRST TIME DAD WITH DAD EST KIDS NAMES🔎 Want to bring tears of joy to your dad's eyes?✔ Looking for a gift that will make your dad's heart swell with pride?✔ Want to make your dad's Father's Day or birthday unforgettable? Gift him a Dad Est. hoodie, customized with his kids' names embroidered on the sleeve. It's a gesture that honors his role as a new dad and shows your appreciation for his love and dedication.👉🏻 CREATE A MEANINGFUL GIFT FOR DAD TODAY!❗ Please note: After placing an order, please send the image with the order ID to the Etsy seller through the \"Meet your sellers\" message. (Design proof 1-3 days)❗[COLOR AVAILABLE]✅ Gildan ® : Sand, Black, White, Sport Gray, Dark Chocolate, Forest Green, Light Pink, Light Blue, Maroon, Navy, Charcoal, Dark Heather, Royal, Orange, Military Green (Outstock), Heather Sport Dark Green (Same color military green), Indigo Blue.STORE INFORMATION▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ 848 San Isabel St, Hartsel, CO 80449, USA✅ Design proof (for customized products or if you request): 1- 2 business days (Outline and text embroidered products) | 2 - 3 days (for fully embroidered products)➤ Manufacturing & shipping address: 848 San Isabel St, Hartsel, CO 80449, USA➤ Package arrives in 3-5 days (After design proof + embroidery for customized products)[COLOR AVAILABLE]✅ Gildan ® : Sand, Black, White, Sport Gray, Dark Chocolate, Forest Green, Light Pink, Light Blue, Maroon, Navy, Charcoal, Dark Heather, Royal, Orange, Military Green, Indigo Blue.ORDER GUIDE:▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤Step 1: Click and select on the list to see more details about the product, including size, color, and any possible customization options.[COLOR AVAILABLE]✅ Gildan ®: Sand, Black, White, Sport Gray, Dark Chocolate, Forest Green, Light Pink, Light Blue, Maroon, Navy, Charcoal, Dark Heather, Royal, Orange, Military Green, Indigo Blue.➤Step 2: Review your cart to make sure you have selected the correct item and quantity, then click the \"Proceed to Checkout\" button.➤Step 3: Enter the shipping address information and fill out the personalization box.➤Step 4: Click the \"Place Order\" button to complete your purchase.(Add twice to cart for two couples product)➤Step 5 : Check your message box on Etsy within 1-3 days if it is a custom product to receive design proof.The order will be produced and sent after all your questions have been processed (e.g., design edits, photo replacements, customizations, text edits, etc.).PERSONALIZED GUIDE:▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔Custom sweatshirts, hoodies, and tees will usually have four embroidery positions:➤On the chest: Left chest (above the heart), right chest, middle chest.➤On the sleeve: Left sleeve or right sleeve (you can customize both, one side is free).➤On the back of the shirt: In the middle.➤In the hood for hoodies.If you want to embroider any of these positions, please place an order and let us know in the Personalized box or via an Etsy message.Embroidery thread color and embroidery icon: You can flexibly choose the color of the embroidery thread or embroidery icon. If a specific color or icon is not available, you can send it to us via a message.NOTES WHEN PURCHASING▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔✅ Check your message within 1-2 days after ordering to receive design proof for personalized products✅ The big discount will end soon, get your offer early.✅ Custom products need to send clear, sharp images or according to image instructions.✅ You can change the embroidery thread color of each embroidery position, text or icon- You can also request different embroidery positions (Ex: hood on hoodie, back sweatshirt, both sleeve) for more embroidery positions there will be a nominal fee, please message us.- Order Cancellations are accepted for 12 hours after your purchase.PRODUCT AND BRAND DETAILS▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ Gildan ® brand➤ Unisex & Classic fit➤ 8 oz./yd² (US) 13.3 oz./L yd (CA), 50/50 cotton/polyester, 20 singles- Heather Sport colors are 60/40 polyester/cotton- Safety Green is compliant with ANSI / ISEA 107 high-visibility standards- 1x1 rib with spandex for enhanced stretch and recovery- Tear away label- Proud member of the U.S. Cotton Trust Protocol- Made with OEKO-TEX certified low-impact dyesORDER SUPPORT▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔➤ In case of any change after purchase, feel free to messenger us at Etsy seller through the \"Meet your sellers\" message, we will update it for you if the shirt did not embroider yet.➤ Some frequently asked questions will help you during and after the ordering process.➤ Messages are free. We are always ready to answer your questions.➤ For return orders:Only receive wrong embroidery, embroidery error, wrong size due to our store.- Just need the embroidery order missing some parts, wrong shirt design (10% -50%)When the design is done but you still want to cancel (70% refund)- In case you provide the wrong shipping address: We will charge a shipping fee of 30% of the order value or the shipping fee for the order (the value of the label we buy)- The order has a design but want to change it: please help me pay an additional $10 for the new design.Because all designs have a fee to buy.- For embroidery on the sleeve: I only embroider one sleeve, if you want to embroider both sides, please pay me $10.- Design implementation time: 1-3 daysLet us know when you'd like to wear an oversized piece so we can design it for you.THANK YOU FOR YOUR ORDER! 💕",
    "reviews": [
      "My partner loved it! Beautiful clean embroidery 🫶🏽",
      "This was amazing quality and I will defy be ordering from them again the shipping was also fast",
      "Quality was perfect and exactly what I wanted!",
      "Good sweater very nice gift"
    ]
  },
  {
    "productId": "yXjtOVlkUp",
    "url": "https://www.etsy.com/listing/776117718/personaliszed-watch-box-leather-with?click_key=77ea14a7792c32d36f3605e8ea061c2bd5480860%3A776117718&click_sum=ed34f6f6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81622-3-16&pro=1&bes=1&sts=1",
    "title": "Personaliszed watch box leather with engraved glass lid.",
    "description": "Description :This Personalised leather watch box with engraved glass lid., ideal gift for a Birthday, or Anniversary or even a groomsman gift, the gift displays a thoughtful and unique gesture for keeping watches and jewellery in a high end glass engraved case, safe and clean from dust and scratches.Is the perfect way to store and display a treasured watch collection. Crafted from  leather with an engraved glass lid, it features a grey velvet﻿ interior lined with 10 or 12 grids for storing your watches in style. The chrome hasp closure adds the finishing touch of luxury while ensuring that your watches are kept safe. A thoughtful and unique gift for any occasion, this personalised watch box will make sure your favourite timepieces stay safe and secure in timeless style.• 10 and 12 grid watch boxes available, made from leather.• Crafted with a chrome hasp to keep your watches safe and secure.• Personalised engraving on the glass lid of the watch box for an extra special touch.• Grey or Black velvet interior lining for added luxury feel and finish.• Ideal for any occasion such as fathers day,birthday, anniversary or wedding gifts.• Can be personalised with names, dates and messages for that extra special touch.• High quality construction, designed to last.• Great way to display, store and organise your watches in one place.• Soft velvet lined compartments protect watches from scratches and dust.• The perfect accessory for any watch lover.• Made, using only the finest materials and engraved and shipped here in the UK.",
    "reviews": [
      "Great service and product was lovely",
      "Was a wonderful present for my husband! Now his watches are safe and together instead of in boxes everywhere!",
      "Great product, very happy, would recommend"
    ]
  },
  {
    "productId": "UtBhrKgjPS",
    "url": "https://www.etsy.com/listing/1451077946/live-edge-charcuterie-board-personalized?click_key=e114e7a3d23840f68d2dbcb8f52b2b194b0dfff6%3A1451077946&click_sum=b66f85a0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-25&pro=1&frs=1&etp=1&sts=1",
    "title": "Live Edge Charcuterie Board Personalized Rustic Cheese Board Custom Olive Wood Board Live Edge Board 5th Anniversary Gift Wedding Gift",
    "description": "Indulge in the elegance of our Olive Wood Live Edge Charcuterie Board, meticulously crafted from a single piece of exotic olivewood, available in 16, 18, and 20-inch sizes. For larger dimensions up to 28 inches or unique shapes, simply drop us a message—our collection includes rare, customized pieces. 🌳✨Customize our olive wood boards with diverse designs and fonts, or share your bespoke ideas. 🎨💡Each board is a natural, handmade marvel from one olive wood piece, ideal for showcasing charcuterie, appetizers, or desserts. They make exquisite personalized wedding or anniversary gifts. 🧀🍰💝To complement our live edge cheese boards, we recommend the following accessories to elevate your culinary affair:▶ Olive Wood Cheese Knives Set (available with or without the holder)https://www.etsy.com/listing/1606068082/personalized-charcuterie-cheese-knives🧀🔪▶ Magnetic stand with four utensils (chisel knife, serving fork, heart knife, and thin knife)https://www.etsy.com/listing/1606793502/personalized-cheese-knife-set-for▶ Set of 3 Small Bowls (ideal for storing loose snacks like grapes, olives, and condiments such as sauces and honey.)https://www.etsy.com/listing/1327239153/small-olive-wood-bowls-set-of-4🍇🍯Explore more Live Edge Olive Wood Boards at:https://www.etsy.com/shop/ForestDecorShop?section_id=28640951🌿🪵*** Engravings are placed in the lower right corner by default, unless otherwise specified.*** This listing doesn't include the cheese knives, only the olive wood charcuterie board🛍️📝 O R D E R I N G ∙ I N S T R U C T I O N S: 🪚🪵Thank you for considering our personalized cutting boards! To ensure that your order is customized to your exact specifications, please follow these simple steps:→ CUSTOMIZE - Please provide us with the exact text that you would like engraved on your board. It's important to ensure that spelling, capitalization, and punctuation are all correct. If any line of information is missing, we will exclude that line. We kindly request that you double check all names and dates entered, as we are unable to accept returns unless the error was made on our end.→ BOARD TYPE - Choose your desired board size and design type from the drop-down menu. We offer a variety of sizes, from smallest 16 inch to large 20 inch. Note the true beauty of olive wood comes from its highly varied grain patterns—something we obviously can’t control. Artisans also hand-carve every item, so each work of art will naturally differ in cut, shape, grain, and size (+/- 1-2” on any given side).Please note that all of our cutting boards are approximately 3/4 inches thick.🌳🪚 Explore Our Maple, Walnut and Cherry Options 🪚🌳We also offer all of our designs on our stunning maple, walnut and cherry wood! If you're interested in purchasing one of the boards, please explore our selection by clicking the following link:https://www.etsy.com/shop/ForestDecorShop?section_id=42300272🚀📦F A S T ∙ F R E E ∙ S H I P P I N G! 📬🎁We're pleased to offer FREE shipping on all orders! Your order will be shipped within 48 hours of purchase from Utah, and we use a fast and reliable shipping method that typically delivers within 4-6 days.🚀📦 R U S H ∙ P R O D U C T I O N ∙ A N D ∙ S H I P P I N G ∙ U P G R A D E S🪚🪵If you're in a hurry to receive your cutting board, we've got you covered! You can order our rushed production service (+$25.00) to have your item guarantee shipped the same or next day. Plus, at checkout, you have the option to upgrade to expedited 2-day shipping with USPS Priority, UPS 3-day, 2-day, or next day air.https://www.etsy.com/listing/1372659195/📜🔍 P R O O F S 🖊️Want to ensure your cutting board is exactly how you want it? Order our proof add-on (+$7.00), and we'll send you a digital proof for approval before engraving and shipping. Please note that proofs must be approved within 72 hours of receiving them, or your order may be processed without an approval.https://www.etsy.com/listing/1356225535/proof-add-on🎁🎀 G I F T ∙ P A C K A G I N G 🎀🎁Surprise your loved ones with a beautifully wrapped gift and a heartfelt message. Add our gift wrapping add-on (+$10.00), and we'll package your cutting board in kraft paper with a tag, twine, and crinkle shred filling. The exact materials may vary depending on the product size and type.For an even more personal touch, include a handwritten note with your gift (+$5.00). We'll handwrite your custom message on a thank you, birthday, wedding, or holiday card (depending on the occasion and your preference).https://www.etsy.com/listing/1356228367/add-on-gift-wrap🪚🌲 P R O D U C T I O N ∙ A N D ∙ Q U A L I T Y ∙ C O M M I T M E N T 🛠️👨‍🔬At our store, we use high-quality sourced olive wood for our custom cutting boards. Before engraving, each board is thoroughly inspected and sanded to ensure a smooth surface. A high-quality food-grade mineral oil finish is applied to each board so that it is ready to use immediately upon delivery.Please note that every cutting board is unique since they are made from different types of wood. Therefore, slight color variations may occur, resulting in engraving that appears lighter or darker than the listing photo.🤲 C A R E ∙ A N D ∙ U S E ∙ I N S T R U C T I O N S 📝We provide a small care instruction card with all of our orders. To maintain the quality of the cutting board, do NOT put it in the dishwasher or submerge it in water. Hand wash the board and dry it immediately.We recommend that you do not cut on the engraved side of the board, which is the display side. If you purchase a juice groove board, please note that our designs are engraved on the juice groove side unless you clearly request otherwise in the \"Notes to Seller\" section.🔍👀 NOTE: Due to the natural origin of the hardwood used to make our cutting boards, color and grain variations in comparison to the listing pictures are possible.🌍 S H I P P I N G ∙ W O R L D W I D EYou may be responsible for extra customs import duties or taxes. 😞 We cannot predict or control this. If your item seems to be taking extra time to get to you, please check with your post-office / customs office. Standard international shipping for Canada and Europe typically takes 4-15 business days, while the rest of the world takes 8-25 business days for regular standard shipping. Please note that the BUYER is responsible for all duties and taxes accessed by your country. Potential duties and taxes are not included in your shipping price. If you would like to receive your items faster, we highly suggest expediting your shipping at checkout. 💨🎨💡 C U S T O M ∙ D E S I G N SWe can engrave your custom design, logo, or create something from scratch to meet your needs. Just send us a message and we can take it from there.💼 W H O L E S A L E ∙ AND ∙ B U L K ∙ O R D E R SThese personalized cutting boards make awesome corporate gifts, wedding favors, etc.If you’re interested in a custom design order or bulk order (company logo, etc.), kindly send us the specs to review. We will reply with the cost and delivery time.🛍️ SHOP ∙ A N D ∙ S A V EExplore the rest of our handcrafted collection and receive 10% off when you spend $350 or more. The discount will be added automatically at checkout.https://www.etsy.com/shop/ForestDecorShop📲 C O N N E C T ∙ W I T H ∙ U SFollow us on social media for new products, promotions, and giveaways:https://www.instagram.com/shopforestdecor (@shopforestdecor)https://www.facebook.com/shopforestdecorThank you for choosing our personalized cutting boards. We can't wait to create a unique and special piece just for you!",
    "reviews": [
      "Looks amazing shipping was fast.",
      "A + + It's beautiful",
      "Beautiful quality, ordered for my BFF, she collects boards",
      "Got this as a gift. My friend loved it!"
    ]
  },
  {
    "productId": "iFiWcIDKAt",
    "url": "https://www.etsy.com/listing/1040265117/love-you-personalized-wooden-box-gift?click_key=a32adb71ac956bc5be6cf173e70c47ce6eb82a6b%3A1040265117&click_sum=e26bcac1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-26&pro=1&frs=1&etp=1&sts=1",
    "title": "Love You, Personalized Wooden Box, Gift For Couples, Laser Engraved Custom Box, Keepsake Box, Memory Box, Personalized Gift, Boxes Wholesale",
    "description": "Personalized wooden box.This memory box is a marvelous gift! Personalized engraving makes your box unique and perfect for any occasion. It will help you memorize special moments of your life. Can be used to store photos, baby gifts, jewelry, souvenirs. This keepsake gift is the easiest way to show your love to the people you care about.External Dimensions:Size 1 - 8.5 x 6 x 3 inSize 2 - 8.5 x 8x 2.5 inInternal dimensions:Size 1 - 7.8 x 5.37 x 2.5 inSize 2 - 7.75 x 7.3 x 1.87 inORDERING INSTRUCTIONS1) Please choose the size and color;2) Please choose the design and engraving option.* If you want to add an inside engraving please select the option \"+Inside Msg\" in the drop down menu. Enter the design number OR your text in the personalization field before proceeding to checkout.Please check your text in the personalization field. Please check your uppercase and lowercase letters. We engrave exactly what you write.* The option \"blank (no engraving)\" means a blank box without any design or personalization on it. If you select that option please enter \"N/A\" in the personalization field.YOUR OWN DESIGNWe can engrave your own unique design. Just select the option \"Your Own Design\" and send us an image you want to be engraved.WHOLESALEYou can order 10 or more boxes with the discount. If you want to order 10 boxes, please select the option from the drop down menu. If you want to order more than 10 boxes, please send us a message and we will create a separate listing for you.PLEASE NOTE that due to the nature of wood - the coloring, markings, knots, minor cracks and rustic characteristics will vary. Each box will be unique!SHIPPINGDomestic shipping is free: 1 box - USPS First Class Mail (2-5 business days)2-10 boxes - USPS Priority Mail (1-4 business days)More than 10 boxes - UPS or FedExInternational Shipping: The items are usually sent using USPS First Class Package Service, generally the delivery time takes 2-4 weeks but we can't guarantee these time frames. Please note buyers are responsible for all duties and taxes accessed by your country. Potential duties and taxes are not included in your shipping price. We are not responsible for delays due to customs.You can find more similar items in the sectionThank you for shopping at WoodenBoxDepot!",
    "reviews": [
      "My email was replied very promptly",
      "Great value thanks.  Love it",
      "Beautiful and well crafted. Excellent turn over rate",
      "These are stunning! Easy to order, have personalized, and fast shipping."
    ]
  },
  {
    "productId": "nxeQPKAWpR",
    "url": "https://www.etsy.com/listing/1079539234/personalized-jewelry-for-her-gift-for?click_key=e09cb82e4d2e3b5c711ab22327e80370acf2eb5f%3A1079539234&click_sum=8c14290c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-27&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Jewelry for Her, Gift For bridesmaids, Unique Gift for women, Minimalist Design Name Logo Necklace - Name Necklace Personalized",
    "description": "Christmas Gift- Gift For The Bride, Unique Minimalist Design Name Logo Necklace - Name Necklace PersonalizedThis necklace brings you a chance to carry your name in style.We will design your name in a stylish unique logo.It is a passion for immaculate design and an innate understanding of the woman and her journey that drives Roberto Gold.Roberto Gold has always challenged traditional notions that endorse the view that jewelry was meant to display one's status and be worn sparingly.This Name Logo necklace is designed to make your daily wear meaningful, with artistic pieces that reflect your individuality, resonate with personal meaning, are crafted to be wearable, and celebrate your every day.Roberto Gold launched three years ago and what an amazing journey it has been. The pinch-me highlight would be coming to understand the magnitude of the community of wonderful clients around the world we created and who are the real heart of the brand.This piece of jewelry is designed especially for our 3rd anniversary.Features:⏺ MATERIAL: 925K Sterling Silver⏺ COLOR: Silver, 14k Gold, 14kRose GoldChain Lengths- 14 inches- 16 inches- 18 inches- 20 inchesBlack Friday SaleBlack Friday Deals",
    "reviews": [
      "customer service was great!  questions answered quickly and response immediate when issue with mailing came up",
      "It was perfect!! Thank you!",
      "I didn't need any customer service for this item",
      "Love the necklace, received it in timely manner"
    ]
  },
  {
    "productId": "PFcjdrvqjN",
    "url": "https://www.etsy.com/listing/1030426802/personalized-recipe-book-blank-binder?click_key=7ad0d9c4b6a4f38c64a96e6bba3554bd15b40fcd%3A1030426802&click_sum=ad91006f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-28&pro=1&etp=1&sts=1",
    "title": "Personalized Recipe Book Blank Binder Gift for Mom Wooden Cookbook Mothers Day Gift",
    "description": "Personalized Recipe Book Blank Binder Bridesmaid Gifts Wooden CookbookThe recipe book is a great gift for close person who loves to cook or could help you gather all your recipes in one place! We perform three steps of processing the cover. It means that this book last you for many years.Complete set:- Wooden cover;- Ring mechanism (for A6 and A5 books - a mechanism with two rings (30 mm (1.2 in) - diameter), A4 - a mechanism with four rings (30 mm (1.2 in) - diameter));- Elastic band;- Set of pages to choose (70 sheets);- Set of sticker dividers.More recipe book designs:https://www.etsy.com/shop/MakityShop?ref=seller-platform-mcnav&section_id=27931767Book sizes:1. SMALL 15x18 cm (5,9\"x7\") - pages A6 (4.1x5.8\")2. LARGE 19x24 cm (7,5\"x9,4\") - pages A5 (5.8x8.3\")3. EXTRA LARGE 25x32 cm (9,8\"x12,6\") - pages А4 (8.3х 11.7\")Sheets:You can choose one of the sets of pages (70 sheets): classic recipe pages, color recipe pages, lined, craft, milky white, or 50 sheet protectors.The sheet density is 80 g/m2. You can add an additional set of pages when choosing the size or order it separately:https://www.etsy.com/listing/773260067/recipe-card-pages-70-sheetsAlso, you can add a stand to your binder:https://www.etsy.com/listing/979267380/recipe-book-stand-for-a6-a5-a4-sizes?ref=shop_home_active_1&frs=1Processing time:We need 3-5 days to produce your book. After we will send the parcel and provide a tracking code.Estimated delivery time:1. 10-14 business days to the US.2. 6-12 business days to Europe.3. 14-18 business days to Canada.4. 10-12  business days to Australia5. 10-30 business days the rest of the world.If you have any questions feel free to ask me!With love,Makety team",
    "reviews": [
      "Good quality and was such a cute gift",
      "I love this. It's nicely made and looks just like in the picture. Item arrived quickly",
      "Just as shown in the pictures. Very satisfied.",
      "This is a great product! Well designed and made. It is just what I wanted and came pretty quickly considering it had to be shipped over the Atlantic 😁.   Thank you"
    ]
  },
  {
    "productId": "AWghnpGhiA",
    "url": "https://www.etsy.com/listing/1228586816/custom-mini-name-bar-bracelet-by-caitlyn?click_key=873678f00bb4ee50f466821e9d31932250397474%3A1228586816&click_sum=5df78f79&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-29&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Mini Name Bar Bracelet by Caitlyn Minimalist • Engraved Charm Bracelet with a Dainty Paperclip Chain • New Mom Gift • BM56F39",
    "description": "L I N K ∙ B A R ∙ N A M E ∙ B R A C E L E TPersonalize this bar bracelet with any names or words that are special to you. The paperclip bracelet chain can be accented with multiple charms to create the perfect customized gift.• Material: High Quality Solid 925 Sterling Silver• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• Bar Dimensions: ~15mm W x ~3mm H• All our work is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Select your desired FINISH, NUMBER OF BAR CHARMS and LENGTH from the drop-down menus.• Then simply use the 'PERSONALIZATION BOX' upon ordering to let us know the INITIAL / NAME / SYMBOL and the FONT NUMBER you would like to use on each bar charm using this format:-- BAR 1:-- BAR 2:-- BAR 3:• If a font is not given, you will receive the font that is pictured, Font #39 (our most popular font choice for this design).O T H E R ∙ I N F O R M A T I O N• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 6 - 10 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)O U R ∙ P O L I C I E Shttp://etsy.me/2cuqINvA B O U T ∙ C A I T L Y N M I N I M A L I S T ♡http://etsy.me/2cYBUSpI N S I D E ∙ S C O O P• IG: @CaitlynMinimalist• FB: https://www.facebook.com/CaitlynMinimalist-----------------------♡--------------------Thank you so much for visiting and hope you enjoy shopping with us ♡♡ Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "Very dainty bracelet.  Perhaps a little smaller than I anticipated but very pretty.  My mom loved it.",
      "My mom LOVED this bracelet",
      "Minimal and cute just as described!",
      "The recipient loved this gift!"
    ]
  },
  {
    "productId": "pqQipjPpSx",
    "url": "https://www.etsy.com/listing/1416281684/where-we-met-map-personalized-couples?click_key=6e079bc06c3143bedfe497d0fbe6d4217c810c49%3A1416281684&click_sum=3fc7f4bc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-30&pro=1&frs=1&etp=1&sts=1",
    "title": "Where We Met Map, Personalized Couples Gift, Custom Map, Boyfriend Gift, First Date Memory Map, Black and White Map, Where It Began",
    "description": "This beautiful map print is the unique gift you have been looking for! A meaningful engagement gift showing the special place the couple got engaged, a wedding gift displaying where the couple plans to start their new life together, or the perfect housewarming present celebrating the couple/family’s new location! Regardless of the occasion, the personalization of this gift is sure to be appreciated!↓↓↓ HOW TO ORDER↓↓↓Please give the following information in the Personalization Box, then Add to your Cart1. Quote to go across the top {where it all began will be used if none other is specified}2. Date or year, if you want it included3. Location of the map {We can find big and small cities, domestic and international! International cities will have native language} You may give a specific address if you prefer.4. What color do you want the heart marker?5. The names you want included.Note: We will find the coordinates for you, just provide the address or city.❤︎ • ❤︎ • ❤︎✸CARD OPTION✸: Interested in adding a handmade, matching card to your order? Check out that listing here:http://etsy.me/2n1dnjy✸3D MAP OPTION✸: Our 3D art offers a more dynamic look by having the map cut and raised from background paper slightly. {$15 more}. Add the upgrade here--->https://etsy.me/2lIHBMT❤︎ • ❤︎ • ❤︎➾ Need it ASAP?? Check out our express upgrade option!• Rush Production:http://etsy.me/1RuJLCN❤︎ • ❤︎ • ❤︎ • ❤︎ • ❤︎ • ❤︎♡ ITEM DETAILSº Our maps are printed on beautifully textured archival quality paper. The paper is a standard letter size measuring 8.5x11 inches. It fits best in frames/mats that have an 8x8 or 8x10 inch opening. Please note you will need to trim the paper slightly for a perfect fit. {If you prefer to have it come to you already framed you may choose one of the framing options available at check-out!}º We take great care in packaging both prints and framed items to make sure they arrive in pristine condition.º Our authentic barnwood frames are indeed authentic! With that will come various imperfection possibilities that show its earlier life such as nail holes, knots and color variations. No two are exactly alike!º All frames are made out of wood and come with glass. The only frame with a table top stand option is the 8.5x11 barnwood frame.❤︎ • ❤︎ • ❤︎ • ❤︎ • ❤︎ • ❤︎➾ Please feel free to convo me to ask any questions you may have! Thanks for stopping by!Jamie© 2014 by Basketful of Grace LLC. All rights reserved.",
    "reviews": [
      "The item was great. USPS bent the envelope even though it said do not bend on it. It was a really great anniversary gift! Thanks",
      "Amazing quality, shipping, everything!  Very happy.",
      "This was such a wonderful buy. No disappointment here. They were very flexible and worked with me to get the exact product I was looking for. Would recommend to anyone."
    ]
  },
  {
    "productId": "ZaprsuxW6y",
    "url": "https://www.etsy.com/listing/273669710/engraved-working-compass-with-mountains?click_key=16d29feb013f4e614771866b428a149ef24940d2%3A273669710&click_sum=a48c9166&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-31&pro=1&frs=1&etp=1&sts=1",
    "title": "Engraved Working Compass with Mountains, Custom Handwriting Gift for Men, Anniversary Gift for Him, Fathers Day Gift",
    "description": "Engraved Working Compass with Mountains, Custom Handwriting Gift for Men, Anniversary Gift for Him, Fathers Day Gift.Made from top quality solid brass, and durable for outdoor use.Checkout my other compasses!https://www.etsy.com/shop/SFdizayn?ref=seller-platform-mcnav&section_id=16459965Diameter: 1.96 inchMaterial: BrassChain: Comes with the same chain as in the listing picturesCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.Engraving: We can engrave whatever you want and we can use every font that you want.This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.*IMPORTANT MESSAGE ABOUT DELIVERY and TURNAROUND TIMEIf you add your phone number to your order notes; delivery would be faster than usual.Turnaround time is 1 business day and I ship your order in 1 day after your purchase. You can choose the Express delivery method at checkout.* HOW TO SEND YOUR ENGRAVING INSTRUCTIONSPlease put all your engraving instructions for each side in the '' add your personalization '' box on the product page. For example:Front side: abc...Inside: xyz...Leather pouch: klm...If you want me to engrave an image or images; please attach the image to the ETSY message box ( conversation box ) after your purchase.For handwriting engraving; please use white unlined ( blank ) paper with a black pen and take a picture of the paper. After your purchase please attach the image of your handwriting via the conversation box. Just send us a message.We can engrave one of the same mountain, lake, river, wave, waterfall, sun, and stars design as in our listing pictures or we can engrave your own design.",
    "reviews": [
      "Exactly as described, incredibly fast shipping.",
      "My partner really enjoyed this gift! The seller was easy to work with and responsive and it arrived on time. Very happy with the compass and the engraving.",
      "Beautiful, and very well made"
    ]
  },
  {
    "productId": "WqOlErKvyJ",
    "url": "https://www.etsy.com/listing/1414624610/to-a-lifetime-of-ice-cream-together-11th?click_key=9156279024a6646db709b0b9071883011a41020e%3A1414624610&click_sum=b8f6eb1e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-32&etp=1&sts=1",
    "title": "To A Lifetime Of Ice Cream Together-11th Anniversary-5th Anniversary-Boyfriend Gift-Unique Personalized Gift-Can Be Used Daily-High Quality",
    "description": "This is a new stainless steel spoon that is carefully hand stamped by me, to say “To A Lifetime Of Ice Cream Together”.OR personalize it to say whatever you want!It's a cute, funny, custom gift for 5th Anniversary (silverware), 11th steel anniversary, a Birthday, or just because!*If you want the optional gift box ($2), go to the checkout screen, select “this order is a gift” option, then select “gift wrap”.Since each spoon is made by hand, Please allow for small variances in letter spacing/placement etc.It can be used daily. The ink used is food safe but not permanent. It's dishwasher safe but hand washing will make the ink last longer. The engraving will remain FOREVER.Please check out my other listings for gift ideas and don't hesitate to convo/email me if you have any questions.Express 1-2 Day Delivery Available (if ordered before 2pm EST). Please message/email me (not a note on the order) when choosing Express so I can expedite the order.Thanks for looking!Jason LeBreux",
    "reviews": [
      "The seller is very nice, the quality of the item is great and I love it!!! It’s a great gift, especially for someone who loves ice cream!!",
      "Loved these for Valentine’s Day. Thank you!",
      "These are such a unique and sentimental gift. They arrived on time, are super cute and great quality!"
    ]
  },
  {
    "productId": "FJeBicBVUt",
    "url": "https://www.etsy.com/listing/1036791537/personalized-custom-blanket-name-blanket?click_key=6def33d22aaaebe0fdfdd209ba73b56886774c44%3A1036791537&click_sum=80de65a8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-33&pro=1&etp=1",
    "title": "Personalized Custom Blanket, Name Blanket, Blanket Gift, Baby Blanket, Kids Blanket, Personalized Gift, Custom Gift, Retro Blanket, Boho",
    "description": "This minky blanket is SO soft! Not only is it super cozy but this is personalized with the text of your choice!This makes a great gift for birthdays, baby showers, graduations, mother's day, or to treat yourself with a new pop of color!SHIPS QUICK! Production time is currently 2-5 days for your very own personalized blanket (USPS is another 2-5 days to deliver).Want to see what your font will look like? See the font preview tool here: https://bit.ly/38ogBudSizes are:30 in X 40 in (baby/toddler blanket)50 in X 60 in (throw blanket)60 in X 80 in (twin size blanket)The back side of the blanket is solid white.Care: Machine Wash Cold, Tumble Dry",
    "reviews": [
      "So soft and cute! A great personalized baby gift! I'm already getting ready to order another one!",
      "Looks great! My nephew loves it!",
      "Looked great! My nephew loves it!",
      "Great baby blanket that stays soft after several washes!"
    ]
  },
  {
    "productId": "MkuYLlYIZs",
    "url": "https://www.etsy.com/listing/1008538693/personalized-travel-bag-set-personalized?click_key=72d3e7b9dd0eae33b58558bfac5a474f87eaaea2%3A1008538693&click_sum=b3876bf9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-34&pro=1&etp=1&sts=1",
    "title": "Personalized travel bag set, Personalized Groomsmen Gift, travel bag, Mens toiletry Bag, Groomsman Gift, Weekender monogram",
    "description": "Wash bag and Weekender gift set.Men like simple, quality and practical gifts.This men's gift set is perfect for your groomsmen as wedding favours, birthday gifts, father's day gift, anniversary gift or Christmas gifts.Its sturdy, its big enough to hold your accessories for the weekend and its sleek :)Get this personalised with your choice of 2-4 letter initials.Letters are embroidered on both bags unless otherwise stated.WEEKENDER BAG:The personalised holdall has:Adjustable shoulder strapSnap fastening fold down ends.Internal valuables pocketCarry handlesFully linedLeather Look PUSize: 58L x 33H x 26WcmCapacity: 30 LitresThread colours as shown in picturesSMC initials in BlackA- Dark brownB- CreamC- GoldD-BrownWASH BAG:Material: Good quality vegan leatherWipe clean interior.Hidden lining zip.Fully lined.Vintage style metal fittings.Internal pockets.Dimensions26 x 13 x 11cmHow to OrderAt checkout or in personalisation box please message us details of initials to embroider.",
    "reviews": [
      "It is great quality and exactly what I ordered!",
      "Love my bag. Will be ordering another",
      "Great gift for my fiancé; we travel quite a bit! He loved it!"
    ]
  },
  {
    "productId": "HJfYnUmmGC",
    "url": "https://www.etsy.com/listing/1384930469/personalized-photo-album-creative?click_key=e2f7df2b9b01d476431d085849270a35bf68b868%3A1384930469&click_sum=d090b76c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-35&pro=1&etp=1&sts=1",
    "title": "Personalized Photo Album Creative mother's day gifts Keyring - Gift for Boyfriend, gift for girlfriend, birthday gift,  photo keychain",
    "description": "Select the bundle offer in order to obtain discounts and you can also choose different colors in the bundle offer (while you are uploading your pictures on the provided link: https://woodili.com/upload/keychain).All your favorite moments will be within reach in your pocket.Choose your pictures in order to create your own elegant key chain and trigger smiles of your loved ones with this surprise in your purse.Key information:-Handmade-Natural leather-High quality photo paper-Key chain approximate size: 1,18 x 1.54 x 0.47 inches (3 x 3,9 x 1,2 cm)How to create your mini photo album key chain:-Select the color of the leather-Choose the quantity of keychains-Select your 7 pictures-No worries about picture editing, our designer will prepare your pictures for the mini photo album in order to obtain the best possible result.Recommendations for the photos:-Be sure that the photos you send are the ORIGINAL full-size images.-Higher image quality = better result. Avoid dark, blurry and unfocused images.After purchasing my key chain, what should I do?You just need to confirm your order number and upload your 7 pictures on the following link (If you have ordered several key chains, you just need to indicate the quantity ordered and the system will let you upload the pictures for every key chain): \u007fhttps://woodili.com/upload/keychainYour product will be shipped out in 1-2 business days and you will receive a confirmation from Etsy with the link in order to track your parcel. If there is an issue with your photos, our designer will contact you directly via email in the next 24 hours. And the last but not the least, if you need it sooner, don't hesitate to select the Express delivery and it will be delivered in 3-4 working days after the expedition.",
    "reviews": [
      "Super easy and quick process, shipped next day and i love it",
      "One picture was upside down, but other than that it was exactly what I expected",
      "My partner loved this gift! Arrived extremely fast. 5*.",
      "Everything is perfect and came really fast!"
    ]
  },
  {
    "productId": "tLqcxVTMQe",
    "url": "https://www.etsy.com/listing/649228419/custom-face-socks-custom-photo-sock?click_key=94b4b605304ac5f9112d8c0a37046a981260c3da%3A649228419&click_sum=c1278e0c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-36&frs=1&etp=1",
    "title": "Custom Face Socks -Custom Photo Sock, Custom Socks, Personalized Socks, Custom Printed Socks, Picture Socks, Fathers Day Gift, Graduation",
    "description": "Photo Socks, Custom Socks, Socks, Personalized Socks, Custom Printed Socks, Picture Socks, Photo Gift, Custom Photo Socks, Photos on Socks, Gift idea, Mother's Day, Father's Day, Christmas Gift, Stocking Stuffer, Birthday GiftOur custom printed photo socks are the perfect gift for anyone for any occasion! You can put your face on socks, your best friend, or that one uncle. The options are endless....Get custom socks with the face of your choice on them! They make the perfect gift for anyone! Perfect for any holiday, birthday, or anniversary! Handmade by local part time moms in Portland, Oregon every pair is made to order.HOW TO SEND IMAGESYou will receive an emailed link within 30 minutes of placing your order to upload your images for us to crop. If you can't find your link in your email, feel free to message us and we can send over Etsy message as well. By default we crop the face, so please leave a note on the upload page if you would like it cropped differently.SIZINGSmall (Youth Shoe Size 12-3) (Women's Shoe Size 4-6)Medium (Youth Shoe Size 3-6) (Men's Shoe Size 6-9) (Women's Shoe Size 6-10)Large (Men's Shoe Size 9-12) (Women's Shoe Size 10-15)Extra-Large (Men's Shoe Size 12-17)MULTIPLE FACESWe charge $3 per additional face on the socks. It is still for ONE pair, but you can add up to 2 additional faces. Feel free to message with any questions.GROUP DISCOUNTSIf you are looking to buy more than 25 pairs please message me and I can get you our group discount pricing!Feel free to message us with any other questions and we will get back to you ASAP.For best results of washing these socks, we recommend turning them inside out, washing with similar colored laundry in cold water, and air dry to prevent shrinking. Do not use bleach!As all of our products are 100% customized, everything we sell is one of a kind. Due to this, we cannot accept returns. In the case of a damaged/faulty product, we are happy to work with you to get you a replacement. In this case, contact us and we will resolve the issue.",
    "reviews": [
      "Adorable socks my daughter loves them",
      "easy and fast love the socks",
      "My husband loved them. Perfect gift.",
      "The socks were a funny gift and my nephew loved it"
    ]
  },
  {
    "productId": "jFfABsivej",
    "url": "https://www.etsy.com/listing/726364447/customized-dog-socks-put-your-cute-dog?click_key=3a6ac50324d6aa3ce230b4fa5d92030de1b31881%3A726364447&click_sum=cfbef4d8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-37&frs=1&etp=1",
    "title": "Customized Dog Socks - Put Your Cute Dog on Custom Socks, Dog Lovers, Dog GIft, Dog Personalized, Dog Gift Socks,Fathers Day Gift,Graduation",
    "description": "Get custom socks with your very own fur babies face on them! They make the perfect gift for anyone who loves their dog! Perfect for any holiday, birthday, or anniversary! Handmade by local part time moms in Portland, Oregon every pair is made to order.HOW TO SEND IMAGESYou will receive an emailed link within 30 minutes of placing your order to upload your images for us to crop. If you can't find your link in your email, feel free to message us and we can send over Etsy message as well. By default we crop the face, so please leave a note on the upload page if you would like it cropped differently.SIZINGSmall (Youth Shoe Size 12-3) (Women's Shoe Size 4-6)Medium (Youth Shoe Size 3-6) (Men's Shoe Size 6-9) (Women's Shoe Size 6-10)Large (Men's Shoe Size 9-12) (Women's Shoe Size 10-15)Extra-Large (Men's Shoe Size 12-17)GROUP DISCOUNTSIf you are looking to buy more than 25 pairs please message me and I can get you our group discount pricing!Feel free to message us with any other questions and we will get back to you ASAP.Photo Socks, Custom Socks, Socks, Personalized Socks, Custom Printed Socks, Picture Socks, Photo Gift, Custom Photo Socks, Photos on Socks, Gift idea, Mother's Day, Father's Day, Christmas Gift, Stocking Stuffer, Birthday Gift, Perfect Gift Idea, Dog Lover Gift, Gift for Dog Lover, Puppy Gift, Anniversary, Wedding, Fur Baby, Softest Comfortable SocksFor best results of washing these socks, we recommend turning them inside out, washing with similar colored laundry in cold water, and air dry to prevent shrinking. Do not use bleach!As all of our products are 100% customized, everything we sell is one of a kind. Due to this, we cannot accept returns. In the case of a damaged/faulty product, we are happy to work with you to get you a replacement. In this case, contact us and we will resolve the issue.",
    "reviews": [
      "Love these great quality socks for a gift idea!!",
      "Super fast delivery for the holidays.  Put the face of my son's cat on dog-themed socks as requested (inside joke).  He loved them!",
      "Great personalized gift. They loved it",
      "Great quality socks! Excellent material"
    ]
  },
  {
    "productId": "sJYdXpcvix",
    "url": "https://www.etsy.com/listing/942350647/personalised-song-plaque-playlist?click_key=97fc9895378a366ef07e8928f7cd8eeb897cd7f6%3A942350647&click_sum=f4a3f8c6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-38&etp=1&sts=1",
    "title": "Personalised Song Plaque Playlist Streaming Boyfriend Girlfriend Valentines Music Love Birthday Wedding Christmas Frame Art Decoration",
    "description": "Personalised Plaque with 2x stand legs or optional frame (frame style are subject to availability)Please peel off protective backing upon receivingA2 and A1 plaques DO NOT come with feetPlease send a square photo after ordering in our chat, photos will be cropped if size is too bigHow does it work? Customise your own music streaming style plaque with custom song/artist name, personal image and a personal message at the bottom. IF WE DO NOT RECEIVED ARTWORK AFTER 5 DAYS OF PURCHASE THE ALBUM ARTWORK FOR SONG REQUESTED WILL BE USED.Laser cut and UV printed Acrylic with personalised messageCustom made to orderPlease leave a note at the checkout with the artist and song title you would likeAvailable in several sizes: A4, A5 & A6 (exact sizes in drop down above)Available with stands or in a deep box frame (see image 5 & 6 for frames)Scratch resistant primer for long lasting printExceptional quality 1200dpi printFree 2nd class UK postageLow cost international postageExceptional quality print.Spend & save, we offer discounts on multiple purchases & combined purchases across our store.These plaques are for decorative use and do not play musicSTANDARD SHIPPED HAS NO TRACKING",
    "reviews": [
      "It was absolutely amazing!!!!! Thanks",
      "Great item, quick delivery, cute gift idea",
      "Great product and super cute"
    ]
  },
  {
    "productId": "NVwBINOZsb",
    "url": "https://www.etsy.com/listing/1574066499/handmade-pressed-flower-forget-me-not?click_key=0d658c181c238fadca8a430a83783e5165345d78%3A1574066499&click_sum=28a716db&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-39&etp=1&sts=1",
    "title": "Handmade Pressed Flower Forget Me Not Heart Necklace| Stainless Steel Floral Heart Locket",
    "description": "Handmade pressed forget me not with white lace flowers.Stainless steel locket and chain.Photo sizes: 5/8\" long(15mmx17mm).Pendant size: 7/8\" (21mm x 23mm)Chain length: 17\"+ 2\" (43cm+5cm)extensionIt comes with gift box.Meaningful present for mother, senior, wife, friends for family memoryNote: Since we use natural flowers, there are subtle differences in color and form.Dark green, purple background colors have glitter in it. Please leave me a note in your order if you don't want the glitter.We accept custom background color, please select the custom option, then leave a note specifying the background color and the flowers you want in your order. Customized items are non-returnable.Each locket comes with a heart shape paper sample in it. You can print out and cut the photos by yourself. Then use any strong glue to stick the photos in the locket.If you want us to put the photos for you, here's the listing of photo print:www.etsy.com/listing/1160034732. $4 is for each colored photo. Please send photos to us by message. We need people are small and in the center of the pictures. So that there's enough space for cutting into heart shape.",
    "reviews": [
      "stunning. got it for a friends sweet 16 and it was perfect",
      "Simply beautiful necklace my daughter received for her birthday.",
      "beautiful gift for my mom looks just like the picture and is very good quality"
    ]
  },
  {
    "productId": "IVEViISIWZ",
    "url": "https://www.etsy.com/listing/1515967344/pave-script-name-necklace-by-caitlyn?click_key=b5e971941685bd8760e8797257c4750b755c2e72%3A1515967344&click_sum=33558feb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-40&pro=1&frs=1&etp=1&sts=1",
    "title": "Pave Script Name Necklace by Caitlyn Minimalist • Personalized Diamond Necklace in Twist Chain • Perfect Valentines Gift for Her • NM132F109",
    "description": "P A V E ∙ S C R I P T ∙ N A M E ∙ N E C K L A C EExpress yourself with our Pave Script Name Necklace, adorned with a distinctive twist chain. The stylish cursive design and the shimmering pave stones make this necklace a trendy and personalized accessory that adds a touch of elegance to any look ♡• Material: High Quality Solid 925 Sterling Silver• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• Dimensions: Depending on your name, the height ranges from ~11-14mm and width ranges from ~20-40mm• Featuring a dainty Pave Script Name Charm with Twist Chain♡ Model showcases a stylish necklace layering look featuring:• Pave Linked Pendant Necklace:https://etsy.me/47yBwET• Mirror Chain Necklace:https://etsy.me/3RnmrAr• All our jewelry is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Simply use the 'PERSONALIZATION BOX' upon ordering to let us know the NAME you would like on the charm (Design can have up to 9 characters).♡ YOUR NAME ♡O T H E R ∙ I N F O R M A T I O N• The length option is the TOTAL length (including the charm). If you order a 18\" chain, the piece will come as CHAIN + CHARM = 18\". All pieces come with a 1\" extension chain so you can FINE TUNE the fit.• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• This item is custom made to order. Our turn around time is about 6 - 9 business days. This can change during peak seasons. Please check our home page for the most current times.M O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/CaitlynMinimalistIG: @CaitlynMinimalistThank you so much for visiting and hope you enjoy shopping with us ♡Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "Beautiful necklace! Nice quality product.",
      "Everything was great! I really my necklace !",
      "Everything looks great! The necklace is so cute and the item time was expected.",
      "Very Beautiful just like the picture ♥️♥️"
    ]
  },
  {
    "productId": "vXELsnHdYP",
    "url": "https://www.etsy.com/listing/748543957/925er-silver-necklace-with-real?click_key=1dc4289aafaa22b8a053f04c35e203f3e750cfc3%3A748543957&click_sum=aa06f70e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-41&etp=1&sts=1",
    "title": "925er Silver necklace with real dandelions and personalized disc • Silver/Gold/Rosegold • real dandelions • gift for her • handmade • K510",
    "description": "Make a wish...Embrace your heart's desires with this elegant, minimalist necklace made of 925 sterling silver, keeping them close to your heart at all times. A hand-blown glass orb encases genuine dried dandelion seeds and a dash of sparkle. We offer a special touch by personalizing the pendant with an engraving of your choice.Dimensions:- Glass orb: 14 mm- Discs: 8 mm- Adjustable chain length: 16 - 17 - 18 - 19 inchesColor/Material:- Silver: Rhodium-plated 925 sterling silver- Gold: Gold-plated 925 sterling silver- Rose Gold: Rose gold-plated 925 sterling silver- Hand-blown glass- Dandelion seeds- GlitterOur premium rhodium and gold plating are durable and resistant to tarnishing.Engraving inspiration:- Name- Word- Date- Initials- Symbols- Or choose to leave it unengraved(Max. 8 letters or 1 symbol)- \"Gravur einseitig\" means the tag will be engraved on the front.- \"Gravur beidenseitig\" means the tag will be engraved on both the front and back.How to order:1. Select your desired options from the drop-down menu2. In the note box, specify your engraving wish and font choice3. Add to cart and proceed to checkoutPlease note:- If we don't receive a font preference, we'll choose a stylish font for you.- Understand that personalized or custom-made products are not eligible for exchange or return.- To ensure the longevity of your jewelry, please follow the care instructions provided.About VIVIANNA:- Each piece of jewelry is lovingly handcrafted to your specifications in our VIVIANNA workshop in Hamburg.- We don't mass produce; each product is made just for you.- We use only high-quality materials.- Your jewelry arrives ready to gift, complete with a beautiful, high-quality gift box and care instructions.",
    "reviews": [
      "The necklace is made so beautifully.",
      "Amazing item! Fast shipping! Excellent!",
      "Very nice chain, unfortunately there was a small problem but the customer service was great",
      "Everything was great 👍 thank you very much"
    ]
  },
  {
    "productId": "jzaAjNIaH5",
    "url": "https://www.etsy.com/listing/1055494929/personalized-liberty-cotton-cord?click_key=b6440d2e957097b332fdce3aec28e4da6a40ff3a%3A1055494929&click_sum=6efd94d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-42&etp=1&sts=1",
    "title": "Personalized liberty cotton cord bracelet with golden medallions to engrave • First name bracelet, Birth gift Mom gift Mother's day",
    "description": "Our catalog of graphics & illustrations to engrave:https://tinyurl.com/bliche• Adjustable bracelet in 100% Liberty cotton cord• 12mm stainless steel medals (10mm for child size) - do not rust, resist over time and are hypoallergenic• Adjustable bracelet thanks to sliding knots and adjustable to all wrists⭐ CUSTOMIZATION -• Choose the number of medals you want, single-sided, or double-sided• Fill in the word(s) / picto / date to be engraved for the medal as well as the font and the size (child, XS/S or M/L)Example :• Medal front/back: Thank you mum / 01.01.2022• Font 2• Size XS/S📏 SIZE -All our bracelets are adjustable and adjustable thanks to sliding knots.We offer 3 sizes:- Child: for children up to about 14 years old- XS/S: for thin wrists- M/L: for \"normal\" and stronger wrists📦 DELIVERY -We manufacture your bracelet to measure and within very short deadlines.Once the production is finished, we ship by registered post La Poste.It takes about 2 to 3 working days for receipt after shipment, except for any delays by La PosteWe remain available for any questions!Silver version:https://www.etsy.com/fr/listing/1153506678/bracelet-personnalise-en-cordon-cotonRose gold version:https://www.etsy.com/fr/listing/1139944944/bracelet-personnalise-en-cordon-coton------To see the whole collection:https://www.etsy.com/fr/shop/BlicheInstagram: @blichebijoux------- GIFT WRAP -All jewelry is delivered with a small pouch but if you would like a gift box, please choose the option by selecting \"This order is a gift\"Mom Wristband | Double Strap | Medal Cord Bracelet | Engraved Medal | Godmother Gift | Mom Gift | Mom Jewelry | Personalized Wristband | Personalized Jewel | Personalized Gift | Woman Gift | Anniversary Wristband | Bridesmaid Bracelet | Birth wristband",
    "reviews": [
      "Superb item, received quickly ☺️",
      "Very good article, I recommend it",
      "Good quality item, consistent with the photo, pretty. Next time I will remember to ask for the size of the bracelet to see if it fits my wrist size",
      "Great. Thank you so much. Quick and neat delivery"
    ]
  },
  {
    "productId": "wVGLdsLnWo",
    "url": "https://www.etsy.com/listing/1168001724/garden-of-love-personalized-outdoor?click_key=d2844fc776245bc4ca10dfbfddb3ac595676e743%3A1168001724&click_sum=8bd5e226&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-43&pro=1&frs=1&etp=1",
    "title": "Garden Of Love Personalized Outdoor Flower Pot, Personalized Gift for Her, Mother's Day Gift, Gift for Grandma, Flower Pot, Planter",
    "description": "Celebrate all the people that make up her family garden with the Garden Of Love Personalized Outdoor Flowerpot.𝙋𝙚𝙧𝙨𝙤𝙣𝙖𝙡𝙞𝙯𝙖𝙩𝙞𝙤𝙣 𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣:- Bottom Line 1: up to 25 characters- Bottom Line 2: up to 25 characters- Names: Enter up to a maximum of 20 names / 9 characters per name𝙋𝙇𝙀𝘼𝙎𝙀 𝙉𝙊𝙏𝙀:Spaces and punctuation count as a character.𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- Please Note: Plants not included.- Flower pot features traditional design with raised rim and drainage hole- Item is highly recommended for outdoor use only because of drainage hole at the base- Beautifully crafted of fine-quality, heavy-weight, chip-resistant stoneware- Measures 7.25” H x 6.5” in diameter",
    "reviews": [
      "Bowl was great - I wish you could fill the flowers to be spread evenly around the entire pot",
      "Customer service was great. My mother in law loved it",
      "Customer service was great. My parents loved it!",
      "It was a great gift"
    ]
  },
  {
    "productId": "CqmhbeDSQX",
    "url": "https://www.etsy.com/listing/1315108369/bangle-bracelet-with-medallions-to?click_key=209a901f103529730bc4d2d9cc31c396239a04da%3A1315108369&click_sum=3ce106fc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-44&etp=1&sts=1",
    "title": "Bangle bracelet with medallions to engrave in stainless steel and birthstone • Personalized bracelet, Birth gift, Mom gift",
    "description": "Our catalog of graphics & illustrations to engrave:https://tinyurl.com/bliche• Bangle bracelet in silver, gold or rose gold stainless steel• 12 mm round medal to engrave• Birthstone of your choice• Adjustable by tightening- CUSTOMIZATION -• Choose whether you want to engrave the front or the front/back of the medal(s)• Fill in the word or picto to engrave for the medal + the font• If you wish to add an additional birthstone, it is possible by adding it to your basket via this link:https://www.etsy.com/fr/listing/1322232805/pierre-de-naissance-supplementaire?ref=listings_manager_gridWe remain available for any questions!------To see the whole collection:https://www.etsy.com/fr/shop/BlicheInstagram: @blichebijoux------- GIFT WRAP -All jewelry is delivered with a small pouch but if you want a real gift packaging, please choose the option in the basket.------- DELIVERY -Orders are processed within 2 to 5 days.Delivery takes 1 to 3 days for mainland France, 3 to 12 days for Europe, and 8 to 60 days for the rest of the world.Mom Wristband | Bangle Bracelet | Medal Bracelet | Engraved Medal | Godmother Gift | Mom Gift | Mom Jewelry | Personalized Wristband | Personalized Jewel | Personalized Gift | Woman Gift | Anniversary Wristband | Bridesmaid Bracelet | Birth wristband",
    "reviews": [
      "Very pretty bracelet, very good quality",
      "Very pretty bracelet! Exactly as pictured. Very fast shipping. THANKS !",
      "I highly recommend ! I am very satisfied with the results!",
      "Beautiful bracelet, exactly what I expected 😀"
    ]
  },
  {
    "productId": "HJgTdtNkat",
    "url": "https://www.etsy.com/listing/790069466/custom-name-bracelet-with-curb-chain?click_key=5141dbc454763c9e55e4e8086da6d0d204bf5bab%3A790069466&click_sum=fa0b4aa4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-45&pro=1&etp=1",
    "title": "Custom Name Bracelet with Curb Chain - Personalized Name Jewelry -  Birthday Gift for Her *NELLY BRACELET*",
    "description": "NELLY BRACELETThe perfect way to show your love, the Custom Name Bracelet with Curb Chain is a heartfelt piece of jewelry that is sure to bring a touch of sentimentality to any occasion. Whether you’re celebrating a friendship or a special relationship in life, nothing will show your love and appreciation like this stunning custom name bracelet.This special bracelet features a beautiful curb chain with personalized nameplate, creating the perfect gift for any special occasion. The personalization options allow you the freedom to customize your bracelet with the names of your loved ones, making it a truly unique and unforgettable piece of jewelry.No matter the occasion, this Custom Name Bracelet with Curb Chain is sure to make its mark. This meaningful gift will quickly be treasured as a cherished reminder of your friendship, love or support. Perfect for any special occasion or just because, this friendship bracelet is truly the gift that keeps on giving!From anniversaries to birthdays, graduations to holidays, and everything in between, this high-quality Custom Name Bracelet with Curb Chain is sure to bring a smile to whoever receives it. Show your love with this one-of-a-kind piece of jewelry that is designed to last. Place your order today and give the gift of joy and appreciation with this meaningful, personalized piece of friendship jewelry.*MATERIAL:— 100% Recycled Sterling Silver - This solid, precious metal is a classic that lasts forever. While it may darken over time, with continuous care and an occasional, it’s as good as new.— 18K Gold Vermeil - For those with an eye for striking gold, our gold jewelry uses sterling silver as a base and is plated with a durable and thick layer of 18-karat gold vermeil.— 18K Rose Gold Vermeil - Our rose gold jewelry uses a sterling silver base with 18-karat rose gold overtop to give our jewelry a pink-golden hue.Vermeil is nickel-free and perfect for people with metal allergies.*DIMENSION:Each letter is approx. 4.5mm in height.*PERSONALIZATION:Enter the letters/numbers you want for your bracelet in the Personalization Box.— Uppercase letters only.— Maximum 12 characters.*LENGTH:Select the length you want for your bracelet from the drop down menu. Our bracelets are adjustable. A 5-5.75\" bracelet can be worn at 5\" or 5.75\" length.TIPS: measuring your wrist using a string or ribbon, wrap it a little loose around your wrist unless you want a snug fit. Mark where the end meets and use a ruler to measure the length.*PRODUCTION TIMEPlease see Shipping & Policies for our most updated production time.*RUSH ORDERPlease select 'Rush Order + Express Shipping' at checkout and include the desired delivery date in the Notes section. Our team will reach out to you to confirm if your request has been accepted.*GIFTINGYou’ll have the ability to add a personalized message to your order. Please lease your messaging in the Note box upon checkout. Once we receive it, our team will print out the message on a notecard and include it with your order.While we currently don’t have gift wrapping, each and every piece is perfectly packaged in true Grace Personalized fashion.***Thank you for supporting our small but growing business! From us to you, we're so grateful to have you here. What started as a passion for making intentional pieces grew into a business full of heart. Every groove and engraving that’s gone into making your one-of-a-kind piece was handmade by local artisans in Vietnam with care, intention, and, most importantly, love. With your artistic vision and our craft, together, we’ve created something truly unique.Here’s to celebrating the beauty in this moment!Your artisans,Grace PersonalizedFollow along @gracepersonalized and share with us your #gracepersonalized story.",
    "reviews": [
      "So happy with my bracelet! Thank you so much!",
      "Great gift, arrived quickly and they loved it!",
      "Great gift, arrived quickly and they loved it!"
    ]
  },
  {
    "productId": "GVZFNWieVz",
    "url": "https://www.etsy.com/listing/1139944944/personalized-liberty-cotton-cord?click_key=b9c6e36919ad0f020f11a73c134535486787ab3c%3A1139944944&click_sum=3e3d3540&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-46&etp=1&sts=1",
    "title": "Personalized liberty cotton cord bracelet with pink gold engravable medallions • First name bracelet, Birth gift, Mother's Day gift",
    "description": "Our catalog of graphics & illustrations to engrave:https://tinyurl.com/bliche• Adjustable bracelet in 100% Liberty cotton cord• 12mm stainless steel medals (10mm for child size) - do not rust, resist over time and are hypoallergenic• Adjustable bracelet thanks to sliding knots and adjustable to all wrists⭐ CUSTOMIZATION -• Choose the number of medals you want, single-sided, or double-sided• Fill in the word(s) / picto / date to be engraved for the medal as well as the font and the size (child, XS/S or M/L)Example :• Medal front/back: Thank you mum / 01.01.2022• Font 2• Size XS/S📏 SIZE -All our bracelets are adjustable and adjustable thanks to sliding knots.We offer 3 sizes:- Child: for children up to about 14 years old- XS/S: for thin wrists- M/L: for \"normal\" and stronger wrists📦 DELIVERY -We manufacture your bracelet to measure and within very short deadlines.Once the production is finished, we ship by registered post La Poste.It takes about 2 to 3 working days for receipt after shipment, except for any delays by La PosteWe remain available for any questions!Golden version:https://www.etsy.com/fr/listing/1055494929/bracelet-personnalise-en-cordon-cotonSilver version:https://www.etsy.com/fr/listing/1153506678/bracelet-personnalise-en-cordon-coton------To see the whole collection:https://www.etsy.com/fr/shop/BlicheInstagram: @blichebijoux------- GIFT WRAP -All jewelry is delivered with a small pouch but if you would like a gift box, please choose the option by selecting \"This order is a gift\".Mom Wristband | Double Strap | Medal Cord Bracelet | Engraved Medal | Godmother Gift | Mom Gift | Mom Jewelry | Personalized Wristband | Personalized Jewel | Personalized Gift | Woman Gift | Anniversary Wristband | Bridesmaid Bracelet | Birth wristband",
    "reviews": [
      "Perfect bracelet, very pretty, the engraving is well done\nGrandmas will love it\nI'm a fan",
      "The bracelets are very pretty, much prettier than in the photos. The engraving is perfect. Grandmas will love it. I'm jealous of it\nFast shipments",
      "Nothing to complain about, the bracelet is very beautiful and the medal is perfect!",
      "The bracelet frays very quickly"
    ]
  },
  {
    "productId": "hGYoMKnkxs",
    "url": "https://www.etsy.com/listing/777841021/personalized-cutting-board-wedding-gift?click_key=3ee5666707e8cf2068f0a6b7b5273e53ab48bb2f%3A777841021&click_sum=afe5b4ca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-47&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Cutting Board Wedding Gift, Bamboo Charcuterie Board, Custom Cutting Board, Bridal Shower Gift, Engraved Engagement Gift",
    "description": "Personalized Cutting Board Personalized Gifts, Custom Cutting Board, Wedding Gift, Bridal Shower Gift, Anniversary Gifts, Engagement GiftsSmall Bamboo Regular Cutting Board: 9\"x6\"Medium Bamboo Regular Cutting Board: 11.5\"x8.7\"Large Bamboo Regular Cutting Board: 13.8\"x9.8\"Small Rectangular Cutting Board: 9\"x6\"Large Rectangular Cutting Board: 17\"x11\"Small Two-Tone Cutting Board: 11.5\"x13.5\"Large Two-Tone Cutting Board: 18\"x12\"Small Butcher Cutting Board: 12\"x8.5\"Medium Butcher Cutting Board: 15\"x10\"Large Butcher Cutting Board: 18.5\"x12Mini Handle Cutting Board: 11\"x6\"Arched: 12\"x9\"Rectangular Walnut Cutting Board: 9\" x 6\"GET READY FOR EVERYONE TO ASK WHERE YOU GOT IT - Stun your guest at your next party or be the favorite gift with one of these cutting boards. With exclusive designs to choose from, these cutting boards will look amazing whether you are slicing, dicing, or setting them out to display as part of your home decor. Add your name for personalization and enjoy a lovely addition to your home decor.A SPECIAL GIFT FOR SPECIAL ONES - Our custom cutting boards are the perfect gift for both family and friends. These personalized cutting boards are also excellent gifts for weddings, anniversaries, and housewarmings. Whether you're displaying this one-of-a-kind piece as art in your kitchen or prepping the family dinner, this wood cutting board provides a unique and personal touch.KINDLY NOTE: Bamboo is a natural product and no piece is the same. Due to the nature of wood products, the actual shade and color of our engraving may vary slightly from lighter to darker than shown in the example photos, but will be absolutely stunning!THOUGHTFULLY DESIGNED - 21 Uniquely beautiful designs and 6 style options are available. One side of the cutting board is personalized for display and the other side can be used for food preparation.FAST SHIPPING - We ship orders in 2 Business days.+++How To Order+++♦\tPlease choose the cutting board's Style & Design.♦\tFill out the 'Personalization Form'.We will exclude the line if any information is not includedThe information will be copied and pasted into the design, therefore, providing exactly what you want to see on the board is important. We will not be guessing the spelling, single/ plural forms, commas, apostrophes, and other punctuation use.It is VERY IMPORTANT to double-check check names/dates that you submit to us. We can not accept returns, as it is a customized product unless the error was made on our end.Let us help you create a custom cutting board for your special day.  Please feel free to contact us with your requests – our team is ready to create a unique product just for you. If you have any unique decorative cutting board ideas, besides our cutting board designs, for your wedding or special events, please contact us via message.Cutting Board Details:Each of our elegantly handmade cutting boards is eye-catching and makes a great, long-lasting keepsake.♣**** HANDWASH ONLY ****♣♥\tDisplay the engraved side and cut it on your solid side. You get a beautiful piece of home décor and a usable cooking tool all in one.♥\tGREAT GIFT - Personalized Wedding, Bridal Shower, Housewarming Gift, Christmas, Mother’s Day, and Father’s Day Gift.♥\tQUALITY - Made of environmentally friendly, extremely durable.♥\tThe engraving color on the wood cutting board may vary because each board is unique.♦\tMake sure shipping time fits the time you expect.----We ship orders in 2 Business Days ----Standard shipping: 2-6 Business Day*Expedited Shipping: 1-3 Business Day*Second Day: 1-2 Business Day**Up to your distance from California.Packaging:Our cutting boards are expertly packaged to ensure that you will receive your item in perfect condition.-Please read the policy page for more information about payment & shipping:https://www.etsy.com/shop/PersonalizationLab/policy",
    "reviews": [
      "Great item and met expectations",
      "This was a beautiful, quality gift for my newlywed friends!",
      "Excellent quality! We’ve ordered two now, and both have arrived just as described!"
    ]
  },
  {
    "productId": "PWWwumB1ui",
    "url": "https://www.etsy.com/listing/1297915417/personalized-liberty-cotton-cord?click_key=6ff6dd284a19f0eca70ef990c84eb7f33b60c1ed%3A1297915417&click_sum=89a98470&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-81623-3-48&etp=1&sts=1",
    "title": "Personalized liberty cotton cord bracelet with medallions to engrave and birthstone • Personalized bracelet for mum, godmother...",
    "description": "Our catalog of graphics & illustrations to engrave:https://tinyurl.com/bliche• Adjustable bracelet in 100% Liberty cotton cord• 12 mm stainless steel medals - do not rust, resist over time and are hypoallergenic• Charm in colored glass beads according to the month of birth• Adjustable bracelet thanks to sliding knots and adjustable to all wrists⭐ CUSTOMIZATION -• Choose the number of medals you want, single-sided, or double-sided• Fill in the word(s) / picto / date to be engraved for the medal as well as the font and the size (child, XS/S or M/L)• If you wish to add an additional birthstone, it is possible by adding it to your basket via this link:https://www.etsy.com/fr/listing/1322232805/pierre-de-naissance-supplementaire?ref=listings_manager_gridExample :• Medal front/back: Thank you mum / 01.01.2022• Font 2• Size XS/S📏 SIZE -All our bracelets are adjustable and adjustable thanks to sliding knots.We offer 3 sizes:- Child: for children up to about 14 years old- XS/S: for thin wrists- M/L: for \"normal\" and stronger wrists📦 DELIVERY -We manufacture your bracelet to measure and within very short deadlines.Once the production is finished, we ship by registered post La Poste.It takes about 2 to 3 working days for receipt after shipment, except for any delays by La PosteWe remain available for any questions!------To see the whole collection:https://www.etsy.com/fr/shop/BlicheInstagram: @blichebijoux------- GIFT WRAP -All jewelry is delivered with a small pouch but if you would like a gift box, please choose the option by selecting \"This order is a gift\"Mom Wristband | Double Strap | Medal Cord Bracelet | Engraved Medal | Godmother Gift | Mom Gift | Mom Jewelry | Personalized Wristband | Personalized Jewel | Personalized Gift | Woman Gift | Anniversary Wristband | Bridesmaid Bracelet | Birth wristband",
    "reviews": [
      "Love it!!  These are my favorite new bracelets on Etsy.  I will order again!",
      "Very pretty for a birth gift.\nThe engraving is of very good quality and very clear.\nI adore ! Thank you Bliche!",
      "very pretty, just the fabric which gets damaged quickly in my opinion, but overall it's a piece of jewelry that lasts for 1 year easily."
    ]
  },
  {
    "productId": "FUaZhjcwuS",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=89a873e2934684454fe92a4f431d0101007ece1d%3A1115114382&click_sum=2429c5b9&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!",
      "They are going to love them"
    ]
  },
  {
    "productId": "NayDuOQDhc",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=20bb26af87873ec8b3b24ec5fccb8346b95134a5%3A654638870&click_sum=13d25a10&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "lXVeunqmWG",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=d3213f39c8417f52999cf4052e241a184e5799f2%3A1355783916&click_sum=6017c635&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!",
      "This amazing hand sketch really captures the soul and spirit of the loving couple - thanks to the wonderful work of M Gokhan who was able to  catch every nuance of expression in the original photo  - a beautiful memory to cherish!!"
    ]
  },
  {
    "productId": "SlcFhFZnYV",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=e6f3cd52c60e9dce68a74f7138f543c95cc71df6%3A1411614241&click_sum=b749eade&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!",
      "Beautiful product.  Arrived early.  Highly quality"
    ]
  },
  {
    "productId": "ihWortmiQJ",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=74e80807a1d9ac083f305a21d7beddb7ff08084b%3A999136086&click_sum=ef999765&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "pKbmpJcSnB",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=34c0459f652489d4a4889abed62fa7c2baa7ad46%3A1440285597&click_sum=95291d08&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!"
    ]
  }
]
