[
  {
    "productId": "CoeKENNuNv",
    "url": "https://www.etsy.com/listing/1651706895/custom-two-name-handwriting-necklace-18k?click_key=8f39f7de417f51d94b4f6476449d25c17b59cd5b%3A1651706895&click_sum=7d9b5e98&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-1&pro=1&frs=1&pop=1",
    "title": "Custom Two Name Handwriting Necklace, 18k gold, Personalized Jewelry, Name Necklace, Personalized Gift, Baby Shower, mothers day Gift Mom",
    "description": "UNIQUE ♥ Dainty Name necklace in 18 K Gold plated, Sterling Silver or Rose gold platedPERFECT GIFT ♥ Make your friends or family happy with this exclusive gift.MINIMALIST DESIGN ♥ Wear this jewellery with joy and show your style with the wonderful designs.SATISFACTION GUARANTEE ♥ Your satisfaction is always our priority. Please feel free to contact us if you have any questions or requests regarding your jewellery.M A T E R I A L♡ High 925k Sterling Silver♡ 100% Handmade with love and careH O W ∙ T O ∙ O R D E RLeave name/word/date/number that you want to see on the necklace to personalisation box.Please specify uppercase or lowercase lettersC H A I N ∙ L E N G T H ∙ G U I D E12'' - For Kids14'' - Choker16'' - Near your collarbone18'' - Most Common20'' - The top of your bustP R O C E S S I N G ∙ S H I P P I N GProcessing time is 3-5 business days.Shipping in the USA is 2-5 business daysShipping to the Canada is 3-7 business daysShipping to the Europe Country is 8-15 business dayR E A D Y ∙ F O R ∙ G I F T I N G♥ GIFT BOX All our products come in an elegant gift box. You don’t need an extra box for your gifts.♥ GIFT NOTE If you want to include a short gift note while ordering, we will be happy to add a short handwriting gift note within your order. Please let us know your message at checkout.Less",
    "reviews": [
      "Beautiful!  Great product & super fast shipping.  THANK YOU!",
      "Beautiful cursive writing of the names",
      "Bought for my wife and she loved it",
      "I am absolutely in love with my purchase! It is even better in person. I had some questions and I got a quick response. Very helpful and arrived quickly. Most definitely would purchase here again."
    ]
  },
  {
    "productId": "dXUQbdiKUq",
    "url": "https://www.etsy.com/listing/1339289109/925-sterling-silver-name-necklace?click_key=062bd1930394ce8eb83263a667d597a4adfb48ef%3A1339289109&click_sum=e402253c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-2&pro=1&frs=1&pop=1&sts=1",
    "title": "925 Sterling silver name necklace,  Personalized Name Necklace, Personalized Jewelry, Name necklace, Personalized Gift, Christmas gift, MF35",
    "description": "Personalized Name NecklaceCheck out our name necklace selection for the very best in unique or custom, handmade pieces from our monogram & name necklaces shopsPersonalize any letter, symbol, and number of your choiceMaterials: Solid High Quality 925K Sterling SilverAvailable in Gold plated, Sterling Silver, and Rose-Gold platedChain: \"cable-style\"Chain Length: 14\",15\", 16\",17\", 18\",19\", 20\",21\" or 22\"Comes with stylish gift boxes925 Sterling silver name necklace,  Personalized Name Necklace, Personalized Jewelry, Name necklace, Personalized Gift, Christmas gift, MF35",
    "reviews": [
      "I've already ordered a necklace for my daughter from this company and this time I got one for myself and I couldn't be more happy thank you for the quality for the swiftness of the delivery thank you.",
      "Both very beautiful Christmas gifts!",
      "Both very beautiful \nChristmas  gifts!"
    ]
  },
  {
    "productId": "jYRKFOnGoL",
    "url": "https://www.etsy.com/listing/195458719/custom-bracelet-personalized-gift-design?click_key=6e4ae3873a13b90417f0b7dd1a73f0e0f6fe128d%3A195458719&click_sum=b262594c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-3&pro=1&frs=1&bes=1&sts=1",
    "title": "Custom Bracelet | Personalized Gift | Design Your Own Jewelry | Custom Jewelry | Personalized Gift | Birthday Gifts For Her |",
    "description": "Design Your Own Personalized Custom Custom Cuff Bracelet| ORDERING INSTRUCTIONS CAN BE FOUND BELOW AND BY SCROLLING THROUGH THE PHOTOS ABOVE |Korena Loves chose stainless steel as the medium for our personalized jewelry for several reasons.  Stainless steel jewelry is sustainable and eco-friendly.  It’s known for its durability, making our jewelry long-lasting and reusable. It is resistant to tarnishing, fading, and corrosion, ensuring that your personalized engraving will stay beautiful. Additionally, stainless steel is a recyclable material, making it an environmentally friendly choice. By choosing Korena Loves stainless steel jewelry, you're not only investing in a timeless piece, but you're making a sustainable choice that helps to reduce waste.  We strive to craft gifts as unique and special as those receiving them and we hope you will feel good about gifting them. Spending our days surrounded by inspirational quotes of faith, love and happiness is our business and our joy.  May they bring joy to those who receive them as well. Thank you so much for visiting our shop.| VERY IMPORTANT PLEASE REVIEW THESE INSTRUCTIONS CAREFULLY PRIOR TO ORDERING |►  All of our items start off blank, the photos are meant for examples and inspiration only.►  Your custom jewelry will be made to order based on the specifications you provide during checkout.►  We carry no standing inventory and produce our jewelry only when ordered.►  Our engraver doesn’t have a proof mechanism, so production will generally begin without additional contact.►  Keep in mind custom crafted jewelry is seldom perfect or evenly spaced. Font and graphic sizes will vary based on character counts and graphic requests. These characteristics are all part of the charm and should not be considered defects.►  As each item is custom produced uniquely for you, refunds and exchanges are not available unless an error was made by Korena Loves.►  We are unable to accept cancellation or change requests after your item has begun the first stage of production.| CUSTOMIZATION & PERSONALIZATION |►  All Korena Loves jewelry begins blank and is made to order.►  Your instructions should be added to the personalization field provided when you load the item into your cart►  Our cuffs are priced by the width. Before purchasing please be sure you have selected a bracelet with the appropriate width/price to accommodate your text.►  The cuff width in the main photo is the width you are purchasing.  If you desire a different width, please purchase from a different listing with the width you desire in the main photo.►  We recommend no more than 60 characters of text including spaces per line.►  Our standard 6” cuff will fit most woman and is slightly adjustable the first time it is worn. Keep in mind these are true cuffs and meant to open in the back.- 1\" cuffs hold up to 5 lines and are available in the standard 6” length only, this size will fit most woman- 1/2\" cuffs hold up to 2 lines and are also available in a 5\" length for smaller wrists and a 7\" length for men & women with larger wrists- 3/8” & 1/4” cuffs hold 1 line and are also available in a 5\" length for smaller wrists| ORDERING INSTRUCTIONS |►  Below are a few simple and concise examples of how best to share your personalization instructions:►EXAMPLE ONEOUTSIDE:  Border M with the name SarahLEFT END:  3rd heartRIGHT END: Love, MomINSIDE: Quote shown in main photo►EXAMPLE TWOOUTSIDE: Border 3LEFT END: leave blankRIGHT END: leave blankINSIDE: I love you more►EXAMPLE THREENEED 5” LENGTH FOR SMALL WRISTSOUTSIDE: Border A with text Psalm 46:5LEFT END: 3rd CrossRIGHT END: Love, Aunt RoseINSIDE: God is with her, she will not fall| WEAR & CARE |►  Cuff bracelets should only be “sized” to your wrist the first time you wear them by gently opening or pinching the ends. After that, rather than bending the metal, simply slide the opening over the narrowest part of your wrist and then gently turn into the cuff. This will avoid overworking the metal so you’ll have a lasting treasure.►  Surgical grade stainless steel may contain some nickel, but is generally considered hypoallergenic for most people.►  Stainless steel jewelry is harder than silver and doesn’t usually tarnish, rust or require a lot of special care, however it can scratch. We recommend storing in it’s box, an individual bag or pouch. If your jewelry does get scratched, you may wish to contact a local jeweler for a professional polish.► Wash by dipping a soft, lint-free cloth in warm soapy water, and then gently wipe. Dry well with a clean cloth. Follow up with a jewelry polishing cloth for a nice shine.Don’t hesitate to contact us with any questions or concerns.Korena Loves | Personalized Jewelry | Personalized Gift | Personalized Bracelet | Gift Ideas | Gifts for Her",
    "reviews": [
      "It's absolutely perfect..I love it",
      "I absolutely love my personalized cuff bracelet. It was very easy to customize and the engraving was perfect!",
      "As described, good quality, engraving turned out great"
    ]
  },
  {
    "productId": "SIpifsjJKa",
    "url": "https://www.etsy.com/listing/847647541/personalized-rustic-wood-serving-tray?click_key=3002e4768e2c1b0cd528aca8fc3eba86a94d48c1%3A847647541&click_sum=7f6c9a56&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-4&frs=1&etp=1&sts=1",
    "title": "Personalized Rustic Wood Serving Tray, Wedding, House Warming, Engraved Wooden Anniversary Gift, Kitchen Decor, Family, Mothers Day Zip Code",
    "description": "Personalized Rustic Wood Serving Tray, Wedding, House Warming, Engraved Wooden Anniversary Gift, Kitchen Decor, Family, Mothers Day Zip CodeThis is not just your average serving tray; this rustic-style wooden tray is ideal for any occasion to serve your favorite foods and beverages.  Durable, yet light weight, this unique tray comes equipped with cast iron handles, making it easy to carry. This versatile tray is not only for serving, but can be used as a cheese board or an accent piece in the home - the possibilities are endless!Dimensions: 17 9/16\" long; 11 1/8\" wide; 5/8\" thickBeing all natural wood each tray is unique, the grain and color of engraving will vary between trays.",
    "reviews": [
      "The seller demonstrated great communication skills and was very responsive in order to have this item delivered on time (before Christmas)! Very well made, great gift!",
      "It was everything I could ask for",
      "Awesome quality and looks amazing. I can’t wait to give this as a gift this year. Super speedy delivery.",
      "Love the wooden tray and look forward to using it when entertaining!"
    ]
  },
  {
    "productId": "Snbz3hHPpW",
    "url": "https://www.etsy.com/listing/1094757056/custom-couple-portrait-engagement-gift?click_key=efa9d5bba26fb1c7ea80d402f1e90819c4595f40%3A1094757056&click_sum=6ecabc33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-1&frs=1&etp=1",
    "title": "Custom couple portrait, Engagement gift, Personalized family stockings, Anniversary gift, Custom watercolor painting, , Personalized gift",
    "description": "Please note: You will not get physical copy but digital image.100% Hand drawnHigh quality, professional illustration.Capture cherished memories with a personalized gift that speaks from the heart. 🎁✨ Whether it's for Christmas, an Anniversary, Birthday, Engagement, or Wedding, a custom-made watercolor portrait from a photo is the perfect choice. The best gift for family and the best gift for her, ensuring your love and moments are forever preserved in artIf you have any questions, please feel free to contact me at any time.- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -**HOW TO ORDER **1.  Please use the drop-down menu to choose the number of people/pets that are going to be illustrated.2. Fill out the personalization box with any additional details you would like your art to include3. Send a photo of reference via Etsy messages.4. Once the illustration is finished, you will get it via email.5. You can give suggestions for additional change which I will gladly make.**WHAT WILL YOU GET**This is a digital product so you will not receive physical print. You can print your digital files using home printer, at your local print shop or online.Your illustration will be in high quality jpg.",
    "reviews": [
      "Very nice work. Great customer service.",
      "Great artist, high quality, fast processing  of the order- I am so in love with this picture! Highly recommended!",
      "quite happy, thank you so much"
    ]
  },
  {
    "productId": "XwLjWKsKcu",
    "url": "https://www.etsy.com/listing/510681794/gift-for-her-personalized-gift-for-him?click_key=74591bcc5bd5ca50a0a4a733ca777c2bd7ba50d9%3A510681794&click_sum=70781182&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-2&etp=1&sts=1",
    "title": "Gift For Her Personalized Gift for Him Anniversary gift for girlfriend The key to my heart Coulpe Love gift for her, Romantic for wife",
    "description": "Are you looking for a Valentine's Day gift for her, an anniversary gift for a girlfriend or a romantic gift for a wife?This lovely message in a bottle with a tiny key and heart is what you need!Sometimes we hesitate to tell a loved one that we think or do not know how to express our feelings ... Message in a bottle will help you with it. A great message does not leave anyone indifferent! It will be a nice surprise and will give happy and smile to loved one. Also, message in a bottle will be a unique gift and a wonderful alternative to a traditional greeting card.Message in a bottle:1. \"The key to my heart!\"2. \"You hold the key to my heart!\"❗️THIS CARD IS CUSTOMIZABLE. In the \"note to seller\" box, include info needed for your own message in a bottle if you choose “your text”You can choose the packaging for your bottle in drop-down menu:1. Teal Blue Gift box with white ribbon;2. Craft Gift Box - World’s smallest package.3. House Floating frame - your bottle will be hanging in the air.➡️Dimensions:Bottle: 2.3 x 0.8 inch❗️Another \"Message in a bottle\" here:https://www.etsy.com/shop/KseniyaRevtaAll orders are packaged with care. You will receive a tracking number when your order is shipped.Please, note that colors may vary due to monitor color settings etc.❤ Have a beautiful day!KseniyaRevta.etsy.com",
    "reviews": [
      "Great quality product. Very happy with my purchase.",
      "Turned out perfect.  Wife loved it.",
      "Fantastic item. Very happy buyer."
    ]
  },
  {
    "productId": "ZIO1fwLwMW",
    "url": "https://www.etsy.com/listing/1178894392/vinyl-record-art-print-favourite-song?click_key=698fc9d9b3b93a99b56eb73e01da63f3bb305d1d%3A1178894392&click_sum=9caea838&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-3&pro=1&etp=1&sts=1",
    "title": "Vinyl Record Art Print, Favourite Song Personalised Metallic Foil Art, Vinyl Print, Personalised Record Gift",
    "description": "Personalised Metallic Foil Song VinylAdd some musical flair to your home and bring back memories with our Vinyl Record Art Print. Available in many sizes, framed or unframed, you can choose from a variety of stylish foil colours to match the decor of your room. This piece is also personalised with song lyrics, special dates or names that mean something to you. A wonderful anniversary gift, capturing the memory of your first dance or any special occasion you have a special song for!🖼️ Frames:Handmade wood frames 25mm wide, 25mm deep fitted with 2mm high quality clear perspex window & MDF backing with wall fittings. For total frame dimensions add 25mm to each side.Quality frames made in the UK.✋ Ready to Hang:Your unique and personalised prints come framed (if you select a framed option) and ready to hang straight out the box.NB: Differences in the way the foil adheres to the paper, can create minor imperfections, meaning that no two prints are identical.Please note: we do not automatically send over a proof of your order, if you'd like to see your image before it's printed please add a note to your order to let us know. (Please be aware in requesting proof this may delay your item being sent to you, and your dispatch date may be extended whilst we wait for approval from you)🖼️ Frames:Handmade wood frames 25mm wide, 25mm deep fitted with 2mm high quality clear perspex window & MDF backing with wall fittings.  For total frame dimensions add 25mm to each side.Quality frames made in the UK.✋ Ready to Hang:Your unique and personalised prints come framed (if you select a framed option) and ready to hang straight out the box.📏 Print Dimensions- 8x6\" - 20.3 x 15.2cm- 8x8\" - 20.3 x 20.3cm- 10x12\" - 25.4 x 30.4cm- 12x12\" - 30.4 x 30.4cm- A5 - 14.8 x 21cm (5.8 x 8.3 inches)- A4 - 29.7 x 21cm (8.3 x 11.7 inches)- A3 - 42 x 29.7cm (11.7 x 16.5 inches)NB: Differences in the way the foil adheres to the paper, can create minor imperfections, meaning that no two prints are identical.Please note we do not automatically send over a proof of your order, if you'd like to see your image before it's printed please add a note to your order to let us know. (Please be aware in requesting proof this may delay your item being sent to you, and your dispatch date may be extended whilst we wait for approval from you)",
    "reviews": [
      "Chip off of the frame but otherwise amazing product!",
      "great item thank you! !",
      "Beautiful and looked perfect when I framed it :)",
      "Beautiful anniversary gift for my husband. Exactly as described"
    ]
  },
  {
    "productId": "PvkBHlhJNN",
    "url": "https://www.etsy.com/listing/1045367250/personalized-metal-sign-custom-family?click_key=edfdf226007e86328e408b67cfca7012112379b8%3A1045367250&click_sum=174711b3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Metal Sign - Custom Family Name & Est. Date - Elegant Metal Home Decor - Minimalist Wall Art - Modern Decor- Personalized Gift",
    "description": "This minimalist custom home sign will make a lovely addition to your home! Adorn your living room walls with your last name and established date. This unique piece of wall art will last for generations to come - making it a wonderful gift for a new family!Personalize this sign with -  LAST NAME (10 characters) EST. DATE (15 characters)ATTENTION: If you want to change anything about the design (adding images, changing the font, changing the layout, etc.) other than the year and text - there is a $35 design fee. Please message me before checkout so I can create a custom listing to match your special requests.- Dimensions18\" wide x 6\" tall x 16g steel24\" wide x 8\" tall x16g steel30\" wide x 10\" tall x 16g steel36\" wide x12\" tall x16g steelCustom sizes done often, contact me for any size up to 5 ft by 10 ft!**Example shown in listing photo is NOT 100% sized to scale**- Mounting1/4\" Mounting Holes for easy surface mounting***PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.***- FinishesRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.INDOOR FLAT CLEAR -DARK (EVEN BLACK) - The Indoor Flat Clear finish is an oil-based matte clear coat that makes the steel darker, sometimes even black. This finish will hold up well inside and is easy to clean. This finish can be darker or lighter than our pictures depending on the recycled steel we use that day.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.ALUMINUM - The Aluminum finish is the best option if you want the look of shiny metal or stainless steel on a budget. This finish is rust-proof and weather-proof (great for marine environments) and is lightweight. Aluminum is also a soft metal and scratches easily, so please be careful when opening your package.ALUMINUM POWDER (GLOSS CLEAR, FLAT BLACK, GLOSS WHITE, GLOSS RED) - These Aluminum powder coat finish options will help prevent chips and scratches and give you more color choices. These UV protected finishes will protect the Aluminum in the toughest conditions and help prevent oxidation over time.GALVANIZED - Galvanized refers to a process in which steel is coated with a layer of zinc to protect it from corrosion. The appearance of galvanized metal is characterized by a shiny, silver-gray surface. The coating gives the material a distinct metallic luster. Over time, the zinc coating may develop a matte gray patina as it weathers, but the initial appearance is typically bright and reflective.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about these options? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!personalized gifts, wall decor, wall art",
    "reviews": [
      "The sign looks just as good as the picture. I LOVEEEE it!!",
      "Turned out great!! Love it",
      "Amazing quality. Really quick to ship and overall very satisfied with the sign.",
      "Just perfect for our new place."
    ]
  },
  {
    "productId": "jZTMNdfBUl",
    "url": "https://www.etsy.com/listing/1307705558/best-man-gifts-personalized-engraved?click_key=804a8a44bac2dd7046e7751d7b8669405f61897d%3A1307705558&click_sum=69ea1895&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-5&pro=1&frs=1&etp=1&sts=1",
    "title": "Best Man Gifts | Personalized Engraved Cufflinks Tie Clip Money Clip | Custom Groomsmen Gift | Groomsmen Proposal | Valentines Gift for Men",
    "description": "*Please leave contact number is ship outside of US.Get our groomsmen gift box and make your wedding proposal special for your groomsmen. Or gift this personalized wooden gift as an anniversary gift for him. The custom wood gift box includes cuff links, a tie bar, and a money clip that gives a perfect vintage look.The wooden gift box comes with a feature that allows you to engrave your name or initials. In addition, the accessories in a gift box are available in two variations so that you can choose the one that best suits you.Features of ItemsOur engraved groomsmen’s wooden gift box nicely holds a set of cuff links, a money clip, and a tie bar.Accessories included in a wooden gift box come in two variations: stainless steel and gold plated.The personalization feature of our groomsman gift box allows you to laser engrave the recipient's name and initials.You can gift on occasions like anniversary gift, father’s day gift, groomsmen wedding proposal, best man gift. Even a great gift idea for the father of the bride or valentines day gift.About shippingDOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.Note for international shipping-Please leave full name and contact number.-The customer is responsible for all duties and taxes.Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.For product value over this limit, there will be import taxes, fees, and customs duties (hereafter, \"Import Fees\"), levied by the customs office of your shipping destination, it could be around 10-25% in total, depending on regulations of local authority.As all of our products are personalized, we will not issue a refund to return-to-sender goods due to unpaid custom duty fee.--------------------------------------------------------------------custom cufflinks, engraved money clip, gold cufflinks, tie clip, laser engraved cufflinks, personalized gifts, groomsmen gift set, metal cufflinks, groomsmen gifts, best man gifts, groomsmen proposal, groomsmen gift box, wedding favors, anniversary gift, bachelor party, cuff links, birthday gift, husband gift, gifts for him",
    "reviews": [
      "Needed a rush order for a big party (10 groomsmen w/ unique names) and was accommodated. These are worth every cent. Loved by everybody and undoubtedly highly recommend.",
      "Very nicely engraved. He loves them! Thank you very much",
      "Great customer service! I requested it to be delivered by a certain date and the order came in on time!"
    ]
  },
  {
    "productId": "wHJAKjBdQs",
    "url": "https://www.etsy.com/listing/1440071934/personalized-gifts-for-one-year-old-girl?click_key=9bf1e215829363b889b4f8fbabc23d08500c1343%3A1440071934&click_sum=36ae1774&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-6&pro=1&frs=1&etp=1",
    "title": "Personalized Gifts for One Year Old Girl, Unique Baby Girl First Birthday Gifts, Toddlers Puzzle, Free Engraving Tyucustomgifts BP063I-AP423",
    "description": "A well designed name puzzle will be a unique toy gift for 1-4 years old. It's could be a great early learning toy and beautiful name sign as nursery decor.3 adorable designs of personalized name puzzles are listed here. BP103 with animals and numbers, BP104 with shapes and numbers, and BP063 with 2 lines of animals. Please pick your favorite style for your little one. Babies could learn to spell their names and tell animals while playing with our name puzzles. Below the animals, the name of each will be laser engraved so it could also be played as a matching game.✔ Free back message engraving(please clearly request it in the note of the order if you need it)✔ Free shipping to more than 10 countries>>>> ABOUT THE NAME  PUZZLE <<<<♦ Water-based, non-toxic paints are applied for the letters. All letters are fully colored, including edges♦ Made of linden wood which is lightweight and soft, perfect for babies to play with♦ 16 different colorful animal head options available♦ 25 color choices for each letter♦ laser cutting applied for all parts to make sure every piece is cut neatly and smooth to avoid hurting babies' hands♦ Pegs are optionalEach puzzle set is 3/8 inch thick in total. Letters are 1/5 inch thick and are raised an 1/8 inch above the front of the puzzle so it's easy for a kid to play with.This name puzzle could be made for a single name with up to 10 letters(no spaces). If you need a longer name, please message me first, I will be happy to help.Want to have a look at other unique designs we have? Here is the whole section:https://www.etsy.com/shop/Tyuweddinggifts?ref=simple-shop-header-name&listing_id=790066607§ion_id=24125360>>>> HOW TO ORDER <<<<You will be required to type you requests in the personalization box when you checkout. Please write below:1)  name of the baby2) color number for each letter(check the last image for my color list)3) animal numbers>>>> TURNAROUND <<<<All puzzles are custom made made to order. Please allow 10-15 business days for delivery after ordering.",
    "reviews": [
      "My niece loves it. It's beautiful.",
      "Item came very quickly, looks exactly how I hoped it would! Very happy with this!",
      "The item came as described with the customization exactly the way I requested it. Definitely would recommend",
      "Very cute, my daughter likes it"
    ]
  },
  {
    "productId": "ZRhdiUVpG8",
    "url": "https://www.etsy.com/listing/717941967/valentines-day-gift-for-boyfriend?click_key=a695593ecc2d7008a0ace9aa5ac5cec5c85b119f%3A717941967&click_sum=96073e49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-7&etp=1&sts=1",
    "title": "Valentines Day gift for Boyfriend Penguin Gift personalized anniversary Gifts for him gift for Girlfriend Lesbian Gift I love you gift Card",
    "description": "｡･ﾟﾟ･ This is The Original and First MESSAGES IN A BOTTLE Etsy Shop!･ﾟﾟ･｡⋆ Find more than 200 designs VISIT OUR SHOPS »»EydavyBottles.Etsy.com&EydavyLargeBottles.Etsy.com&EydavyFavorAndPrints.Etsy.com✶ The most special, meaningful keepsake to keep close everyday. Maybe, the Perfect Gift for everyone!Keep your Special Moment and Memories in a cute little bottle, personalized with a photo make the bottle special and memorable!✸ The unique gift that is a card + possible ornament + Home Decoration + and a keepsake in itself° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °MESSAGESYou are my penguinI found my penguinI love you✻ I can create the label with YOUR OWN MESSAGE, you only need to select the option \"Change to OWN TEXT\" in Message selector and write me it on Personalization section, or in “add a note to EydavyBottles” at checkout° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °PACKAGINGSelect it on drop-down selector, and receive the bottle ready to gift up it✻ Standard✻ Tiny Postal Package (like a miniature parcel)✻ Inside a Cloud✻ Love Box✻ Christmas Postal Packaging (Our special Christmas Tiny Postal Edition :)✻ Square Floating Frame: Handmade with natural wood✻ House Floating Frame: Handmade with natural wood, shape like a little house✻ Triangle base° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °SOME ◦ DETAILS⋆ SIZE bottle H 5cm x D 2cm  /  2 X 0.8 Inch⋆ Carefully handmade to order and Carefully packed ready to gift up it⋆ The bottle include a blank paper card in a little cute envelope, for you to add your personal touch! (if you mark your order as a gift We’will NOT add this envelope)° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °SUBMIT ◦ PHOTOOnly valid if you order it with photo!After placing your order, select \"View Receipt\"  »  \"Contact Shop\" or \"Help With Order\"  »  click on \"Add an image\" to attach your photo° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °ADD ON ◦ for ◦ DISPLAYHand-crafted in our studio. We use Natural Pine. All in Natural colorWe can personalized with a few words⋆ FRAME: SQUARE or HOUSE shape for 1 bottle(Only in case you have not selected it in the Packaging selector)https://www.etsy.com/listing/892788723⋆ FRAME for MULTIPLES BOTTLEShttps://www.etsy.com/listing/292478397⋆ TRIANGLE STAND.https://www.etsy.com/listing/892849817⋆ HANGING SHELFhttps://www.etsy.com/listing/686282468⋆ ADD A HOOK and turned into an ornamenthttps://www.etsy.com/listing/878962580° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °SENDING ◦ DIRECTLY ◦ TO ◦ RECIPIENT✻ Mark “This order is a gift” at payment moment. Prices will not be shown on packing slip✻ I can print and send a little gift note in a little envelope with your order. If you want it, Mark “Add gift message for free”, leave your message... and don’t forget to say who it’s from!✻ Gift Receipt.  I never include the receipt or any price in the packaging, so you don’t need to worry about it when gifting° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °SHIPPING ◦ METHODThe basic shipping costs do not include track and trace, it has not tracking, but works very well ;)  If you need a tracking please consider upgrading to Tracking to USA. To Europe all are sent out with tracking. Please, read the shipping policiesPOLICIES:https://www.etsy.com/shop/EydavyBottles/policy° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °MORE ◦ GOOD ◦ THINGS✻ We are the store that created the concept of messages in a miniature bottle with handcrafted decorations inside✻ Read our wonderful REVIEWS. The most beautiful words about our bottles and our great customer service!✻TOP QUALITY  guaranteed ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° ° °ABOUT ◦ EYDAVY DESIGN S.L.Everything is hand-crafted by our little teamDavinia, the owner, created and designed each piece of art that you see in our shop, and works everyday in your bottles. Also is the person that answer all your questions.Nenedán, Cynthia and Ilenia work making and packaging your ordersOur Bussiness was built from the ground up based on integrity, creativity and the genuine desire to make people happy spreading MESSAGES of LOVE around the world!We love you, dear customer ツ｡･ﾟﾟ･ You have found the perfect little gift! ･ﾟﾟ･｡✷ This little gift is a great decorative item to display literally anywhere!The perfect size that does not occupy a lot of space but a lot of meaning. Add the Frame to Display it better.⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒⌒Any questions?? please don't hesitate to contact me, I'd love to hear from you! Thank you!",
    "reviews": [
      "Totally adorable! Exactly as described 💜",
      "Very cute and so adorably tiny! Even the wrapping is sweet with a cotton cloud to protect the bottle and a little ribbon around the box. Love it :)",
      "This is so adorable! I love it!",
      "Super cute product, high quality workmanship. Fast overseas shipping."
    ]
  },
  {
    "productId": "heDGYDzAKp",
    "url": "https://www.etsy.com/listing/1543617152/personalized-pencil-case-name-gift?click_key=1b7a61e8fd7e034d662398768deef812aa064b35%3A1543617152&click_sum=503d8e3b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-8&etp=1&sts=1",
    "title": "Personalized Pencil Case Name | gift schoolchild | Enrollment | pencil case | Case | pencil case | Teacher Farewell Gift | School",
    "description": "Pencil case personalized with name❤︎ Are you still looking for a little attention to say thank you? Say goodbye with a personalized pencil case! These practical pen cases for all your favorite writing utensils with a personal print are the perfect farewell gift for colleagues, fellow students and teachers. Also ideal as a gift for the new school beginning for a good start.❤︎ Product Information & FeaturesMaterial:Vegan leather in saffiano look with golden (in black also with anthracite-colored) zipperDimensions:- 22.0x5.5x4.5cmThe pencil cases are available in the following colors:- light grey- pink- black- ivory- taupeThe following colors are available as font colors:- gold- silver- white- black- rose gold❤︎ Personalization- Names and salutations are printed in normal spelling (first capital letter followed by small letters) at the bottom right-hand edge.- The initials are printed in capital letters with a vertical line in the middle, as shown in the example.Do you have another personalization request? Please send us a message before ordering.❤︎ EXPRESS editingWould you like to receive your order faster? Please note our express processinghttps://www.etsy.com/en/listing/1169392478/express-editing❤︎ More great personalized gifts are available here:https://www.etsy.com/de/shop/JelliesDesign-------------------Important instructions:Due to the individual personalization, the pencil cases are non-returnable.If you are unsure about the font, please ask for a graphic in advance when ordering. The visualization is subject to our design sensitivity and is therefore no reason for a complaint.The decoration shown on the product image is not part of the scope of delivery.",
    "reviews": [
      "It's so good and so cute but it's like kind of long compared to a normal pencil/pen. Lots of extra space vertically but its okay",
      "I love it! Thank you :)",
      "Top quality, very fast delivery.\nI'm fascinated, very beautiful!"
    ]
  },
  {
    "productId": "MmOWLTMkjA",
    "url": "https://www.etsy.com/listing/498167385/personalize-groomsman-gift-set-of-7-men?click_key=4beb94c81948025af0622abc9be881b0ed065923%3A498167385&click_sum=4f73f148&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-5&pro=1&sts=1",
    "title": "Personalize Groomsman Gift Set of 7 Men Shaving Toiletry Leather Travel Bag Dopp Kit Monogram Wedding Gift Groom Best Man Brother Husband",
    "description": "Dopp Kit - Pricing includes embroidery.Affordable gifts for the Groom, Fathers, or Groomsmen on your wedding day. Spacious to hold personal toiletries and belongings. Great as gifts and every day use.♥ Shaving Bag Details:· Material: PU Faux Soft Leather· Measurements: 8.5 x 6 x 4· Interior: Polyester Lining· Zipper Closure· Side Loop♥ Embroidery Options: Max 3 letters· 1 Letter, 2 Initials, or 3 Letter Initials (first, middle, last)♥ Add-On Rush Fees:· Ship within 14 days ($25)· Ship within 7 days ($50)♥ Note for 3 Letter Initials for Men· Men Initials should be in first, middle, last and will be embroidered same size across.♥ SHOP POLICIES:· By purchasing any listing from Love Meets Craft, all buyers acknowledge that they have read and understand the \"Item Details\" described in all listings and shop policies. Thank you.· All items are made to order.· Shop cannot be responsible for incorrect initials provided.• Due to variation between every monitor, smart phone and tablet display, the colors shown may appear different in person.· Personalized gifts do not qualify for returns. If there is a mistake, please contact us.· Customer satisfaction and happiness is our number one priority!♥ All images are property of Love Meets Craft",
    "reviews": [
      "The bags came out great! An amazing groomsman gift!",
      "Great customer service, amazing quality, and quick turn around! Will definitely be ordering again from her! ❤️❤️",
      "Very nice bags. I recommend them"
    ]
  },
  {
    "productId": "XbDeHy3Sbs",
    "url": "https://www.etsy.com/listing/1610370413/personalized-charcuterie-board-realtor?click_key=ef95cabb6e38942bb81a0ea0524694e96ab80258%3A1610370413&click_sum=bb4e0f5b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-6&pro=1&frs=1&bes=1",
    "title": "Personalized Charcuterie Board,  Realtor Closing Gift, Housewarming Gift, Bridal Shower Gift, Hostess Gift, Unique Christmas Gifts for Her",
    "description": "🧀🔹 Welcome to Acacia Crafts Art - Where Art Meets Appetite 🧀🔹Explore the perfect blend of artistry and functionality with our Handmade Marble and Acacia Wood Charcuterie Board. Now, introducing our luxurious Marble Charcuterie Board - a stunning addition to any home entertaining setup! Elevate your hosting experience with this exquisite piece crafted from premium, heavy marble and acacia wood.✨ Elevate Your Entertaining:Host memorable gatherings with our Personalized Cheese Boards, perfect for showcasing your favorite cheeses and charcuterie. Add a touch of creativity and elegance to your next event.🎁 Unique Gifts for Every Occasion:Our versatile boards make thoughtful gifts for housewarmings, weddings, or any special occasion. Personalize them to create a cherished and unique present.🌱 Sustainable Sophistication:We take pride in sustainability. Our Handmade Marble and Acacia Wood Boards not only enhance your table but also reflect our commitment to eco-friendly practices.🔹 Laser Engraving:Personalize your serving board or coasters with a laser engraving of your choice! Choose from various design options and customize any area with a name, date, or address. Laser engraving is permanently etched into the wood, ensuring a design that lasts for years.📏 Dimensions:-Cheese Board: 15\"-7.3”-0.5  >> Our Charcuterie Board ensures sturdiness and durability. The smooth, polished finish adds a touch of elegance to your serving experience.-Coaster: 4”-4”-0.39” >>  For a more intimate setting, explore our Coaster set, Perfect for protecting your surfaces in style.🔹 Wood Characteristics:Embrace the unique charm of acacia wood! Due to its nature, the coloring, markings, knots, and rustic characteristics may vary, resulting in lighter and darker areas on the board. Each board and coaster is unique, adding to its charm and character.🔹 Care Instructions:To maintain the beauty of the marble and acacia wood, hand wash the serving board and coasters, and polish the wood with mineral oil. With proper care, these pieces will last for years to come.🚚 Fast and Pristine Delivery:Your satisfaction is our priority. We ensure fast processing and delivery, so your board arrives in pristine condition, ready to be the centerpiece of your next culinary creation.📞 Contact Us:Your experience matters. If you have any questions, feel free to reach out. We're here to make your journey with Acacia Crafts Art exceptional.So why wait? Add these exquisite pieces to your collection today and impress your guests with your hosting skills! 🌟",
    "reviews": [
      "Looks exactly like the picture! A great gift!",
      "Perfect engagement or wedding gift.",
      "Coasters were the perfect house warming gift!"
    ]
  },
  {
    "productId": "wBtGCwxBHi",
    "url": "https://www.etsy.com/listing/774280971/actual-handwriting-necklace-memorial?click_key=63df05b40e445467c5af249b75cbcecb21995f5b%3A774280971&click_sum=4f3e756c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-7&pro=1&bes=1&sts=1",
    "title": "Actual Handwriting Necklace Memorial Personalized Gift Signature Remembrance Sign Jewelry Custom Engraved Jewelry Gift Wedding Handmade Gift",
    "description": "Actual Handwriting Necklace Memorial Personalized Gift Signature Remembrance Sign Jewelry Custom Engraved Jewelry Gift Wedding Handmade Gift*All Orders Ship the Next Business Day*Personalize this piece with your own meaningful message. Personal, timeless pieces you’ll never want to take off - it is made to keep your sentiments close.All of our jewelry are hypoallergenic and tarnish resistant. We wish to create lasting pieces that everyone can cherish, no matter the price point.We carefully package individual items with our original jewelry cards and gift box, and we are happy to write a handwritten gift message for you if the occasion calls for it. Please simply leave us your instructions in the note section at checkout.Dimensions:Disc: 0.5\"x0.5\"Chain: 18\"+2\" extenderSimilar Items:- Band Ring:https://www.etsy.com/listing/757804085/- Bar Necklace:https://www.etsy.com/listing/607362557/- Bar Bracelet:https://www.etsy.com/listing/743654602/Sister Shop:www.geominimalist.etsy.com",
    "reviews": [
      "I ordered several of these and all came out beautifully. The attention to detail was amazing. I love that I can ever get a sense of the texture of the pen she used. Shipped extremely quick (the day after I ordered) and arrived only a few days later. Would highly recommend and may be coming back soon to buy more!",
      "Really happy with the final product :) it looks amazing! Thank you so much!!",
      "The photo of my dad's signature that I sent was not great so I didn't expect much from this piece. It turned out so good! Affordable and beautiful."
    ]
  },
  {
    "productId": "JXJTznNwUu",
    "url": "https://www.etsy.com/listing/1579265141/personalized-night-light-customized?click_key=b38c1a19daed07a8b8b9a5f19dbbb09345acd1f5%3A1579265141&click_sum=4fa7ed04&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-8&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Night Light, Customized Valentine's Day Gift, Gift for Birthday, Girl, Daughter, Boy, Him, Baby Shower, Dad, Mom, Her Boyfriend",
    "description": "Christmas Gift, Birthday Gift from Daughter, Personalized Night Lamp, Custom Night Light, Anniversary gift for Him, Her. Gift for kids, boy, girl, son, daughter.Are you looking for a night light to brighten up your child's bedroom? Or a decorative, elegant, and personalizable gift for a loved one? You have come to the right place!Our homemade lights are the perfect gift for your loved ones. Whether it’s for Christmas, Valentine’s Day, Father’s Day, Mother’s Day, Birthdays, Weddings, or any other event, our lights are fit for the occasion!🌸–Light Information–🌸Dimensions of the lights:- Cloud Light = 8\" wide 6\" height- Rectangular and Oval Lights = 6\" wide 8\" height- Heart Light = 6.7\" wide 6.7\" heightThe acrylic is made out of 100% Virgin MMA.The wood is made out of Basswood, more commonly known as Lindenwood.The product comes with:- The acrylic- Wood stand- 3 ft. USB cable with on/off button*Power adapters are not provided with the order*The LED in the light lasts up to 50,000 hours.Made in Canada.There are no harmful ingredients in the lamps.🌻–Personalization Information–🌻We can engrave your personalizations to both the acrylic and the wood to add a personal touch to your orders!- If you only want personalization on the acrylic, please select “No thanks” for the woodpersonalization. Then, write your request in the box provided.- If you want both acrylic and wood personalizations, please select “Yes please” for the woodpersonalization. Then, write your request in the box provided. Please specify whichpersonalization you would like to write on the acrylic and which one you would like on thewood.Personalization Request Example:Acrylic = Michelle & JohnWood = I love you to the moon and back.Acrylic Personalization:We can only engrave with 1 font (examples provided in the pictures).- Cloud Light = Only one name (one word) can be written on the cloud acrylic.- Rectangular and Oval Lights = We can engrave two names, a date, and a sentence on theacrylic. If you would like all 3 on the acrylic, the sentence needs to be a maximum of 6words. If you only want a sentence without names or a date, it can be two lines long.- Heart Light = Maximum two names and one date can be written on the acrylic.Wood:We can only engrave with 1 font (examples provided in the pictures).A maximum of two lines can be written on the wood.Logo Engraving =We can engrave logos on the lights as well. If you would like to engrave a certain logo, please message us through Etsy messages and send the picture you would like.🌷–Shipping Information–🌷We prepare and ship your products in 1 or 2 business days.Normally, Canadian customers receive their orders in 3-10 business days. Whereas, US customers receive their orders in 3-7 business days.*Please note that during the holiday season, there may be delays in shipping. We are not responsible for these delays.*🌹–Light Care–🌹- Before you start using the light, please remove the protective film behind the acrylic part.- In order to keep the light clean, you can use a glass cleaner with a soft cloth to wipe the acrylic part.If you have any questions, please message us through the Etsy messages and we can gladly assist you the best we can!We can make your order in 1-2 days.Canadian customers receive their orders in 3-10 business days.US customer receives their order in 3-6 business days.",
    "reviews": [
      "The product was beautiful! It is a birthday gift though so I wish it came packaged a little better then just put in a cardboard box with bubble wrap.",
      "Loved the light! Gifted it to friends and they loved it. Highly recommend.",
      "I didn't see this in person as I had it shipped directly to the recipient as a new-baby gift. However, she said it was beautiful and really liked it. Customer service was great. Thank you!",
      "Love the quality! And handled with care."
    ]
  },
  {
    "productId": "FdIzkZWEeb",
    "url": "https://www.etsy.com/listing/1214897208/personalised-ballerina-musical-carousel?click_key=2a3a730f6ab362527930035266f3a541aa8e5d7c%3A1214897208&click_sum=614c6b87&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalised Ballerina Musical Carousel Wooden - Custom Heirloom Music Box - Engraved Keepsake Gift - Baby Shower - New Mom - Baby Girl",
    "description": "Our beautiful musical carousels are the perfect keepsake for your little love. Made from beech wood and featuring a sweet tune when turned, our carousels are the perfect piece to treasure for years to come. Each carousel is 11cm wide x 18cm high, and can be lovingly engraved on the front in our timeless script and serif fonts. Choose from ballerinas or horse etched design.Ballerina Carousel plays You are my Sunshine.Horse Carousel plays City of the Sky.*Please note the songs cannot be changed.*Perfectly packaged in a gift box, our Carousels will make the perfect gift for the new arrival in your life and is sure to be treasured for years to come.Please leave the requested name in the 'Personalisation' box on listing. We recommend up to 2 names, as the more names, the smaller the wording will be. The maximum width of the name will be 4-5cm. Please ensure all spelling and capitalisation is correct as no drafts are provided before production. If you select 'No' to personalisation and leave a name, you will receive a non-personalised plaque. Please ensure the correct option is purchased prior to completing your order.A full list of the script font is available to view if you swipe through the listing pictures. Please ensure all spelling and capitalisation is correct, as no drafts are provided before production.",
    "reviews": [
      "The item was beautiful and as expected! The outside box packaging was severely damaged",
      "Thank you so much for the most wonderful gift for my Gran-Twin’s first birthday.  I genuinely love my purchase of the ballerina musical carousel for Brooklynn Rose and the horse carousel for Byson Edward.  I know this will be a treasured gift for them; a grateful Nana, Brenda.",
      "Absolutely beautiful and arrived quicker than I expected. Very very glad I chose to purchase😊"
    ]
  },
  {
    "productId": "UwWTAUpOkJ",
    "url": "https://www.etsy.com/listing/1398293160/moon-embosser-book-stamp-personalized?click_key=d7ced66c01b4f9f282ec444c4c1c13ca1835ac6e%3A1398293160&click_sum=95802330&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Moon Embosser Book Stamp | Personalized From the library of | Ex Libris | This book belongs to | Book lover gift | Wood and Self ink stamper",
    "description": "Personalized Book Stamps, change the wording to your own or use common phrases \"From the Library of\" Ex Libris\" Property of\"🎁 𝗧𝗛𝗘 𝗣𝗘𝗥𝗙𝗘𝗖𝗧 𝗚𝗜𝗙𝗧💎 𝗤𝗨𝗔𝗟𝗜𝗧𝗬 𝗖𝗥𝗔𝗙𝗧𝗠𝗔𝗡𝗦𝗛𝗜𝗣✨ 𝗘𝗟𝗘𝗚𝗔𝗡𝗧 𝗗𝗘𝗦𝗜𝗚𝗡🌟 𝗠𝗢𝗡𝗘𝗬-𝗕𝗔𝗖𝗞 𝗚𝗨𝗔𝗥𝗔𝗡𝗧𝗘𝗘We love this stamp, and we hope you will too. If for any reason you are not satisfied, we will give you your money back, guaranteed!----------𝗣𝗥𝗢𝗗𝗨𝗖𝗧 𝗢𝗣𝗧𝗜𝗢𝗡𝗦- SELF INK STAMP = inkpad is built into the stamp and inks design with colors: Black, Blue, Red, Green, Purple- WOOD HANDLE STAMP =  inkpad not included- EMBOSSER = Embosses right onlySIZESWood Stamp: 1 x 1.5 in. aproxSelf Ink Stamp: 1 × 1.5 in. aproxEmbosser: 1 × 1.5 in. aprox (embosses right only)----------Follow these easy steps to customize & complete your order:♡ 𝗖𝗛𝗢𝗢𝗦𝗘 𝗬𝗢𝗨𝗥 𝗢𝗣𝗧𝗜𝗢𝗡𝗦Wood stamp with handle, wood stamp with no handle, or self-ink stamp♡ 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗭𝗘 𝗜𝗧Use the \"Personalization Box\" or \"Notes to Seller\" to let me know the details of your stamp. Please copy & paste this template:Text above: from the library ofName: laura miler♡ 𝗗𝗜𝗚𝗜𝗧𝗔𝗟 𝗣𝗥𝗘𝗩𝗜𝗘𝗪 (OPTIONAL - ADDS 2-3 DAYS)If requested, I'll send you a digital preview via Etsy messages within 2-3 business days. I ask that you please keep an eye on your Etsy messages and email. The quicker you approve your preview, the faster I can ship it to you 🙂If there's no response, I'll attempt to contact you a second time before I begin production as-is.♡ 𝗣𝗥𝗢𝗗𝗨𝗖𝗧𝗜𝗢𝗡 𝗔𝗡𝗗 𝗦𝗛𝗜𝗣𝗣𝗜𝗡𝗚 𝗧𝗜𝗠𝗘𝗟𝗜𝗡𝗘Production: please allow 2-3 business days after your digital preview is approvedShipping: the average shipping time is 3-5 business days---Can you rush my order?Of course! I offer options to expedite production.Please contact me before placing your order, so I can make sure that you can get your stamp delivered to you in time 🙂",
    "reviews": [
      "Perfect addition to my home library. Love this.",
      "It's a great product, would recommend",
      "Love this personalized embosser, the design fits my aesthetic perfectly"
    ]
  },
  {
    "productId": "xbBygJDYXc",
    "url": "https://www.etsy.com/listing/1513076450/personalized-liberty-cotton-cord?click_key=f47f8c29db8f6052a5f264d53e2f9e1db2d5d425%3A1513076450&click_sum=e8d43088&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-12&etp=1&sts=1",
    "title": "Personalized liberty cotton cord bracelet with medals to engrave, first name bracelet, birth gift Mom gift Mother's Day",
    "description": "👉🏼 DETAILS• 100% Liberty Cord Bracelet with stainless steel T-shaped clasp closed by 2 sliding knots,• 12 mm stainless steel medals in stainless steel do not rust, resist over time and are hypoallergenic to engrave on both sides* Gift box in addition * when ordering, simply tick the gift box and the box will be offered, otherwise the bracelet will be wrapped in an organza pouch.Imagined and created in our workshop in the south of France. We will take particular care in the creation and finishing of each model.Do not hesitate to contact me if you have a particular request, I respond quickly to your messages.🚚 DELIVERY• Each piece is handmade and personalized in our workshop. It takes 1 to 2 working days once the order has been validated before we can ship it.• Orders are shipped by tracked mail or colissimo depending on the weight of the order in a bubble envelope.• The deadlines below are given as an indication by the postal services. These deadlines may vary for reasons beyond our control.👌🏻 MAINTENANCE TIPThe jewels are made of stainless steel, they are very resistant, but it is preferable in order to preserve the life of your jewels, to remove them before going to sleep in order to limit breakage.Avoid keeping your jewelry in the pool or in the sea and putting your jewelry in contact with hydroalcoholic gel, perfumes and other cosmetics.",
    "reviews": [
      "Amazing thank you very much what work!! 😍",
      "In the top ! Thank you so much",
      "Given to a friend, who loved it",
      "Meets my expectations. Very pretty"
    ]
  },
  {
    "productId": "LThslEbqyb",
    "url": "https://www.etsy.com/listing/653100855/personalized-stationery-set-custom-gift?click_key=ef80c2e1225ccda549aa73b6acedb300639e4223%3A653100855&click_sum=65e5f837&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-13&frs=1&etp=1&sts=1",
    "title": "Personalized Stationery Set | Custom Gift Set with Everyday Notecards, Personalized Flat Cards and Notepad : Blush Field Stationery Set",
    "description": "The Blush Field personalized stationery set is hand illustrated with cheerful abstract florals to brighten up your notes, lists, and greetings. Each hand crafted set includes a large personalized notepad with 50 tear away sheets and sturdy chipboard backing, a set of 12 personalized flat cards, and 8 folded notecards with blank interiors for everyday notes or special occasions. Perfect to gift, the set arrives in a hand stamped cotton bag.The personalized stationery set includes:• Personalized Notepad | 5 x 7 inches | 50 tear away sheets• 12 Personalized Flat Cards | 4.25 x 5.5 inches | envelopes included• 8 Folded Notecards | 4.25 x 5.5 inches | envelopes included, blank interiors• Cotton BagFrom illustrating stationery and packaging orders to folding cards and trimming notepads, everything at Phoebe & June is proudly crafted by hand right here in Smithsburg, Maryland. Don't hesitate to get in touch if you have questions about this or any other item!",
    "reviews": [
      "Beautiful, would highly recommend to everyone.",
      "This was lovely. It will be a great gift.",
      "Matched the pictures exactly. Very high quality and exactly what I was looking for!"
    ]
  },
  {
    "productId": "DobAuJWFDc",
    "url": "https://www.etsy.com/listing/1403927391/personalized-gift-personalized-bags?click_key=d9b8d9f4e8c26d332d7651cc72e78a95b984136d%3A1403927391&click_sum=256eebff&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-14&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized gift| personalized bags | custom duffle bag | dance bag | personalized duffel | birthday gift| personalized gift for kids",
    "description": "High quality personalized duffel bag. Perfect for kids gift, dance bag, overnight bag, sleep over bag and more❤️Price includes 6 free patches/letters + making + two day priority shipping ❤️extra patches will be $3 each. I will contact you and l send custom links for the difference. feel free to place the order.Choose your own letter patches to add the personal touch.Size: 18.5 inch x 10 inch x 7.5 inch3-pieces set includes:- One Duffel: 18.5 inch x 10 inch x 7.5 inch- One XL Pouch: 11 inch x 8 inch x 5 inch- One S Pouch: 5 inch x 5 inch x 2 inch",
    "reviews": [
      "High quality. Quick shipping. Exceeded expectations.",
      "They were great about shipping it quickly to get here in time for a birthday party!",
      "All 3 of my kids are in sports and I got them each one. Super cute and they loved them!",
      "I bought this for my daughter for dance and overnight bag and I love it!! Turned out so cute"
    ]
  },
  {
    "productId": "BmCrLhXFHn",
    "url": "https://www.etsy.com/listing/226489512/wife-christmas-gift-what-a-difference-a?click_key=01d72f7f9400065686adaa39369f40b920cee401%3A226489512&click_sum=707b68ac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-15&pro=1&etp=1&sts=1",
    "title": "Wife Christmas Gift, What a Difference a Day Makes Burlap Print, Personalized Family Name Sign Important Dates Anniversary Gift for Wife",
    "description": "Wife Christmas Gift, What a Difference a Day Makes Burlap Print, Personalized Family Name Sign Important Dates Anniversary Gift for WifeCelebrate your one of a kind love story by showcasing special dates/events that make up your personal family history! This handmade burlap print is the perfect gift for any family or couple! Wife, husband, parents, grandparents, in-laws, friends, family, teachers, coworkers, you name it! This personalized gift is ideal for many occasions, such as a birthday, anniversary, housewarming, holidays, and more!// NAME & DATE LIMIT //8x10 ➡ 1-7 Names & Dates (in a single column); 8-16 Names & Dates (in two columns)11x14 ➡ 1-9 Names & Dates (in a single column); 10-20 Names & Dates (in two columns)// ADD A FRAME //If you’d like your print professionally mounted, framed, and ready to be displayed when it arrives, be sure to select the framed version from the list of offerings.The display photo pictured in this listing shows an {8x10 print} in an {11x14 frame with 8x10 mat}.// ITEM DETAILS //Material: 100% all-natural, eco-friendly jute burlap. We use a special, high-quality burlap for all of our prints. Unlike most burlap, this is a tightly woven, heavyweight burlap with a high thread count. The superior quality of this product results in a sharper, cleaner image and allows for fine detail in your print!Backing: A proprietary, heavy-duty backing is included with every print. This conveys a sturdy, photo-like quality to the fabric and helps to maintain the shape, prevent fraying, and prolong the life of your personalized print.Sizes: Available sizes indicate the dimensions of the actual print itself (Ex. If you select 8x10, the fabric will measure 8 inches by 10 inches)// ORDERING AS A GIFT? //Have your print professionally framed and shipped directly to the recipient!♥ COMPLIMENTARY GIFT NOTE INCLUDED! ♥// SHIPPING //Production Time: Please allow 1-2 business days for your personalized item to be designed and created. Your print will be ready to ship in just 1-2 business days!Once your print ships, arrival time depends on shipping method:STANDARD SHIPPING: 3-5 Business Days (approximate)PRIORITY MAIL: 2-3 Business DaysEXPRESS MAIL: 1-2 Business Days*TRACKING INCLUDED!* When your order ships, you will receive an email from Etsy including a tracking number for your package. All items are shipped from Florence, SC via USPS. Your print will be safely shipped to you in a heavy duty mailing envelope secured with thick corrugated cardboard to prevent bending or damage.INTERNATIONAL ORDERS: All international orders are shipped via USPS First Class International and take approximately 2-4 weeks to arrive. Tracking is not included, but we rarely have an issue with our packages not reaching their final destination!// WHY BUY FROM CHATHAM PLACE? //We have been fortunate to put art in over 80,000 homes all over the world! We are proud of our 5 STAR rating and with thousands of reviews, you don’t have to take our word for it! See what our past customers have to say about our shop, products, and customer service! ➡www.etsy.com/shop/chathamplace/reviews// VIEW OUR ENTIRE COLLECTION // :chathamplace.etsy.comFeaturing: Personalized Wedding Gifts・Anniversary Gifts・Bridal Shower Gifts・Engagement Gifts・Mother’s Day Gifts・Father’s Day Gifts・Birthday Gifts・Valentine’s Day Gifts・Housewarming Gifts・Baby Shower Gifts・Rustic Wedding Decor・Baby Nursery Decor・Holiday Decor・Seasonal Decor・Rustic Home Decor・Kitchen Decor・Gift Ideas・Gifts for Animal Lovers・Gifts for Coffee Lovers・Gifts for Grandma・Gifts for Grandpa・Gifts for Grandparents・Gifts for Mom・Gifts for Dad・Gifts for Parents・Gifts for CouplesStyles: Country・Shabby・Vintage・Rustic・Woodland・Garden・Barn・Farm・DIY・Backyard Chic・Eco Friendly・Natural・Elegant・Enchanted・Whimsical・Eclectic・Retro・Cottage Chic・Shabby Chic・Earth Tones・Earthy・Authentic・Organic// EXCLUSIVE SALES, COUPONS, & GIVEAWAYS //FACEBOOK: facebook.com/chathamplaceshopINSTAGRAM: instagram.com/chathamplace❤ Feel free to contact me with any questions or special requests!Back to the Shop:chathamplace.etsy.com© 2012 Chatham Place, Inc. All rights reserved.Artwork is for personal use only & may not be resold or published online.",
    "reviews": [
      "My third time purchasing one as my family has grown over the years. Bittersweet to see the old ones in the back of the frame. Great product!",
      "Beautiful gift and very quick delivery.",
      "Love this, great quality and shipped fast!",
      "Great item, looks exactly like I hoped it would!  The seller was very friendly and helpful."
    ]
  },
  {
    "productId": "m7vDlYFQwZ",
    "url": "https://www.etsy.com/listing/1494519213/personalised-gift-for-your-best-friend?click_key=27d2e8cd773206de1834f0a4915cfc140b37e802%3A1494519213&click_sum=5b2aff48&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-16&frs=1&etp=1&sts=1",
    "title": "Personalised gift for your best friend - choose your quote, Print for best friends, Xmas Gift for friends, best friend print, Christmas gift",
    "description": "🌺𝘈𝘳𝘦 𝘺𝘰𝘶 𝘭𝘰𝘰𝘬𝘪𝘯𝘨 𝘧𝘰𝘳 𝘴𝘰𝘮𝘦𝘵𝘩𝘪𝘯𝘨 𝘦𝘹𝘵𝘳𝘢 𝘴𝘱𝘦𝘤𝘪𝘢𝘭 𝘵𝘰 𝘨𝘪𝘧𝘵 𝘧𝘰𝘳 𝘺𝘰𝘶𝘳 𝘣𝘦𝘴𝘵 𝘧𝘳𝘪𝘦𝘯𝘥? Then why not surprise your bestie with a one off bespoke personalised portrait print. A beautiful keepsake gift that has been known to draw many a happy tear! With its watercolour background and touching message customised to you, this print is sure to touch your friend's heart. 🌺👀Please see the order template above the personalisation box to check how to order & make sure to look at the gallery for all outfit and hairstyle codes. If you are viewing on your mobile phone then all you need to do is swipe right on the main image.👀❔If you have any questions or concerns, please do not hesitate to contact me. ❔***IMPORTANT INFORMATION***❗PLEASE NOTE THAT THE FRAME IS NOT INCLUDED UNLESS PURCHASING THE OPTION WITH THE FRAME. ❗❗PLEASE NOTE THAT THE FRAME SHOWN ON THE MAIN IMAGE IS NOT THE FRAME USED TO FRAME YOUR PRINT IF OPTING FOR THE FRAMED VERSION. THIS IS A STOCK PHOTO USED TO DEMONSTRATE HOW MY PRINTS LOOK FRAMED❗*** SIZING OPTIONS ***🖨️ Digital print – Saved as a high-quality PNG File that can be printed in any size. If you are after a specific size then please request this on your order. This digital copy will be emailed to you rather than a physical copy sent and will be delivered to the email address attached to the ETSY order ready for you to print off. The email you receive will be from  pennyprintsx [!at] gmail.com which is my business email.🖌️Unframed A4 print - approx. 11.7\" x 8.3\" or 21cm x 30cm🖌️Unframed A5 print - approx. 8.3\" x 5.8\" or 15cm x 18cm🖼️ A4 Framed print Black or White – 9.5\" x 13\" or 24cm x 33cm. Border thickness is 0.78\" or 2cm🖼️ A4 Framed print Grey, Silver or Wood – 8\" x 10\" or 20cm x 25cm. Border thickness is 0.39\" or 1cm. Frames are slightly smaller but advertised as A4 as it needs to be printed on A4 Supplies.🖼️ A5 Framed print Black or White – 6.25\" x 7\" or 16cm x 21cm. Border thickness is 0.78\" or 2cm🖼️ A5 Framed print Grey, Silver or Wood - 6.29\" x 8.2\" or 16cm x 21cm. Border thickness is 0.39\" or 1cm❗ALL FRAME MEASUREMENTS ARE TAKEN FROM THE OUTSIDE OF THE FRAME AND DETAIL THE COMPLETE FRAME SIZE❗❗ALL FRAMES CAN BE STOOD UP ON A TABLE TOP OR WALL MOUNTED. IF OPTING TO STAND ON THE TABLE TOP PLEASE MAKE SURE TO USE THE STABILISER ON THE BACK OF THE FRAME. ❗❗All PRINTS ARE PRINTED ON 220GSM MATTE CARD❗***DETAILS***⭐At The Penny Prints, I understand the importance of quality when it comes to gift giving. That's why I only print on high-quality 220gsm card, with perfect resolution. I offer the highest quality customised prints at very affordable prices and like to pride myself of being available to the many!I am more than happy to work with you on customisation to make unique prints so if there is something you would like but can’t see then please give me a message. There's nothing I enjoy more than helping you to create an exclusive & unique print. ⭐***HOW TO ORDER***📏 Choose the size you would like (Digital copy, A4 unframed print, A5 unframed print or a framed version)💻In the Add personalisation box Please type:a. From left to right (All details must be entered in order from left to right) please provide the number of people for the print – you can have as many people as you would like. Any number over 2 means the print will be landscape.b. From left to right please provide the name, skin colour code, outfit code and hairstyle code for each person (for detailed instructions please see listing image)c. For hair options please see options in listing image, please state in personalisation box which style it is you would like and the number attached to the picture.d. Please write the text you would like to appear on the print in the personalisation box this can be any message you like! The complete print is fully customisablee. Click \"Add to Cart\" button❗PLEASE ENSURE THAT ALL DETAILS IN YOUR MESSAGE ARE CORRECT TYPOS WILL NOT BE RECTIFIED AS QUOTES & NAMES ARE DIRECTLY COPIED AND PASTED FROM YOUR ORDER❗Example:Person 1Skin Tone: s1Top option: pinkBottom option: whiteSocks: WhiteProp code: P11Hairstyle code: H232Name: PennyPerson 2Skin Tone: s1Top option: whiteBottom option: pinkSocks: whiteProp code: p23Hairstyle code: h312Name: CharlotteWatercolour splash = w1Title = Best FriendsText for beneath the title= because of you I laugh a little harder, cry a little less and smile a lot more❗IF YOU WOULD LIKE A PREVIEW OF YOUR PRINT BEFORE IT IS SENT OUT THEN PLEASE REQUEST THIS ON YOUR ORDER AND WHETHER YOU ARE HAPPY TO BE CONTACTED VIA ETSY MESSENGER OR IF YOU WOULD PREFER IT SENT TO YOUR EMAIL. IF OPTING FOR THE EMAILED VERSION PLEASE LET ME KNOW THE EMAIL ADDRESS TO SEND IT TO. ❗❗PLEASE NOTE THAT 3 REVISIONS/CORRECTIONS ARE INCLUDED IN THE PRICE ANY CHANGES MORE THAN 3 TIMES WILL INCUR A FEE FOR THE TIME IT IS TAKING ME TO COMPLETE THEM❗❗PLEASE NOTE THAT PREVIEW MAD POTENTIALLY ADD TIME TO THE DISPATCH OF YOUR ORDER. IF A PREVIEW IS NOT REQUESTED THEN THE ITEM WILL BE SENT AS PER YOUR PERSONALISATION REQUESTS SO PLEASE CHECK THAT THEY ARE ALL CORRECT BEFORE ORDERING. ❗❗PLEASE NOTE THAT ONCE THE IMAGE HAS BEEN CREATED AND A PREVIEW SENT THEN NO REFUND OR CANCELLATIONS CAN TAKE PLACE AS I HAVE SPENT TIME CREATING THE PRINT AND THE PREVIEW THAT YOU HAVE WILL NOW MEAN THAT YOU HAVE A PRINT THAT HAS BEEN SENT FREE OF CHARGE. ❗❗IF YOU FAIL TO REPLY TO THE PREVIEW WITHIN 2 DAYS/48 HOURS THEN THE IMAGE WILL BE SENT AS THE PREVIEW’D VERSION❗***POSTAGE INFORMATION***📫 All UNFRAMED PRINT orders to the UK are sent via Royal Mail First Class Post (NOT TRACKED)📫All FRAMED PRINT orders to the UK are sent via Royal Mail First Class Post Tracked and Signed📫 All UNFRAMED A5 PRINT orders sent internationally are sent via Royal Mail International Tracked & Signed 5–12-day delivery📫 All UNFRAMED A4 PRINT orders sent internationally are sent via Evri Parcelshop Tracked Standard 3-7 day delivery📫All FRAMED PRINT order sent internationally are sent via Evri Parcelshop Tracked Standard 3-7 day delivery❗PLEASE DOUBLE CHECK THE DELIVERY ADDRESS BEFORE PURCHASING AS REPLACEMENT ITEMS/REFUNDS WILL NOT BE GIVEN FOR INCORRECT DELIVERY DETAILS❗❗PLEASE NOTE THAT ALL TRACKED ORDERS CAN BE FOLLWED THROUGH THE PURCHASES SECTION IN ETSY OR VIA THE DISPATCH EMAIL. IT IS YOUR RESPONSIBILITY TO CHECK ON THE STATUS AND MAKE SURE THAT YOU DON’T MISS THE DELIVERY. IF THE ITEM IS SENT BACK TO ME DUE TO MISSED DELIVERY/COLLECTION THEN ANOTHER POSTAGE FEE WILL NEED TO BE PAID FOR IF YOU STILL WANT THE ORDER❗***FAQ’s***What paper do you use?All prints are printed on high quality 220GSM CardHow long does the dispatch process take?Once ordered all & created the same day and then posted next day with 1st class post to the UK and approx. 5–12-day delivery Leadtime internationally.Does this item come with a frame included?Frames can be purchased at an additional cost when selecting the size option***RETURNS***Due to the product being personalised I not be able to issue a refund, unless the item has arrived with you damaged. If the item is incorrect or there is an issue then a replacement will be issued. If you order is damaged please let me know within 7 days of receiving your item. Unfortunately, I won’t be able to accept returns once the 30 days have passed.Please be sure to check the Estimated Dispatch time under Deliveries & Policies upon ordering***ADDITIONAL INFORMATION***This shop and its content are copyright of PennyPrintsx - © [2021]. All rights reserved.Any redistribution or reproduction of my designs in any form is prohibited other than the following:•\tYou may print or download the custom artwork for your personal use only•\tArtwork may not be reproduced by any process without the express written permission of the artist.•\tAll copyright and reproduction rights are retained by the artist.•\tDigital File is for personal use only.You may not, except with my express written permission, distribute or commercially exploit the content of my shop. Any shop found to be copying my work will be reported to ETSY and legal action may be taken.❤ Follow me on Instagram @pennyprintsx",
    "reviews": [
      "It turned out very beautiful.",
      "Really loved this and the words made it so special",
      "Great print with quick delivery",
      "Lovely item very happy with it. My friend loved it"
    ]
  },
  {
    "productId": "PElYPMjlBw",
    "url": "https://www.etsy.com/listing/1596014840/corporate-portfolio-and-smart-thermos?click_key=5a3620c22641c6889a24525d51652cfd1fdc876f%3A1596014840&click_sum=99259f60&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-9&pro=1&frs=1",
    "title": "Corporate Portfolio and Smart Thermos Gift Box, Company Custom Diary Gift Box, Business Bulk Order Smart Thermos, Company Client Gift Box",
    "description": "Corporate Portfolio and Smart Thermos Gift Box, Company Custom Diary Gift Box, Business Bulk Order Smart Thermos, Company Client Gift BoxIMPORTANT INFORMATION: All set products come in our very high quality and stylish gift box. We can only print logos on our black and navy blue boxes.WHAT'S INCLUDED IN OUR GIFT PACK ?1- Business A5 Notebook Charger Diary2- 16oz Stainless Steel Smart Thermos3- Premium Carbon Fiber Pen4- High Quality Gift BoxPRINTINGWe can print all of our products in the set FREE OF CHARGEPROCESSING TIMEOnce your order is confirmed, we can usually complete printing within 1-3 days.SHIPPING TIMEShipping times vary depending on the shipping states. Typically, delivery is made to New York in 2 days, Texas and Chicago in 3 days, Arizona and Colorado in 4 days, and California in 5 days.Thank you very much in advance for choosing us and wish you success in your work.Best RegardsUNITED PROMO - Corporate Gifts",
    "reviews": [
      "Great quality and great customer service.",
      "I am very happy with the items received. These were gifts for Admin Day. They were received very quickly, and customer service was responsive, helpful, and accommodating. I would definitely purchase more items in the future.",
      "We are very happy that you honored us with your wonderful comments.\n\nThank you very much for your kindness and kindness.",
      "Incredible Quality and service. Will use frequently",
      "We are very happy that you honored us with your wonderful comments.\n\nThank you very much for your kindness and kindness.",
      "I loved how this came out, I ordered as gift for my husband and his new business partner. It was something I was proud and excited to give.",
      "We are very happy that you honored us with your wonderful comments.\n\nThank you very much for your kindness and kindness."
    ]
  },
  {
    "productId": "NVWlAG0EHg",
    "url": "https://www.etsy.com/listing/1128885688/personalized-hugs-and-kisses-monkeys?click_key=d7ec5f20248ddc64c119adc2465f7a1f172d9283%3A1128885688&click_sum=a3320f79&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-10&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Hugs and Kisses Monkeys - Loving Gift- Stuffed Animals for Kids – For Couples - Personalized Gift For Two",
    "description": "ADORABLE MONKEY BUSINESS: These monkeys are cute, cuddly and ready to share all the love in their own sweet & snuggly way. No matter who you’re surprising, this darling pair is sure to make them feel your love one hug at a time.UNIQUELY PERSONALIZED: Make it extra-special for special kids—or couples, best friends and anyone who needs a hug! Personalize each adorable monkey’s foot with any name up to 9 characters.FOR YOUR LITTLE MONKEYS: Each time your favorite people snuggle up with this delightful brown and gray duo, they’ll know how much they mean to you for all the days to come.PREMIUM QUALITY. Made of super-soft polyester plush, this adorable pair measures 10.5\"W x 16\"H. Recommended for children ages 3+.A PLAYFUL GIFT: Delight the special people in your life with a gift that says “I Love You”. Perfect for Christmas, Valentine’s Day, birthdays or any time you want to share your love and put a smile on someone’s face.",
    "reviews": [
      "Sweet and so very cute!",
      "Adorable! Great quality. Loved it!",
      "Absolutely in love! I cannot wait to gift it to my cousin’s son, I got both of our son’s names on them."
    ]
  },
  {
    "productId": "hajahtTooj",
    "url": "https://www.etsy.com/listing/1461073739/wooden-cutting-board-with-juice-groove?click_key=6d956db83a47c25a7c024774429003cc6b0dfa4f%3A1461073739&click_sum=9e6f639b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-11&pro=1&frs=1&etp=1&sts=1",
    "title": "Wooden Cutting Board with Juice Groove Barbecue Gift Custom Cutting Board for Grilling Man Grill Gift Idea Personalize Grill Smoke Meat",
    "description": "Looking for a unique gift for the steak lover in your life? Our personalized steak cutting boards are the perfect choice. These cutting boards are made from high-quality wood and can be engraved with your chosen design, whether it be a monogram or a custom message. They also make a great addition to any kitchen, with options including personalized wooden cutting boards and customized cutting boards.https://www.etsy.com/shop/ForestDecorShop?section_id=42300272🛍️📝 O R D E R I N G ∙ I N S T R U C T I O N S: 🪚🪵Thank you for considering our personalized cutting boards! To ensure that your order is customized to your exact specifications, please follow these simple steps:→ CUSTOMIZE - Please provide us with the exact text that you would like engraved on your board. It's important to ensure that spelling, capitalization, and punctuation are all correct. If any line of information is missing, we will exclude that line. We kindly request that you double check all names and dates entered, as we are unable to accept returns unless the error was made on our end.→ BOARD TYPE - Choose your desired board size and type from the drop-down menu. We offer a variety of options, including Maple, Cherry, and Walnut in three sizes: 12x9 inches, 16x10 inches (available in a standard rectangular shape or an arched shape with juice groove), and 17x11 inches (available in a rectangular shape with juice groove).Please note that all of our cutting boards are approximately 3/4 inches thick.🌳🪚 Explore Our Olive Wood Board Options 🪚🌳We also offer all of our designs on our stunning olive wood cutting boards! If you're interested in purchasing an olive wood board, please explore our selection by clicking the following link:https://www.etsy.com/shop/ForestDecorShop?section_id=28640951🚀📦F A S T ∙ F R E E ∙ S H I P P I N G! 📬🎁We're pleased to offer FREE shipping on all orders! Your order will be shipped within 48 hours of purchase from Utah, and we use a fast and reliable shipping method that typically delivers within 4-6 days.🚀📦 R U S H ∙ P R O D U C T I O N ∙ A N D ∙ S H I P P I N G ∙ U P G R A D E S🪚🪵If you're in a hurry to receive your cutting board, we've got you covered! You can order our rushed production service (+$25.00) to have your item guarantee shipped the same or next day. Plus, at checkout, you have the option to upgrade to expedited 2-day shipping with USPS Priority, UPS 3-day, 2-day, or next day air.https://www.etsy.com/listing/1372659195/📜🔍 P R O O F S 🖊️Want to ensure your cutting board is exactly how you want it? Order our proof add-on (+$7.00), and we'll send you a digital proof for approval before engraving and shipping. Please note that proofs must be approved within 72 hours of receiving them, or your order may be processed without an approval.https://www.etsy.com/listing/1356225535/proof-add-on🎁🎀 G I F T ∙ P A C K A G I N G 🎀🎁Surprise your loved ones with a beautifully wrapped gift and a heartfelt message. Add our gift wrapping add-on (+$10.00), and we'll package your cutting board in kraft paper with a tag, twine, and crinkle shred filling. The exact materials may vary depending on the product size and type.For an even more personal touch, include a handwritten note with your gift (+$5.00). We'll handwrite your custom message on a thank you, birthday, wedding, or holiday card (depending on the occasion and your preference).https://www.etsy.com/listing/1356228367/add-on-gift-wrap🪚🌲 P R O D U C T I O N ∙ A N D ∙ Q U A L I T Y ∙ C O M M I T M E N T 🛠️👨‍🔬At our store, we use high-quality American-sourced lumber for our custom maple, cherry and walnut cutting boards. Before engraving, each board is thoroughly inspected and sanded to ensure a smooth surface. A high-quality food-grade mineral oil finish is applied to each board so that it is ready to use immediately upon delivery.Please note that every cutting board is unique since they are made from different types of wood. Therefore, slight color variations may occur, resulting in engraving that appears lighter or darker than the listing photo.🤲 C A R E ∙ A N D ∙ U S E ∙ I N S T R U C T I O N S 📝We provide a small care instruction card with all of our orders. To maintain the quality of the cutting board, do NOT put it in the dishwasher or submerge it in water. Hand wash the board and dry it immediately.We recommend that you do not cut on the engraved side of the board, which is the display side. If you purchase a juice groove board, please note that our designs are engraved on the juice groove side unless you clearly request otherwise in the \"Notes to Seller\" section.🔍👀 NOTE: Due to the natural origin of the hardwood used to make our cutting boards, color and grain variations in comparison to the listing pictures are possible.🌍 S H I P P I N G ∙ W O R L D W I D EYou may be responsible for extra customs import duties or taxes. 😞 We cannot predict or control this. If your item seems to be taking extra time to get to you, please check with your post-office / customs office. Standard international shipping for Canada and Europe typically takes 4-15 business days, while the rest of the world takes 8-25 business days for regular standard shipping. Please note that the BUYER is responsible for all duties and taxes accessed by your country. Potential duties and taxes are not included in your shipping price. If you would like to receive your items faster, we highly suggest expediting your shipping at checkout. 💨🎨💡 C U S T O M ∙ D E S I G N SWe can engrave your custom design, logo, or create something from scratch to meet your needs. Just send us a message and we can take it from there.💼 W H O L E S A L E ∙ AND ∙ B U L K ∙ O R D E R SThese personalized cutting boards make awesome corporate gifts, wedding favors, etc.If you’re interested in a custom design order or bulk order (company logo, etc.), kindly send us the specs to review. We will reply with the cost and delivery time.🛍️ SHOP ∙ A N D ∙ S A V EExplore the rest of our handcrafted collection and receive 10% off when you spend $350 or more. The discount will be added automatically at checkout.https://www.etsy.com/shop/ForestDecorShop📲 C O N N E C T ∙ W I T H ∙ U SFollow us on social media for new products, promotions, and giveaways:https://www.instagram.com/shopforestdecor (@shopforestdecor)https://www.facebook.com/shopforestdecorThank you for choosing our personalized cutting boards. We can't wait to create a unique and special piece just for you!",
    "reviews": [
      "I think this is a duplicate request.",
      "Beautifully made spoon and spatula.",
      "Shipping ws an issue, but was resolved quickly. This was a gift and she love it"
    ]
  },
  {
    "productId": "dPAhHQvcxJ",
    "url": "https://www.etsy.com/listing/1466485536/personalised-memory-film-acrylic?click_key=4d344778e2b286ea949a0a1deb7818ed45d27aed%3A1466485536&click_sum=083870c2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalised Memory Film Acrylic, Personalized Camera Roll Gift Our First Trip, Couples Gift Bestfriend Gift, Meaningful Valentines Day Gift",
    "description": "PLEASE CUSTOMIZE YOUR DESIGN:-Choose the plaque size: 4.6 × 8\" or 4.6 × 10\"-Choose your stand: Wooden, Acrylic, Mini Easel-Message us your photos you want to see in design.We create custom and handmade clear acrylic gifts for your most special days! This designs are a complete game-changer! Acrylic is a great material to place on your desk for long years since it is lighter than glass and it keeps its transparency and shines over time. Further, you can use it safely with children, since it does not break like glass, nor contains any harmful chemicals.What Will You Get In Your Package?-A clear acrylic plaque with your personalized design-StandDo you have further customization ideas? Or do you have more questions about personalization, customer service, or shipping? Just contact us via Etsy message. We would be more than happy to help you :)Why Should You Choose Us?• High Quality - We use high-quality products in every production step. We check every package just before the shipment one by one!• 100% Personalization & Customer Satisfaction - We arrange all the orders individually. We apply all the changes to the designs you require to get 100% customer satisfaction. We do not send any of the designs to production if the customer did not approve them.• Fastest Service - Since we are a local shop, the shipment doesn’t last more than a few days!• 24/7 Customer Service - We are always here to assist you! We do not care about the day or the hour. Do you have questions? Just send us a message, we will reply to it in a few hours :)",
    "reviews": [
      "Absolutely unbelievable product!!! The quality is amazing. I placed my order on a Friday & my order arrived the following Tuesday…. To IRELAND might I add!!",
      "This is great. The pictures look amazing!",
      "Turned out amazing. I love it"
    ]
  },
  {
    "productId": "wKwSbMZmzw",
    "url": "https://www.etsy.com/listing/1495633534/14k-solid-gold-name-birth-flower?click_key=c6ed5fd18c4a911fc4881d79d8e162c44ceb870c%3A1495633534&click_sum=3e9e9b29&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-17&pro=1&frs=1&etp=1&sts=1",
    "title": "14K Solid Gold Name Birth Flower Necklace, Custom Thin Gold Flower Jewelry Personalized Gifts for Her and Bridesmaid Gift",
    "description": "The exquisite 14K Solid Gold Name Birth Flower Necklace, a custom thin gold flower jewelry piece that is perfect for personalized gifts for her and bridesmaid gifts. With your choice of birth flowers, you can create a unique and meaningful necklace to celebrate special occasions or simply show your love for someone dear.Name and Birth Flower Necklace- Personalize this unique combination of name and birth flower to create a special keepsake for yourself or loved ones, available in 14k solid gold or thin gold necklace options- Customizable with any name and birth month flower, making it an ideal personalized gift for bridesmaids, mothers, or that special someone in your life- Delicately crafted 14k name necklace not only serves as a beautiful accessory but also holds significant meaning by representing one's personality through their birth flower- Birth flower jewelry adds a touch of elegance to your daily wear while showcasing the beauty of nature intertwined with personal identity- Perfect sentimental gift option for birthdays, anniversaries or simply because you care - order today and experience the charm of our handcrafted designs➰ Handmade and Delivered Exactly as Requested & on Time!🎉 Zero Shipping Charges🚀 Package at Your Door within 1 to 5 days🎁 Arrives in a Beautiful Gift Box➰ How to Order in a Breeze:- Choose your most-loved pieces from the drop-down menus above- Use the \"Personalization\" box to specify your customization- Got more requests? I'm all ears! Send me a message or leave a note for me at checkout!➰ Support the Handcraft of Experienced Artisans:- My mission is to ensure you're overjoyed after this shopping experience- Crafting with supreme materials: 925 sterling silver and genuine 14k gold- Proudly maintaining an allergenic material-free environment in my shop➰ Only the Finest, Certified Precious Metals- Say no to tarnish, scratches, and fade outs- No green blemishes or marks on skin- Offering 100% waterproof jewelry- Featuring Superior Quality Solid 925 Sterling Silver, 14K Gold Filled, 14K Rose Gold Filled, Authentic White Gold (Rhodium) Filled, and 10K 14K 18K Karat Gold- Your tailor-made piece will come with an authenticity certificate and hallmark➰ My Journey and my Dream- My love for handmade custom jewelry was born in a humble workshop- Secrets of the handcraft were passed on by my gold and silver-loving grandparents- Today, I breathe life into that very workshop, pouring love into each custom creation➰ I Ensure a Worry-Free Etsy Experience- I accept returns and exchanges, and I offer full refunds for any dissatisfaction- Something not as you expected? I'll recreate and reship at no cost- Kindly give USPS a bit more time during peak seasons. Your package is in safe hands➰ Fantastic Custom Made Picks for You:- 14K Gold Name Birth Flower Necklace:https://www.etsy.com/listing/1495633534/14k-solid-gold-name-birth-flower- Custom Morse Code Necklace:https://www.etsy.com/listing/1509775523/custom-morse-code-necklace-for-women- Discover more at my handmade sanctuary:https://www.etsy.com/shop/MinimalistAuraWarmest thanks!",
    "reviews": [
      "Bought for granddaughter for Valentine’s Day. She loved it.",
      "So happy to hear that, thank you for the great review!",
      "I purchased an necklace it's  simply beautiful well crafted this necklace is more than just  jewelry it's a work of art  the shipping process outstanding \nYou can tell the maker that pride in her work \nI'm totally satisfied and happy with my purchase \nthanks so much \nSylvia",
      "Incredible review, many many thanks!",
      "Unique design; quality piece;would order again",
      "Thank you so much enjoy your necklace!",
      "It is just as lovely and elegant in person as in the photos. Thank you for such an elegant piece to add to my jewelry collection.",
      "You are welcome-thank you as well!"
    ]
  },
  {
    "productId": "YwCytdzekH",
    "url": "https://www.etsy.com/listing/1276404155/rounded-edge-wrap-name-ring-by-caitlyn?click_key=a0487b3019ecbec2d08b49c4baa7c722a2c3193c%3A1276404155&click_sum=67917fb0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-18&pro=1&frs=1&etp=1&sts=1",
    "title": "Rounded Edge Wrap Name Ring by Caitlyn Minimalist • Custom Engraved Open Style Ring for Stacking • Personalized Gift for Mom • RM83F38",
    "description": "W R A P ∙ N A M E ∙ R I N GLooking for a creative and personal gift that says you’re thinking of your loved one? Our Rounded Name Wrap Ring is a nice change from the traditional style. It has a subtle curve that makes everyday wear more comfortable, without looking too feminine or masculine. The rounded edges add a softness to its otherwise modern look, while the custom name gives it that extra bit of personalization no other ring can match!• Material: High Quality Solid 925 Sterling Silver• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• Dimensions: ~3.5mm at the thickest part of the band to 1.5mm at the thinnest part.• All our work is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Simply leave us the Names or Messages and the Font Number you would like in the 'PERSONALIZATION BOX' upon ordering using this form:-- TOP/LEFT SIDE:-- BOTTOM/RIGHT SIDE:• If a font is not given, you will receive the font that is pictured for your order which is font #38 (our most popular font choice for this design).O T H E R ∙ I N F O R M A T I O N• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 6 - 10 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)O U R ∙ P O L I C I E Shttp://etsy.me/2cuqINvA B O U T ∙ C A I T L Y N M I N I M A L I S T ♡http://etsy.me/2cYBUSpM O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/CaitlynMinimalistI N S I D E ∙ S C O O P• IG: @CaitlynMinimalist• FB: https://www.facebook.com/CaitlynMinimalist-----------------------♡--------------------Thank you so much for visiting and hope you enjoy shopping with us ♡♡ Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "My mother loves it so much very beautiful",
      "Eh , I tried . Wasn’t what I expected.",
      "Very simple but pretty. I would recommend a 100% well made",
      "Simple but very cute,  I'm very pleased with my ring🩶"
    ]
  },
  {
    "productId": "qqBwrlhjTE",
    "url": "https://www.etsy.com/listing/1346863359/personalized-duffle-bag-weekender-bag?click_key=8e0ab4d6a192ff14a0d7c4eca97bc9bf0d6d2390%3A1346863359&click_sum=1f720564&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-19&pro=1&etp=1&sts=1",
    "title": "Personalized Duffle Bag, Weekender Bag Women, Duffle Bag Women, Personalized Gift for Her R8",
    "description": "Whether you're off on business, visiting family and friends for the weekend, or headed off to college in need of a large accommodating duffel, the Weekender is your go-to travel bag. In addition to ample storage space, this popular weekend getaway duffel features a top zip closure, inside zip pockets and standard pockets. Equipped with two genuine leather handles and a detachable shoulder strap, It's sure to keep you traveling in style comfortably. This heavyweight washed cotton canvas body features brown buffalo leather trim and antique brass hardware.✨PREVIEW NAME OR TEXT✨https://app.fontvisual.com/showcases/68b267c6-982d-423a-90a3-b7ce8800f8d5♥ HOW TO ORDER ♥1) Select options for any Dropdowns (see photos for options)2) Enter information in the Personalization Box3) Click \"ADD TO CART\"4) Go back to listing and repeat as needed5) Confirm Shipping Address and Complete Checkout!♥ SIZING AND ITEM DETAILS ♥▹ Listing photos contain sizing, details, and color options.▹ Design is Embroidered.▹ 23\" x 11\" x 14\"▹ Cotton Canvas▹  Brown Buffalo Leather Trim With Brass Hardware And Zippers▹ Two leather handles with detachable and adjustable shoulder strap with leather padding▹  Sturdy Top Carry Leather Handles♥ PROCESSING & SHIPPING ♥▹Shipping (re-shipment fee) must be purchased for packages returned due to incorrect address to be mailed again.▹ You will be emailed with shipping confirmation and tracking once your order ships.✧ PROCESSING ✧• Times vary by design style.• Please message us for accurate turnaround on a specific item.✧ SHIPPING ✧• Times are typically between 2-10 business days:• Shipping times are ESTIMATES ONLY; actual delivery time can be faster or may be delayed.• Holidays, natural disasters, and other special circumstances can delay delivery.• We are not responsible for shipping delays, and do not guarantee any specific delivery date.♥ CARE INSTRUCTIONS ♥▹ See package insert for all care instruction.♥ DISCLAIMER ♥▹ Verify all information including spelling and address before ordering.▹ Due to the nature of our items, we are unable to accept returns, exchanges.▹ Cancellations and changes can not be made to orders once purchased due to fast processing times.▹ Colors can vary from screen monitors to physical products.▹ For any Rush Order, we must be messaged for accommodation and purchase Rush Upgrade BEFORE ordering.▹ We are not liable for delays due to missing information, shipping delays, or any deadlines.▹ Read shop \"POLICIES\" for more information.♥♥ Any other question or concern, please message us directly! ♥♥",
    "reviews": [
      "The item came in a reasonable time & it’s actually more (in the good sense) than what I expected the bag to look like. Would buy again & recommend this product",
      "I bought this for a gift and my daughter loved\nIt !!!!",
      "The customer service is the best I’ve seen. They stand behind their product."
    ]
  },
  {
    "productId": "jNn7rOpDHj",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=4f32eff1ed767d1e54630986810c88185cf04e90%3A747068567&click_sum=1bb9bc84&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-20&pro=1&frs=1&etp=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Would recommend this is a great gift",
      "I paid extra for this to be delivered by Christmas--and it came early :) Great responsiveness and its beautiful.",
      "The best! A great housewarming gift"
    ]
  },
  {
    "productId": "VZnyxswCUN",
    "url": "https://www.etsy.com/listing/1090998930/custom-name-neon-sign-for-kids-neon-sign?click_key=eae4d88a30782e2dce0ac50a7505c74c1eff55d2%3A1090998930&click_sum=fbcdde99&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-22&pro=1&frs=1&etp=1",
    "title": "Custom Name Neon Sign For Kids, Neon Sign Bedroom Neon Sign Custom Neon Sign Bedroom Bedroom Decor Kids Room Decor  Home Decor Gift For Kids",
    "description": "*** 12 Months warranty-Super fast production and shipping ***Ready to ship during 5-7 business daysShipping time: 7-12 working days (not holidays)Neon Sign, Neon Led Light, Custom Neon Sign, Hand-crafted Wall Hangings, Wedding Neon Sign, Wedding Decor, Bridal Shower Sign, Birthday Decor, Birthday Gifts, Personalized Gifts, Housewarming Gifts, Living Room Decor, Bar DecorSince the early 1900s, neon has been used to bring monuments to life with its cool, electric glow. Neon transforms the commonplace into something amazing, whether it's a Midwestern bowling alley, a Miami nightclub, or a downtown cafe.If you're anything like us, you love how neon illuminates a room with its warm, inviting glow, revitalizing the mood, elevating the vibe, and energizing the vibe. Customers adore our neon canvas art, so we set out to find a way to bring the fun and excitement of neon art into their homes in a way that is both beautiful and economical, as well as long-lasting and pleasurable!MATERIALS/GUARANTEEThe sign is made of long-lasting, ecologically friendly LED neon strip and is set on a clear acrylic back board. It includes a 5 meter clear power cable as well as a white or black power bank with plugs appropriate for each shipping country.The light should persist for at least ten years.WHAT'S INCLUDED IN ONE PACK?Customized Neon Sign based on Your Requirements12-Month International Manufacturer WarrantyPower Supply and AdaptorDimmer SwitchDrill Holes for installation",
    "reviews": [
      "Love the quality and overall look.",
      "Perfection. We absolutely love it!",
      "Very pleased with the purchase, Looks great!",
      "Love the sign - it’s a birthday present. Can’t wait to see it up in her room."
    ]
  },
  {
    "productId": "kduTTyP6Xh",
    "url": "https://www.etsy.com/listing/963154727/custom-handmade-belt-engraved-leather?click_key=0551edda0996fb15a0829fb880f640134145ee53%3A963154727&click_sum=31bacea7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-23&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Handmade Belt - Engraved Leather Belt - Grooms Men Gift - Genuine Leather - Gift for Boyfriend - Gifts for Men - Gifts for Him",
    "description": "Custom Handmade Belt - Engraved Leather Belt - Grooms Men Gift - Genuine Leather - Gift for Boyfriend - Gifts for Men - Gifts for Him🎁 High-Quality Custom made leather gift for Dad - Anniversary gift for Husband - Men's Belt for Boyfriend - Gift for groomsmen 🎁🎁 Best Personalized Leather Belt Gift for Dad, Husband, Valentine, Brother, Son, Partner, Men, Grandfather, Groomsmen, Boyfriend 🎁✨It is made with Genuine European Leather.✨ This belt is 1 1/4 inches wide.✨Please check my store for other designs!!!✨Feel free to contact me if you have any questions.✨I gladly accept bulk ordersHow to order:📏 Select your color and length option (IF YOU NEED A SHORTER SIZE, JUST LEAVE A NOTE IN YOUR ORDER. I WILL SHORTEN IT FOR YOU)📏 Select your engraving option, you can see the different locations in the listing photos.📏 Write your personalization into the \"PERSONALIZATION\" box📏 If you need a custom font you can send us a message❗❗❗ We do not make any changes to the context of your personalization. Please make sure you don't have any typos ❗❗❗",
    "reviews": [
      "exactly as the photos show ! i love it",
      "Good quality, husband likes it.",
      "The item quality is really nice and I would definitely purchase again! I got it for my boyfriend as a gift and he loves it",
      "Great gift for significant other!"
    ]
  },
  {
    "productId": "woCdMCdSVh",
    "url": "https://www.etsy.com/listing/922081956/bridesmaid-gifts-makeup-bag-for-her-maid?click_key=de45b72041b73bb0c4b7dbb47f1d7b181426a826%3A922081956&click_sum=fe8373c2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-24&pro=1&etp=1&sts=1",
    "title": "Bridesmaid Gifts Makeup Bag for Her | Maid of Honor Proposal | Bridal Party | Wedding Gifts for Her | Custom Cosmetic Bags | Birthday Gift",
    "description": "Sunglasses:https://etsy.me/38b3AEMSun hat:https://etsy.me/3Ao8x5CBeach bag:https://etsy.me/3s3rrfaAcrylic clutch:https://etsy.me/3yyyCOOPersonalized makeup bags are the cutest and most practical Bridesmaid Gifts. Include them in your bridesmaid proposal gift box, or gift them on the wedding day while getting ready to keep their personal belongings.Store your most valuable possessions - your beautiful makeup - in true style with our personalized makeup bags. Cute enough to store those necessities out in the open and portable enough to toss in your tote, this custom makeup bag will ensure you sparkle from morning to night.This cute little pouch is made with durable 100% cotton canvas that will stand the test of time - or any potential makeup spills or mishaps! And with seven diverse and versatile bag colors and ten font colors, there is a suitable option for any lady love of your life!PRODUCT DIMENSIONS:6\" x 9\"PERSONALIZABLE:Please make sure to provide all the necessary information, so we can get working on your bags asap.⭐Social Media⭐Stay informed on all of our latest products and sales by following us on social media.Facebook: https://www.facebook.com/HundredHeartsDesignsInstagram: https://www.instagram.com/hundredheartsdesigns/⭐About shipping⭐DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.⭐Note for international shipping⭐-Please leave full name and contact number.-The customer is responsible for all duties and taxes.Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.For product value over this limit, there will be import taxes, fees, and customs duties (hereafter, \"Import Fees\"), levied by the customs office of your shipping destination, it could be around 10-25% in total, depending on regulations of local authority.As all of our products are personalized, we will not issue a refund to return-to-sender goods due to unpaid custom duty fee.-----------------------------------------------------------makeup bag, gift for her, bridesmaids gifts, maid of honor gifts, cosmetics bags, personalized bag, monogram makeup bag, Personalized Gifts, Wedding Gifts,Bridesmaid proposal, Bridal Party Gifts, Custom maekup bag",
    "reviews": [
      "The items were exactly as described. PERFECT gift for my bridesmaids to be!",
      "Great product! Looks exactly like the pic",
      "Perfect quality and super cute"
    ]
  },
  {
    "productId": "QZVpgJZOhf",
    "url": "https://www.etsy.com/listing/1568187520/personalized-charcuterie-board-custom?click_key=d801b71780738e52a5b90e09a5a3b28ff87da18b%3A1568187520&click_sum=bab6a7ee&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-13&pro=1&frs=1&sts=1",
    "title": "Personalized Charcuterie Board, Custom Cheese Board with Engraving, Wedding Gifts, Anniversary Gifts, Couple Gifts, Housewarming Gift Idea",
    "description": "Personalized Charcuterie Board, Custom Cheese Board with Engraving, Wedding Gifts, Christmas Gifts, Couple Gifts, Corporate Gift, Housewarming Gift, Gift for him or her, Anniversary Gifts, New home Gifts, Engagement Gifts, Hostess Gift, Valentines gift, Home decor GiftThis is a premium quality wooden charcuterie board, is the perfect gift idea for housewarming, Christmas gift, Valentines day gift, BBQ gift for dads, move-in gifts and any occasion for your friends and family.  Made with real bamboo material, it has a large serving rim, and with its compact design, this wooden cheese board is a must-have for hosting a party for any occasion.This board can be personalized with laser engraving, which makes this custom cutting board a great personalized gift.The cutlery set, which includes 4 different types of tools for shredding, slicing and serving all kinds of cheese, sausage and fruit, is located in a drawer inside the product.  This bamboo cheese board offers both neatly organized tools and a compact appearance.Features:●\tBAMBOO MATERIAL – Natural and Durable●\tLIGHTWEIGHT - From picnics to parties, carry it everywhere●\tCOMPACT DESIGN – Slide out drawer contains a cutlery set with 4 different tool●\tEASY TO CLEAN – Just wipe it with a wet cloth●\tPERFECT GIFT – Unique Gift for a Wedding registry or housewarmingDimensions●\t13\" x 13\" x 2\"https://www.etsy.com/shop/UsWoodArts",
    "reviews": [
      "Beautifully made. A little smaller than I expected it to be.",
      "I bought this item for a Christmas gift.  My brother-in-law just loves it.  \nShipping was fast!",
      "This was a wedding gift for my niece and her new husband. Shipping was very fast and it got here in time for Christmas morning. Thank you!!",
      "Item was shipped just a few hours after ordering -- just a week away from Christmas! I imagine this was a hectic time with orders, but the item arrived with time spare. Board was not flimsy and it was a great gift. Recipient loved it."
    ]
  },
  {
    "productId": "uxIEyvStHl",
    "url": "https://www.etsy.com/listing/879661411/personalized-family-name-metal-sign-last?click_key=34c7a12aac489532898b7f0547a413189fe05f97%3A879661411&click_sum=409dacc2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-14&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, Anniversary",
    "description": "01.07.24 Update! Thanks to our amazing clients we had an increase for December of over 50% vs last year! It caused a few delays in shipping with us and UPS but as of 01.10.24 we'll be back to our 24hr shipping as usual!!Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, AnniversaryUSMC Veteran owned/ran shop, cutting and hand finishing steel made right here in the USA from a 200 year old family owned steel mill!Our full line of monograms:https://www.etsy.com/shop/Crosswoodworks?ref=seller-platform-mcnav§ion_id=26441026Monograms are NOT created the same, please, please look at the lines in the design for character, smooth flowing lines, depth of wider areas back to thinner areas. I customize EACH and every one, even tho they look like the others, they are not. When you look at the details, you will see the difference, even in the computer generated version which I'm using first to get these listed for my clients as fast as possible! Multiple fonts coming in block, script, serifs, modern. Hundreds of new designs over all in 2023 for monograms, address plaques, name plaques, ornaments, bottle openers, verses, phrases, all in multiple fonts for each phrase in multiple finishes, all cut and shipped via UPS (the most dependable, fastest, damage free carrier we have ever used) within 24 hours or the following business day when ordered by noon!!NO MORE WAITING FOR WEEKS!! CUTS AND SHIPS SAME OR NEXT DAY WHEN ORDERED BEFORE NOON!! WE ARE CHANGING 95% OF THE FOCUS OF PRODUCTION AT THE SHOP TO STRAIGHT FORWARD METAL PIECES WITH THREE MAJOR DETAILS:1. Extremely fast cut and ship that no one else offers2. 10\" - 96\" sizes that no one else offers3. Focus on excellent quality that our clients have come to expect in every hand finished piece that we touch. We do ourabsolute best to earn your respect, and your business.For Monograms, please ensure that you fill in all of the appropriate info for each style design.Finish note: All finishes except for Rust are sealed with a 20 year uv/weatherproof industrial powder coat for interior/exterior/seaside/desert/ use in any environment you can imagine. Rust is true rust, not sealed.Dark steel patina and rust vary in color on every piece.We cut EVERY single piece out of 14 gauge cold roll carbon steel, from family owned steel mills right here in the U.S.A",
    "reviews": [
      "Beautiful! 8 year anniversary gift for my wife. She’ll love it!",
      "Absolutely gorgeous!  I can not wait to give it to my wife for our anniversary!",
      "Gift for my aunt's anniversary. Absolutely stunning! Heavy and beautiful craftsmanship. Would definitely purchase from again!"
    ]
  },
  {
    "productId": "DKSEvrAUky",
    "url": "https://www.etsy.com/listing/1577051388/personalized-handmade-belt-for-dad?click_key=ca831a3f8557fd5ba97fac9d74990eb40c2dcae3%3A1577051388&click_sum=68b67305&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Handmade Belt for Dad, Valentines Gift for Him, Gift for Dad, Custom Leather Belt for Men, Personalized Men's Belt",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Personalized Handmade Belt for Dad, Christmas Gift for Dad, Gift for Husband, Custom Leather Belt for Men, Personalized Men's BeltThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift Ideas",
    "reviews": [
      "Great belt with a lovely personalization.",
      "It was a great gift.",
      "Love this! It’s just as listed and comes quickly!"
    ]
  },
  {
    "productId": "MSFmJVQnje",
    "url": "https://www.etsy.com/listing/468413460/custom-friend-gift-box-personalized?click_key=0f31db72e126616e7a1321b5d85fe1b4f642501f%3A468413460&click_sum=5e0343ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645255-9-16&pro=1&etp=1&sts=1",
    "title": "Custom Friend Gift Box, Personalized Friend Gifts, Personal Message, Custom Personalize, Custom Gift, Personalized Gift, Gift Box For Friend",
    "description": "FREE SHIPPING ! Custom Friend Gift Box, Personalized Friend Gifts, Personal Message, Custom Personalize, Custom Gift, Personalized Gift, Gift Box For Friend - By LizushWhether it's the enjoyment of a long bath at the end of the day, relaxing with a good book or just treating your friends and loved ones, our Lavender SPA  gift baskets the perfect choice. Our All Natural Handmade Products make this a unique gift as a Bridesmaids gift, Mother’s Day gift, Birthday gift,  Valentine's day gift or just because you deserve it…All Natural Bath Set includes:❀ Natural Soap Bar❀ Bath bomb❀Body Scrub or Body shea❀ Body Oil❀ Shower steamer❀ Natural Lip Balm❀ Face towel❀ Scented Candle❀ Sponge❀ Gorgeous New elegant box - MAKE IT PERSONAL - Add the recipient's name on the box with rose gold letters❀ Your personal note printed on a beautiful greeting card (please add your text for the greeting card during the checkout)100% NaturalArtificial fragrance-free & artificial color-freeAlcohol-freePreservative - freeNever tested on animalsDoes not contain any GMO ingredientsAt Lizush we believe that you deserve the best. After working hard all week and taking care of your family and loved ones, it’s now time that someone else will take care of you. We, therefore, created all-natural care products with you in mind.High-quality all-natural ingredients:+ We use only natural colorants made from spices and herbs+ We use only high-quality essential oils for scentOur goal at Lizush is to make you feel good and look your best!Keywords:Bath Set. bridesmaid gift set. Spa gift. Holiday gift. BFF Spa Gift sets.  Spa basket. SPA Gift set. Birthday bath and body gift. Skincare. Bridesmaids Spa Gift. home and living, Gifts for Mom, Mom Gifts, Personalized gifts for mom, Christmas gifts for mom, Birthday gifts for mom, Gifts for her, Christmas gifts, Spa gift  - Lizush",
    "reviews": [
      "I bought it as a gift for my sister. She loved it.",
      "Glad to hear that your gift was well received. Thank you",
      "I got for Christmas last minute. It arrived on time, looked beautiful and had everything advertised. Loved it. Thank you",
      "My Mom absolutely loved it. Thank you!",
      "Great! Thank you for your review",
      "Incredibly beautiful basket full of goodies!!!"
    ]
  },
  {
    "productId": "XMTnejrvF1",
    "url": "https://www.etsy.com/listing/927049606/personalized-cosmetic-bag-with-name?click_key=4026980cfe4a6ac209be355876ce3a47484a0fa1%3A927049606&click_sum=edef2901&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-25&etp=1&sts=1",
    "title": "Personalized cosmetic bag with name | Beauty Bag | Make Up bag | Mothers Day gift | birthday gift for Mum | Personalized gift for Her",
    "description": "Vegan leather cosmetic bags with your name in two sizes. This is how you organize your chaos.❤︎ Product Information & FeaturesThe toiletry bag made of vegan leather with a saffiano look is available in two sizes or as a set.small: 18 x 11 x 4.5 cmlarge: 25 x 16 x 10.3 cmThe wash bags are available in the following colors:With golden zipper:- new in white- new in taupe- ivory- light grey- pink- lilac- turquoise (incl. inside pocket with zip)- emerald green *Limited Edition, (incl. inner pocket with zip)- berry *Limited Edition, (incl. inside pocket with zip)- blackWith anthracite colored zipper:- black❤︎ PersonalizationThe ornament (capital initial) is applied in ROSE, the name in GOLD, unless otherwise stated in the personalization!The following colors are available for the lettering:- gold- silver- black- white- pink- and much more. Please feel free to ask.The first letter of the name is automatically the monogram in the background. The name is printed with the first capital letter followed by lower case letters.Do you have a special personalization request? Please send us a message before ordering.Due to the individual personalization, the bags are non-returnable.If you are unsure about the font, please ask for a preview in advance when ordering. The visualization is subject to our design sensitivity and is therefore no reason for a complaint.EXPRESS:Would you like to receive your order faster? Please note our express processinghttps://www.etsy.com/en/listing/1169392478/express-editing------------------Important instructions:This article is made to your liking and is therefore non-returnable. Therefore, please check your details before ordering or send us a message before placing an order if you are unsure about the design. If you do not request a preview for approval, the visualization is the responsibility of our design team and does not constitute a reason for complaint if your idea deviates.The decoration shown on the product image is not part of the scope of delivery.You can find more great personalized gifts here:https://www.etsy.com/de/shop/JelliesDesign",
    "reviews": [
      "Everything was great, whether the goods or the shipping",
      "Everything great. Beautifully made bags.",
      "Turned out very nicely! The recipient was very happy.",
      "I gave the cosmetic bag as a gift, it arrived on time, I was extremely happy"
    ]
  },
  {
    "productId": "NRGYXnGtF5",
    "url": "https://www.etsy.com/listing/1106544582/personalized-leather-coaster-set?click_key=28269e1b239bd1a78caa27f61b6a6235ddc6036e%3A1106544582&click_sum=cedce419&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-26&pro=1&etp=1&sts=1",
    "title": "Personalized Leather Coaster Set , Customized Round Whiskey Coasters, 3rd Anniversary Coffee Mug Gift For Husband Wife Mother's Day",
    "description": "It's just a sweet personalized gift for every occasion such as birthday, graduation , bachelorette , wedding , 3rd anniversary, housewarming,Mother's Day GiftThese leather coasters are made by fusing two different leathers together.Elaborate stitching gives it a high quality look and they'll basically be a heirloom piece.We're taking our time making leather coasters one by one, please do not confuse these with the mediocre leather coasters that are made in 10 seconds just by die-cutting a piece of leather.FEATURESAll leather coasters are handmade from 100% cowhide leather and suede in our pet-free, smoke-free studio in Brooklyn, NY.We supply our leather from local vendors.Diameter: 4 1/8 inches / 10 cmBacking material of these leather whiskey coasters is 100% cowhide suede in golden brown for brown, honey and light gray coasters.Backing is suede in teal for emerald green coasters.Holders for these coasters available via link below;https://www.etsy.com/listing/1535646447/leather-coaster-holder-holder-for-round?click_key=d3a7ea5f2fafdb1bf21914a84346b9b74d3d19f7%3A1535646447&click_sum=91ec4e2a&ref=shop_home_active_1&pro=1&sts=1PERSONALIZATION is available. Please enter your initials up to 3 letters.When you enter- one letteryou will receive One Large  Uppercase Letter Centered in the middle- 2-3 letters you will receive Small  Uppercase Letters Centered near the stitching( Custom logo stamping is also available for large batches, please message me to learn more)*Personalized items can't be returned or exchanged!NOTEThis listing is only for a set of leather coasters. Props are not includedYou can find our detailed return policy in FAQI gladly accept returns, exchanges, and cancellationsReturns are accepted  for full refund minus outgoing shipping  costs.Questions about your order?Please contact me immediately if you have any problems with your order. I will be more than happy to help.FOLLOW our story & production process and be in the know about all collaborations , new items , impromptu sales :  www.instagram.com/zeyn.nyBACK TO OUR SHOPwww.etsy.com/shop/zeynnyABOUT US : We are a  husband and wife team, immigrated from Istanbul  to New York in 2014. Both of us held corporate jobs for over five years before deciding to pursue a creative career. We first manufactured leather goods for other designers but in 2020 pivoted to selling our own designs on Etsy. Today, we create unique leather and waxed canvas goods for our Etsy shop Zeyn NY, while also operating a retail shop in Red Hook/ Brooklyn.Thank you for visitingZeynep & Erdem",
    "reviews": [
      "Elegant and beautiful. Thank you!",
      "This was a gift. It was on time.",
      "Item is just as described and amazing!! High quality!!"
    ]
  },
  {
    "productId": "4nhYh4uiTK",
    "url": "https://www.etsy.com/listing/1396040089/adventure-book-scrapbook-couples-gift?click_key=a33dfe5ede50f1d7dcd5da6a889a911b506c3654%3A1396040089&click_sum=219b2941&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-27&pro=1&frs=1&etp=1&sts=1",
    "title": "Adventure Book Scrapbook Couples Gift for Boyfriend, Anniversary Gifts Couples, Personalized Gift, Valentines Day Gift for Him",
    "description": "Our Adventure Book is the perfect keepsake gift for a boyfriend, an anniversary gift for couples, gift for him, valentines day gift for him, personalized gift, christmas gifts, personalized gifts! Designs are laser engraved with YOUR unique details, every book is one-of-a-kind!I N C L U D E S• Vegan Leather Fabric Binding Book (6\"x9\"  OR  8.5\"x11\")• Cherry or Maple wood covers• Your choice of 30, 45, or 60 sheets of acid-free paper- 28lb Standard Paper option includes BLANK white sheets- 65lb Cardstock Paper option includes BLANK black, cream, or white sheets (recommended for use with photos)*Wood color and grain will vary naturally from the example photo. Wooden covers are coated with a lacquer finish to prevent scratches and to provide a water-resistant coating.H O W  ∙  T O  ∙  O R D E RFrom the drop-down menu:• Select a book size and type of wood• Choose sheet quantity, & paper typeIn the \"Add your personalization\" box:1) Screw Color: Gold, Black, Silver, or Copper.2) Binding Color: See listing photos for all options.3) TEXT to be engraved:*Any other details, such as special design requests and timing deadlines4. Request proof of cover:Check out our shop page for more designs!www.RedBerryGuestBooks.etsy.comT U R N  ∙  A R O U N D  ∙  T I M EIn order to provide a quick turnaround on orders, we do not send proofs of the design unless requested in the notes at checkout.Once the order is received, your book will be sent to production and ready to ship out within about 2 business days. From there, transit time will depend on the shipping method that you select at checkout.………………………………….………………….………………………………Please message us with any questions or for custom requests.We look forward to working with you!© RedBerryGuestBooks*PLEASE NOTE: Wood is a natural product. Knots, dark spots, and grain of the wood will vary naturally. While we do our best to select the best wood pieces for your books, we can not guarantee that the book will be free of these natural occurring variations.",
    "reviews": [
      "Quick service! Great quality as described!",
      "Wonderful quality. I love how it came out.",
      "Looks great! Would definitely recommend"
    ]
  },
  {
    "productId": "QSABpouZwS",
    "url": "https://www.etsy.com/listing/823311406/diy-solar-printing-kit-craft-kit?click_key=bce4351710846196ac36ffa905756f80cb13c196%3A823311406&click_sum=5566bdbd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-28&frs=1&etp=1",
    "title": "DIY solar printing kit , craft kit , cyanotype , kit , solar printing kit , Craft ,  DIY kit , gifts to make",
    "description": "Eco friendly Solar Printing DIY art kitUsing items from nature make realistic prints on paper. Add little bits from your favourite gardens,  bush walks and bouquets to create your own meaningful prints with these magic sheets of light sensitive paper, develop in the sunshine and fix in water.Instant gratification Art !Great for gifts 🍀 nature lovers , eco consious , outdoors , makers , homeschool,  artists , photo nerds and gardeners . suitable for most ages and creative levels.gift wrapping and personalized note available.Size of sheets4 x 6 inches10 x 15 cm.postcard size*STENCILS : add a stencil for some detail to your artworkshttps://www.etsy.com/au/ElementalLeaf/listing/1079028676/cyanotype-stencil-kit-What we bring to the party:~Hand treated magic blue printing paper(You choose the amount of light sensitive-cyanotype paper sheets 5 ,8, 10 ,15 , or 20) Size of sheets:4x6 inches / 10x15 cm. (postcard size)~Easy to follow printed Instructions with a brief history and YouTube video tutorial links included~Natural plant cellophane bag that can be used as a portable light box window in the process~recycled brown paper packagingAll eco friendly, compostable elements and ethicist made from my art studio.What you need to add:                                                       ~UV rays!! The Sun is an excellent natural source, but if you live some where, where the sun is not always about, you can use a UV LEDs as an alternative.~Water for stopping the alchemical process and fixing your blueprints.Cut out stencils and add your nature elements or use whole, tear light sensitive paper into smaller pieces if you wish to make small note cards, book marks and scrapbook embellishments.Experiment exposing at different lengths of times to gain various depths of blue. Try different plants or write on glass to make art prints. Prints, once created are archival and can last over 100 years.Elemental leaf solar printing kits just got even better !! We now have fantastic plant press for you add to your steps , keep your pretty blooms flat and on hand for future arts crafts and photo shoots🙌https://etsy.me/3BixPUNvideo tutorials: https://www.youtube.com/user/berlinrosesFollow me on Instagram for more botanical inspiration https://instagram.com/elemental_leaf?igshid=dl2lai9qset4",
    "reviews": [
      "A really fun project to do!",
      "Given to my best friends 2 year old as her birthday present! Something super fun for them to do out in the sun 💖💖",
      "Wife and daughter will be having a blast with it.",
      "took months to ship but the product itself is exactly what i hoped for!"
    ]
  },
  {
    "productId": "VUqqvfBAMZ",
    "url": "https://www.etsy.com/listing/1229142158/personalized-word-bracelet-kids-name?click_key=32fe839fbd75b67c64827c38a9955fe648fea0c6%3A1229142158&click_sum=ee4f8ea1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-29&etp=1&sts=1",
    "title": "Personalized Word Bracelet, Kids Name Bracelet, Stacking Mama Bracelet, Custom Name Beaded Bracelet, Personalized Gift, Stretch Bracelet",
    "description": "🔹 Design the personalized word bracelet that you have always wanted! These stacking mama bracelets can be personalized so you can get exactly what you want.🔹They are made with 4mm howlite, grey agate, amethyst, rose quartz or aquamarine gemstones beads, 18k gold plated beads, 18k gold filled beads, sterling silver beads or rose gold beads and then strung together with a strong double-strung elastic cord.🔹Please add each bracelet style separately to your cart. They will be sent to you as a stack. If you want all six bracelets, please choose the option for all six bracelets, otherwise you will receive the single styles that you purchased.🔹Each custom beaded bracelet stack is packed in a gift box wrapped in organza ribbon and a handwritten message can also be included. It makes the perfect gift for yourself or for Christmas, a baby shower, new mom, Mother's Day, bridal shower, birthday and Valentine's Day.🔹Length: bracelets are made to a standard 7 inches, please let me know if you would like the lengths adjusted. Bead color may vary slightly.🔹Care tips- Treat and store bracelets gently- Please roll bracelets on and off gently. Repeated stretching can weaken the elastic and shorten the life of your bracelets.- Avoid excessive water and sweating while wearing bracelet.- If you would like to ensure that your letter beads maintain their color I suggest putting a light coat of clear nail polish on each side of the letter!🔹See More Stacking Bracelets here:https://www.etsy.com/shop/SimplyStatedNY?section_id=35301838🔹Go back to my store:https://www.etsy.com/shop/SimplyStatedNY🔹Sign up for my newsletter here and get 15% off your order!!!  https://bit.ly/37G7UrN🔹Please do not hesitate to ask any questions!",
    "reviews": [
      "Fast and exactly what I needed!",
      "Love my bracelets! They turned out amazing!",
      "The bracelets are beautiful and great quality",
      "Love the product. Good turn around time."
    ]
  },
  {
    "productId": "WXlYTqdMQP",
    "url": "https://www.etsy.com/listing/553133545/personalized-wedding-gift-jewelry-dish?click_key=35ded9330b8c82b143bf51f9c27a08aff2bf432e%3A553133545&click_sum=0b252f24&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-30&etp=1&sts=1",
    "title": "Personalized Wedding Gift /  Jewelry Dish / Date and Initials / Wedding Gift / Personalized Gift / Personalized / Engagement Gift /",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "My sister in law loved the ring dish! She actually had the same one picked out in her Etsy cart.",
      "This made a great gift and they were very accommodating when I ordered the wrong personalization",
      "Great gift. The paint looks a little different than the photo, but overall good. Thanks!"
    ]
  },
  {
    "productId": "qsZtBvWKPQ",
    "url": "https://www.etsy.com/listing/1173724712/personalized-wooden-headphone-stand?click_key=849241447974a7ef752965a1b07b82943ed41871%3A1173724712&click_sum=273816be&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-31&pro=1&frs=1&etp=1",
    "title": "Personalized Wooden Headphone Stand, Audiophile Gift For Him, Office Desk Accessories, Music Lover Gift, Gifts For Men, Home Office",
    "description": "***Displayed picture's wood finis: Wenge, Plexiglass color: Red- Handcrafted headphone and phone stand together. Made of high quality birch plywood and fancy plexiglass on top.- Easy to assemble and it can be personalized with name or game tag. Free of charge.- Compatible with almost all controllers and headsets- Fit most headphones. Perfectly shaped as to not stretch the headband.* Headphones and controllers NOT included.Headphone stand, Personalized Headphone holder, Gamer gift, DJ gift, Game gift, Headphone hanger, Custom headphone, Christmas gift",
    "reviews": [
      "Such a high quality item",
      "Love it! Shipping was so fast!",
      "Thanks so much, it's a perfect gift!"
    ]
  },
  {
    "productId": "hQMTlKIiDw",
    "url": "https://www.etsy.com/listing/1337971525/golf-bag-tag-personalized-golf-gifts-for?click_key=a480a68a96712d7e3a8db1a4a5c9c8e74420150d%3A1337971525&click_sum=fa60a79a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-32&etp=1&sts=1",
    "title": "Golf Bag Tag - Personalized Golf Gifts for Men or woman - Custom Golf Accessories",
    "description": "GOLF TEE HOLDER WITH TEES PERSONALIZED2.75\" Golf Tees and disc/Strap. laser engraved.6 options to choose from.Design 3 and 6, please put N/A in personalization area.DID YOU WANT TO ADD A DELUXE GOLF DIVOT OR BALL MARKER TO YOUR GIFT?https://www.etsy.com/listing/1325938971/golf-gift-golf-divot-and-ball-marker-set?click_key=0ae8ca5bc27f3629c62e0cc4672d7c6641deb7c0%3A1325938971&click_sum=ab4da466&ref=shop_home_active_1&sts=1OR A SCORECARD HOLDERhttps://www.etsy.com/listing/1439428390/golf-scorecard-yardage-book-holder?click_key=97b1d6e38d5abb3eb0fb4a44aa241dc04b52f2ba%3A1439428390&click_sum=10b1f281&ref=shop_home_active_1",
    "reviews": [
      "Great gift idea for golf lovers!",
      "My cousin loved this. He's a big golfer and was excited to put his tag on his bag. Great Christmas gift!",
      "Such a great gift for golf lovers!",
      "Such a good gift for golf lovers!"
    ]
  },
  {
    "productId": "nqRlVgqASo",
    "url": "https://www.etsy.com/listing/839461313/personalized-wedding-gift-ring-dish?click_key=c9beea81ff226b9a7b2e8378b6c2d7e1cb30f807%3A839461313&click_sum=ef19802b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-33&etp=1&sts=1",
    "title": "Personalized Wedding Gift / Ring Dish/ Wedding Ring Dish / Gift for the Bride / Jewelry Dish /Engagement Gift/ Bridal Shower Gift",
    "description": "Clay Ring Dish, approximate size 3.25\".  Color shown is White Clay trimmed in Gold w/ Gold stamped letters. This is also available trimmed in Silver w/Silver stamped letters.This is a clay item, NOT CERAMIC. Lightweight and slightly pliable.Each dish is molded, stamped, painted and sealed by hand.This makes a great gift for the newly engaged couple or the Bride and Groom.These are handmade items so no 2 items will be exactly the same.  There may be slight imperfections. Please be aware that due to computer settings the color of the dish may vary slightly in person than what you view on your phone or computer.If you like this trinket dish but would like something changed, please send me a message.I will be happy to work with you to create a custom piece. Please be aware that some changes may increase the cost of the dish.To clean your dish just wipe it down. Do not submerge it in water.I do not accept returns or exchanges but........If you are not satisfied with your purchase please message me.  I want you to be happy with your item!***Please note if you want a customization with a lot of words please message me before ordering.  The size of the words will determine if it will fit or not.•",
    "reviews": [
      "Incredible! Inscription is exactly right!",
      "A little smaller than I expected but it’s beautiful and perfect!",
      "This was a gift and seemed to ship fast!",
      "This arrived later than expected but it is absolutely beautiful so worth the wait."
    ]
  },
  {
    "productId": "vuZlWRrRfq",
    "url": "https://www.etsy.com/listing/993944520/valentines-day-gift-personalised-mens?click_key=eb330e96d229d92ac4543026f89832754342196d%3A993944520&click_sum=5b273e1d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-34&pro=1&frs=1&etp=1&sts=1",
    "title": "Valentine's Day Gift, Personalised Men's Wallet, Genuine Soft Leather Wallet, Personalized Engraved Gift for Him, Boyfriend, Dad, Husband",
    "description": "The Perfect Gift for any occasion, make this high quality leather wallet extra special with a personalised message or name on the front and a short message which will be engraved in the inside.Bifold Black & Brown Leather WalletRFID Blocking Technology10 Card Sections2 ID Window2 Compartments For Bank NotesVertical Zip Pocket1 Tab Closure Coins Pocket3 Multi-Purpose Pockets (can hold 5 cards on each side)This wallet can hold between 16 - 20 cardsId Window Size: L71mm x H42mmSize Closed: L12CM X W2CM X H10CMSize Fully Opened: L35CM X W0.3 X H10 CMPackaged in a high-grade gift box, an amazing gift and best choice for family & friends. Perfect gift for Birthdays, Weddings, Christmas, Anniversaries, Father’s Day or even a treat for yourself. You can add a special personalised gift to your loved one.Disclaimer:-We are pleased to provide a 30-day return and exchange policy. However, it is important to note that once a product has been personalized, we are unable to accept returns or exchanges as this customization process is irreversible.Any questions please contact me, thank you.",
    "reviews": [
      "perfect, thanks so much!! X",
      "Item shipped in time. Beautifully presented and really happy with the quality and product itself. The personalised engraving looked amazing - would highly recommend this seller",
      "Husband really impressed with his wallet."
    ]
  },
  {
    "productId": "JFMZJeFqdy",
    "url": "https://www.etsy.com/listing/833113054/kids-gift-stickers-square-stickers?click_key=35fe3dfe96c567072e3371631059fd5b6bf95ea0%3A833113054&click_sum=22f12806&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-35&etp=1",
    "title": "Kid's Gift Stickers, Square Stickers, Personalized Stickers, Vinyl Stickers, Name Stickers, Birthday, Label Stickers, Teacher, Gift Sticker",
    "description": "Gift giving is made extra special when adding a personalized touch! Our personalized square stickers are designed for a quick and easy added flair to wrapped gifts, gift bags, envelopes, treat bags and more!Product Highlights:-2.5x2.5” in size-White vinyl sticker stock-Packaged in a cello bagPersonalization:-Please include name(s) in the personalization box as you would like them printed.-Select colorway Multicolored, Pinks or Blues*Proofs are not sent unless requested. If requested, please allow extra time for communication and proof approval.Order Processing & Ship Time:-Orders are processed within 3 business days.-Orders arrive within 7-10 business days from order date (often sooner)*Please let us know if you need your order by a specific date, especially during the holiday months, as we do have a rush option for up to 5 products.-RUSH SHIPPING 1-2 ITEMS:https://www.etsy.com/joycreativeshop/listing/966241715/rush-order-processing-for-1-2-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1634351583876-RUSH SHIPPING 3-5 ITEMS:https://www.etsy.com/joycreativeshop/listing/952284782/rush-order-processing-for-3-5-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=163435160006______________________________________________Head to the shop here:https://www.etsy.com/in-en/shop/JOYcreativeshopSay hi ::  hello [!at] joycreativeshop.comConnect with us on Instagram, Facebook + Pinterest :: @joycreativeshopConnect with us online :: joycreativeshop.comThank you so much for your support of Joy Creative Shop! We’re so grateful for you!",
    "reviews": [
      "These are perfect for friends birthday gifts for your kiddos if they don’t want to make a homemade card. Looks professional and is fun",
      "Thanks so much, Becky!",
      "So cute and perfect size",
      "Thank you so much!",
      "Fabulous quality stickers that are clean and classic."
    ]
  },
  {
    "productId": "PEIgSmvmvb",
    "url": "https://www.etsy.com/listing/1214206893/embroidered-wedding-handkerchief-for?click_key=cd21db57f5641599994faf2788ae6840b6278442%3A1214206893&click_sum=c01ae058&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-36&etp=1&sts=1",
    "title": "Embroidered Wedding Handkerchief For Father, Wedding Handkerchief for dad, wedding gift to dad, personalized wedding handkerchief",
    "description": "100% CottonColor: WhiteDimensions: 16W x 16L inchesMaterial: CottonPlease Message us the following information:🔹️Dad, Daddy, Father or Name🔹️From who? Daughter's name🔹️Date🔹️Proof (preview) Yes/No*** if preview is requested, it adds up an extra 3 business days for the processing timePLEASE BE AWARE -- All the personal information such as date and name will be put the way it was spelled in the message. Please check capitalization, date format, spelling!!!!GIFT BOXES AVALIABLE FOR PURCHASEPlease follow the linkhttps://www.etsy.com/listing/863050562/gift-boxes-for-personalized-handkerchiefIN A HURRY?1. Use a Priority Mail or Priority Mail Express at the check out2. If you purchase a \"Rush Order\", your ordrr will be ready to ship the following business day. Click here to add a \"Rush Order\" to your carthttps://www.etsy.com/listing/872022997/rush-fee-on-orders-with-dkk-craftsWe are welcome to make a custom handkerchief! -----> JUST Personal Message us for a quote :)",
    "reviews": [
      "Very good quality and very nice stitching! My dad is definitely not keeping it together wedding day!",
      "I got this for my dad and gave it to him during our first look. We are emotional so it was perfect and it looked stunning! I think it came out even better in person!",
      "Turned out exactly like I wanted. Prompt delivery"
    ]
  },
  {
    "productId": "lpjtkvIqjV",
    "url": "https://www.etsy.com/listing/1483652561/personalized-baby-name-blanket?click_key=6b5530187578b45641d063a05bd91a1a8ff9a354%3A1483652561&click_sum=670115fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-37&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Baby Name Blanket, Personalized Baby Gift, Custom Coming Home, Gender Neutral Hospital Blanket, Baby Shower Gift, JS14",
    "description": "Baby Swaddle BlanketsThis listing is for purchasing a blanket and/or headpiece together or separate. These make a perfect keepsake and baby shower gift for a mom to be.They are perfect for Hospital Gifts, Birth Announcements, Monthly Milestone Photos, Birthday Gifts, Christmas and just snuggling those precious babies.-DETAILS-Headpiece prints will be made with the same pattern as shown on blanket unless requested otherwise.Design: Printed On One Side. Designs are printed using high quality inks that will not fade or peel. The fabric stays silky smooth against skin. This is NOT embroidery or vinylCare: Machine Wash; Tumble DrySwaddle Size / Material: 42x42 JerseyPlease Note: All sizes have a variance +/- 1\"-2\" due to heat causing shrinking when pressed.-HOW TO ORDER-1. Choose product type from the drop down menu above (see photos for references)2. Add your personalization requests to the personalization box.3. Click \"Add to Cart\"4. Enter your payment information, shipping address, *DOUBLE CHECK EVERYTHING* and click \"Order\"5. Sit back and wait for your special package in the mail!-RUSH ORDERS-If you are in a rush, I do offer an express production option.Please add this listing to your order-https://www.etsy.com/listing/498793304-DISCLAIMERS-Periodically tiny microfiber dots may occur – this is a natural occurrence in the fabric (mostly seen in fleece). They typically appear black, blue, orange or yellow in color. Once the fabric is washed, they usually are less visible. This is common in sublimation - caused by natural fiber particles!We cannot promise colors to match between products. Since they're made from different materials, and different manufacturer's, there will always be a difference.Please note these headpieces are preconstructed. Solid background and full-bleed pattern designs may have creasing on the sides.-CUSTOM ORDERS-I LOVE creating new designs but for a design that I do not currently offer please contact me before ordering to see if can create your request.-RELATED LISTINGS-Interested in more personalized baby gifts? Look through the following listings to complete your order!https://www.etsy.com/shop/DashingFoxCo-FAQS-Are these personalized?Yes, the babies name will be changed to the one that is left in a note for me during checkout. If you would not like a name to be added you can leave the note blank or simply leave \"No Name.\"Do you do custom designs?Absolutely! I love to make custom designs. Please contact me before ordering to make sure that I am able to produce the design you would like.Can the blanket be made in a different color?Sometimes, The text and parts of some designs can be made with a different color. Watercolor floral is not able to be changed however I can try to create something with floral in the color you are looking for. Please contact me before purchasing to make sure I can make the adjustments you would like.Can my order be rushed?Yes, if you need your order rushed, I do offer an express production option to have your order shipped quicker. Just apply it to your order:https://www.etsy.com/listing/498793304Can the fonts be changed?Absolutely!! Just include a note for me during checkout.What is Jersey?It is a 100% lightweight polyester material that stretches. Perfect for swaddling.Will I receive a proof?We do not supply a proof of your personalized design as standard to ensure we do not delay your order, however if you would like to see the design before we create it please request this along with your personalization when you place your order. If requested we will not proceed with your order until you are 100% happy with the design. Please ensure you factor in extra time for this, as edits may delay your order.-ADDITIONAL NOTES-▹ Please keep in mind when ordering that color settings on monitors and lighting in product photography vary so the product might differ a tad from what you see on screen.▹ I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.▹ If you have any questions, please use the “Message Seller” button next to the price and I’ll get right back to you.Remember to select the ♥ FAVORITE button to save this product for later!Thank you so much for shopping at DashingFoxCo!https://www.etsy.com/shop/DashingFoxCo© 2019 DashingFoxCoLLC",
    "reviews": [
      "Item was slightly different color than expected.",
      "Great quality. The blanket is exactly how described.  Definitely will buy from this shop again.",
      "Outstanding customer service, my requests were fulfilled, the fabric is nice and soft, and shipping came quickly after I placed my order! Only good things to say!",
      "Can't wait for our grandson to get to wrap him in this swaddle!!"
    ]
  },
  {
    "productId": "CsNXwwHapR",
    "url": "https://www.etsy.com/listing/862957907/best-friend-gifts-personalized-best?click_key=0b5d5f041dfaaa6d1ae8e9e879ba04943c362517%3A862957907&click_sum=833be98f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-38&pro=1&frs=1&etp=1&sts=1",
    "title": "Best Friend Gifts Personalized, Best Friend Birthday Gifts For Her, Friendship Gift, Gift For Best Friend, Mother’s Day Gift, Gift for Mom",
    "description": "✨🤍✨NEW MONTH NEW SALE✨🤍✨RISK-FREE ∙ PURCHASEIf you realize after our first conversation regarding your personalization wishes that it’s not the right product for you, then I’ll give you full refund (This term doesn’t apply once I’ve started creating the artwork for you.).CREATED ∙ WITH ∙ LOVE ∙ TO ∙ THE ∙ DETAILAre you looking for a handmade, thoughtful gift for your special someone? Or would you like to preserve precious memories captured in an old picture which maybe doesn't have the best quality? Then you are at the right place! I'd love to create a beautiful artwork for you according to your wishes.H O W ∙ TO ∙ ORDER• Please select in the drop-down list the number of people/pets to be illustrated (e.g. 2 people + 1 dog = select \"3\"). After the purchase lean back and relax. I'll contact you within a few hours via Etsy Messages. So please check your Etsy inbox regularly. Of course you can also message me first.• I'll ask you for a reference picture, desired background color, desired saying/text, any other wishes.DRAFTSI’ll provide you with drafts of the artwork until it corresponds fully to your expectations.FINAL ∙ PRODUCTDIGITAL FILENo physical items will be shipped.The aspect ratio of the illustration will be suitable for 8x10 inch paper. If you’d like it in any another size up to 24 inches, simply let me know.You can easily print it at home, any copy shop or use an online printing shop like Zazzle or Walgreens. I recommend using heavyweight paper (65 lb / 180 gsm or more) - matte, semigloss or glossy.Please contact me if you have any further questions.Let’s put on your loved ones’ faces a lovely smile and a twinkle in their eyes! I wish you lots of joy and happiness with your very special & timeless keepsake.MY ∙ SHOPhttps://www.etsy.com/shop/AnsAtelierI N S I D E ∙ S C O O P• IG: @Ans.Atelier• Pinterest: AnsAtelier | Custom Portraits & IllustrationsThank you so much for visiting and happy shopping! ♡",
    "reviews": [
      "It the perfect gift for my best friend!",
      "I love it because of the artistic perfection!",
      "She did a good job."
    ]
  },
  {
    "productId": "PWTHWfmzxz",
    "url": "https://www.etsy.com/listing/950751047/nature-lovers-giftpersonalized-olive?click_key=735a1d05e1408d7e4b699644a820cfee1ac17bec%3A950751047&click_sum=98a29217&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-39&pro=1&etp=1",
    "title": "nature lovers gift,personalized olive wood cutting board, cheese board, wood chopping board,camper, walkers gift",
    "description": "There's nothing like a good snack. It becomes especially good when it is served on a shapely and sustainable cutting board made of olive wood. Then it tastes all the better.A detailed deer engraving refines this rustic olive board, which is timeless and will certainly bring great joy to the recipient.Give away the serving bed as a birthday present to the hiker and nature lover, cutting boards made of olive wood are trendy and a fancy and personal gift. If you are looking for a wedding present for the bride and groom with the name, then we have the ultimate gift for you Housewarming gift, this serving board, carving board is very personal. It is a great gift for cooking lovers or wine lovers. The individual wooden board is a special Christmas present. It can be used as a cheese board, ham board, herb board, meat cutting board, pizza board, steak board, bread cutting board or other dishes and delicacies to cut or to serve. The olive wood board is also ideal as a decoration and eye-catcher in the kitchen.Enter the surname of the recipient and we will make your personal gift that is sustainable and unique. Every olive wood board is unique in its shape and grain.Olive wood is easy to care for, just wash it off with warm water and a mild detergent. The cutting board has a long service life.In addition, olive wood counteracts bad smells and is scratch-resistant.Size approx. 30-35 x 20 cm natural cut, so the size varies",
    "reviews": [
      "Done nice and neat, would recommend 👍🏻",
      "Beautiful  craftsmen.  Loved it so much.",
      "All the best, thank you"
    ]
  },
  {
    "productId": "RciNBYJQEN",
    "url": "https://www.etsy.com/listing/1265918148/4mm-cuff-bracelet-actual-handwriting?click_key=f147c18e6d82ef27e41f3c3525c9d92134d8cf8f%3A1265918148&click_sum=d7403a63&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-40&pro=1&frs=1&etp=1&sts=1",
    "title": "4mm Cuff Bracelet - Actual Handwriting - Mother of the Bride Gift - Stacking Gold Cuff - Personalized Cuff Bracelet - Secret Message Cuff",
    "description": "The perfect meaningful gift for her. This listing features our 14K gold filled or sterling silver cuff bracelet that can be handstamped or laser engraved with anything you would like. Outside of cuff has a beautiful smooth or textured finish which creates a brilliant shine. This bracelet is handmade from start to finish making each truly unique. Starting price is for one bracelet. To purchase multiple bracelets, please update qty at checkout.Bracelet measures approximately 4mm wide by 6 inches long and is flexible/adjustable to fit most wrists. Recipient can squeeze and mold bracelet to fit their unique wrist!Stamp the inside of bracelet only!This bracelet is 100% solid sterling silver or 14K yellow gold filled and is nickel and lead free. Bracelet width is approximately 4mm.There are two options for personalization. Bracelet can be laser engraved with text in your choice of two fonts - print or cursive, or  bracelets can be laser engraved with your actual handwriting.You can view our 3mm width cuff here:https://www.etsy.com/listing/1086581765/cuff-bracelet-mother-of-the-bride-gift?click_key=7f892598c3a1a694b94b10de54b9bb683ded9d23%3A1086581765&click_sum=46c35cf2&ref=shop_home_feat_2&frs=1&bes=1&sts=1***Things to consider when submitting your handwriting sample:1. Take a photo of your handwriting in natural light (near window is the best option)2. Try to keep letters mostly uniform in size (eliminate exaggerated tails on \"y\" \"j\" etc). The writing can be larger in overall size if all the letters are more uniform.3. Focus the cursor on the writing itself, before snapping the photo with your phone. If you zoom into the letters - it should not look fuzzy or pixelated when in focus!4. The best pen to use is a thin sharpie or gel pen. Both these pens have thicker ink that will show up best on the metal. Using a ballpoint pen (ex. BIC) will give the lightest impression because the ink is so thin.",
    "reviews": [
      "Just as pictured! Love it!",
      "Just as pictured! Love it!",
      "So beautiful. I can’t wait to gift this on my wedding day.",
      "So beautiful. I can’t wait to gift this on my wedding day."
    ]
  },
  {
    "productId": "eZonETEtjr",
    "url": "https://www.etsy.com/listing/732530897/slim-leather-card-holder-personalized?click_key=ce39ac07d743c31572301fa378e649fa2d062476%3A732530897&click_sum=a59ba7af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-41&pro=1&frs=1&etp=1&sts=1",
    "title": "Slim Leather Card Holder, Personalized Wallet, Minimalist Front Pocket wallet, Handmade Small ID Card Wallet, Anniversary Gift For Him Men",
    "description": "Slim Leather Card Holder, Personalized Card Wallet, Minimalist Front Pocket wallet, Anniversary Gift For himFeatures:* Slim design :~ 3” x 4.5” ( 7.8 cm x 12cm)* World’s famous distressed leather.* Can hold up 5-6 cards safely.* 2 vertical and 2 horizontal slots to hold Cards and folded cash.* It’s a great gift for Wedding, corporate events and graduation.——————-Personalization:* NAME OR INITIALS (Location: front bottom right):we can emboss up to 6 capital letters of initials or name to the front of the wallet——————* Laser engraving is not available, we carefully apply \"traditional hot stamp technique for durable / long term visibility of the personalization\".Please leave your instructions. After you ADD your item(s) to CART, you will see in the bottom left hand corner a Box that says: \"Add a note to Yoakum Leather (optional)\".Please contact us for additional customization request and visit the following listing for more information:https://www.etsy.com/listing/719165008/additional-customization-monogram* All orders comes in gift boxes (free of charge)",
    "reviews": [
      "I have a few of this shop's awesome totes, so when my husband needed a wallet, it's the first place I checked. EXCELLENT quality!!!! I'll probably order more as gifts. Shipped FAST too!",
      "Exactly what I needed for my elderly father.  Small for easy pocket storage yet perfect amount of room for his cards and some cash.  I had his initials put on it and he loves the natural leather and the feel of it in his hands.",
      "Kind of big for small card holder. A few scratches on the wallet and the initials I wanted didn’t come out super nice. Can see that the M was double stamped and part of the T isn’t there, maybe wasn’t fully stamped? A little disappointed"
    ]
  },
  {
    "productId": "YpQcbCekEw",
    "url": "https://www.etsy.com/listing/1229947581/large-personalized-piggy-bank-for-boys?click_key=521743e1c796e2d67cf17d4e15567e9b4b8b8e69%3A1229947581&click_sum=6e58740d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-42&pro=1&frs=1&etp=1&sts=1",
    "title": "Large Personalized Piggy Bank for Boys, First Birthday Gift Boy, Easter Piggy Bank Boys, Letter Bank, Handmade Gift for Kids, Nursery Decor",
    "description": "Personalized Wooden Letter Piggy Bank - A unique gift idea for kids.This piggy bank can be personalized with the name of your choice.Personalizing a piggy bank is a great idea for boys and girls - not just because kids love their banks,but also because this gift is so much more special when you personalize it.Give the birthday boy or girl a wooden letter bank for their room to help them save up for their first pair of shoes,or give the baby a personalized piggy bank to put their love for everything treasure hunt in.Children will love to grab their own money and save the pennies and coins needed for the day's purchases.This Piggy Bank is specially designed to be durable, build strong character education skills in childrenwhile encouraging them to appreciate the value of saving money.The Wooden Coin Bank is the perfect gift especially for the kids and who have the kids’ spirit.It teaches saving and importance of the saving. With their name personalized on the acrylic window of the Wooden Coin Bank, they will feel more responsible and more individual.- Strong, durable, and nice-looking wood.- Safe finishing with organic eco-friendly wax- No chemical dyes or ingredient- Acrylic covering- Can be personalized with your kid's name on acrylic.- Handmade 100% Woodwork- Handmade Gift / Nursery DecorPersonalizationName or any customization will be engraved on acrylicEngraving would appear exactly as you typeThe place and direction of the engraving on the letter you ordered will be chosen, accordingly.You may choose any letter as the initial of your child or you may pick any favorite special toy shapes that your child love and have the name engraved on them.How to Order1st Please choose the letter (initial) / shape from the drop-down menu2nd Please write down the engraving you like to have in the “personalization box”3rd The engraving place will be chosen by us due to the letter or toy shape you like to choose on drop-down menu.How to OpenTo open the bank, unscrew the screws and remove the acrylic cover.Production, Shipping and PackingYour Wooden Coin Bank will be wrapped in bubble wrap and it will be packed after.It will be delivered undamaged and in perfect condition this way.Production 1-3 business daysShipping 2-4 business days with regular shipping. Please throw a message if you need expedited shipping. Please consider, that expedited shipping makes the shipping earlier but not the production time.Black Friday DealsBlack Friday Sale",
    "reviews": [
      "Exactly what we wanted. Would recommend.",
      "Just as described and arrived timely:)",
      "Great product and turn around.",
      "Great quality and fast delivery"
    ]
  },
  {
    "productId": "sNQVWuaWbX",
    "url": "https://www.etsy.com/listing/1167107194/reasons-we-love-mommy-personalised?click_key=ecad74b6a2195b8cdd2ca1252e586f329d9856cb%3A1167107194&click_sum=84e13c2b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-43&pro=1&etp=1",
    "title": "Reasons We Love Mommy - Personalised Softcover Book, Unique Mother's Day Gift, Read together children's story - 10 things we love about Mum",
    "description": "For the best Mum in the world - our personalised story book celebrates all the reasons we love Mummy. This listing is for a Softcover book - to order a Hardcover book, please order the Hardcover listing.PERSONALISING YOUR BOOK- Written on behalf of the children. Select how many children the book is from - and the text will change from we, our, us to I, my, me.- Select what you call Mum - Mummy, Mum, Mommy, Mom, Mammy, Mam, Mama, Ma, Step mum, Step mom- Enter child's (or children's) first name in personalisation field (max 30 characters)- On the first page we print your gift message - enter this in NOTES TO SELLER at checkout. Only enter a message as everything you type here will be printed. If you have any other questions - please contact us with a separate message.For our full range of books with further personalisation, visit letterfest.com24 pages, 210x250mm when flat (a little shorter than A4)",
    "reviews": [
      "Fantastic, as described, would highly recommend",
      "It’s such an amazing item. \nIt is beautifully made. I will be spreading the word. \nMany thanks",
      "Great product and very well crafted",
      "Really lovely book thank you"
    ]
  },
  {
    "productId": "BbWMcdhzLq",
    "url": "https://www.etsy.com/listing/1173936717/personalized-stationery-teacher-gift?click_key=18de3a63c22d0a868f208c58f3564842d2be1c63%3A1173936717&click_sum=f386ce80&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-44&etp=1",
    "title": "Personalized Stationery, Teacher Gift, Custom Thank You Cards, Bridesmaids Gifts, Graduation gift, Hostess Gift, Christmas Cards, Hanukkah",
    "description": "Our FUN and FUNctional personalized stationery is the perfect go-to for expressing your gratitude, staying in touch and easy gifting for any occasion. Joy Creative Shop stationery features unique colors and clean, modern typography on lightly textured white cardstock.Product Highlights:-Modern lowercase name and period-4.25 x 5.5 inches [A2] flat card printed on our signature 110lb. lightly textured cardstock-Coordinating envelope options-Return address printing add-on available-Clear boxed ready-to-gift packagingPersonalization:-Please type name and color choices in the personalization box. Include period or heart in the personalization box (will go after last name). Include return address add-on information, if purchased.*Proofs are not sent unless requested. If requested, please allow extra time for message communication and proof approval.Order Processing & Ship Time:-Orders are processed within 3 business days.-Products are shipped via USPS or FedEx and arrive within 7-10 business days from order date (often sooner). You will receive tracking information once your order has shipped!*Please let us know if you need your order by a specific date, especially during the holiday months. We do offer a rush option for up to 5 products, which can be purchased using the following listing links:-RUSH SHIPPING 1-2 ITEMS:https://www.etsy.com/joycreativeshop/listing/966241715/rush-order-processing-for-1-2-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1634351583876-RUSH SHIPPING 3-5 ITEMS:https://www.etsy.com/joycreativeshop/listing/952284782/rush-order-processing-for-3-5-items?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=163435160006Return Address Printing:-When selecting your quantity, select the “w/ return address” option.-Provide your name (optional) and return address in the personalization box as you’d like it to appear on your envelopes.-If adding return address printing on to a previous order, follow the link below to purchase:https://www.etsy.com/joycreativeshop/listing/700626832/add-on-custom-return-address-printing?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1634414139692______________________________________________Head to the shop here:https://www.etsy.com/in-en/shop/joycreativeshopSay hi ::  hello [!at] joycreativeshop.comConnect with us on Instagram, Facebook + Pinterest :: @joycreativeshopConnect with us online :: joycreativeshop.comThank you so much for your support of Joy Creative Shop! We’re so grateful for you!",
    "reviews": [
      "Super cute personalized and exactly as expected\nGreat quality paper",
      "Great service and beautiful product! :)",
      "Have ordered this gift over and over. Perfect every time.",
      "Great stationary- thank you so much!"
    ]
  },
  {
    "productId": "RbLTAKqUsW",
    "url": "https://www.etsy.com/listing/1663884429/custom-valentines-playing-cards-with-box?click_key=a26405ffd9b343732f6c41eb0e3e50b973a7f5f8%3A1663884429&click_sum=10241df5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-45&pro=1&etp=1",
    "title": "Custom Valentine's Playing Cards with Box, Couple's Photos Playing Cards Idea, Personalized Wedding playing Cards, Gifts for Him/Her",
    "description": "❤️ Create Lasting Memories with Customized Couple Playing Cards ❤️Step into a world of romance and creativity with our bespoke couple playing cards. Each deck is a canvas waiting to tell your unique love story. Handcrafted with care and attention, our personalized cards are more than a game; they're a celebration of your journey together. Imagine the joy of surprising your partner with a deck customized with your favorite moments. From choosing the number of custom photos to deciding on the packaging, our process is as delightful as the cards themselves. Add a touch of magic to your game nights, anniversaries, and special occasions – turning every shuffle into a celebration of love.❖ About the Product ❖——————————————• Size:> cards: 2.24×3.42 in/5.7×8.7 cm> wooden box: 4.3×2.8×1.6 in/10.8×7.2×4 cm> iron box: 3.6×2.6×0.9 in/9.1×6.5×2.3 cm• Material: Paper, Wood, Iron• Printing: INDLGO full-color printing• Quantity: A set of 54 cards• Features: Waterproof, durable, portable, long-lasting• Process: Double-sided printing, double-sided lamination❖ How to Customize ❖————————————————1. Choose the number of custom photos for the front2. Select packaging3. Fill in detailed personalized information4. Add to cart and proceed to payment❖ Product Includes ❖————————————————A standard deck of 52 cards includes four suits, each with 13 ranks: Spades (♠), Hearts (♥), Diamonds (♦), Clubs (♣), and 2 Jokers(🤡) cards.✨ All products in our store are my original handmade products and original designs.",
    "reviews": [
      "The cards are nice quality and came out pretty well, but a couple of the photos weren’t centered properly. I forgot to indicate which photos should be on the jokers (which is completely my fault!) but the seller didn’t contact me to ask which photos to use, they just picked some. I also didn’t get to view any proofs before they were shipped. The shipping was a bit slow; they arrived a couple of days after the estimated window. But overall, despite these minor issues, I’m happy with the cards and would consider ordering from this seller again in the future.",
      "Reliable and professional work. Great service. Thank you David.",
      "SO IN LOVE! The image quality is amazing and the overall craftsmanship of the cards is incredible. blew me away & exceeded my expectations. PLus, fast shipping!",
      "Very nice product. It was a gift and they loved it."
    ]
  },
  {
    "productId": "ybmDnnvihY",
    "url": "https://www.etsy.com/listing/177068574/first-communion-gift-girl-original?click_key=7c1ed52e31a0ea4b02ad5f2e1794c9dcbbb8e98c%3A177068574&click_sum=90d0248a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-46&pro=1&frs=1&etp=1&sts=1",
    "title": "First Communion Gift Girl, Original Clarey Clayworks First Holy Communion Bowl, Personalized Gift for Girl First Communion",
    "description": "It's one of the biggest days in their faith journey.  We've captured all the special details in one perfect little piece.  The Original Clarey Clayworks First Holy Communion Bowl.  Faith-filled, meaningful and guaranteed to be cherished for years to come.   There's a reason it's been the best selling First Communion gift here on Etsy 10 years in a row!† DETAILS:Made entirely be hand in our faith-filled studio, this commemorative bowl is the perfect size (about 4.5\") to hold a rosary, loose change, rings or other trinkets.  As functional as it is beautiful!† TO ORDER:Each bowl comes with the verse shown.   Simply leave the child's name as you would like it to appear and numerical date of First Communion in pull down menu at checkout.  Make sure to triple check your spellings and date!    We will personalize your bowl exactly as you tell us.   If there is anything extra  we should know (accent marks, spacing request, etc.) please feel free to use the \"notes to seller box.\"Your bowl will arrive in our signature gift box with bow.  If you are sending it as a gift make sure they know it is from you -- we're happy to include a gift card at no additional charge.  Just tell us what to say and we'll do the rest.*Spring 2022 update - due to extreme shortages of talc in the U.S. many clay manufacturers have had to make substitutions in their clay recipes.  Please note, some pieces may have a more cream or off-white appearance than shown in listing photos.  This will not affect the strength (or beauty!) of the piece!† CRAFTING TIME:Most orders ship in about 7 business days.   If you need it sooner please send me a note before ordering - we'll try to help.     Expedited shipping is available at checkout -- this shortens the shipping time only (or the time it takes to get to you once it leaves our studio) -- NOT the time it takes for us to make it.** all designs, written copy and images  © copyrighted 2009 - 2022 Clarey Clayworks.  Please don't copy our designs -  it's mean and costs a lot in legal bills.**Return to shophttp://www.etsy.com/shop/clareyclayworksFirst Communion Gift | Original Clarey Clayworks First Holy Communion Bowl | Personalized Gift for First Communion | Gift from Parents",
    "reviews": [
      "Just BEAUTIFUL! Can’t wait to give to my niece!",
      "A beautiful and well-crafted keepsake my daughter and nephew will have to remind them of their First Holy Communion.",
      "Amazing!!! Can not wait to\nGive to my daughter for her First Communion!"
    ]
  },
  {
    "productId": "RkTcfLcyvE",
    "url": "https://www.etsy.com/listing/592052499/memorial-wind-chimes-handmade?click_key=7db134c49e647cd0237cc0dab706908ac0c1cfe2%3A592052499&click_sum=129fd1a2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-47&etp=1&sts=1",
    "title": "Memorial Wind Chimes Handmade Personalized Bereavement Gift More Options at My Website",
    "description": "Looking for a heartfelt and lasting way to honor the memory of a loved one? Look no further than EarthWind Bells! Our stunning handmade sympathy gifts are the perfect way to express your love and affection, without breaking the bank. Unfortunately, I've had to move the personalized gifts to my website at earthwindbells.com due to poor support from Etsy. $10 off over there every day, every product.For the price of a typical bouquet of flowers, you can send a one-of-a-kind memorial wind chime that is sure to touch the hearts of all who hear it. Our personalized bereavement wind chimes feature a beautiful personalized wooden wind sail that has been expertly finished to create a unique and timeless look.And to make your gift even more special, every order comes with a free gift card, note, and kraft envelope - all beautifully presented and ready to give. So why wait? Let EarthWind Bells help you remember your loved one in a way that will be cherished for years to come.This handmade ceramic wind chime showcases an intricate starburst pattern, complemented by a premium wooden wind sail featuring personalized etching for a heartfelt touch. A small ceramic blue bird of happiness perches atop the bell, completing the piece. Ideal for home and garden decoration, our wind chimes also serve practical purposes such as wind alerts, scaring off unwanted birds and animals, and creating a soothing, zen-like sound outdoors.Key Features:- Personalized wooden wind sail with etched message (e.g. \"In Loving Memory of John Smith\") and \"Listen to the wind and know I am near\" inscription- Handmade ceramic wind chime with carved starburst pattern and patina-finish wooden wind sail- Proudly made in the USA, unlike competitors who import from China and resell on Etsy- Includes a FREE gift card with your sentiments (add a note during checkout)- Optional $5 gift wrapping available- Ideal for wedding or housewarming gifts- Durable, unglazed stoneware clay fired to 2200 degrees- Bell length: 6.5-7.5\"; Total length: 13-14\"; Width: 2.5\"; 6\" hanging chain included- Listen to the chimes: https://www.youtube.com/shorts/CBTh5AQ2WAg- Watch the bird-making process: https://youtu.be/CzE2itBTiJQ- Browse our other wind chimes:http://www.etsy.com/shop/EarthWindBells- Hang on a sturdy branch or hook; bring indoors during extreme cold for longevity- Please allow 7-10 days for completion, as personalized wind sails require 3 days for proper crafting and finishing. Don't hesitate to contact us with any questions or concerns.Note: Each bell is individually handcrafted, resulting in slight variations from the photos. Birds and beads may differ, but we strive to match the images whenever possible. If you prefer the wind chime to closely resemble the photo, please message us before ordering, as some beads or birds may be out of stock.©2024 Earthwind Bells",
    "reviews": [
      "The windchime was so beautiful.  I will purchase again at the time of another death.",
      "Beautiful and just perfect to remember a loved one.",
      "Thank you for this lovely memorial gift."
    ]
  },
  {
    "productId": "gFd9RwQUXr",
    "url": "https://www.etsy.com/listing/702466850/birthstone-bracelet-birthday-bracelet?click_key=300737896a2b7bd1fdfba45d33d1aad12c3eec73%3A702466850&click_sum=c9edf3eb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-645256-9-48&etp=1&sts=1",
    "title": "Birthstone Bracelet, Birthday Bracelet, Birthday Gift For Her, Girlfriend Gift, Christmas Gift Idea, Women Bracelet, Sister Birthday Gift",
    "description": "This wonderful bracelet features a 925 sterling silver chain & Swarovski birthstone. This is a great gift for yourself or your loved one.∙  All components made from high-quality 925 sterling silver, 24k gold vermeil∙  Adjustable chain∙  Each order comes in a beautiful gift boxD I M E N S I O N S∙  chain length 16 cm ( 6.3 in)  + 3 cm ( 1.2 in) chain extender∙  total length 19 cm ( 7.5 in)P A C K A G I N GWe will package your order in a beautiful box, without a receipt - gift giving ready.S T O R E  ∙ P O L I C Ywww.etsy.com/shop/diamondrosejewellery/policyL E T' S ∙ G E T ∙ S O C I A L !www.instagram.com/diamondrosejewellery (@diamondrosejewellery)Handmade by us, personalised by you.",
    "reviews": [
      "Item as expected thank you",
      "Thank you! This bracelet is lovely. I paid double the price a few weeks ago!",
      "Beautiful and just what I needed.",
      "Every thing as described thanks"
    ]
  },
  {
    "productId": "LhzZ9dIejr",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=e7f1c185571c6736d561369b0bd2756d8739d413%3A1115114382&click_sum=254a8fb4&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "cgKQewVXJD",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=fc036bba00e0c2e54c7bbc4a72a522a12e11824d%3A654638870&click_sum=97990298&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "HBQEtVezgE",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=c6e77bd0140fc3a8c00535201d0b7414e1109fb9%3A1355783916&click_sum=fdc421c4&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "FWwCrjAjsE",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=b74a2b9de2591ed3776031ca8912c2e4295a8e14%3A1411614241&click_sum=3b271e2d&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "jLVHbFaRRf",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=37b3821fa5ea82e55c6a0a36973da81a79728af9%3A999136086&click_sum=af3846e7&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "PcwddnbUiS",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=d982f0d524db161bf258ba948c3bdcf7916cd104%3A1440285597&click_sum=0060220a&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!",
      "Just as described. Would order again."
    ]
  }
]
