[
  {
    "productId": "QOBOnlShGC",
    "url": "https://www.etsy.com/listing/934777186/easter-bunny-decor-stuffed-wool-bunnies?click_key=6fdf427859f96650457f421dec652acff8b269c6%3A934777186&click_sum=c5aeb969&ref=search2_top_narrowing_intent_modules_etsys_pick-1",
    "title": "Easter bunny decor, Stuffed  wool bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunny",
    "description": "Easter bunny decor, Stuffed  wool bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunnyStuffed bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunnySet of 3 Easter bunnies. One set is for one green, one pink and one yellow bunny. Bunnies are made of old but clean sweater. I love to upcycle old clothes.Please note: as all the bunnies are made of old sweater- green rabbits have all a little different look! The back side of the green rabbits is shown in the photos (it is plane green).All stuffed Easter rabbits are made of old sweater. I love to reuse old materials. Ecofriendly decorations. Bunnies are perfect rustic farmhouse deocrations or Easter basket decor. Even nice spring gifr idea!All bunnies are stuffed with pillow filling.Bunnies are 9.65 inch (24.5 cm) tall, the widest side is 4.70 inch (12 cm) the bottom.This is a decoration, not a toy!For more Easter ornaments and spring home decor ideas please visit:https://www.etsy.com/shop/tertsdesign?ref=seller-platform-mcnav&section_id=18416408I ship worldwide from Estonia Europa.Thank you for visiting my Tertsdesign shop:https://www.etsy.com/shop/tertsdesign",
    "reviews": [
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!",
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!",
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!",
      "Great item!  Love the ornaments!  Will purchase from this Seller again."
    ]
  },
  {
    "productId": "gnmcjhuqjM",
    "url": "https://www.etsy.com/listing/1653429768/mini-personalized-knitted-wire-name-wall?click_key=b7f7dba435f8609b09b7b245af6aeb7631cb043d%3A1653429768&click_sum=e8622658&ref=search2_top_narrowing_intent_modules_etsys_pick-2",
    "title": "Mini Personalized Knitted Wire Name Wall Hanging | Children and Baby Bedroom, Birthday Gifts, Easter Basket Gift Tag",
    "description": "This mini knitted wire is a perfect and special way to decorate your little one's Easter baskets, birthday or Christmas presents, or as a cute decoration for their bedroom. Each measures 3\" in height for the capitol letter, and approximately 2.5for lower case. Length depends on the amount of letters needed.This custom banner is made by hand with knitted wire and is available in over 30 different colors! Easily match your little one's bedroom, nursery, or home's holiday decor. A fun and unique addition to any space. These custom wire hangings make a great gift too! Easily hang on your wall with a push pin or command hook, or tie to any gift with the matching strand provided!\"Brooklyn\" is made with pink yarn\"Grayson\" is made with baby blue\"Caleb\" is made with goldenrodPlease remember that your handmade sign is not a toy and should be kept away from children and pets. During shipping, it is normal for the knit on your sign to pull back, exposing some of the wire. Gently pull the knit back over the wire to cover.Our items are handmade in a smoke and pet free home.*** When purchasing items needed for a specific date, please leave a note in your order form letting me know when. I will do my best to accommodate, however please be aware of my turn around times (which does not include shipping, or bulk/multiple items) and other delays such as holidays or weather. If you have any questions, please message me. Thank you!",
    "reviews": [
      "It turned out awesome!! I can’t wait to gift it at the baby shower!",
      "This is perfect as a decorative hanger for a mirror with chain.  Used a double threaded screw.  Love it!",
      "High quality craftsmanship. Beautiful addition to any decor!"
    ]
  },
  {
    "productId": "FNAVBpOCIV",
    "url": "https://www.etsy.com/listing/1414500238/easter-egg-hunt-tokens-easter-egg?click_key=196a42604d7e092539acfd6e1e245421b1621d0d%3A1414500238&click_sum=9dbf4b4e&ref=search2_top_narrowing_intent_modules_etsys_pick-3",
    "title": "Easter Egg Hunt Tokens - Easter Egg Stuffers - Easter Basket Stuffers - Easter Reward Token - Wooden Easter Coins - Kids Easter Gift",
    "description": "Want to give your children more than candy in their Easter eggs this year? Tired of the mess of tiny toys that only get played with once? Use these Easter egg fillers instead! Each bunny has a fun or special activity or small monetary amount on it. You can also create your own activities with our blank add on option! Collect memories instead of things this spring. Please note eggs are not included.Tokens are cut, scored, and engraved by a laser machine. Sometimes items and packaging may arrive with a slight smoke/burn smell. If you are sensitive to smoke smell this may smell stronger to you. Tokens may also have slight burn marks. We do our best to avoid this but sometimes it is unavoidable.***** IMPORTANT INFORMATION – READ BEFORE ORDERING *****TURNAROUND- Orders ship in 3-5 business days.………………………………….F E A T U R E S :• Solid wood engraved on one side.• Tokens come in a bag for storage.• Half set is 12 random tokens.• Full set is 24 tokens listed below, including one of each.………………………………….P H R A S E S  I N C L U D E :- Special lunch for school- Date with Mom- Date with Dad- Free chore day- Donuts- Extra game time- Pizza night- Outside time- Ice cream- Extra TV time- Movie night- $1- $2- $3- $5- Build a fort- Stay up late- Zoo trip- Bake cookies- Game night- New book- Go to the park- Small toy- Extra dessert………………………………….S H I P P I N G :• All items get sent via USPS first class mail.• Priority 2-3 day Domestic shipping upgrade available at checkout - NOTE choosing priority shipping does not shorten the production time, it just speeds up time in transit.………………………………….<<< R E T U R N S & E X C H A N G E S >>>Please note that we cannot process cancellations or returns for orders older than 24 hours.Do you have additional questions or want a custom design?If so, please message us directly on Etsy and we will respond as soon as possible.",
    "reviews": [
      "Very cute! Great idea for Easter",
      "Shipping was very fast and the quality of the product was amazing",
      "These were fantastic and my kids were even more excited about them than candy!  Additionally, the shop owner was fantastic. I had ordered these late, thinking I was ordering them for the following Easter, they wouldn’t arrive on time. But the shop owner reached out to me, shortly after placing the orde,  to upgrade my shipping if I wanted them to arrive by Easter. She was great!",
      "Adorable tokens! Loved having a non-candy option for Easter egg hunting. Thank you!"
    ]
  },
  {
    "productId": "tHMdaMPqWo",
    "url": "https://www.etsy.com/listing/1660635928/easter-carrot-basket-tags-svg-carrot?click_key=65f62aec7990cda61716d65dee5205a7e2614879%3A1660635928&click_sum=57e58a5d&ref=search2_top_narrowing_intent_modules_etsys_pick-4&pro=1",
    "title": "Easter Carrot Basket Tags svg, Carrot Bunny Ears Tags svg, Easter Name Tag, Easter Basket Tag, Bunny bundle, carrot dxf, lasercut, glowforge",
    "description": "★ This is and Digital item DOWNLOAD INSTANTLY ★Pay attention: it isn’t the real product, it’s the file which you can download. No physical item will be shipped.PLEASE CHECK THAT YOUR MACHINE CAN USE THESE FORMATS: DXF and SVG filesAfter your payment is confirmed, Etsy will send an automated email to let you know your files are ready to download. To download, follow the Etsy email link or visit your purchase/order history on Etsy and next to the item(s) there will be a \"Download Files\" button. Click that button and follow prompts.LICENSE AND USEYou can:use these files to create items for personal useuse these files to create finished products to sellYou may not:However, you CANNOT:use the picture for another purposeUse any portion of these files to sell digitally in any formatsharing or selling these files for any reasonWARRANTYI don't accept returns, exchanges or cancellations. But please contact me if you have any problems with your order.THANK YOU!",
    "reviews": [
      "great file will shop again",
      "Many thanks!",
      "This is soooo beautiful thank you so much",
      "Love the design will use on other items to."
    ]
  },
  {
    "productId": "TvWAjDkllk",
    "url": "https://www.etsy.com/listing/1679534057/spring-embroidery-table-runner-hand?click_key=b87a1b11ec88376105ae0d12d7bd16544581820e%3A1679534057&click_sum=a055bdbd&ref=search2_top_narrowing_intent_modules_etsys_pick-5&frs=1&sts=1",
    "title": "Spring Embroidery Table Runner, Hand Embroidered Cloth Table Mat, Hand Stitched Festive Dinner Table Decor",
    "description": "Delight in the most delicate spring details this Easter! Welcome new beginnings and celebrate the Spring season with our handcrafted and embroidered cotton table runner. Embroidered with our favorite animals: chicks, bunnies, sheep, ladybugs and bumblebees, along with sweet Spring blossoms - this heirloom table runner is set to fill your home with sweetness for the year ahead.With gorgeously hand-embroidered spring blossoms around the center and the edges, our runner can be used throughout the spring and summer holiday seasons.Hand-embroidered.Made from 100% cotton.Crafted with love by artisans in India.60\" Long x 20\" Wide.Pairs delightfully well with our Spring Embroidery Napkin Set and our Spring Embroidery Cocktail Napkin Set.Our table runner comes ready to gift, tied with two cotton ribbons and wrapped in tissue paper along with a postcard highlighting our product's handmade and fair-trade story. You can also add a gift message or chose additional gift wrapping options at checkout.",
    "reviews": [
      "The ornament is exactly as pictured, a nice weight and solid. More than that, the seller was super helpful when USPS lost the package and sent a replacement the same day. Lovely folks to do business with!",
      "This is adorable, I gets lots of compliments!",
      "This basket is so sweet. I am obsessed!!",
      "I purchased this for my husband's Grammy. She enjoys seeing this beautiful, bright, and well-craftes hummingbird in her windowsill with the houseplants."
    ]
  },
  {
    "productId": "GfpOYylKiO",
    "url": "https://www.etsy.com/listing/945969660/easter-diy-craft-kit-easter-birdhouse?click_key=91c5bfec32a4b91cf462ca434b1b3a43160c47a6%3A945969660&click_sum=2ba85a50&ref=search2_top_narrowing_intent_modules_etsys_pick-6",
    "title": "Easter DIY Craft Kit | Easter Birdhouse | Kids Spring Craft",
    "description": "In this craft kit you receive everything you need to create this adorable Easter Spring Birdhouse! Paint the 3.8” wooden house, add ribbons, moss or wooden stick roof + cute Easter & spring themed add-ons to make this one of a kind craft!Get creative and design your own cute Easter Spring Birdhouse. Each kit is uniquely curated to make something truly special! These kits are perfect for kids as well as adults!Supplies included:-1   3.8” Wooden Birdhouse-6  Paint colors-4  Mini pastel plastic Easter eggs-1   Mini pastel wooden bunnies-2  Mini foam carrots-1   3D paper Spring butterfly-1   Bag wooden sticks + flower sequins-1   Container of Tacky Craft Glue-1   Paintbrush-1   Small bag of moss-Various sizes + designs + colors of ribbons/stringsSuggested additional supplies NOT included:- Other paint colors or paintbrushes if desired- ScissorsThere are so many ways to create your Birdhouse with plenty of supplies to be as creative as you want! These make great gifts and also a fun at home craft project for you or your little ones.**Please note that the birdhouse design has slightly changed! Now it comes with a loop on top so you can actually hang your birdhouse outside if you desire!Thank you!!**",
    "reviews": [
      "So much fun!",
      "The crafts from this shop are the cutest! The customer service is awesome- so kind and helpful! They really went out of their way to help when needed."
    ]
  },
  {
    "productId": "Olt1NSTLyy",
    "url": "https://www.etsy.com/listing/1671914152/easter-breakable-smash-chocolate-2?click_key=39f7b9aeb98946ddb78d8a66888d130bf11b4c1c%3A1671914152&click_sum=96dbfc1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754452-1-1&pro=1&frs=1&pop=1",
    "title": "Easter Breakable Smash Chocolate -  2 oversized eggs filled with fun Jelly Belly jelly beans. Comes with hammer. Each Individually wrapped.",
    "description": "Get your orders in early!! 🐣🐇🌷🌸** Order today and we can delay shipping for Easter arrival -🐣Awesome Easter Bunny Basket treats! 🐇🥕 Break out of the regular gift-giving routine with these unique breakable chocolate eggs.🌸🌷Handcrafted of premium Ghirardelli chocolate, our large crave-worthy eggs are filled with Jelly Belly jelly beans in flavors from Root Beer and Blueberry to Sour Cherry and Tutti-Frutti. The festive treats each come with a wooden hammer tied with a bow for cracking them open and releasing the sweets inside. 🐇Fun for parties, grandkids, gifting little ones, classmates, wedding guests, bridal showers, baby showers, sweet 16’s, class parties, co-workers, teacher gifts…. 💜**🐇🌸 Orders of 48+ get free personalized labels on each box, and choice of coordinating ribbon color**🥕🌷* Set includes 2 oversized chocolate eggs and 2 wooden mallets.RECEIVING INSTRUCTIONS* Store unopened at room temperature for up to 12 months.Arguably the best tasting Easter breakables on Etsy!Get your orders in now before the Easter ordering frenzy starts. 🤪",
    "reviews": [
      "Such a cute item for Easter! The seller was very accommodating with getting my item shipped so it wouldn’t sit and melt in the mailbox while we were out of town.   I can’t wait to see the kids get excited to crack open their carrots!",
      "Thanks Thanks thanks thanks thanks",
      "Exactly as described!!!  Will definitely be back."
    ]
  },
  {
    "productId": "jyABEgFzKR",
    "url": "https://www.etsy.com/listing/1409731188/ship-in-1-2-day-kids-easter-basket?click_key=d77361dcdf244fba0b7f73107dee3b1fd2d0b5ee%3A1409731188&click_sum=6f353d61&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754452-1-2&pro=1&bes=1&sts=1",
    "title": "Ship in 1-2 DAY Kids Easter Basket | Custom Embroidered Easter Basket | Easter Bunny Tail Bag | Bunny Baskets for Easter Gifts",
    "description": "🚚 Considering to upgrade shipping for quicker delivery?We take great care to ensure that orders are processed promptly, typically within 1-2 business days.If you need your order to arrive sooner, we kindly suggest considering an upgrade to expedited shipping during the checkout process for a speedier delivery.Our personalized easter basket with designs and your child's name will make a perfect easter gift. These baskets will be a great companion on your kid's easter egg hunt. Also, you can either make it an easter basket or a storage basket for toys on weekdays. All the baskets come with a bunny design and personalized embroidered design made with high-quality thread to give them quality and durability in the future.Product FeaturesOur custom easter basket is available in size 9\" wide x 9.8\" height with a handle length of 18.1\".With a personalized basket, you get a professionally machine-embroidered Name design with good-quality thread. There are 5 color variations available in the bunny easter basket, i.e., Blue, Pink, Purple, Coffee, and Lime.Choose the font variations & thread color from the drop-down list. And include the Name in the notes box at checkout.Perfect easter gift or basket to give your kid to make them enjoy an easter egg hunt to the fullest. And personalized design features helped us to make the easter basket with the kid's name.⭐Social Media⭐Stay informed on all of our latest products and sales by following us on social media.Facebook: https://www.facebook.com/HundredHeartsDesignsInstagram: https://www.instagram.com/hundredheartsdesigns/⭐Note for international shipping⭐-Please leave full name and contact number.-The customer is responsible for all duties and taxes.Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.For product value over this limit, there will be import taxes, fees, and customs duties (hereafter, \"Import Fees\"), levied by the customs office of your shipping destination, it could be around 10-25% in total, depending on regulations of local authority.As all of our products are personalized, we will not issue a refund to return-to-sender goods due to unpaid custom duty fee.--------------------------------------------------------------------easter gift, happy easter, easter gifts, easter bunny, easter decor, easter favors, easter basket, easter baskets, boy easter basket, easter decoration, easter decorations, kids easter basket, personalized basket",
    "reviews": [
      "The basket is very cute and looks exactly like the picture! It's slightly smaller than I thought BUT that's me not knowing measurements, lol. It fits everything we wanted to put in my son's basket. Seems sturdy.",
      "Absolutely adorable, can’t wait to give to the grandkids",
      "Arrived on time, good quality, beautifully made"
    ]
  },
  {
    "productId": "aAUNZRD9Pl",
    "url": "https://www.etsy.com/listing/1669436374/custom-easter-basket-easter-egg-hunts?click_key=25e3ec961e64b6465404211be36db212e594fd48%3A1669436374&click_sum=0346217f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754452-1-3&pro=1&bes=1&sts=1",
    "title": "Custom Easter Basket, Easter Egg Hunts, Bunny Baskets for Kids Bag, Personalized Easter Sack for Easter, Boys Girls Easter Gifts, Bunny Sack",
    "description": "🐣 Custom Easter Sack for Kids 🐰Make this Easter unforgettable with our charming Custom Easter Sacks, perfect for your little ones! Crafted from high-quality cotton, these sacks are designed to hold all the Easter goodies your kids can find. With three adorable designs to choose from, each sack can be personalized to make it truly unique for your child.🌟 Features:Material: 100% Pure Cotton - Soft, durable, and eco-friendly, perfect for kids.Size: Generous 16\" W x 24\" H - Ample space for all the Easter eggs and treats.Designs: Choose from three enchanting designs - each one full of Easter joy and ready to be customized with your child's name.Rope Color: Vibrant Red - Adds a pop of color and makes the sack easy to carry.Personalization: We offer custom name personalization to make your Easter sack one-of-a-kind. Please provide the name you'd like added to your chosen design at checkout.🎨 How to Order:Select your preferred design from the options available.Include the name for personalization in the 'Personalization Box'.Our team will craft your Custom Easter Sack and have it ready to ship in no time!💌 Perfect For:Easter Egg HuntsEaster Morning SurprisesSpringtime GiftsPersonalized Children’s Gifts🛍️ Why Choose Our Custom Easter Sacks?Unique, personalized touch for your child's Easter celebration.Large capacity to hold plenty of Easter surprises.Durable and reusable - a lovely keepsake that can be used year after year.Fast processing and shipping.Hop into the Easter spirit with a Custom Easter Sack that your kids will love and cherish! Order now and make this Easter extra special with a touch of personalization and lots of Easter fun. 🌼🐥",
    "reviews": [
      "Very cute. Nicely made. Will make a great Easter gift.",
      "Loved them. A little bigger than expected but will be perfect",
      "Loved them. A little bigger than what I was expecting but will be perfect",
      "Loved them. A little bigger than I was expecting but they will be perfect."
    ]
  },
  {
    "productId": "HnMaCilYgA",
    "url": "https://www.etsy.com/listing/1412479718/easter-diy-personalized-paint-kit-easter?click_key=c2791af631eab5bd29ab32f8f31dbde67dac25db%3A1412479718&click_sum=574ffe36&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-1&pro=1&pop=1&sts=1&content_source=ee5d0c5940455de23acc3014807fc33038b3a54d%253A1412479718",
    "title": "Easter DIY,  Personalized Paint Kit, Easter for Kids, Easter basket Stuffers, Fillers, Easter Eggs",
    "description": "These Wood Easter Egg Paint Kits make wonderful Easter Basket Stuffers.The paint kit comes with 1 personalized wood Egg, acrylic paint set with your choice of 3 colors and a brush. Choose one of our 4 original egg designs.The wood eggs are handcrafted in our studio, and our designs are copyrighted.The egg measures approximately 5” tall. The paint is acrylic and it is permanent It will not wash off.If you have any questions please ask before you place your order. We don't accept returns, exchanges, or cancellationsBack to \"April & Kiwi\"https://www.etsy.com/shop/AprilandKiwi?ref=hdr_shop_menu",
    "reviews": [
      "Gonna be a cute addition to grandchildren’s Easter gifts",
      "Nicely packaged - arrived promptly…so cute",
      "Fun Easter gift…nice addition to Easter baskets",
      "Perfect Easter gift for kids!"
    ]
  },
  {
    "productId": "wLPvhFfQwU",
    "url": "https://www.etsy.com/listing/576452614/seed-kit-easter-gifts-for-kids-adults?click_key=172f565771b4a6aaa8f4001036244213b11e7281%3A576452614&click_sum=b55ac2ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-2&frs=1&bes=1&sts=1&content_source=828138420d3c243f11f4a3feca89d8096d4089fe%253A576452614",
    "title": "Seed Kit Easter Gifts for Kids & Adults, Boys and Girls, Fun, Educational Garden Gift, Easter Basket Filler, Easter Party Favor, Easter Gift",
    "description": "Mini Flower Garden Grow Kit for Easter with Plantable Easter EggFlower seeds are inside the handmade Easter egg!Our seed kits are small, making them the perfect size gift as an Easter basket filler or Easter party favor.A fun, at home, garden gift experience for boys, girls, moms, dads, grandparents, friends and family of all ages.Qty: 1 KitSize: 2\"X2\"X2\" (Miniature sized, but that is one of the things our customer love about them!)Each kit contains everything you need to grow a beautiful flower garden, including:(1) plantable seed paper Easter egg(1) flower pot(1) soil(1) gift-ready gift box with Easter design box front and ribbon(1) planting instruction(1) \"Happy Easter\" design box front, as seen in the featured photoSeed Blend:A beautiful assortment of butterfly-attracting annual and perennial flower seeds can be found inside each handmade paper egg. This unique blend of seeds is proven to have the highest germination (flowering) rate throughout the US.The seed blend includes:Zinnia,Pinks, Sweet WilliamPoppySnapdragonCatchflyDaisyBlack-Eyed SusanFive SpotCandytuftBaby Blue EyesWallflowerOrders ship USPS with tracking number provided.For other nature-inspired party favor and gift ideas, see our store:http://www.naturefavors.etsy.com© 2023 by Nature Favors, all rights reserved.",
    "reviews": [
      "So beautiful. The little boxes and ribbons really made them look so special.",
      "Smaller than I thought and took a bit of time to ship.",
      "So cute! Thanks so much."
    ]
  },
  {
    "productId": "jqsmxrkunI",
    "url": "https://www.etsy.com/listing/1425720721/girls-personalized-name-handbag-daisy?click_key=aa37d1c805a6cc9e01e75ea85bf942400cd87831%3A1425720721&click_sum=fb9bca13&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-3&pro=1&bes=1&sts=1&content_source=7c68c604e2187a56d095c9af0332a33a1e3fb7b1%253A1425720721",
    "title": "Girls Personalized Name Handbag Daisy Flower First Purse School Bag Princess Toddlers Kids Babies Birthday Easter Gift Christmas Present",
    "description": "Adorable customized girls round daisy crossbody bag for your little ones! Purses can fit all your little ones essentials, including a pair of sunnies, hand sanitizer and face mask. The purse comes in three color options (marigold, green and pink)Crossbody bag Measurements(Approx): Length- 4.5 in, Height - 4.5 in, Width - 1.5 in, Adjustable Straps - 17.5 inCrossbody bag Material : PU LeatherWe have two options available:1.\tPersonalized purse only2.\tPersonalized purse and sunglasses setIf you would like to customize with a name, please enter personalization details. We are able to fit a maximum of 12 letters for the desired name.Perfect for the spring, summer, upcoming vacation or photoshoot. Would make for a great Easter gift, kids birthday party favor, goody bag gift, graduation gift, junior bridesmaid, flower girl gift or proposal.Candy themed birthday party, princess accessories, little girls eye wear, toddler girl gifts, first birthday gift, Christmas gift, Hanukkah present, stocking stuffer, gifts under $25For kids under 3, use only under supervision of an adult.",
    "reviews": [
      "Love it will buy again",
      "Granddaughter loved this gift for Easter!",
      "My granddaughter is going to love this. So cute 😍"
    ]
  },
  {
    "productId": "Ph42PqLBea",
    "url": "https://www.etsy.com/listing/1310850012/3-organic-stuffed-bunnies-in-carrot-zip?click_key=657141e482279017368bce22adff5269ea9fa087%3A1310850012&click_sum=1362712b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-4&bes=1&sts=1&content_source=6e116f6d462a4b7d435fed642911a10228b5a067%253A1310850012",
    "title": "3 organic stuffed bunnies in carrot zip purse, Easter bunny, Home decor, Carrot treat bag, White bunny plush, Babyshower, Children's gift",
    "description": "☆★ Please take your time to read shop policy, item descriptions before making a purchase.EXPRESS SHIPPING 4-6 DAYS TO THE US ?BUY SHIPPING UPGRADE $11.90 > Clink >https://etsy.me/3TC6bfOListing of 3 bunnies in carrot zip purse.Cute bunny set is a great addition to your Easter decor or decorate your room. It will be a perfect Easter gift! Our bunnies are made with organic cotton and the inside is filled with hypoallergenic fiber filling.【Size】Carrot : 8\", Bunny : 2.5\"【Color 】White【Material】Dyed cotton fabric ✂【Gift】If you are looking for a gift, PLEASE buy a gift wrap(See Gift wrapping details)【Care】It is recommended to wash only by hand, with mild detergents, dried naturally.-----------------------------------------------------------------------✈ Ship worldwide by Fast-ship.co Mail Standard / Thailand post / PostNL / Asendia / USPS✈-- Instant tracking-- We ship Mon-Fri (ex. Holidays)-- To USA : Fast-ship.co Mail Standard via USPS mail service system : Estimated time delivery 9-14 days-----------------------------------------------------------------------➽ UPGRADE TO EXPRESS SHIPPING ➽-- Make your selection on the Shipping Method page✈ESTIMATED DELIVERY TIMES✈-- USA: 3 - 5 business days-- EU: 3 - 5 business days-- Canada: 4 - 6 business days-- Australia + New Zealand 4 -7 business days-- The rest of the world: 3 - 5 business days➽ EXPRESS : CONTACT PHONE NUMBER is required for including on the shipping label and courier delivery purpose. Please leave your phone number / note when you place an order.➽ PLEASE NOTE that the delivery is not available to P.O. Boxes. The area that appears \"Remote area\", an additional delivery fee will be charged.----------------------------------------------------------------------📷 The picture was taken in natural light.💻 Product color may slightly vary due to photographic lighting sources or your monitor settings.Any questions *Message seller* ✉🇫​​​​​🇦​​​​​🇨​​​​​🇪​​​​​🇧​​​​​🇴​​​​​🇴​​​​​🇰​​​​​Animal gift idea : https://www.facebook.com/tanmadeshop----------------------------------------------------------------------❤ CUSTOMER REVIEW/FEEDBACK ❤★★★★★This is seriously the cutest thing I’ve ever seen in my life. It took a long time to get to me but it was so worth it. It is so well made and just like the pictures. Thank you so much for making my bunnies!! And nothing excited me more than seeing that elephant key chain! What a bonus! Thank you!★★★★★Another great item. My daughter adored the little bunnies in the carrot sack. Good quality and company went out of their way to be helpful and to get everything needed. Would really like to do business with them again!★★★★★Very nice, the baby I got this for loved the carrot and bunnies. She learned how to zip and unzip quickly. Great educational toy.★★★★★Tan does beautiful work. The stuffed animals in their little pouches are adorable and really well made. Tan went above and beyond with customer service as well. I let Tan know that I was hoping to give these as gifts at a specific time so Tan specifically dropped them off at the airport post office to cut down on shipping time. Communication was excellent as well. I will definitely purchase from Tan again!★★★★★SO adorable!! Love love love them! Fast shipping and thank you for the extra keychain★★★★★Very nice, the baby I got this for loved the carrot and bunnies. She learned how to zip and unzip quickly. Great educational toy.★★★★★Love these so much. The work is incredible. My niece is going to love it! Very pleased with purchase. Looks exactly like picture. Thanks",
    "reviews": [
      "Adorable and really well made. Materials used were of great quality too!",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone! Ratcha...",
      "Love this little carrot set…..I should have paid more attention to the description, however.  It’s a lot smaller than I was anticipating, but still darling.",
      "So cute! Great for Easter baskets.",
      "Items exactly as advertised. No complaints whatsoever. First class experience.",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone! Ratcha..."
    ]
  },
  {
    "productId": "IBlklrazYI",
    "url": "https://www.etsy.com/listing/1659166754/personalized-toy-cars-wooden-toys-for?click_key=1f79409e16e67b04696022d9f028ff8634c98041%3A1659166754&click_sum=85560e1a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-5&pro=1&bes=1&content_source=093b362fd07174cae99cdf59f2e5badbe2179538%253A1659166754",
    "title": "Personalized Toy Cars. Wooden Toys For Kids. Farm Truck With Name. Sensory Toddler Toys. Custom Birthday Baby Gifts. Easter Basket Stuffers.",
    "description": "· Wooden Colored Toy Cars ·Imagine the joy on your little one's face as they embark on imaginative adventures with their very own fleet of wooden cars. These handcrafted treasures are not only beautiful but also make the ideal gift for birthdays, christenings, Christmas, and any other special occasion.Busy Puzzle invites you to build a fleet of these enchanting wooden cars. Discover the joy and wonder that these personalized wooden cars bring to your little one's world.PLEASE NOTE THAT OUR CARS ARE suitable FOR CHILDREN AGED 3+.By this age, it can be a great decoration in the nursery.· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.· Materials ·The cars are made of solid wood.They are covered with water-based paint.· Personalization ·For an additional cost, you can add a name engraving to the car and make this toy even more special.PLEASE NOTE  that the BusyPuzzle name logo is printed onto every product and cannot be removed.You can order:• You can combine your own set of cars by selecting the quantity in the options and specifying which cars you have chosen (A, B, C) in the personalization box.You can add one of the presented roads (see infographic) for an additional cost.PLEASE specify which design you have chosen in the personalization box.· Approximate Dimensions ·The size of the cars depends on the selected design.Approximate dimensions:Length: 5.1 inches (13 cm)Height: 1.9 inches (5 cm)Width: 1.5 inches (4 cm)· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. All kids have imagination. And we made all we can to give you a safe toy. But be careful and try not to leave your child alone with toy. Instead - play with your kid. Collect memories2. Ensure that the child does not take small parts for him.Please, contact us if you have any questions. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "It is an adorable gift for a little boy who loves cars!",
      "got a car with my sons name on it and i love it! came in time for easter to new jersey",
      "Very cute and well made.",
      "Cute little car! Our grandson will love it!"
    ]
  },
  {
    "productId": "HGZhGLOfuX",
    "url": "https://www.etsy.com/listing/1404243062/easter-basket-egg-tokens-set-of-42?click_key=3f7711c5be0e82a6d7a6557e4125691b86ff6701%3A1404243062&click_sum=ebd6dad8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-6&pro=1&bes=1&sts=1&content_source=1726d072a85f1aeee9745b764058bf6f5ed9fa0e%253A1404243062",
    "title": "Easter Basket Egg Tokens Set of 42 | Easter Basket Stuffers | Wooden Easter Reward Coins | Egg Hunt Prizes and Rewards for Children",
    "description": "Thank you for checking out my listing. This set of 42 Easter basket tokens is laser engraved and cut from 1/8 inch thick birch plywood. These basket stuffers make a great alternative for candy and can be redeemed for prizes. Use these Easter coins for an egg hunt, or use them in baskets for a fun twist. The Easter tokens can be reused for many years.",
    "reviews": [
      "Shipped quickly and the item quality is top notch. They had several activities in this set that others didn’t have. Would definitely recommend.",
      "My grandaughters will love this",
      "Cute idea and product.  I love that we don’t have to give out candy in the eggs."
    ]
  },
  {
    "productId": "i8cCNJqbgC",
    "url": "https://www.etsy.com/listing/1681206305/nanas-favorite-peeps-easter?click_key=e519661208adb6595579001b092d7fb7e5c2a270%3A1681206305&click_sum=28582aa0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754452-1-4&pro=1&bes=1&sts=1",
    "title": "Nana's Favorite Peeps Easter Shirt,Personalized Grandchild Name Tshirt,Custom Funny Tee For Grandma,Cute Bunny Nana Mom Gift,Women Shirts",
    "description": "Nana's Favorite Peeps Easter Shirt,Personalized Grandchild Name Tshirt,Custom Funny Tee For Grandma,Cute Bunny Nana Mom Gift,Women Shirts----- How To Order -----1-) Please, check and review all the photos.2-) Choose your t-shirt size and color.*Different styles of shirts may have different shades of same color choice due to different manufacturer brands.*For this reason, we recommend you to match shirts from the same styles if you want precisely matching colors (ex. Unisex, V-necks, Toddler, etc.).3-) Click add to cart. You can go back to add more shirts.4-)Click \"Proceed to check out\".5-)When you check out, you can add a note to seller for any request.----- Unisex Shirts -----* Unisex t shirt fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Retail fit. Unisex sizing. Shoulder taping.----- Woman V-Neck Shirts -----* Fabric: Lightweight Cotton Poly Jersey.* 60% Combed Ring-Spun Cotton 40% Polyester / 30 singles, 135 grams/4.0oz.* Binding: Set-in Collar 1x1 Baby Rib with Front Cover Stitch. Side seamed.* Tear away label.----- Youth Shirts -----* This youth tee fits like a well-loved favorite, featuring a crew neck, short sleeves and superior airlume combed and ring-spun cotton that acts as a blank canvas for printing.* Features: Side-seamed. Retail fit. Unisex sizing.----- Toddler Shirts -----* Toddler short sleeve fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Crew neck. Tear-away label.----- Baby Bodysuits -----* Flatlock-stitched seams.* Double needle stitched ribbed binding on lap shoulder neck, shoulders, sleeves and leg opening.* Innovative three-snap closure and Side seam construction.----- Care Instructions -----* We recommend you to wash the item inside out in cold or warm water with delicate cycle and hang them to dry. Do not bleach and do not tumble dry. Do not apply iron directly on the design. Inside out ironing will make the design last longer.----- Production and Shipping -----* Processing is 1-3 days. First Class Shipping is 2-5 business days (after processing time).* If you need item the sooner, please upgrade the shipping in the chart.",
    "reviews": [
      "I can’t wait to wear this shirt, it is so 🥰",
      "Very happy with the shirts! Great communication before I even ordered, good pricing, love the quality/color and custom design turned out great. The design looks good in all my sizes ordered, from 2T to Adult Small. Seller sent a preview to ensure names were spelled correctly/layout looked good and I liked that I could select what color peeps I wanted.",
      "Very happy with the shirts! Great communication before I even ordered, good pricing, love the quality/color and custom design turned out great. The design looks good in all my sizes ordered, from 2T to Adult Small. Seller sent a preview to ensure names were spelled correctly/layout looked good and I liked that I could select what color peeps I wanted.",
      "Very happy with the shirts! Great communication before I even ordered, good pricing, love the quality/color and custom design turned out great. The design looks good in all my sizes ordered, from 2T to Adult Small. Seller sent a preview to ensure names were spelled correctly/layout looked good and I liked that I could select what color peeps I wanted."
    ]
  },
  {
    "productId": "NfEODyitTw",
    "url": "https://www.etsy.com/listing/1185684364/easter-shirt-he-is-risen-shirt-vintage?click_key=7d6929b9e809287f42b1937f5db20e15fef380c5%3A1185684364&click_sum=76afabe0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-5&pro=1&pop=1&sts=1",
    "title": "Easter Shirt, He is Risen Shirt, Vintage Easter Shirt, Shirt for Easter, Good Friday T-Shirt, A Lot Can Happen in 3 Days Shirt, Easter Gift",
    "description": "Easter Shirt, He is Risen Shirt, Vintage Easter Shirt, Shirt for Easter, Good Friday T-Shirt, A Lot Can Happen in 3 Days Shirt, Easter Gift----- How To Order -----1-) Please, check and review all the photos.2-) Choose your t-shirt size and color.*Different styles of shirts may have different shades of same color choice due to different manufacturer brands.*For this reason, we recommend you to match shirts from the same styles if you want precisely matching colors (ex. Unisex, V-necks, Toddler, etc.).3-) Click add to cart. You can go back to add more shirts.4-)Click \"Proceed to check out\".5-)When you check out, you can add a note to seller for any request.----- Unisex Shirts -----* Unisex t shirt fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Retail fit. Unisex sizing. Shoulder taping.----- Woman V-Neck Shirts -----* Fabric: Lightweight Cotton Poly Jersey.* 60% Combed Ring-Spun Cotton 40% Polyester / 30 singles, 135 grams/4.0oz.* Binding: Set-in Collar 1x1 Baby Rib with Front Cover Stitch. Side seamed.* Tear away label.----- Youth Shirts -----* This youth tee fits like a well-loved favorite, featuring a crew neck, short sleeves and superior airlume combed and ring-spun cotton that acts as a blank canvas for printing.* Features: Side-seamed. Retail fit. Unisex sizing.----- Toddler Shirts -----* Toddler short sleeve fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Crew neck. Tear-away label.----- Baby Bodysuits -----* Flatlock-stitched seams.* Double needle stitched ribbed binding on lap shoulder neck, shoulders, sleeves and leg opening.* Innovative three-snap closure and Side seam construction.----- Care Instructions -----* We recommend you to wash the item inside out in cold or warm water with delicate cycle and hang them to dry.  Do not bleach and do not tumble dry.  Do not apply iron directly on the design. Inside out ironing will make the design last longer.----- Production and Shipping -----* Processing is 1-3 days. First Class Shipping is 2-5 business days(after processing time).* If you need item the sooner, please upgrade the shipping in the chart.",
    "reviews": [
      "I do love the design and the shirt. The shirt is very soft, although it is thin. I am disappointed though that for a woman's shirt, it really doesn't give any room or give for our chest. It's actually tight in that area. I already ordered a medium that normally fits me, and this shirt did not and had to give that to my sister and then ordered a large and it really was not that much bigger in size.",
      "Item matched description. Soft fabric, good quality, correct sizing. Shipping took a little longer than expected.",
      "Exactly what I expected! Great quality and washed well!",
      "I love it, fits perfect!"
    ]
  },
  {
    "productId": "noZRAkIPOJ",
    "url": "https://www.etsy.com/listing/1174538745/custom-easter-card-egg-gift-crackable?click_key=fb8c7f7fe0cf55bb398182b3731647d7432962df%3A1174538745&click_sum=c7246464&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-6&bes=1&sts=1",
    "title": "Custom Easter Card Egg Gift - Crackable Husband Wife Easter card - Easter Gift - Unique Easter Basket Filler-  Funny Easter Egg Card Gift",
    "description": "This crackable Easter egg greeting card is the perfect unique way to make this Easter extra special! This crackable little egg makes the perfect gift for your Husband, Wife, Parent, child, or any loved one in your life.  Use in an Easter egg hunt, place in an Easter basket, or give as a special Easter gift.Birdalay is the original inventor of the \"Quail egg announcement\" phenomenon!PRODUCT INFO:🐰 Each egg is a real unfertilized quail egg that has been emptied, cleaned, and sanitized through a small hole in the bottom!🐰 Your selected note style comes inside the egg ready to be cracked open!🐰 Select from one of our 21 premade note wording options, or create your own custom note.🐰 Personalization box is ONLY for the \"Custom Note\" option. Note options 1-21 are not customizable/personalizable. Do not write anything in the personalization box unless you selected the \"Custom Note\" option or your order will be canceled.🐰 For custom notes please type your note wording into the \"Personalization\" box before adding the item to your cart.  Your EXACT written wording will be typed on the note and we will design it to make it beautiful! Please spell-check your work!🐰 If you are sending directly to recipients please check the box that says \"This item is a gift\" and include a gift note letting them know who the item is from.🐰 If your order contains a variety of eggs we will write on the bottom of each box in pencil to indicate which note is in which box🐰 Production times vary based on how many orders we have so please check our store page to see what our current production time is 😊SHIPPING:🐰 Please note that all shipping ranges given by Etsy are ESTIMATES based on the selected USPS shipping speed combined with our current production time and should never be taken as a guaranteed delivery date as the post office shipping times are not guaranteed by the post office and may vary.🐰 Post office delays are common and we do not refund for delayed packages as that is up to the post office.🐰 Each order can only ship to ONE address. If you would like us to ship multiple items to several different addresses for you, please place an individual order for each address.🐰PLEASE NOTE: The shipping label will have OUR business name (Birdalay) and address as the sender. Please keep this in mind if you decide to send it directly to the recipient. They may not know it's from you or they may google our name before opening the gift!Please feel free to let us know if you have any questions before you order.  We are friendly, enthusiastic, and we look forward to talking with you!",
    "reviews": [
      "Absolutely love!!! Super fast shipping, great customer service!",
      "A 10.perfect gift for my love",
      "Very clever & adorable addition to an Easter Basket!",
      "What a lovely and unique card gift, great packaging, fast shipping, thank you!!"
    ]
  },
  {
    "productId": "B5uCFjaECz",
    "url": "https://www.etsy.com/listing/1313629677/name-puzzles-personalized-baby-girl-gift?click_key=6dec97a2340fe961641741ddff4373b077cb3d72%3A1313629677&click_sum=5fb72e4b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-7&pro=1&frs=1&bes=1&content_source=a06954894b9631372bcd6c224b0532857ecd0e6c%253A1313629677",
    "title": "Name Puzzles Personalized Baby Girl Gift Gifts for Kids 1st Birthday Custom Baby Shower Gift Wooden Montessori Toys 1 Year Old Personalized",
    "description": "· Name Puzzle from BusyPuzzle is the Best Personalized Wooden Gifts for Kids ·· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.In 4 years, we have sold 500,000 puzzles worldwide. We have received tens of thousands of reviews and are constantly trying to improve our Name Puzzles.Most often we receive orders for Christmas and Birthdays.Our Name Puzzles are suitable not only for playing but also as decor for a nursery. Especially for this we have developed 10 color schemes.· Approximate Dimensions ·Length: 13.7 inches (35 cm)Height: 3.1 inches (8 cm)Thickness: 0.35 inches (0.9 cm)The specified sizes refer to a puzzle of 5-6 letters.The size of your puzzle will depend on the number of letters in your child's name.We will be happy to make personalized puzzles for your kids!PLEASE NOTE, that the size of puzzle was changed in order to keep same price.Over the past 4 years, we have created many other puzzles and different toys for kids, as well as Christmas Decor.We have many products that complement each other to create a special atmosphere in the baby's room.To see the entire range, go to the main page of our store:https://www.etsy.com/shop/BusyPuzzle· Have any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms and Conditions for Safe Use ·1. All kids have imagination. And we did all we can to give you a safe toy. But be careful and try not to leave your child alone with puzzles. Instead - play with your kid. Collect memories2. Please, note  If your puzzle has letters «i», «j» or number «1» we recommend you to attach it to the wooden base.PLEASE NOTE  that the BusyPuzzle name logo is engraved onto every product and cannot be removed.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "So cute! I'm happy about the outcome, very well made and high-quality. I'd recommend this shop to friends and family",
      "Love it very nice gift",
      "Good quality, but lighter and thinner than I thought. Good customer service and reasonable shipping time.",
      "Very nice quality. So happy with it"
    ]
  },
  {
    "productId": "WBpWNbuQPe",
    "url": "https://www.etsy.com/listing/956902557/personalized-toy-truck-customized-with?click_key=01fe40cdd0dbceb471ff5be8874607cec3a7305f%3A956902557&click_sum=363a4199&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-754453-1-8&bes=1&content_source=82386b3f448be98c6de0910ced0a2f3435c5fbc3%253A956902557",
    "title": "Personalized toy truck, customized with your child's name on the side of the truck: birthday, Christmas, any event for children!",
    "description": "Personalized toy truck is customized with your child's name on the side of the truck: great gift for birthday, Christmas, any event for children!  You choose the image (baseball, football, soccer, basketball and more).  You choose the colors and then tell us what name you want on the truck.How can you be sure we have the name you want?  Because we make the toy to order... ANY name!  Tell us what you'd like, and we make it custom just for your child!This is a 1/87th scale toy truck.  For an idea of size, watch the video.  Please note that this toy is intended for ages 3 and up.While we cannot promise delivery dates, I am able to ship your order within 48 hours if you need it soon.  Message me when you order and I'll get it out as soon as possible.Thank you for visiting my store!",
    "reviews": [
      "My 4yr old Autistic grandson loves trucks, cars, and trains. His favorite food is pizza so the pizza emblem on the truck along with his name is perfect! An Easter gift much better than candy!",
      "Fast delivery and cute item!",
      "I really like it but wish the truck but wish it was not plastic."
    ]
  },
  {
    "productId": "grrGdrthRE",
    "url": "https://www.etsy.com/listing/1673905579/resurrection-scene-easter-decor-he-is?click_key=83d609d5c05e22cca2fd507e6f2abbdef25bf529%3A1673905579&click_sum=c0750c6d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-10&pro=1&frs=1&bes=1&content_source=ee7e991507a678012eb476ef63b181dd6c3ae01a%253A1673905579",
    "title": "Resurrection Scene. Easter Decor. He is Risen. Wooden Empty Tomb Scene. Christian Gifts. Easter Gifts. Holiday Decorations. Handmade Decor.",
    "description": "· Easter Decor · Resurrection Scene · Christian Decor ·The wooden RESURRECTION SCENE is a great Christian decor that will be a great addition to your home on this significant holiday.The Scene is made of solid wood, which means that this decor will serve you for many years.Also it is a great Handmade Easter Keepsake for your family and friends.And with the help of engraving, you can put a wish or favorite Bible verse on the back of the rock, which will make this gift even more special.· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.· Details ·• The Resurrection Scene is made of solid wood.• There are two scene sets available:- Set 1: Basic Set.- Set 2: Full Set.See the infographic!Also you can engrave a unique text on the back of the rock.· Size ·Length: 7.5 inches (19.2 cm)Height: 4.1 inches (10.5 cm)· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Perfect! Exactly as I ordered and very high quality. Excited to display these in my home.",
      "I didn't realize the tallest piece would be four inches high, so this set was smaller than anticipated, but I found it to be even better than expected as a result. I gave one of the sets to my friends who have a four-year old son, and he loved opening the packages of the pieces and looking closely at each of them. I specifically wanted a set that would be interactive for children, and this definitely is. Wood is sanded to a soft finish, but pieces are sturdy and not at risk of breakage. It will also be terrific to use in the weeks leading up to Easter, as the pieces can be arranged to illustrate Christ in many instances of His life and ministry. Perfect touch that His hands are marked only on one side of the figure. It is beautiful, and a long-overdue addition to my home. Thank you!",
      "Thank you for your feedback, Jeslyn!\nIt made my day! We are so happy to make something special for you to become your little traditions and at the same to be a toy with a deep meaning.\nSoincerely, your BusyPuzzle team",
      "Loved it. It was just what I wanted."
    ]
  },
  {
    "productId": "vNbfUAsCfe",
    "url": "https://www.etsy.com/listing/1407026685/easter-decor-resurrection-scene?click_key=11a17dcc2404b4e576b56b60766d4bbbca7d34e9%3A1407026685&click_sum=82ebcb63&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-11&pro=1&frs=1&bes=1&content_source=369cfb04601a9f3037e639a23a8ece00c0c4c540%253A1407026685",
    "title": "Easter Decor Resurrection Scene Christian Decor Handmade Easter Keepsake Home Gift Religious Easter Family Gifts Empty Tomb Solid Wood",
    "description": "· Easter Decor · Resurrection Scene · Christian Decor ·The wooden RESURRECTION SCENE is a great Christian decor that will be a great addition to your home on this significant holiday.The Scene is made of solid wood, which means that this decor will serve you for many years.Also it is a great Handmade Easter Keepsake for your family and friends.And with the help of engraving, you can put a wish or favorite Bible verse on the back of the rock, which will make this gift even more special.· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.· Details ·• The Resurrection Scene is made of solid wood.• There are two scene sets available:- Set 1: Basic Set.- Set 2: Full Set.See the infographic!Also you can engrave a unique text on the back of the rock.· Size ·Length: 7.5 inches (19.2 cm)Height: 4.1 inches (10.5 cm)· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "The Resurrection set is well crafted, and more importantly, will be used to remind my grandchildren of the true reason for Easter. Thank you for offering such a meaningful  keepsake.",
      "This is the cutest thing. I’m so glad I ordered it.",
      "Beautiful! As described, highly recommend",
      "Looks great. Using it with children at church"
    ]
  },
  {
    "productId": "LRibPOOSaA",
    "url": "https://www.etsy.com/listing/572536849/wooden-name-puzzle-easter-gift-for-kids?click_key=60c6116353f63d1bcead8bd718bd823a4dd49c68%3A572536849&click_sum=93c475d2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-12&pro=1&frs=1&bes=1&sts=1&content_source=e8f7a677adfa09e11edbc1193df9608eaee5edd4%253A572536849",
    "title": "Wooden Name Puzzle, Easter Gift for Kids, Name Puzzles for Toddlers, Montessori, First Birthday, Baby Shower Gift, Custom Name Puzzle",
    "description": "Our personalized name puzzles make the perfect gift!A gift you love giving, our wooden name puzzles are a wonderful learning toy to give a toddler or baby for Easter, Birthdays, baby showers and as a new baby gift.  They are a fun \"just because I love you gift\" and a great way to encourage letter and name recognition.•\tFREE Shipping!•\tSuper cute gift shows you care•\tFun and educational•\tDisplay Stand available separately (see link below)Puzzles are a fun learning toy that encourage name recognition, spelling, and fine motor skills.  They are time tested and never go out of style.  Made of high quality baltic birch, our puzzles are 4.5\" tall and the length varies based on the length of the name.  The puzzles typically range from 10\" long, to a maximum length of 30\" based on the number of letters and shapes. The letters are approximately 3\" high, the perfect size to grab for your young learner.  All of the puzzle pieces are raised, making it easy to get them out and play with. We use non-toxic paint, eco-friendly ink, and a food grade non-toxic wood sealer that is child friendly.COLOR OPTIONS:  Please choose from below, or send us a message to customize with any available colorsShown on Color Options Page 1-1. Adventure:  Dark Green, Brown, Green, Spice, Dark Grey2. Mint & Navy:  Navy, Mint, Dark Grey, Light Grey3. Earthy:  Rust, Warm Sand, Peach, Spice4. Primary: Red, Orange, Yellow, Green, Sky Blue, Royal BlueShown on Color Options Page 2-5. Pink and Gold: Pink, Blush, Gold6. Coral & Mint: Coral, Mint, Blush7. Rose Dust: Rose Dust, Warm Sand, Peach8. Berry Fun: Bright Pink, Purple, Turquoise, MintThe exact colors used and order of the colors will vary from puzzle to puzzle.  The number of colors used varies based on the number of letters in a name.  Due to differences in monitors and devices, the colors may appear slightly different than shown on your screen.  If you have a specific request, please leave it in the Notes to Seller and we are happy to accommodate you if we can.  We are not able to include special characters like hyphens or apostrophes in our puzzles.  Our puzzles only include uppercase letters, without any special characters.FREE SHIPPING: We offer FREE 2 Day Shipping on most orders via UPS 2 Day Air.  In select locations that we are unable to ship UPS, such as PO Boxes, Hawaii, and Alaska, as well as rural locations without UPS delivery, we ship via USPS Priority Mail.RETURNS: We do not accept returns on customized items.  However, if you have any questions or concerns with your order, please don't hesitate to reach out.  Our number one goal is that you LOVE your order!  If we make a mistake, we will always make it right for you.CANCELLATIONS: We work hard to start work on your order as soon as possible!  Due to our quick processing time and the personalized nature of this product, we are currently unable to accept cancellations after the order is placed.  If you have any questions, feel free to reach out before placing your order. Thank you!",
    "reviews": [
      "Beautiful colors and perfect size for toddlers!",
      "Beautiful colors and perfect size for toddlers.",
      "Not only is this item absolutely perfect, well-made, and an excellent gift, the seller has their settings set so that you know every step of the shipping process and transit.  Awesome work!"
    ]
  },
  {
    "productId": "GjGQXEdpZE",
    "url": "https://www.etsy.com/listing/1188992911/personalized-puzzle-name-board-toy-gifts?click_key=eb1da60e5f1431f52763d12e6951e2c9358d8c4d%3A1188992911&click_sum=aded05d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-13&pro=1&frs=1&bes=1&sts=1&content_source=be8d8ee437f9037a433caf368db9f47ebd2f5126%253A1188992911",
    "title": "Personalized Puzzle Name Board, Toy Gifts for Baby Girls, Custom Name Puzzle for Toddlers, Custom Wooden Baby Keepsake, Baby Shower Gift",
    "description": "This well designed name puzzle will be a unique toy gift for 1-4 years old girl or boy. It's could be a great early learning toy and beautiful name board as nursery decor.As listed is a personalized wooden name puzzle with adorable animal heads. Babies could learn to spell their names and tell animals while playing with this name puzzle. Below the animals, the name of each will be laser engraved so it could also be played as a matching game.>>>> WHAT'S SPECIAL <<<<♦ Completely Colored Letters- Letters on a common name puzzle are only colored on the front side. We do far more than that. Front, back and edges of each TYU name puzzle letter will be completely colored with water-based, non-toxic inks.♦ Free Engraving- TYU will not charge you a cent when you require us to engrave a message on anywhere of the puzzle. No limit on letter quantities.♦ Free shipping to USA, Canada, Australia, UK and most EU countries. No MOQ.♦ More Choices, More Customizable- TYU provides 20 different colorful animal head options and 25 color choices for letters. Pick your favourites and make your gifts one of a kind.♦ Light Weight, Soft Touch- TYU name puzzles will all be made of linden wood which is lightweight and soft, perfect for babies to play with.♦ Safer- Laser cutting applied for all parts to make sure every piece is cut neatly and smooth to avoid hurting babies' fingers.-  Pegs are secured with hidden nails so won't fall off and bring choking hazard.Each puzzle set is 3/8 inch thick in total. Letters are 1/5 inch thick and are raised an 1/8 inch above the front of the puzzle so it's easy for a kid to play with.Want to have a look at other unique designs we have? Here is the whole section:https://www.etsy.com/shop/Tyuweddinggifts?ref=simple-shop-header-name&listing_id=790066607§ion_id=24125360>>>> HOW TO ORDER <<<<You will be required to type you requests in the personalization box when you checkout. Please write below:1)  name of the baby2) color number for each letter(check the last image for my color list)3) animal numbers>>>> TURNAROUND <<<<All puzzles are custom made made to order. Please allow 10-15 business days for delivery after ordering.",
    "reviews": [
      "Great gift for new baby.",
      "Items matched the description. Arrived on time. Will definitely order again.",
      "Second puzzle we have ordered. Customised it for us to be exactly what we wanted. Beautiful quality, speedy delivery and excellent service. 10/10",
      "Fast production and delivery! Looks great"
    ]
  },
  {
    "productId": "NjjwctEOtc",
    "url": "https://www.etsy.com/listing/1671375870/easter-gift-basket-personalized-jelly?click_key=df20104aa8db8b7873b36bda8b6ce4efff18e5fd%3A1671375870&click_sum=99d67f2a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-7&pro=1&frs=1&bes=1&sts=1",
    "title": "Easter Gift Basket, Personalized Jelly Bag, Custom Kids Straw Clutch, Egg Hunt Bag, Plastic Hand Clutch, Bridesmaid Gifts, Flower Girl Gift",
    "description": "Introducing our delightful Plastic Straw Bag, also affectionately known as the Jelly Bag, now available in three charming colors: pink, beige, and blue. This adorable accessory is not just a bag; it's a statement piece perfect for various occasions. Whether you're planning Easter egg hunts or seeking unique bridesmaid gift bags, this versatile item has you covered.Embrace the retro charm with our Plastic Straw Bag, exuding vintage vibes that elevate any outfit or event. Crafted with a foldable design, it effortlessly combines style with practicality, offering protection from small impacts while maintaining its adorable aesthetic.Measuring 9.65 inches in length, 6.89 inches in height, and 3.54 inches in width when opened, this bag provides ample space for your essentials without compromising on its compact nature. From strolling through flower-filled meadows to dancing the night away at weddings, this bag is your perfect companion, adding a touch of whimsy wherever you go.Add a pop of color to your ensemble and a dash of nostalgia to your day with our Plastic Straw Bag. Whether you're reliving childhood memories or creating new ones, this charming accessory is sure to turn heads and spark joy wherever it travels.How to orderPlease select your primary color and font choice, then write down your name request to proceed with the order.",
    "reviews": [
      "Love it! So cute and good size",
      "So cute! I can’t wait to gift it to my goddaughter",
      "This arrived within a few days of ordering. It’s exactly as described and will make the perfect Easter gift for my daughter!",
      "Quick shipping! The way that it was folded and packed into a bag caused a lot of bending so it’s wonky. Not happy but it will do the job."
    ]
  },
  {
    "productId": "jajtsMulfo",
    "url": "https://www.etsy.com/listing/1430001773/easter-dollar-bills-20-variety-pack-with?click_key=ac337525102dacba31e7a2c94ef8a96393ff904a%3A1430001773&click_sum=d7793db5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-8&frs=1",
    "title": "Easter Dollar Bills 2.0 Variety Pack with Metallic Eggs. Easter Gift, Easter Basket Stuffer. 5 Eggs Included",
    "description": "• Each $2 USD Bank Note is Genuine Authentic United States Currency Legal Tender featuring a Bunny portrait seal placed over the front of the bill covering the portrait of George Washington and creating an Easter Bunny Dollar Bill.• This US $2 Bill has been enhanced with a special and unique die cut seal process by The Easter Dollar Bill Collection. This process produces a seamless Easter Seal integration with an existing USD $2 creating an Easter collectible work of art combined with an authentic USD $2 Bill.• Each bill comes displayed in an Easter Card Currency Holder Card issued by the Easter Dollar Bills Company. This currency holderdisplays a certificate of authenticity as well as a message from the Easter Bunny.• Each USD $2 bill is brand new and in uncirculated condition.• This is the Official Easter Bunny Dollar Bill offered by Easter Dollar Bills and is part of the Official Easter Bunny Currency Collection.Help share the magic of the Easter Bunny with the giving of this unique Easter Bunny Dollar Bill and Easter Gift Card. This bill is 100% real 2.0 USD. Included with this dollar bill is an Easter card which features a sweet message from the Easter Bunny.Each package contains:1 Easter Bunny $2 Dollar and Metallic Easter Egg1 Mrs Easter Bunny $2 and Metallic Egg1 Easter Chick $2 Dollar and Metallic Easter Egg1 Easter Lamb $2 Dollar and Metallic Easter Egg1 Easter Duckling $2 Dollar and Metallic Easter Egg",
    "reviews": [
      "Grandkids loved them!! Perfect item for their Easter baskets….",
      "Great product. Cute, perfect gift",
      "Very pleased with my order."
    ]
  },
  {
    "productId": "MAfAJDCaFR",
    "url": "https://www.etsy.com/listing/1648921758/treat-all-peeps-with-kindness-shirt?click_key=4ed2462002b52920ee093e18d407b56e0d36870f%3A1648921758&click_sum=212fc382&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-9&pro=1&bes=1&sts=1",
    "title": "Treat All Peeps With Kindness Shirt, Teachers Easter Shirt, Easter Gift For Teacher, Teachers Easter Day Outfit, Teacher Bunny Shirt Gift",
    "description": "Treat All Peeps With Kindness Shirt, Teachers Easter Shirt, Easter Gift For Teacher, Teachers Easter Day Outfit, Teacher Bunny Shirt Gift▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬🎈HOW TO ORDER▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬1-) Please, check and review all the photos.2-) Choose your t-shirt size and color.*Different styles of shirts may have different shades of same color choice due to different manufacturer brands.*For this reason, we recommend you to match shirts from the same styles if you want precisely matching colors (ex. Unisex, V-necks, Toddler, etc.).3-) Click add to cart. You can go back to add more shirts.4-)Click \"Proceed to check out\".5-)When you check out, you can add a note to seller for any request.▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬🎈PRODUCT DESCRIPTION▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬UNISEX SHIRTS* Unisex t shirt fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Retail fit. Unisex sizing. Shoulder taping.WOMAN V-NECK SHIRTS* Fabric: Lightweight Cotton Poly Jersey.* 60% Combed Ring-Spun Cotton 40% Polyester / 30 singles, 135 grams/4.0oz.* Binding: Set-in Collar 1x1 Baby Rib with Front Cover Stitch. Side seamed.* Tear away label.TODDLER SHIRTS* Toddler short sleeve fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.* Features: Side-seamed. Crew neck. Tear-away label.BABY BODYSUITS* Flatlock-stitched seams.* Double needle stitched ribbed binding on lap shoulder neck, shoulders, sleeves and leg opening.* Innovative three-snap closure and Side seam construction.▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬🎈CARE INSTRUCTIONS▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬* You can simply hand wash your shirts inside out and hang dry for best results.* Wash in warm water, NOT hot. Please do not bleach, do not tumble dry, do not dry cleaning, do not iron directly on the design.▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬🎈PRODUCTION AND SHIPPING▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬- Processing is 1-3 days. First Class Shipping is 2-5 business days (after processing time).- If you need item the sooner, please upgrade the shipping in the chart.▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬🎈RETURN POLICY▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬Unfortunately, we are NOT able to accept RETURNS or EXCHANGES. This is due to our bags being made-to-order for you, and cannot be restocked. If your item is damaged or incorrectly made, please don't hesitate to message us, and rest assured that we will make it right. That is DTF PRINTS TEAM'S GUARANTEE!Thank you for shopping with us!",
    "reviews": [
      "Loved it! It was perfect.",
      "The quality is great.  There was a weird mixup with shipping payment but the seller was receptive.  The shirts are awesome though and I’d buy them again!",
      "Beautiful shirt! I bought it to surprise a friend. She loved it! Only thing is she did not find the message that I had asked to be included."
    ]
  },
  {
    "productId": "vQd7tOvU0Z",
    "url": "https://www.etsy.com/listing/927526784/personalized-easter-tic-tac-toe-bunny?click_key=1b67670dc7c848d94d04e6bf25288f4b4c4f1f84%3A927526784&click_sum=448e4c8f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-14&frs=1&bes=1&content_source=f7dc8be95bfc58a098ddb7c1d476f843ecd5dd3a%253A927526784",
    "title": "Personalized Easter Tic Tac Toe Bunny and Eggs - Easter Basket Stuffer For Kids - Easter Gift Basket - Kids Baby Toddler Basket Stuffer",
    "description": "These adorable personalized tic tac toe sets are the perfect stocking stuffer. Comes with 5 bunnies and 5 eggs. Pick any 2 colors of your choice for your game set.Set is 4.5”x5.5Made out of solid wood*Grain of wood may vary*Colors may vary from photos due to the coloration of your monitor*If no color is selected, colors will be chosen at random*NOT RECOMMENDED FOR CHILDREN UNDER 36 MONTHS OF AGETO ORDER:Put colors & name you’d like in “notes to seller” box at checkout!",
    "reviews": [
      "Thinner wood than I anticipated but cute.",
      "Thinner wood than I anticipated but cute.",
      "Thinner wood than I anticipated but cute."
    ]
  },
  {
    "productId": "eKtwuYocOE",
    "url": "https://www.etsy.com/listing/970123909/smash-egg-with-peepjelly-beans-and?click_key=a631e1ec1cc68fca4e06baea8c358a258ef9250c%3A970123909&click_sum=7a722d0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-15&bes=1&content_source=6bdebe8300360b27886574f993366fb50f697f4f%253A970123909",
    "title": "SMASH EGG with Peep,Jelly Beans, and Easter M&M's",
    "description": "SUPER POPULAR EASTER SMASH EGG filled with Peeps, Jelly Belly Jelly Beans, and M&Ms.LARGE 5 inch Milk Chocolate Hollow Egg filled with Easter candy and comes with a small wooden mallet to smash your egg and discover what's inside!!!!LIMITED QUANTITIES and WILL SELL OUT!  PLEASE ORDER EARLY TO AVOID DISAPPOINTMENT AND POTENTIAL USPS SHIPPING DELAYS.Bulk orders and wholesale welcome.We use high quality chocolate and ingredients in a state certified commercial kitchen.",
    "reviews": [
      "I sent one to my 4yr old grandson who lives 4 hrs away from me. He called me today so I could watch him break. It was Huge. Nothing but Smiles! Then he proceeded to fit as many Jelly beans in his mouth as he could lol. It arrived in perfect shape and he Loved it!! Thank you, thank you",
      "Well made & fun addition to an Easter Basket!",
      "It is very cute not too big",
      "Order was packaged well, arrived perfectly and timely. Great size...my grandson will love breaking it open."
    ]
  },
  {
    "productId": "XQMXTtCAUj",
    "url": "https://www.etsy.com/listing/1344053428/custom-name-silicone-sippy-cup-with?click_key=20b625f5ae188fbecd88c17d766fad8702ca27b2%3A1344053428&click_sum=337bfaf4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-16&pro=1&frs=1&pop=1&content_source=9e56b0347f5e89d0160643ee062364ebd69a72e2%253A1344053428",
    "title": "Custom Name Silicone Sippy Cup with Straw for Baby 6+ Months, No Spill, Personalized Engraved Toddler Training Cup - 7oz",
    "description": "This training sippy cup is made from 100% food grade silicone, comes with a no-spill lid and a gentle straw for baby teeth and gums. It’s a good trainer cup that helps baby learn how to drink from a cup, easing the transition from the bottle or breast.Custom engraving with lovely icon and name makes it a great personalized baby gift for newborns, 1st birthday, Christmas or any occasion.Express Engraving in USA★ FEATURES ★• Materials: 100% Food Grade Silicone• Cup with a Lid and a Straw• Size: 2.7 inch W, 3.65 inch H, 5.2 inch H (with straw)• Capacity: 7.1 oz / 210 ml• Color: Blue, Gray Blue, Green, Yellow, Pink, Gray, Bronze, Beige.• Available in 36 icon & 12 font options for Engraving• Dishwasher & Microwave Safe• Recommended for age 6 months+★ WHY CHOOSE US ★Premium Quality - Made from 100% food grade silicone, non-toxic, odorless and tasteless, BPA free, suitable for both warm and cold drinks. We consider the safety of babies’ drinking absolutely.Fast Free Shipping - Custom order will be processed and shipped with 1-3 business days, and should arrive in 4-6 business days.Color Me Beautiful - Find the perfect match for your toddler with eight irresistible colors that are suitable for both boys and girls.Multiple Custom Options - 36 icon and 12 font options for engraving. High precision laser engraving on the cup body, looks nice and never fade.Perfect Gift Idea - Custom engraving can transform even the most simple gift into an incredibly thoughtful one. It is the perfect baby gift for birthday, Christmas or any occasion.★ HOW TO PLACE AN ORDER ★1. Select the color you like.2. Select whether to engrave or not.3. Provide us what you want on the cup in the custom box. (Check out available fonts and icons listed in the 6th and 7th photo)4. Select how many sippy cups you want.5. Add to cart.★ PRODUCTION AND SHIPPING TIME ★✓ All products are custom, handmade, made to order.✓ Production time: 1 - 3 business days.✓ Shipping takes 3 - 6 business days for U.S., 10 - 15 business days for all other countries.★ RETURNS & EXCHANGES ★Returns on personalized product for reasons other than our error will not be accepted. Please kindly contact us with the reason of returns within 30 days of receiving your order. Returns without prior communication with us will not be accepted.Please message me with any questions. Thanks!",
    "reviews": [
      "Got it for a gift so soft. Perfect for a little one just learning to use a cup",
      "Very cute gift, they loved it",
      "The cup is smaller than expected BUT that was purely my fault. It is absolutely adorable and perfect for our 4 year old nephew."
    ]
  },
  {
    "productId": "wZtvVJVePR",
    "url": "https://www.etsy.com/listing/1171294891/custom-easter-card-egg-gift-crackable?click_key=5f00c28b143bcf7d62739eb77219595026db7f40%3A1171294891&click_sum=9f3e6617&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-17&bes=1&sts=1&content_source=9ec9a46b65527d968abcaf435b1dd726dd2c323b%253A1171294891",
    "title": "Custom Easter Card Egg Gift  - Crackable Husband Wife Easter card - Easter Gift - Unique Easter Basket Filler-  Funny Easter Egg Card - Gift",
    "description": "This crackable Easter egg greeting card is the perfect unique way to make this Easter extra special! This crackable little egg makes the perfect gift for your Husband, Wife, Parent, child, or any loved one in your life.  Use in an Easter egg hunt, place in an Easter basket, or give as a special Easter gift.Birdalay is the original inventor of the \"Quail egg announcement\" phenomenon!PRODUCT INFO:🐰 Each egg is a real unfertilized quail egg that has been emptied, cleaned, and sanitized through a small hole in the bottom!🐰 Your selected note style comes inside the egg ready to be cracked open!🐰 Select from one of our 21 premade note wording options, or create your own custom note.🐰 Personalization box is ONLY for the \"Custom Note\" option. Note options 1-21 are not customizable/personalizable. Do not write anything in the personalization box unless you selected the \"Custom Note\" option or your order will be canceled.🐰 For custom notes please type your note wording into the \"Personalization\" box before adding the item to your cart.  Your EXACT written wording will be typed on the note and we will design it to make it beautiful! Please spell-check your work!🐰 If you are sending directly to recipients please check the box that says \"This item is a gift\" and include a gift note letting them know who the item is from.🐰 If your order contains a variety of eggs we will write on the bottom of each box in pencil to indicate which note is in which box🐰 Production times vary based on how many orders we have so please check our store page to see what our current production time is 😊SHIPPING:🐰 Please note that all shipping ranges given by Etsy are ESTIMATES based on the selected USPS shipping speed combined with our current production time and should never be taken as a guaranteed delivery date as the post office shipping times are not guaranteed by the post office and may vary.🐰 Post office delays are common and we do not refund for delayed packages as that is up to the post office.🐰 Each order can only ship to ONE address. If you would like us to ship multiple items to several different addresses for you, please place an individual order for each address.🐰PLEASE NOTE: The shipping label will have OUR business name (Birdalay) and address as the sender. Please keep this in mind if you decide to send it directly to the recipient. They may not know it's from you or they may google our name before opening the gift!Please feel free to let us know if you have any questions before you order.  We are friendly, enthusiastic, and we look forward to talking with you!",
    "reviews": [
      "A very fun, high quality, and well thought out gift for anyone.",
      "The item arrived in adorable packaging!  I can’t wait to give this as an Easter gift.  Looks perfect!",
      "So COOL. Seriously a unique gift.",
      "These were GREAT! Purchased them for the kiddos Easter baskets! Exactly as described and met all expectations!"
    ]
  },
  {
    "productId": "gmygdqGmzJ",
    "url": "https://www.etsy.com/listing/1408562110/toddler-initial-hat-baby-initial-hat?click_key=51fce076b0d39fccfb132135ee4b70f6e790dcaa%3A1408562110&click_sum=2d8d05ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-18&pro=1&bes=1&content_source=8cc4cdb82581cca097c56119d58f7518a8d75de0%253A1408562110",
    "title": "Toddler initial hat, baby initial hat, baby monogram hat, toddler varsity letter hat, varsity letter hat, baby letter hat, baby  letter hat",
    "description": "This baby + toddler initial hat comes with a varsity letter. Each hat has an adjustable back strap.HAT COLORSDeep pinkBlush pinkDenimOceanCreamWhiteLETTER COLORSPink/goldWhite/goldMint/goldSIZING6-24 months (18.8in)2-6 years (20in)6-10 years (21.6in)All items ship within 1-3 business days. Initials attached via heat press.",
    "reviews": [
      "So cute! Can’t wait to see my niece wear it",
      "Great product. Exactly as pictured. Ordering another soon.",
      "Nice item very happy with the cap"
    ]
  },
  {
    "productId": "lTarLUQMKQ",
    "url": "https://www.etsy.com/listing/1174003086/easter-crosses-wood-project-for-kids?click_key=a4474eabe5ca5bf5237c100d03406000553c1ad4%3A1174003086&click_sum=ededfc67&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-19&frs=1&bes=1&sts=1&content_source=2552aa0552806c97137d95a912bcb4abc841ab66%253A1174003086",
    "title": "Easter Crosses - Wood Project for Kids - Complete Yarn Craft Kit",
    "description": "Great for the little ones in your life -- use in Easter baskets, at Sunday School, for small group crafts, or even in the classroom (no glue, no mess)! They can easily be turned into ornaments or added to wreaths.Singles -- individually bagged crafts, each with their own instructions; great for gifts and party favors.Bundles -- multiple crafts in one bag; great for in the classroom and group activities.Bundles are available in multiples of 4. Each set of 4 wooden lacing crosses includes six bright colors of 100% acrylic yarn and four plastic (kid-friendly) weaving needles! This is a complete kit, so you're ready to craft as soon as it arrives. Easy instructions and a visual is included.Many color options! Any yarn color set you choose will include 6 colors.Size: each cross is 6\" tall, 4\" wideHandmade in Sanford, Florida",
    "reviews": [
      "Such a cute item! Thank you!!",
      "Can t wait to do this crafts with my family!",
      "Just as described!  Fast Shipping!  Good Purchase!",
      "Great gift. Would’ve liked to have seen some templates for patterns to follow since I wasn’t really familiar with how to design my own."
    ]
  },
  {
    "productId": "sqYJ1kVTUP",
    "url": "https://www.etsy.com/listing/1427903064/panoramic-sugar-easter-egg-easter-gift?click_key=38184855e11f873359520f10af38e8d31610bbbb%3A1427903064&click_sum=65197571&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-10&bes=1",
    "title": "Panoramic Sugar Easter Egg Easter Gift Egg Decoration YELLOW Edible 3D Egg",
    "description": "YELLOW -  PANORAMIC SUGAR EASTER EGGThis is a fresh and edible 2024 Panoramic Sugar Easter Egg.  This Easter Egg is a buttery YELLOW.   I have been selling my Easter Eggs on Etsy since 2011 and am proud of the extra steps I take for you to enjoy them.  Once you smell this sweet smell you will be so glad you have a choice to eat it, or decorate with it for years to come (can be easily stored for years).I hand craft them one at a time using Sugar, Confectioners Powdered Sugar, Meringue Powder, Water and Food Coloring.  No two eggs are exactly the same and are so fun to look at.  Included on the inside of each Easter Egg is a handmade Bunny, Carrot, Flowers, Grass, Clouds in the Sky, a Forsythia in bloom, a Bird in the sky and a white Picket Fence with flower vines growing up the posts.  This egg measures 4\" tall x 3 1/2\" wide.Years ago when I decided I would try crafting these vintage Victorian styled eggs I wanted to change it up a little and put my own modern and whimsical twist on them.  The outside is sweet and simple with the true \"surprise\" on the inside (as you can see by the group picture of my eggs, the flower colors and arrangements on each egg vary).I am making a variety of eggs in several different colors daily, including my own unique multi-colored \"Speckled Eggs\", so check out the other eggs in my shop.  If you wish to order multiple eggs/colors please place all of the eggs in your cart, make 1 easy payment and automatically receive your combined shipping discount ($10.00 first egg with $5.00 each additional egg).This egg will arrive to you in a clear bag with a bow tied and ready to give as a gift.  If you would like me to ship as gifts to multiple addresses you will need to place a separate order for each address. Shipping to the US only.  I ship USPS Priority Mail daily Monday - Friday.  Personalizing this egg with a name in white icing will add a small fee and will delay the shipping time.  The closer to Easter the quantities may be limited so please order early.Thank you for supporting my small business and for visiting my shop!Please message me with any questions you may have.",
    "reviews": [
      "I’m so excited to share these with my niece’s!",
      "Highly recommend! Product and shipping are flawless.",
      "Arrived in perfect condition and looks exactly as shown online. Beautiful."
    ]
  },
  {
    "productId": "nkOwsJcFkG",
    "url": "https://www.etsy.com/listing/1686396921/god-says-i-am-handsome-tee-shirt-cute?click_key=765c2a4160d8c3545a2269b77665de1736a34aa0%3A1686396921&click_sum=e4799b0a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-11&pro=1&bes=1&sts=1",
    "title": "God Says I Am Handsome Tee Shirt - Cute Religious Kids Tee - God Says I Am Strong Tee - Easter Kids Gift",
    "description": "✿ Welcome to Pint Sized Premium! ✿Our goal is to bring you the cutest and trendiest designs on the highest quality onesies and shirts. All of our products are designed, printed, pressed, and shipped next business day from our Upstate New York boutique.Things to know:- Each item is handmade to order!- We carry several different brands, including Gerber Premium, Rabbit Skins, and Bella Canvas. Please see our size chart below :)- Machine wash cold, tumble dry low. To preserve the print for longer, wash inside out.- For personalized designs - enter customization in the “Add your personalization” field.- Orders ship next business day.- On a deadline? Upgrade to Priority Mail Express at checkout.✰Onesies® Brand SIZE CHART ✰0-3 Months :: 21-24 in. / 8-12 Ibs.3-6 Months :: 24-26 in. / 12-16 Ibs.6-9 Months :: 26-28 in. / 16-20 Ibs.12 Months :: 28-30 in. / 20-24 Ibs.18 Months :: 30-32 in. / 24-28 Ibs.✰ TODDLER SIZE CHART ✰18 M :: 30-32 in. / 24-28 Ibs.24M / 2T :: 32-34 in. / 28-32 Ibs.3T :: 34-38 in. / 32-35 Ibs.4T :: 38-40 in. / 35-39 Ibs.5T :: 40-44 in. / 39-43 Ibs.✰ YOUTH SIZE CHART ✰6-8 Small :: 20 7/8 in. long / 15 1/4 in. wide10-12 Medium :: 22 1/8 in. long / 16 1/4 in. wide14-16 Large :: 23 3/8 in. long / 17 1/4 in. wide**Quick Sizing Tip**White Onesies® Brand and shirts are printed on Gerber brand. The NATURAL color runs true to size, but WHITE tends to run small so we recommend sizing up if you are on the fence.—————————————————————————————————————At PintSized©, we pride ourselves on using the highest quality fabrics and kid-safe inks. All onesies® are interlocking knit 100% cotton and CPSIA COMPLIANT. Shirts are cotton or cotton tri-blend, depending on the brand used. Learn more about CPSIA standards at https://www.cpsc.gov/Regulations-Laws--Standards/Statutes/The-Consumer-Product-Safety-Improvement-Act/Our contract manufacturers and suppliers are Ethically Made / Sweatshop Free, assuring they meet our high standards for working conditions for your peace of mind, and ours as well.—————————————————————————————————————CAN’T FIND THE ANSWER TO YOUR QUESTION?If you cannot find the answer to your question, please shoot us a message. We strive to reply immediately and will do everything we can to accommodate your requests :)► We often need to reach out for more information. We write via ETSY messaging in order to keep good records, so please keep an eye on your ETSY inbox.ONESIES® Brand trademark is owned by Gerber Childrenswear LLC",
    "reviews": [
      "I absolutely love the onesie and t-shirt I received for my grandchildren.  There was a slight issue with my package getting sent overseas by mistake (postal service mistake NOT the seller).  I contacted the seller and a replacement was immediately shipped out.  Excellent customer service.",
      "I love it, thank you so much.",
      "Item matched description and perfect quality"
    ]
  },
  {
    "productId": "NRWUToObib",
    "url": "https://www.etsy.com/listing/1182261074/easter-bunny-real-currency-gift?click_key=d9e34d33f7cbee5138847d5914e4ee3cefef03aa%3A1182261074&click_sum=b0c5ff11&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-12&frs=1&bes=1",
    "title": "Easter Bunny  Real Currency Gift",
    "description": "Kids of all ages love these fun dollars! They are real, spendable US currency that have been made especially for the Easter Bunny with special seals placed over Thomas Jefferson on a new, crisp US $2 bill.  They are legal tender if your child absolutely has to spend it (you can take the seal off, if necessary) although most kids tend to keep theirs. They each come with in their own gift envelope.Decals and envelopes also available if you want to use your own $1 or $2 bills. The price shown, minus the currency. Message me to place an order.If you have a big order, please contact me to make sure we have the number of bills you need available. Currently only $2 bills are available, however the seals will fit on $1 bills as well.I ship these for free USPS first Class without tracking for orders under $25. Please upgrade shipping if you want tracking.",
    "reviews": [
      "It looks exactly how it does in the picture my daughter is going to love it",
      "Just what I was looking for!",
      "I am VERY PLEASED with my purchase!  The customization of the bills is amazing and excellent quality!! I will definitely buy again from this vendor. 👍👍👍👍👍",
      "Adorable and great quality! Thank you so much!"
    ]
  },
  {
    "productId": "lQxBAoXTVX",
    "url": "https://www.etsy.com/listing/1499040405/personalized-toddler-hatpersonalized?click_key=a8a774ed928cb7057a21af3be092d30ee8b4a4cd%3A1499040405&click_sum=e96b1729&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-20&pro=1&pop=1&content_source=d16b2d163af222dde398744c2db5b57490ef9e46%253A1499040405",
    "title": "Personalized Toddler Hat,Personalized Infant Hat,Leather Patch Hat,Kids Baseball Hat,Signature Hat,Gift For Baby,Baby Snapback Hat,Youth Hat",
    "description": "A personalized rectangle leather patch hat is a stylish and cute accessory. The hat is adjustable, with a snap closure at the back, The material behind the hat has mesh and regular models to choose from, which can meet different needs, ensure a secure and comfortable fit on the head.The hat's defining feature is a rectangle leather patch affixed to the front of the hat. This patch can be personalized with your and baby's name.Product Details:Material: Leather Patch, Cotton, PolyesterProcess: Laser engravingHat color:White, Gray, BlackSize:S: 18.8-20.5in/48-52cm, kids from 9 months~6 years oldM: 20.5-22.8in/52-58cm, child from 6 years old~12 years oldL: 22.8-24.4in/58-62cm, adultHow to order:1. Choose the size and style of the hat.2. Select the font you want to customize, you can also choose not to customize the name.3. Leave the name you want to customize in the customization box. If you choose not to customize, please ignore it.4. Select the quantity.5. Add to cart.Please allow 1-2 weeks for production, followed by 1-10 business days for shipping. Feel free to reach out if you have any questions or specific requirements.Thank you for visiting our shop!Note: Before placing your order, kindly double-check the accuracy and completeness of the customized information. Incorrect or incomplete details may impact the production and delivery of your hats.",
    "reviews": [
      "Super cute hat! I love that it's adjustable too",
      "Quality product and fantastic customer service",
      "Great great great great great"
    ]
  },
  {
    "productId": "epSPTBitLU",
    "url": "https://www.etsy.com/listing/1010272742/personalized-embroidered-name-wee?click_key=87e3d1d538136fc72c228d28d21a1fbff5a35417%3A1010272742&click_sum=9441cc6c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-21&bes=1&sts=1&content_source=b1d4ce99e04309140c6077971f5c696c8564082b%253A1010272742",
    "title": "Personalized Embroidered Name Wee Nibbles Bunny",
    "description": "Embroidered Name Tiny Nibbles BunnyThese beautiful bunnies are super soft and make wonderful gifts for all ages, from babies to adults. Larger sizes are available in separate listings by color.The tiny nibbles are the same size & quality as the former wee nibbles.These Tiny Nibbles are from Bunnies By The Bay. A company based in the United States that started making these beautiful bunnies in 1986.They are 8 inches tall from the tops of their heads to the bottom of their feet.They are available in many colors.Their eyes and noses are embroidered so there are no loose parts.They are made with 100 % polyester, bottom stuffed with plastic pellets. Spot clean only.Non toxic stabilizer: Sulky topper, Floriani fusible tearaway, and permanently finished with ironed-on Sulky tender touch for sensitive skinFloriani color stay embroidery threadsPersonalization: Name, Birthdate, Christening, Baptism, Bible VerseBoth ears may be embroideredSelection: Exact spelling of name needed, font and thread choices (one color for name). Please specify the ear for the name and the date or Bible verse. You may have one or both ears embroidered. You may have a different font for the name vs the dateColors: white, cream, black, dark gray, silver, dark brown, brown, gold, orange, golden yellow, yellow, peach, hunter green, green, light green, navy, blue, teal, sea glass, baby blue, dark plum, purple, lavender, light purple, red, wine, magenta, mauve, pink, baby pinkIf you have your own idea or any questions please contact us before ordering. I will try my best to make the perfect bunny just for your recipient. Please look for an email from me as I will ask for a confirmation before embroidering your order!Embroidered in my home that is smoke and pet free. Will be displayed in a cello bag with a ribbon and shipped USPS with tracking.A gift? Let me know! I will gladly provide a notecard and ribbon for gifting.Questions? Please email me before or after your order and I will be happy to assist you with your questions!Embroidery artist: me, Poppy Threads Studio.Notice: Color will vary based on your computer screen settings and lightingPoppy Threads Studio is a firm believer in charity and the responsibility of caring for our neighbors. A portion of each sale will go to:Sew Powerful and their 3 Esthers Farm, Africa, to learn about their mission, please visit https://www.sewpowerful.orgAmazima Ministries, Africa, to learn about their mission, please visit https://amazima.orgThank you for visiting Poppy Threads Studio!",
    "reviews": [
      "Great to work with! Pride in her product! Would highly recommend",
      "Casey was so patient with me.  I'm so grateful.  ❤️",
      "Cutest little bunny with wonderful embroidery. Very happy with purchase!",
      "Cutest little bunny with wonderful embroidery. Very happy with purchase!"
    ]
  },
  {
    "productId": "ftccWeTbWQ",
    "url": "https://www.etsy.com/listing/1543020920/personalized-kids-nylon-fanny-pack?click_key=1d413c236b9a1f89e6e2b9ee0b8c3c81bd04bf75%3A1543020920&click_sum=bafb024a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-22&pro=1&bes=1&sts=1&content_source=6f6b3e7a3f9758dd3e764a3af715f8a47ec6220b%253A1543020920",
    "title": "Personalized Kids Nylon Fanny Pack | Chenille Letter Patch Fanny Pack | Custom Kids Belt Bag | Kids Mini Fanny Pack | Crossbody Patch Bag",
    "description": "Personalized Kids Nylon Fanny Pack | Chenille Letter Patch Fanny Pack | Custom Belt Bag | Kids Mini Fanny PacksHands free is the way to be with our cute kids nylon fanny packs! These adorable fanny packs make a great birthday or holiday gift!KIDS NYLON FANNY PACK:• Nylon and polyester material• Available in  lilac, hot pink, light pink, tie dye + white• Wear as a fanny pack or crossbody belt bag• Gold accent zipper & buckleDEMINSIONS:• Bag size: Kids size: 9.5” x 4” x 2.5” | *models in pictures are 6 and under*",
    "reviews": [
      "excellent gift!!! she loved it.",
      "Great gift for my 4 year old niece she loved it",
      "Lovely the girls will love."
    ]
  },
  {
    "productId": "RqWLQIGTcE",
    "url": "https://www.etsy.com/listing/1472709701/floral-daisy-girls-personalized-name?click_key=e4ea766be691f61515160f598fedd480a1356bd7%3A1472709701&click_sum=6accac48&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-23&pro=1&bes=1&content_source=fb588126d1ef25add353dd2c668ef40030cbce6d%253A1472709701",
    "title": "Floral Daisy Girls Personalized Name Sunglasses | Toddler Gift | Kids Gift | Babies Gift | Baby Girl Personalized Birthday Gift Sunglasses",
    "description": "Personalized/Custom Kids Sunglasses⚡ This listing is for a single UV 400 Lens Kids Sunglasses.ESSENTIAL DETAILS♦ Handmade Item♦ Black Letter White Beads♦ Gender: Unisex, kids sunglasses♦ Style: Kids Sunglasses♦ Age: 6 month - 8 Year Baby & Children♦ Lenses Optical Attribute: UV400♦ Frame Color: Multi Color♦ Function: Eye Protection♦ Case: Included📏 Size:Lens Width: 51 mmLens Height:49mmTotal width:127mmNasal Distance:11 mmTemple length :128 mm📌 ADULT SUPERVISION HIGHLY SUGGESTED FOR KIDS UNDER 3 DUE TO BEADS AND CHARM (CHOKING HAZARD)✨How To Order- Choose your Color from Options.- Choose your Charm Color.- Enter Your Personalization:📌 (Please double check your personalization to be sure, your name spelled correctly)📌 The maximum characters limited with 12 letters for each sunglasses.✨ IMPORTANT NOTE: Since each sunglass is custom made with your personalization, all sales are final and no refunds will be issued.YOUR CUSTOMER SATISFACTION is our PRIORITY. Please reach out via ETSY messages if any product arrives damaged or with any problem.We are here to resolve your problem immediately!🌞 This Custom Personalized sunglasses Perfect for a Summer Vacation , Beach, Birthday Gift, Easter Gift, Christmas Gift, Baby Showers or Party and photoshoot.Thank you for shopping.",
    "reviews": [
      "SUPER fast shipping! Perfect Easter basket gifts - thank you!",
      "Exactly as pictured , thank you!",
      "LOVE LOVE LOVE these!! Cant wait for our girl to wear them!"
    ]
  },
  {
    "productId": "tBk0BdaBIL",
    "url": "https://www.etsy.com/listing/1433578487/3-organic-stuffed-bunnies-in-carrot-zip?click_key=179d59d952c3663f2d260c3fe842fb3a6c0549b6%3A1433578487&click_sum=8d5ac298&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-24&pop=1&sts=1&content_source=27507b6f8608e9c1cc6acc99e1dda27193eaea00%253A1433578487",
    "title": "3 Organic stuffed bunnies in carrot zip purse, Bunny Easter, Bunny toy, Home decor, White bunny plush, Children's gift",
    "description": "☆★ Please take your time to read shop policy, item descriptions before making a purchase.EXPRESS SHIPPING 4-6 DAYS TO THE US ?BUY SHIPPING UPGRADE $11.90 > Clink >https://etsy.me/3TC6bfOListing of 3 bunnies in carrot zip purse.Cute bunny set is a great addition to your Easter decor or decorate your room. It will be a perfect Easter gift! Our bunnies are made with organic cotton and the inside is filled with hypoallergenic fiber filling.【Size】Carrot : 8\", Bunny : 2.5\"【Color 】White, grey, brown【Material】Organic cotton, cotton ✂【Gift】If you are looking for a gift, PLEASE buy a gift wrap(See Gift wrapping details)【Care】It is recommended to wash only by hand, with mild detergents, dried naturally.-----------------------------------------------------------------------✈ Ship worldwide by Fast-ship.co Mail Standard / Thailand post / PostNL / Asendia / USPS✈-- Instant tracking-- We ship Mon-Fri (ex. Holidays)-- To USA : Fast-ship.co Mail Standard via USPS mail service system : Estimated time delivery 9-14 days-----------------------------------------------------------------------➽ UPGRADE TO EXPRESS SHIPPING ➽-- Make your selection on the Shipping Method page✈ESTIMATED DELIVERY TIMES✈-- USA: 3 - 5 business days-- EU: 3 - 5 business days-- Canada: 4 - 6 business days-- Australia + New Zealand 4 -7 business days-- The rest of the world: 3 - 5 business days➽CONTACT PHONE NUMBER is required for including on the shipping label and courier delivery purpose.Please leave your phone number / note when you place an order.➽ PLEASE NOTE that the delivery is not available to P.O. Boxes. The area that appears \"Remote area\", an additional delivery fee will be charged.------------------------------------------------------------------------📷 The picture was taken in natural light.💻 Product color may slightly vary due to photographic lighting sources or your monitor settings.✔️ Any questions *Message seller* ✉🇫​​​​​🇦​​​​​🇨​​​​​🇪​​​​​🇧​​​​​🇴​​​​​🇴​​​​​🇰​​​​​Animal gift idea : https://www.facebook.com/tanmadeshop----------------------------------------------------------------------✔️ Please note : You may see the same type of product from the same source. But what a different is the sewing, hand stitching and quality of materials and workmanship. Products in my store are produced in the family and it is through the process of checking on my own. This is why I can guarantee that you will get good quality products from TanMadeShop : Cotton is naturally dyed and bleached to give the color of the bark. Therefore, the dark color of some rolls of fabric may be distorted from the color in the picture.----------------------------------------------------------------------❤ CUSTOMER REVIEW/FEEDBACK ❤★★★★★This is seriously the cutest thing I’ve ever seen in my life. It took a long time to get to me but it was so worth it. It is so well made and just like the pictures. Thank you so much for making my bunnies!! And nothing excited me more than seeing that elephant key chain! What a bonus! Thank you!★★★★★Another great item. My daughter adored the little bunnies in the carrot sack. Good quality and company went out of their way to be helpful and to get everything needed. Would really like to do business with them again!★★★★★Very nice, the baby I got this for loved the carrot and bunnies. She learned how to zip and unzip quickly. Great educational toy.★★★★★Tan does beautiful work. The stuffed animals in their little pouches are adorable and really well made. Tan went above and beyond with customer service as well. I let Tan know that I was hoping to give these as gifts at a specific time so Tan specifically dropped them off at the airport post office to cut down on shipping time. Communication was excellent as well. I will definitely purchase from Tan again!★★★★★SO adorable!! Love love love them! Fast shipping and thank you for the extra keychain★★★★★Very nice, the baby I got this for loved the carrot and bunnies. She learned how to zip and unzip quickly. Great educational toy.★★★★★Love these so much. The work is incredible. My niece is going to love it! Very pleased with purchase. Looks exactly like picture. Thanks★★★★★These cute bunnies arrived over a week earlier than expected! They are very high quality and beautiful, exactly as shown in the photos! My sister said the quality is superb!! Communications with the seller were very professional and easy. Incredible craftsmanship, also the packaging was beautiful and he even included a little cute elephant key chain, \"thank you\" gift for ordering. It trully deserves a 5 stars *****",
    "reviews": [
      "Arrived sooner than expected and my  granddaughter absolutely loved it!",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone! Ratcha...",
      "The bunnies are so cute, and they nestle perfectly inside the carrot!  Shipping from Thailand to the U.S. was much faster than I expected (always appreciated). This set will be a great addition to my great-granddaughter’s Easter basket this year!",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone! Ratcha...",
      "Cute and perfect!",
      "Thank you so much!!",
      ". . . . .",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone.If there’s anything else I can do to make your visits even more special, please don’t hesitate to let me know. Warmest regards, Ratcha."
    ]
  },
  {
    "productId": "cidnJwxCtm",
    "url": "https://www.etsy.com/listing/758294994/easter-pysanky-set-10-ukrainian?click_key=60795672aa3540b39c8a8ae8dc7a8c7cbf414b5d%3A758294994&click_sum=49711383&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-25&bes=1&content_source=c63d0779b73a379f88914698564d99588c0b8374%253A758294994",
    "title": "Easter pysanky, Set 10 Ukrainian traditional wooden eggs, Hand painted ornament eggs, Ukraine souvenir and gift for Easter",
    "description": "Ukrainian wooden eggs. Easter pysanka handmade. Traditional Ukrainian ornament. In a set of 10 pcs.A wonderful gift for Easter.Eggs are not intended for small children.Have a real size chicken egg.Eggs made in Ukraine.Dimensions: 2/56 inches (6.5 cm)The size and color may be slightly different, because it is handmade. Each egg is individual.Ukraine sellerSee other Easter eggs in my store:https://www.etsy.com/shop/VintageOldStore?ref=seller-platform-mcnav&section_id=25393927See other vintage interesting items in my store:https://www.etsy.com/shop/VintageOldStore?ref=sellerPlease note! Parcel will go to you depending on your location.- USA: 2 - 4 weeks- Canada: 2-4 weeks- Australia, New Zealand and Oceania:: 3-6 weeks- Europe: 2-4 weeks- Japan 2-3 weeks",
    "reviews": [
      "Absolutely gorgeous! These are so beautiful. Very high quality. I have them in a bowl and get so many compliments on them.",
      "Beautiful workmanship. I love them. Very special ❤️",
      "Item is lovely and arrived quickly."
    ]
  },
  {
    "productId": "JKOlVNdTwE",
    "url": "https://www.etsy.com/listing/1666910566/easter-gift-for-adult-easter-basket-for?click_key=e9b1ac4e5d0bfd2de8210936230df0002e7d9aba%3A1666910566&click_sum=7b020614&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-13&pro=1&frs=1&sts=1",
    "title": "Easter Gift For Adult  | Easter Basket For College Student | Unisex Easter Care Package | Easter 2024",
    "description": "Happy Easter 2024!! Get ready to indulge in the ultimate Easter treat with our all naturally made, handcrafted adult care package gift. Perfect for gifting to college students, friends and/or family,  this gift is filled primarily with \"no calorie\" treats that everyone (unisex!) can enjoy...BUT just incase you have a little sweet tooth - choose between milk or dark chocolates to sweeten the deal even further.☆4 Piece Gift Care Package includes:1 x Organic Soap (5oz) - BALANCE: Rosemary•Mint•Fir1 x Organic Lip Balm (0.15oz) - Vanilla & Rosemary1 x Organic Solid Lotion Bar - Lavender•Peppermint•Orange•Patchouli (3oz)1 x Chocolate is like a Hug inside packet  (6piece: pick Milk or Dark Chocolate)FREE SHIPPING☆GOOD TO KNOW:No NastiesHandcrafted items!No Palm OilNo Parabens or SLSNo Synthetic Colors or Fragrance╰☆╮Thank you for shopping with usMADE IN THE SHADYNaturally Crafted products in Shady Valley, Tennessee",
    "reviews": [
      "I got these for my adult children for Easter. So carefully curated and classy. Shipped very quickly!",
      "Smells amazing, brought so much joy to the parents to be",
      "Outstanding! Ordered as a gift, and received a shipping notification within the hour! Recipient loved the gift. Thank you!!"
    ]
  },
  {
    "productId": "EvsoRAgxvx",
    "url": "https://www.etsy.com/listing/1598385942/personalized-bunny-doll-babyshower-gift?click_key=81e2cfb44d2976ebfddc18343addca60545f0e10%3A1598385942&click_sum=ff5bfcc0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-14&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Bunny Doll | Babyshower Gift | Custom Rabbit Toy for Newborn | Easter Kids Present | Personalized Doll Rabbit Gift | Newborn",
    "description": "🌟🐇 Welcome to a world of cuddles and custom delights with our Personalized Bunny Dolls! 🎁✨🌸 Looking for that extra special gift for a new arrival or a memorable keepsake for your little one?Our handcrafted, super-soft plush bunnies are just the answer!✨ Whether it's for a surprise, a baby shower delight, or a heartfelt Easter gift, these adorable bunnies are designed to spread joy on any occasion.🎀 Each bunny is meticulously crafted with love, boasting a delightful size perfect for cuddles and exploration by tiny hands. Made of premium cotton filling and the softest plush fabric, these bunnies promise a comforting companion for your little darling.🌈 What sets us apart is our commitment to personalization!🌟 With professional-grade HTV, we skillfully customize your bunny's left ear with a name and font of your choice. Simply choose from our font styles.⚠️ ⚠️ ⚠️ The name is not embroidered on the ear.🎨 Our customization options ensure that each bunny is uniquely tailored, making it a standout addition to your little one's world. Plus, we pack these adorable companions in an elegant organza gift bag, ready to be presented to your precious one!📦✈️ Ships next day.🌸😍⚠️ Please note, due to the nature of personalization, we're unable to accept returns unless an error occurs on our part. So, please double-check the spelling and details before finalizing your order.💌 We're here to make your experience delightful! If you have any queries or desire a custom creation, don't hesitate to reach out. Your satisfaction is our priority!🌟 Thank you for choosing our small business to create cherished memories for your little ones.🌟🐰✨ From cuddles to cherish forever, our personalized bunny dolls are here to make every moment magical.🌟🐰✨ The height of the bunny is about 15\" (40 cm).All listing:https://www.etsy.com/shop/GondwanaDesignThank you for visiting! ❤️Personalized Baby Girl's Gift - A Unique Rabbit Doll, Tailored for Her, Celebrating Special Moments with Customized Name, Perfectly Crafted for Newborns - Personalized Bunny Doll - Crafted for Your Baby Girl, Long-Eared Plush Bunny Toy, Softness Meets Personalization in Pink Nursery Decor",
    "reviews": [
      "The Bunny is adorable! Fast shipping and gifted in a nicely organza bag with a custom made tag. Can’t wait to give this to my niece first Easter! Thanks ~",
      "Love it will buy again",
      "As described…perfect for my granddaughter’s first Easter! Thank you so much!",
      "Sooo cute my grand daughter will love it"
    ]
  },
  {
    "productId": "IfkBnNLKEC",
    "url": "https://www.etsy.com/listing/1688994305/personalized-2024-easter-squishmallows?click_key=7609861f44e4506c5d505a301bcc5ad35e982054%3A1688994305&click_sum=89a81eab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized 2024 Easter Squishmallows Custom Name Plush, Unique Easter Gift, Easter Basket, Easter Plush, Easter Basket Filler",
    "description": "Introducing our personalized 2024 Easter Squishmallow plushies — the perfect gift for anyone who loves a touch of cuteness and sparkle in their life!Each plush is super soft and huggable, making it the perfect companion for anyone who needs a little extra comfort and love. But what really sets these Squishmallows apart is the ability to add a personalized touch with our high-quality glitter vinyl.Our personalized name Squishmallow plush is the perfect gift for any occasion or just a little something to show someone you care. And because each plush is made to order, you can be sure that your gift will be unique and special.So why settle for a generic gift when you can give something that's truly personalized and special? Order your personalized Squishmallow plush made with high-quality glitter vinyl today and bring a smile to someone's face!🌟 All Squishmallows are Brand New and have all their original tags.🌟 All Squishmallows are personalized with heat transfer vinyl, we do NOT offer embroidery.🌟 When adding your personalized name, be sure to double check the name to insure the spelling is correct.🌟 The longer personalized name is, the smaller the font will be to fit proportionally to the plush. All names will be placed on the belly of the plush, unless noted otherwise.🌟 If you do not wish to add a custom name and just want the Squishmallow plain, please select \"No Personalization\" in the Color menu and enter \"N/A\" into the Personalization box. The cost will be the same as if you were to get it personalized.Note — Different computer monitors may cause the colors to vary slightly from the picture shown.Returns are not accepted on personalized items, but if there is an issue please contact us. We will help you best we can.Check back periodically as we get new styles often!Thank you for your interest. Please feel free to contact us with any questions!",
    "reviews": [
      "Super cute! Can’t wait for my daughter to see it!",
      "Quality was great. Great product!",
      "Quality is great. Great product!"
    ]
  },
  {
    "productId": "wMX9PBsiUG",
    "url": "https://www.etsy.com/listing/1186601022/easter-basket-bunny-name-tag?click_key=8c6fe58ede8fe91e59dcd2bbbcaa155cb3020d40%3A1186601022&click_sum=1c97e34d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-26&bes=1&sts=1&content_source=91e1bdd9158891316608c6c4ceaa01bd50fa463c%253A1186601022",
    "title": "Easter Basket Bunny Name Tag / Personalized Wood Accessory for Spring / Custom Gift Tag Decor for Boy, Girl, Grandkids",
    "description": "A cute wooden Easter basket decoration for your little bunny(ies). Personalized name is laser engraved on each piece and tag is hand-sanded for a unique and rustic touch.Bunny size: 5\" x 2.75\"",
    "reviews": [
      "Super cute, great quality, it looks like the picture.",
      "Please with the product I received.",
      "Please with the product I received.",
      "The tag came out so cute and is the perfect  size!"
    ]
  },
  {
    "productId": "ZXYOFOsAHl",
    "url": "https://www.etsy.com/listing/1668689665/childrens-personalised-sunglasses-0-8?click_key=83ff96792185c1a27b6d812d69a469a3d27dea89%3A1668689665&click_sum=1a995a09&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-27&pro=1&bes=1&content_source=571164b6e5912a657d1d3320759cee06498be61b%253A1668689665",
    "title": "Children’s personalised sunglasses 0-8 years UV400 | party favours | Easter egg hunt gift | Easter basket filler | flower girl birthday girl",
    "description": "Fun customised sunglasses suitable for ages 0-8 years. UV400 sun protection.Perfect as an Easter gift / Easter egg hunt gift / birthday gift / party favour, the list is endless.Please kindly note that flower colours include one large white daisy, small pastel pink, cream, peach, pastel blue, lilac or deep pink flowers. If you select the flower and name option, please kindly note that flower colours will be chosen at random unless colours are specified in the personalisation box.The main designs include dinosaurs, unicorns, mermaids, flowers, strawberries, flamingos, however we are happy to design as per your design requests and we have many other charms!",
    "reviews": [
      "Lovely gift for my granddaughters",
      "My little girls loves them",
      "Perfect for my niece! Thank you :)"
    ]
  },
  {
    "productId": "ahwZuikgA0",
    "url": "https://www.etsy.com/listing/1184757681/personalised-easter-gift-bunny-i-first?click_key=562e16543935274a234864ca8a855a9bfe04e5a2%3A1184757681&click_sum=2efb1670&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-28&bes=1&content_source=9eac7570f762e9ee504c72956bc10da2775fd9f5%253A1184757681",
    "title": "Personalised Easter Gift Bunny I First Easter, Baby Easter keepsakes, Easter Teddy, Soft plush rabbit toys Baby girl boy 1st, Rabbit",
    "description": "These personalised bunnies are perfect the perfect gift for your little one this easter. Each toy in premium quality and ultra-soft will create a big smile. An amazing gift and keepsake for your daughter, nephew, granddaughter.--- DIMENSIONS ---Each bunny is roughly 24cm's tall.--- HOW TO ORDER ---1. Choose the colour of rabbit you would like,2. Choose the rabbits coat colour for the design,In the personalisation box please specify the following:3. The name you would like on the item.--- PERSONALISATION ---Personalisation will be printed exactly as entered on ordering, please ensure that all details are correct before checking out with your order.--- DISPATCH & DELIVERY ---Dispatch times vary depending on the product. Each listing will show an accurate dispatch time prior to purchase. We are unable to refund or cancel orders due to a buyers problem with dispatch time as we must reiterate this is advertised prior to purchase. However, we will always endeavour to get products our as quickly as possible. If you are ordering with a particular occasion or date in mind, we ask you to message us prior to ordering so we can let you know if it will be possible to fulfil your order in time. Changes to dispatch time must be confirmed in writing before an order is placed, we cannot accept any requests following an order being made.We may extend the dispatch time of your order following your purchase if we have stock shortages. Where this is the case we will always inform you as quickly as possible and give you the opportunity to cancel your order.Dispatch times do not include time for postage, this is additional and dependant on the service you select.The services we offer for this product are:Standard - 2-3 working daysExpress - 1-2 working daysWestern Europe - 2-5 working daysRest of Europe - 5-10 working daysUSA & Canada, Far East and Australasia - 5-10 working daysRest of the World - 5-14 working daysWith all of our tracked deliveries you will receive a dispatch notification which includes your tracking information so you can follow your parcel straight to your door.--- DISCLAIMER ---Actual colours may vary. This is due to the fact that every computer monitor has a different capability to display colours and that everyone sees these colours differently. We try to edit our photos to show the samples as life-like as possible, but please understand the actual colour may vary slightly from your monitor. We cannot guarantee that the colour you see accurately portrays the true colour of the product.-- RETURNS ---I am happy to refund any unused item that is still saleable, this does not include personalised, custom-made products. Please contact me within 14 days if there are any issues with your item.Return Address:Tweedside Design Co. Ltd1 Enterprise Court,Northumberland Road,Berwick Upon TweedTD15 2AS--- KEEP UP TO DATE ---Check out our shop for everything you need for more gifting ideas from mugs to totes, drinkware, hoodies and more!Join the party on Instagram for giveaways, discount codes and see the products in real life! Tag us for a chance to be featured!@tweedsidedesignco",
    "reviews": [
      "A lovely bunny. Very pleased. Customer service was fab. Very helpful.",
      "Lovely gift - soft and personalisation is delicate and subtle just as we wanted",
      "My order arrived and was incorrect I contacted the seller who replied within minutes to apologise and would get the correct order sent out. \n\nThere is was a little delay in me receiving my replacements however when I did they were just perfect exactly what I wanted.\n\nI would definitely recommend this seller.\n\nThank you.",
      "My order arrived and was incorrect I contacted the seller who replied within minutes to apologise and would get the correct order sent out. \n\nThere is was a little delay in me receiving my replacements however when I did they were just perfect exactly what I wanted.\n\nI would definitely recommend this seller.\n\nThank you."
    ]
  },
  {
    "productId": "RhiKAuXh1b",
    "url": "https://www.etsy.com/listing/952908676/peter-rabbit-personalized-easter-basket?click_key=c213b3a4ccc926701aaa2491e1dc3b8870ac166c%3A952908676&click_sum=cd4506af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-29&bes=1&sts=1&content_source=11e108d97aad2b618749e3ba213c5c38f35ecbaa%253A952908676",
    "title": "Peter Rabbit Personalized Easter Basket Liner • Custom Easter Basket Liner • Monogram • Easter Basket Liner for Boy or Girl | Peter Rabbit",
    "description": "PLEASE READ FULL DESCRIPTION BELOWD E T A I L S•  Universally Sized Basket Liner {LINER ONLY - Basket NOT included}•  Drawstring Ties Allow Basket Liner to Fit a Wide Range of Baskets•  Liner will come as it appears in the listing photos•  TWO Fabric Options•  All items are designed and hand-crafted with you in mind! Because each piece is carefully handmade there may be some slight variations in color and design which only adds to the charm of each item that has been hand-crafted just for you!F A B R I C•  Natural  - Cotton/Linen Blend.  Natural Oatmeal/Beige Color. {White Twill Side Ties}•  White - 100% Cotton Canvas. Bright White. {Gray Twill Side Ties}S I Z I N G•  Fits various sized baskets UP TO 15.5\" in diameter and 7\" deep. I can not guarantee it will fit any baskets OVER this size.B A S K E T S   S H O W N•  Seagrass Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/seagrass-easter-basket/?catalogId=15&sku=3507626&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=3507626&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH-qO6dBOmhvrNEEv09mWjJeMaCXeZtNPW4wls6mXnTk5b4giOmYkOgaAiOfEALw_wcB•  Sabrina Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/white-sabrina-easter-baskets-spring18/?catalogId=15&sku=4155920&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=4155920&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH82GuR7NHjjabfj7G-Y4bx2Z_VyDtdUdIuAI-R3Jhf6WgAxT_9fl_kaAiWTEALw_wcB•  Isabella Basket from World Market {Large}https://www.worldmarket.com/product/large-white-oval-isabella-basket.do?sortby=ourPicks•  The smaller the basket the more gathered liner will be. The drawstring ties allow you to simply adjust the gathers where you want them so the print is visible.P R O D U C T I O N  •  T I M E•  All items are made to order - please allow 5-10 business days for your basket liner to be made.  If you need your order rushed, please add this listing to your cart.https://www.etsy.com/listing/212337977/rush-your-orderC A R E•  Spot cleaning or hand washing is recommended. Lay flat to dry. Iron as needed. Do not bleach.R I B B O N  •  C O L O R•  The ribbon color shown in this listing is white or gray depending on the fabric you chose. If you would like to change from the default ribbon color please add this listing to your order and select your color choice in the drop down menu.https://www.etsy.com/listing/674477120/easter-basket-liner-twill-ribbon-color?ref=listings_manager_gridI N K  •  C O L O R•  The font color shown in this listing is gray•  We offer a variety of color options if you would like something other than gray! If you would like to change the color of the text or graphic, please add this listing and select your color choice in the drop down menu.https://www.etsy.com/listing/469936976/choose-your-coloradd-to-any-listingS H I P P I N G•  All my items are shipped via USPS. Please allow 5-9 business days for delivery. International shipping can take longer.F O L L O W  •  U S•  Instagram: www.instagram.com/porterlanehome and don't forget to tag us with your new Porter Lane Home items! We love to see your photos!•  Facebook: www.facebook.com/porterlanehome•  Pinterest: www.pinterest.com/porterlanehomeQ U E S T I O N ?•  Don't hesitate to send me a message if you have any questions.",
    "reviews": [
      "Beautiful product. Babies first Easter will be amazing :)",
      "Beautiful! This is our sixth one purchased and they’ve all been perfect.",
      "It made a nice gift"
    ]
  },
  {
    "productId": "UcyePeZgOF",
    "url": "https://www.etsy.com/listing/1413946821/easter-egg-tokens-easter-hunt-game-for?click_key=b6b91b340868ff661379b730dfeb0dfab5ca5390%3A1413946821&click_sum=e2f5770e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-30&pro=1&bes=1&content_source=35699a79d92f7ebf77801a13fda499300bf6c054%253A1413946821",
    "title": "Easter Egg Tokens, Easter Hunt Game For Kids, Reward Tokens, Children Easter Outdoor Game, Easter Basket Tokens, Wooden Hunting Tokens",
    "description": "· Easter Tokens ·A great game for children on Easter.Hide tokens in plastic eggs and organize an egg-collecting quest for your little ones.16 tokens that include various tasks and nice bonuses in the form of coins.Collect memories with BUSY PUZZLE and spend this wonderful time with your family.PLEASE NOTE that plastic eggs are not included.Wooden Easter tokens are packed in a specially designed bag. (See photos).· COUPON ·When buying 2 or more Baby Toys or Easter Decor, we have an additional coupon discount: EASTERJust add it to your shopping cart.· Details ·• The TOKENS is made of plywood.• There are five color sets available:- Blue- Pink- Yellow- White- MixedSee the infographic!· The dimensions of each egg ·Length: 1.2 inches (30 mm)Height: 1.5 inches (38 mm)· List of tasks ·1. Date with mom2. Date with dad3. Pizza night4. $15. $36. $57. Movie night8. EXTRA 5 MINUTES SCREEN TIME9. LATER BEDTIME10. You pick dinner11. Outside time12. Morning donuts13. Park day14. Treat after dinner15. FUN ACTIVITY16. One toy at store· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "I loved it and can’t wait to use them on Easter!",
      "The shipping took a bit since it came from afar, but it was worth it.  Great product!",
      "Very cute, I can’t wait for my kids to see these",
      "This is exactly what I was looking for to fill my children's eggs. They are small enough to fit in my smaller eggs but big enough to easily read. They are adorable and the craftsmanship is wonderful!"
    ]
  },
  {
    "productId": "csJtXSkxcG",
    "url": "https://www.etsy.com/listing/1163673856/golden-retriever-dog-funny-easter-cards?click_key=a9c601746b19adfce8d711173fe65370a0da0742%3A1163673856&click_sum=1f5c7a01&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-31&bes=1&sts=1&content_source=1cd57cb1c13fd32c2601b368dec7ea54456643d2%253A1163673856",
    "title": "Golden Retriever Dog Funny Easter Cards For Kids - Watercolor Egg Easter Gifts For Granddaughter",
    "description": "Golden retriever dog holding mouthful easter eggs and dressed up as an Easter bunny. This cheeky Easer card is great for friends and kids who also love dogs.😃Hand-painted, printed, folded, and packed all by me - 100% handmade😃A2 size 4.25 x 5.5 inches folded card😃Blank inside😃Printed on extreme heavyweight cardstock with matching envelope😃Ship in rigid protective mailer, full refund for damaged/lost cards😃Sustainably sourced materials - No plastic packaging for single cardBack to the shop:LiyanaStudio.Etsy.com🎁 GET A FREE CARD! (AND MONTHLY 15% OFF COUPON)Get a coupon code to receive a free card with any purchase instantly when you sign up for our e-mail list at:👉 Signup: https://rb.gy/1bolcd😸 GREETING CARD SETSWant more than one? Check out our greeting card sets with discount plus free shipping!https://www.etsy.com/shop/LiyanaStudio?section_id=23123028💖FOLLOW US FOR UPDATES!I am @Liyanastudio on Instagram & Pinterest.🌈WHOLESALE?Interested in wholesale? We'd love to work with you! Send us a message for more information.Please contact me with any questions, I usually reply super-fast all 7 days.We are trying to be more eco-friendly by reducing single-use plastic waste, so a single card will be shipped without a cello bag. It will be carefully shipped in a DO NOT BEND rigid mailer and will arrive safely. Please, let us know if you would like your card to be shipped in a cello bag (i.e. your area is in the rain season).",
    "reviews": [
      "Love the card! It is very well made! Just like the picture and description. Thank you!",
      "Love, love, love these Easter cards. So beautiful!",
      "Simply adorable, my son and daughter-in-law will love it!!"
    ]
  },
  {
    "productId": "RZeeEsg80n",
    "url": "https://www.etsy.com/listing/1423534253/somebunny-cereal-sly-loves-you-bowl?click_key=9218dfcd0eeecb2084d9af40e6e47124eb053a29%3A1423534253&click_sum=4d20bd0d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864752-1-16&pro=1&bes=1&sts=1",
    "title": "Somebunny Cereal-sly Loves You Bowl - Easter Cereal Bowl - Oversized Mug - Personalized Easter Gift - For Kids - For the Cereal Lover",
    "description": "Give the gift of warm fuzzies this Easter with this super cute and custom cereal bowl. They'll know they're loved by some bunny special with every bite of their loops or o's.GET BOWLED OVER: Everyone needs their own personal bowl! This oversized porcelain bowl is colorful, practical and designed for everyday use—and it lets them know they’re loved.UNIQUELY PERSONALIZED: What a unique way to say, “I Love You” (or \"We Love You\"). Customize your bowl with any name up to 10 characters, presented in candy-colored letters. \"Some Bunny Cerealsly loves you\" will always appear.FILL IT UP: The signature bowl’s convenient handle makes it ideal for everything from cold treats like ice cream to hot comfort food like soup. Plus, it’s microwave safe!PREMIUM QUALITY: Made of porcelain, the Love You oversized Mug Bowl holds 32 oz. of whatever deliciousness you put in it and has a convenient handle. Hand-wash only. Imported for final manufacture locally.YOU NAME IT: Everyone loves getting a thoughtful gift with their name on it! This colorful bowl is an unexpected way to express your love on any special occasions or just because.",
    "reviews": [
      "Very cute gift for Easter. My niece loved it!!",
      "I ordered last minute for my grand nieces and nephew for Easter…a whole gift theme inspired by them. Beautiful quality and here within days!",
      "Super cute,I’m going to put it in my granddaughters Easter Basket",
      "I liked this item so much I ordered four!"
    ]
  },
  {
    "productId": "FubzgRGWjL",
    "url": "https://www.etsy.com/listing/846003223/ukrainian-easter-egg-hand-painted-easter?click_key=7d18ed38154a3d149e6b4348dae10bf9a73209ac%3A846003223&click_sum=a58ba556&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-32&pro=1&frs=1&etp=1&sts=1&content_source=14846ab579820eefaa8fdbf39f7132d2e71966e6%253A846003223",
    "title": "Ukrainian Easter Egg • Hand Painted Easter Decor • Wooden Decorative Pysanky • Petrykivka Handmade Gift Shop • Ukraine Seller • S131",
    "description": "MORE DESIGN VARIATIONS HERE:https://www.etsy.com/shop/HandicraftsMill?section_id=29395189Handmade and Hand Painted Wooden Easter Egg in original Ukrainian Petrykivka painting technique.It can be a perfect Gift Idea for any occasion: Birthday Gift for Her, Valentine's Day Gift for Girlfriend, Christmas Gift for Mom, Wedding Gift Idea, Mother's Day Gift or just Perfect Gift to anyone.The item is ready to ship!Product material: wood (birch)Paints: art oil paintsCoating: four layers of glossy varnishPackaging: individual cardboard boxDimensions:Diameter: 70 mm / 2.76\"Height - 96 mm / 3.78\"Height with stand - 130 mm / 5.12\"The video of the creation process can be viewed on the main page:https://www.etsy.com/shop/HandicraftsMillPlease note that each product is a hand painted work of authorship, therefore slight differences in painting are allowed.But this means that you will be the only owner in the world of a unique product!!!PETRYKIVKA PAINTING is the Ukrainian arts and crafts patterned folk style that originated from the village of Petrykivka.Petrykivka painting is traditionally dominated by floral motifs. The floral ornament depicts various flowers (asters, dahlias, roses, and chamomile) and fruits, which are combined in fantasy compositions of plants and shrubs. Sometimes floral patterns are combined with the images of people, birds and animals.In 2012, the Petrykivka painting was recognized as part of the National Intangible Cultural Heritage, and, in 2013, it was included in the Representative List of the Intangible Cultural Heritage of Humanity by UNESCO.",
    "reviews": [
      "This egg is even more gorgeous in person. The detail is exquisite and the colors are so vibrant. I bought this for Easter but will be leaving it up year round. I would highly recommend this seller.",
      "The egg was beautiful. It met all expectations and will be a perfect gift for my friend.",
      "Beautiful! Would definitely order again",
      "Beautiful! Would definitely order again!"
    ]
  },
  {
    "productId": "OSkLzLzaBH",
    "url": "https://www.etsy.com/listing/1185369101/personalised-engraved-easter-basket-tags?click_key=910ecf7f61488dd51d5fc93525a9a6bfe0b5f8e8%3A1185369101&click_sum=63b7d7c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-33&bes=1&sts=1&content_source=62c63e0938c53a86363a36a04b234b87b5cc46c2%253A1185369101",
    "title": "Personalised Engraved Easter Basket Tags | Easter Keepsake Decoration | Wooden Baby Easter Gift | Easter Egg Hunt Labels | Easter Bunny Tag",
    "description": "Personalised Engraved Easter Basket Tags | Easter Keepsake Decoration | Wooden Baby Easter Gift | Easter Egg Hunt Labels | Easter Bunny TagCelebrate Easter with your child(ren) using our adorable Easter basket tags! Personalised with their name, fill their Easter basket with goodies and finish it off by attaching their very own tag from the Easter bunny. A beautiful keepsake that will last a lifetime.- Made with real wood veneer- The tag can be personalised with the name of your choiceMEASUREMENTS80mm X 60mm4mm thickHOW TO ORDERTell us the name you'd like in the \"Add Personalisation\" boxItems will be dispatched within 1 - 2 Working Days.PERFECT GIFT TO LAST A LIFETIMEOur machinery is top of the range giving a precision finish on your engraving.Your engraving is permanent, and unlike other methods of personalising will not fade or wear away.Due to the nature of real wood materials, the grain may vary slightly to the example photo shown above.Our engraving is GUARANTEED FOR THE LIFE OF THE PRODUCT",
    "reviews": [
      "Great item, added to my daughters first Easter basket and know we will use it year after year. Fast delivery and really well made.",
      "Lovely  item really well made",
      "Lovely product, arrived quickly and as described.",
      "Really love our personalised gift tag!"
    ]
  },
  {
    "productId": "XHgrAvAmQU",
    "url": "https://www.etsy.com/listing/1505040618/floral-daisy-girls-personalized-name?click_key=38ae3cdfa35d3c5a959aaeb0c0f714df25887f13%3A1505040618&click_sum=4756720f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-34&pro=1&frs=1&bes=1&sts=1&content_source=232467e2a47937e386cef2ca551772c37679999d%253A1505040618",
    "title": "Floral Daisy Girls Personalized Name Sunglasses|UV400 Protection|Toddler Gift|Kids Gift |Kids Personalized Sunglasses Flower girl sunglasses",
    "description": "Simply specify your preferences in the customization box, ensuring that the spelling of the names is accurate, as we will directly copy and paste them onto the sunglasses.Each and every one is handmade by me! That's why I take great care with each pair of glasses to ensure their quality when you receive them. Don't worry, I'll meticulously inspect my orders all the time. Usually, I'll ship them out the day after you place your order because the letters on the glasses need one night to dry!We are thrilled to present our exclusive personalized sunglasses collection, designed to make your little ones stand out from the crowd! These custom sunglasses are perfect for baby girls, toddlers, and children aged 3 to 14. We offer a wide array of vibrant colors to choose from, allowing you to find the perfect match for their unique personal style.Add a special touch to the sunglasses by personalizing them with your child's name or a special phrase. During the order placement process, you can easily enter the desired name and color in the customization box. Each pair can accommodate up to 12 letters, providing you with the opportunity to create truly one-of-a-kind accessories for your children.The safety of your children is our top priority. That's why our sunglasses offer UV 400 protection, ensuring that their eyes are shielded from harmful sunlight. Rest assured, our sunglasses have undergone rigorous safety testing and meet the highest industry standards.Featuring a charming heart-shaped design, these sunglasses add delightful flair to any occasion. Whether it's a casual outing, a family vacation, a beach getaway, a birthday celebration, or even special events like being a flower girl, these sunglasses make perfect accessories. They can also serve as exquisite props in spring and summer photography, capturing those precious moments in a stylish way",
    "reviews": [
      "These glasses are stunning. Such lovely items. Very greayful. Thank you x",
      "Met all my expectations and matched the pics",
      "Super cute item , perfect"
    ]
  },
  {
    "productId": "dXNuKqSUns",
    "url": "https://www.etsy.com/listing/1139545060/peter-rabbit-and-flopsy-personalized?click_key=5c2e988b45c0455ac4e8e455d89c4a08ab48c07f%3A1139545060&click_sum=ef03709c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-35&bes=1&sts=1&content_source=f13e3825cdcefbb50ab4dad1f0052102dd19482d%253A1139545060",
    "title": "Peter Rabbit and Flopsy Personalized Easter Basket Liner • Easter Basket Liner Boy or Girl • Easter Basket Liner • Monogram | Flopsy Peter",
    "description": "PLEASE READ FULL DESCRIPTION BELOWD E T A I L S•  Universally Sized Basket Liner {SOLD INDIVIDUALLY - LINER ONLY - Basket NOT included}•  Drawstring Ties Allow Basket Liner to Fit a Wide Range of Baskets•  Liner will come as it appears in the listing photos•  TWO Fabric Options•  All items are designed and hand-crafted with you in mind! Because each piece is carefully handmade there may be some slight variations in color and design which only adds to the charm of each item that has been hand-crafted just for you!F A B R I C•  Natural  - Cotton/Linen Blend.  Natural Oatmeal/Beige Color. {White Twill Side Ties}•  White - 100% Cotton Canvas. Bright White. {Gray Twill Side Ties}S I Z I N G•  Fits various sized baskets UP TO 15.5\" in diameter and 7\" deep. I can not guarantee it will fit any baskets OVER this size.B A S K E T S   S H O W N•  Seagrass Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/seagrass-easter-basket/?catalogId=15&sku=3507626&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=3507626&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH-qO6dBOmhvrNEEv09mWjJeMaCXeZtNPW4wls6mXnTk5b4giOmYkOgaAiOfEALw_wcB•  Sabrina Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/white-sabrina-easter-baskets-spring18/?catalogId=15&sku=4155920&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=4155920&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH82GuR7NHjjabfj7G-Y4bx2Z_VyDtdUdIuAI-R3Jhf6WgAxT_9fl_kaAiWTEALw_wcB•  Isabella Basket from World Market {Large}https://www.worldmarket.com/product/large-white-oval-isabella-basket.do?sortby=ourPicks•  The smaller the basket the more gathered liner will be. The drawstring ties allow you to simply adjust the gathers where you want them so the print is visible.P R O D U C T I O N  •  T I M E•  All items are made to order - please allow 5-10 business days for your basket liner to be made.  If you need your order rushed, please add this listing to your cart.https://www.etsy.com/listing/212337977/rush-your-orderC A R E•  Spot cleaning or hand washing is recommended. Lay flat to dry. Iron as needed. Do not bleach.R I B B O N  •  C O L O R•  The ribbon color shown in this listing is white or gray depending on the fabric you chose. If you would like to change from the default ribbon color please add this listing to your order and select your color choice in the drop down menu.https://www.etsy.com/listing/674477120/easter-basket-liner-twill-ribbon-color?ref=listings_manager_gridI N K  •  C O L O R•  The font color shown in this listing is gray•  We offer a variety of color options if you would like something other than gray! If you would like to change the color of the text or graphic, please add this listing and select your color choice in the drop down menu.https://www.etsy.com/listing/469936976/choose-your-coloradd-to-any-listingS H I P P I N G•  All my items are shipped via USPS. Please allow 5-9 business days for delivery. International shipping can take longer.F O L L O W  •  U S•  Instagram: www.instagram.com/porterlanehome and don't forget to tag us with your new Porter Lane Home items! We love to see your photos!•  Facebook: www.facebook.com/porterlanehome•  Pinterest: www.pinterest.com/porterlanehomeQ U E S T I O N ?•  Don't hesitate to send me a message if you have any questions.",
    "reviews": [
      "Perfectly done.  Great quality and shipped quickly.",
      "Beautiful quality! Amazing customer service!",
      "Cute and perfect for Easter!",
      "really cute and perfect for Easter 🐣"
    ]
  },
  {
    "productId": "TR5bKjWsUL",
    "url": "https://www.etsy.com/listing/1384550098/personalized-easter-egg-custom-wood?click_key=79a7339ec3dffdac84b8203f7d49a43d6029a78a%3A1384550098&click_sum=e2a1f150&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-36&frs=1&bes=1&sts=1&content_source=3853ee43a44792444b8fe3e5fa5775a38ed54ec9%253A1384550098",
    "title": "Personalized Easter Egg, Custom Wood Easter Egg, Easter Basket Gift, Personalized Easter Gift, 2023 Easter Gift Ideas, Kids --EGG-NW-100",
    "description": "Personalized Easter Gift 2023, New Easter Basket Gifts, Personalized Easter Gift, Custom Easter Eggs, Easter Gifts Ideas 2023, Easter Gift Ideas for Girls, Easter Basket Gifts for Boys, Easter Gift Ideas, Personalized Egg, Personalized Eggs, Wood Easter Eggs, Painted Easter EggsEtch This Out's new Personalized Easter Eggs are the perfect gift for your loved ones Easter Basket!Each Easter Egg features a professionally laser engraved design with your custom name or message.Our Easter Eggs have a flat base so they stand up, they are 2.5\" tall and 1.85\" inches wide.⚙️ Product SpecificationMaterial: Solid WoodSize: 2.5\" x 1.85\" inchesColor Options: Light Blue, Pink, Purple, Yellow, White, Raw Wood✅ Ordering & ProcessingWe make it our mission to process our orders fast and efficiently! You will be asked if you would like a proof upon adding your product to the cart. If you select No we will begin the production process right away for you! If you choose Yes on the proof, we will email you your proof of your order to ensure it is exactly how you envisioned it. We will work with you until you are completely in love with your new personalized gift and 100% satisfied with your order. Once we know you are completely satisfied with your and we receive your approval via email- Our team will start processing and making your unique gift!📦  Production ProcessIts time to get busy engraving! All orders are processed and shipped out within 24 hours of when we have received your approval of your proof.⏱️ Shipping TimesPlease be aware that shipping times may vary from 2-6 business days depending on the product and shipping class. First class mail generally takes 2-5 business days, while priority mail takes 1-3 business days to arrive.⭐ Satisfaction GuaranteeAt EtchThisOut, we know your are going to love your personalized product when you receive it. However If for any reason you are not satisfied with your order, we would be happy to assist you on replacing your item or fixing it for you.💲 Bulk OrdersWe are proud to offer bulk pricing on all of our products when purchasing 25 or more. Prices do vary based on the quantity you are looking for. Please send us a message about the quantity you are looking for and the zip code we will be shipping to.Personalized Night Lights Kids, Kid's Night Light, Children Night Lamp, Boys Room, Night Lights for Kids Kid’s Bedroom Decor, Children’s Lamp, Children’s Light, Personalized Night Light, Custom Night Light, Children’s Light, Kids Bedroom, Girls Room",
    "reviews": [
      "Cute personalized wooden easter egg ...",
      "This was just a beautiful little egg.  The engraving was perfect.",
      "I ordered these and they arrived in less than a week!  They are beautiful quality and I love them. Will probably order more. Thank you!",
      "Great quality and the item is perfect for a gift."
    ]
  },
  {
    "productId": "iZLOyJMCCW",
    "url": "https://www.etsy.com/listing/1404584142/easter-egg-tokens-egg-hunt-prize-reward?click_key=9448ec4e96af71c8d1c8be839545117edbfc9ff2%3A1404584142&click_sum=b2c94dd1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-37&bes=1&sts=1&content_source=e1d5b09fef9a547c596d1de9196402d8b16bfd17%253A1404584142",
    "title": "Easter Egg Tokens | Egg Hunt Prize Reward Tokens | Set of 21",
    "description": "This set of Easter egg tokens is a fun addition to your hunt! Tokens are designed to be 'cashed in' on the spot, or in the days and weeks following Easter! Each of the 21 tokens measures 1.4\" round - the perfect size to fit inside a standard size Easter egg. They are laser cut from 1/8\" wood and then hand-sanded to ensure no rough edges for little fingers! Each set comes packaged in a small drawstring bag for safekeeping year-round :)Set includes the following words/phrases:1 - Game Night1 - Movie Night1 - Stay Up Late1 - Candy Bar1 - Picnic1 - Sweet Treat1 - Extra Screen Time1 - Ice Cream Date1 - Go to the Park1 - Drive Thru Dinner1 - New Book1 - Date with Mom1 - Date with Dad1 - Pizza Night1 - $53 - $13 - $2⇨ If you prefer custom tokens, please select the number of tokens you would like changed from the drop down box above.  Changes may include:- Different quantities of standard tokens (i.e. 5 - $5, 2 - $2, 2 - Stay up late, etc)- Replacement of tokens in set with custom phrases, etc (i.e. Remove Date with Dad  and replace with Craft Day)**Please Note: if you request custom tokens, but do not purchase custom, your order will be shipped as a standard set)⇨ These tokens are not intended to be used as toys. Young children should be supervised at all times to ensure their safety with small objects.If you need your order rushed, you MUST purchase the rush fee here:https://www.etsy.com/listing/1399987292/rush-my-order?click_key=3ff10fead73047dae23dc95b48a862d5794db3fd%3A1399987292&click_sum=1077fd1d&ref=shop_home_active_1&frs=1*Please note: rushes may not be placed on bulk orders.Let me know if you have any questions as you shop!",
    "reviews": [
      "These tokens are very high quality and the seller is so easy to work with. She was able to easily customize my order. These tokens will be reused over and over again, which I love. Customer service is top notch - I will be following her ship and plan to be a returning customer. :-)",
      "Super cute,! Great gift! Great customer service too!",
      "They look just as described and pictured. I’m going to put them in the Easter Bunny’s eggs for our egg hunt. They are the perfect size and there are enough that I pick and choose which ones I want to use. I’m also already coming up with ideas to reuse them. Like to pick one out of a bowl as a prize for winning a game or for rewards for chores, etc. Thank you!!",
      "Beautiful, just as described. High quality, packaged very nicely"
    ]
  },
  {
    "productId": "txYzgqsQYp",
    "url": "https://www.etsy.com/listing/1383030831/handmade-bead-table-runner-carrot-design?click_key=f81fff82e906a2a58a69ce65c98b11bdba1fa828%3A1383030831&click_sum=57a5b3e6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-38&pro=1&frs=1&sca=1&sts=1&local_signal_search=1&content_source=f0407d7e701bdc79ece7335a1aa9eebb3ee483d0%253A1383030831",
    "title": "Handmade bead table runner, carrot design beaded runner for Easter",
    "description": "This beautiful carrot design beaded runner and placemats are made using multicolor beads. This looks stunning on any table.These are handmade products and are done with a lot of precision. We use the best beads to create the design.This runner looks great on the centre table or dining table.While creating this runner, we take extra care to tie all the knots and secure them properly.These are ideal for the living room and dining room. This will add glamour, texture, and interest to your table.Runner Size: 13x36 inchPlacemat size: 14 inchMaterial: Beads and fabricColour: multicolourFinishing: The runner is very well finished and we have taken care to finish the rear side too. We use fabric to finish the rear side which looks equally interesting.Packing and wrapping:We make sure our product reaches you in good condition. We pack our products in handmade eco-friendly corrugated boxes and secure these with tapes.🌷 For more runner designs from our shop, please check:https://www.etsy.com/in-en/shop/Enlivenstores?ref=simple-shop-header-name&listing_id=905055152&section_id=32894572🌷 There are many products that you might like in our shop. Please check these too:https://www.etsy.com/in-en/listing/928362591/handmade-beaded-placemats-14x14inch?ref=shop_home_active_1&frs=1&crt=1https://www.etsy.com/in-en/listing/941666752/handmade-bead-placemats-14x14inch-table?ref=shop_home_active_2&frs=1https://www.etsy.com/in-en/listing/905055152/handmade-bead-placemats-14x14inch-table?ref=shop_home_active_3&frs=1&crt=1https://www.etsy.com/in-en/listing/905047846/handmade-beaded-placemat-14x14inch?ref=shop_home_feat_1&frs=1https://www.etsy.com/in-en/listing/949488927/handmade-bead-placemats-14x14inch-table?ref=shop_home_active_8&frs=1&cns=1https://www.etsy.com/in-en/listing/949477629/handmade-bead-placemats-14x14inch-table?ref=shop_home_active_10&frs=1&cns=1https://www.etsy.com/in-en/listing/934908340/handmade-beaded-placemat-14x14inch?ref=shop_home_active_9&frs=1&crt=1Some of our other Jute Mats:https://www.etsy.com/in-en/listing/930921135/set-of-2-handmade-eco-friendly-jute?ref=shop_home_active_12&frs=1&crt=1https://www.etsy.com/in-en/listing/905048758/set-of-2-handmade-eco-friendly-jute?ref=shop_home_active_14&frs=1&crt=1🌷A well-decorated wall adds glamour but a table serves one main purpose, the functional aspect. But that does not mean that the same functional area can't be glamourous too. We Enliven the same functional table and help you make it exciting and glamourous. Adding a few placemats or runners really change the whole feel of it. Simple products like napkin rings or a nice table napkin or a beautiful handmade charger plate, these all just add to the whole look.🍂✨When you buy from our shop, we make sure each product is as per the photo that you have viewed and liked. But we request you to just give us a little scope and understand that these all products are handmade and sometimes color from one lot that we create to another differs by 2-5% and this is because of many reasons, and one is the availability of raw material and other factors are season when we are doing it. One biggest reason so far is our device where we are watching it. Any single photo you check on the internet, there will be a variation in color if you see the same image on two monitors or phones. So, in the same way, what you see also will vary a bit from the original color. But at the same time, you can trust Enliven Stores designers who check each of the finished product themselves before it reaches you. We make sure, what you get is better and beautiful than what you saw on the screen!🍂✨We have the capabilities to create and manufacture new designs and so, if you like something in our shop here, please do let us know. We will be happy to know and in case you want to contact us for new designs and trade & wholesale requirements, please contact the shop owner.We thank you for taking the time to read something about us. If you like something, please purchase from our shop and also check for sales if there is any to get better prices. We have a special section on sales and you can reach there by clicking here:https://www.etsy.com/in-en/shop/Enlivenstores?ref=search_shop_redirect§ion_id=32534824Your own handmade decor item is waiting for you at our store!Happy shopping...Team EnlivenImages (c) Rachita Shahi Choudhary________________________________________________________________________________________________________________________________________This product:Handmade bead table runner and placemat, carrot design beaded runner for EasterSome of the words to help find my item on Etsy:Floral table placemat, handmade table placemat, table mat, table mat set, placemat set, luxury table mats, Luxury Beaded Placemat, Linen placemat, Beaded Charger Placemats, Decorative mat, burlap table placemat, Gift for her, House warming gift, New Year table runner, Table runner sets etsy in UK, Table runner sets etsy in USA, Table runner sets etsy in Canada, Decorative table runner, custom table runner, macrame table runner, Christmas table runner, Linen table runner, burlap table runner, Farmhouse table runner, Quilted table runner, Crochet table runner, Etsy table runner patterns crochet, Etsy cheesecloth table runner, Etsy chiffon table runner, Etsy table runner, floral table placemat, Living room table decoration, Dining Table Mat,  Charger Placemats, charger plate, beaded runners, beaded placemats, living room decor ideas, gift ideas, mother's day gift, Easter gift, luxury placemat, luxury runner, exquisite designs, exciting colours, placemats set of 6, placemats set of 4, placemats set of 2, beaded placemats, Coasters and Napkin Ring, Table Decor, centerpiece, Placemats, Decorative & Housewarming Gift, Ready to Ship, Glass beads, handcrafted beaded set, Handmade Beaded Placemat, Living room table decoration, Dining Table Mat, Floral Design, Gift for her, Charger Placemats, Dinning Table Mat",
    "reviews": [
      "Very cute item. Cannot wait to use on my Easter table.",
      "Super fast shippong! Thank you!",
      "Can’t wait for the Easter season to display this beautiful runner!",
      "Love this piece. Looked so cute for Easter!"
    ]
  },
  {
    "productId": "sAMvcFUNo7",
    "url": "https://www.etsy.com/listing/1672574913/stack-the-bunnies-balance-toy-for-kids?click_key=cfa5ab27f27aa608102f1f42f4e6f5f9b28bf260%3A1672574913&click_sum=03d971fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-39&pro=1&frs=1&etp=1&content_source=70979ca556a005a4c8e24bee8c2fb01b4ff1fb21%253A1672574913",
    "title": "Stack the Bunnies. Balance Toy For Kids. Easter Basket Stuffers. Personalized Baby Gifts. Easter Sensory Toy. Montessori Toys For Toddlers.",
    "description": "· Easter Montessori Balance Toys ·The Personalized Balance Toy is a unique Gift For Kids.Our balance toy is designed for babies and their parents.There is a lot of fun to put bunnies and eggs on a semicircular base, sometimes it is not easy but will be interesting for the whole family.Have a great time assembling a tower of uniquely shaped figurines.The toy will also be a great addition to the Easter evening.· COUPON ·When buying 2 or more Baby Toys or Easter Decor, we have an additional coupon discount: EASTERJust add it to your shopping cart.· Benefits ·While playing with the balance toy, the child will develop movements coordination, logical thinking and memory. It a great way of practicing eye-hand coordination and developing fine motor skills.· Details ·Set consists of a moon, four rabbits and three eggs.Made of solid wood – a lasting and durable material.You can choose color: natural or colorful.Toy is covered with linseed oil or with water based paint (it is ecological and safe for kids).· Size ·Balance toy (moon): 6.3x3.8 inches (15.9х9.6 cm).Bunnies and eggs vary in size from 1.5x2.3 inches (37x59 mm).· Additional Options ·We can personalize the toy and engrave the name of your baby on it. It will make your gift more special and memorable!PLESE NOTE, that on the colourful balancer the name will be printed, and on the natural one it will be engraved.Additionally, you can order extra set (two rabbits and three eggs) for the basic set and a keeping bag.See infographic!· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at BusyPuzzle ♡",
    "reviews": [
      "The item was beautifully made",
      "So cute! I'm happy about the outcome, very well made and high-quality. I'd recommend this shop to friends and family"
    ]
  },
  {
    "productId": "BDcxbCgrBg",
    "url": "https://www.etsy.com/listing/818081420/ukrainian-easter-egg-ukraine-seller?click_key=4bc6a822941d286fd83fe47d8a2836e8d506997e%3A818081420&click_sum=f222b089&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-40&pro=1&frs=1&sca=1&sts=1&content_source=90df5dc8f8df291c74d0402e60307fb50787a10f%253A818081420",
    "title": "Ukrainian Easter Egg • Ukraine Seller Decorative Wooden Pysanky • Hand Painted Easter Decor • Petrykivka Handmade Gift Shop • S041",
    "description": "MORE DESIGN VARIATIONS HERE:https://www.etsy.com/shop/HandicraftsMill?section_id=29395189Handmade and Hand Painted Wooden Easter Egg in original Ukrainian Petrykivka painting technique.It can be a perfect Gift Idea for any occasion: Birthday Gift for Her, Valentine's Day Gift for Girlfriend, Christmas Gift for Mom, Wedding Gift Idea, Mother's Day Gift or just Perfect Gift to anyone.The item is ready to ship!Product material: wood (birch)Paints: art oil paintsCoating: four layers of glossy varnishPackaging: individual cardboard boxDimensions:Diameter: 70 mm / 2.76\"Height - 96 mm / 3.78\"Height with stand - 130 mm / 5.12\"The video of the creation process can be viewed on the main page:https://www.etsy.com/shop/HandicraftsMillPlease note that each product is a hand painted work of authorship, therefore slight differences in painting are allowed.But this means that you will be the only owner in the world of a unique product!!!PETRYKIVKA PAINTING is the Ukrainian arts and crafts patterned folk style that originated from the village of Petrykivka.Petrykivka painting is traditionally dominated by floral motifs. The floral ornament depicts various flowers (asters, dahlias, roses, and chamomile) and fruits, which are combined in fantasy compositions of plants and shrubs. Sometimes floral patterns are combined with the images of people, birds and animals.In 2012, the Petrykivka painting was recognized as part of the National Intangible Cultural Heritage, and, in 2013, it was included in the Representative List of the Intangible Cultural Heritage of Humanity by UNESCO.",
    "reviews": [
      "Hand painted with skill - very lovely",
      "A + + + +",
      "I am so thrilled with this! It looks absolutely stunning!",
      "This is a wonderful, perfectly painted and designed work of art, painted on a wooden egg!!!   I have purchased several other eggs by this artist and they are of consistently excellent quality."
    ]
  },
  {
    "productId": "YgFqcOMRHs",
    "url": "https://www.etsy.com/listing/966877099/bunny-personalized-basket-liner?click_key=6897e5401cc794aef783d07b69112ebb009c17eb%3A966877099&click_sum=df42edb2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-41&bes=1&sts=1&content_source=8d8f3245b098e80c3bf6c0533c72ac1fd92cdbb0%253A966877099",
    "title": "Bunny Personalized Basket Liner • Customized Easter Basket Liner • Monogram • Girl Easter Basket Liner • Boy Easter Basket Liner | Bunny",
    "description": "PLEASE READ FULL DESCRIPTION BELOWD E T A I L S•  Universally Sized Basket Liner {LINER ONLY - Basket NOT included}•  Drawstring Ties Allow Basket Liner to Fit a Wide Range of Baskets•  Liner will come as it appears in the listing photos•  TWO Fabric Options•  All items are designed and hand-crafted with you in mind! Because each piece is carefully handmade there may be some slight variations in color and design which only adds to the charm of each item that has been hand-crafted just for you!F A B R I C•  Natural  - Cotton/Linen Blend.  Natural Oatmeal/Beige Color. {White Twill Side Ties}•  White - 100% Cotton Canvas. Bright White. {Gray Twill Side Ties}S I Z I N G•  Fits various sized baskets UP TO 15.5\" in diameter and 7\" deep. I can not guarantee it will fit any baskets OVER this size.B A S K E T S   S H O W N•  Seagrass Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/seagrass-easter-basket/?catalogId=15&sku=3507626&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=3507626&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH-qO6dBOmhvrNEEv09mWjJeMaCXeZtNPW4wls6mXnTk5b4giOmYkOgaAiOfEALw_wcB•  Sabrina Basket from Pottery Barn {Large}https://www.potterybarnkids.com/products/white-sabrina-easter-baskets-spring18/?catalogId=15&sku=4155920&cm_ven=PLA&cm_cat=Google&cm_pla=Easter%20%3E%20Easter%20Baskets%20%26%20Liners&cm_ite=4155920&gclid=Cj0KCQjwg73kBRDVARIsAF-kEH82GuR7NHjjabfj7G-Y4bx2Z_VyDtdUdIuAI-R3Jhf6WgAxT_9fl_kaAiWTEALw_wcB•  Isabella Basket from World Market {Large}https://www.worldmarket.com/product/large-white-oval-isabella-basket.do?sortby=ourPicks•  The smaller the basket the more gathered liner will be. The drawstring ties allow you to simply adjust the gathers where you want them so the print is visible.P R O D U C T I O N  •  T I M E•  All items are made to order - please allow 5-10 business days for your basket liner to be made.  If you need your order rushed, please add this listing to your cart.https://www.etsy.com/listing/212337977/rush-your-orderC A R E•  Spot cleaning or hand washing is recommended. Lay flat to dry. Iron as needed. Do not bleach.R I B B O N  •  C O L O R•  The ribbon color shown in this listing is white or gray depending on the fabric you chose. If you would like to change from the default ribbon color please add this listing to your order and select your color choice in the drop down menu.https://www.etsy.com/listing/674477120/easter-basket-liner-twill-ribbon-color?ref=listings_manager_gridI N K  •  C O L O R•  The font color shown in this listing is gray•  We offer a variety of color options if you would like something other than gray! If you would like to change the color of the text or graphic, please add this listing and select your color choice in the drop down menu.https://www.etsy.com/listing/469936976/choose-your-coloradd-to-any-listingS H I P P I N G•  All my items are shipped via USPS. Please allow 5-9 business days for delivery. International shipping can take longer.F O L L O W  •  U S•  Instagram: www.instagram.com/porterlanehome and don't forget to tag us with your new Porter Lane Home items! We love to see your photos!•  Facebook: www.facebook.com/porterlanehome•  Pinterest: www.pinterest.com/porterlanehomeQ U E S T I O N ?•  Don't hesitate to send me a message if you have any questions.",
    "reviews": [
      "Love it X o xo",
      "Great item! We love it",
      "Great quality. Came in a timely manner.",
      "Love this basket insert! I am certain to make my son an Easter basket for him until his 35 !! LOVE IT"
    ]
  },
  {
    "productId": "PIzDoYTpuQ",
    "url": "https://www.etsy.com/listing/696105354/personalized-name-puzzle-with-pegs?click_key=0995213f6584964ce23b6ff1dd017414320297a3%3A696105354&click_sum=2ea4475c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-42&pro=1&frs=1&pop=1&content_source=93d83119063d5570ee9ff521f0c9ea47953952a2%253A696105354",
    "title": "Personalized Name Puzzle With Pegs, Montessori Toys, Baby Gift,  First Christmas, Wooden Toys, Baby Shower Gift for Kids, Wood Name Puzzle",
    "description": "· Name Puzzle from BusyPuzzle is the Best Personalized Wooden Gift for Kids ·· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.In 4 years, we have sold 500,000 puzzles worldwide. We have received tens of thousands of reviews and are constantly trying to improve our Name Puzzles.Most often we receive orders for Christmas and Birthdays.Our Name Puzzles are suitable not only for playing but also as decor for a nursery. Especially for this we have developed 10 color schemes.· Approximate Dimensions ·Length: 13.7 inches (35 cm)Height: 3.1 inches (8 cm)Thickness: 0.35 inches (0.9 cm)The specified sizes refer to a puzzle of 5-6 letters.The size of your puzzle will depend on the number of letters in your child's name.We will be happy to make personalized puzzles for your kids!PLEASE NOTE, that the size of puzzle was changed in order to keep same price.Over the past 4 years, we have created many other puzzles and different toys for kids, as well as Christmas Decor.We have many products that complement each other to create a special atmosphere in the baby's room.To see the entire range, go to the main page of our store:https://www.etsy.com/shop/BusyPuzzle· Have any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms and Conditions for Safe Use ·1. All kids have imagination. And we did all we can to give you a safe toy. But be careful and try not to leave your child alone with puzzles. Instead - play with your kid. Collect memories2. Please, note  If your puzzle has letters «i», «j» or number «1» we recommend you to attach it to the wooden base.PLEASE NOTE  that the BusyPuzzle name logo is engraved onto every product and cannot be removed.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Perfect for my 3 year old who is learning how to spell his name! I wish I would have paid the extra to get his full name engraved but it does the job! Love the colors. Wonderfully made!",
      "Love this for our playroom! So adorable.",
      "Love it as decor and then it can be played with!"
    ]
  },
  {
    "productId": "oSFJiMarvb",
    "url": "https://www.etsy.com/listing/1150012610/custom-bunny-rabbit-plush-toddler?click_key=e5ed442c12de92b91b5e2c458b04308d2dfb0f8d%3A1150012610&click_sum=a94e37cf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-43&pro=1&bes=1&sts=1&content_source=6089d38f3646f56ad7d81af3ee2d571eeecefed8%253A1150012610",
    "title": "Custom Bunny Rabbit plush - toddler - newborn - Newborn gift - 18” and 12” bunnies! FREE embroidery- gift for toddler - present",
    "description": "Adorable custom plush Bunnies!Follow us @Little_Lady_A_ on Instagram to be updated on more personalized giftsStanding 12” and 18” tall our bunnies are the softest cuddle toy you’ll ever have!with over 52,000 sales we cannot be more proud to say these are our BEST seller and know you’ll love them!**please specify a thread color number for the embroidery on your purchase.- if a color is not chosen then we will chose blue if it’s for a boy,  or pink for a girl.add a embroidered blanket to your gifthttps://littleladyacreative.etsy.com/listing/1207688014With 400+ different color options these are great for both genders!",
    "reviews": [
      "Absolutely beautiful I highly recommend ❤️",
      "Excellent quality, super fast production and shipping—I couldn’t believe how quickly the item arrived! Can’t wait to give it to our son for his first Easter—thank you for making this beautiful \nbunny ❤️🐇",
      "This is the second little bunny I have bought from this shop. Super snuggly and soft and arrived promptly. Love the personalization~ makes it so special!"
    ]
  },
  {
    "productId": "JEzBrhBIhz",
    "url": "https://www.etsy.com/listing/1429949225/personalized-easter-egg-custom-wood?click_key=9ef3c7ed52371d0a69f718f15adc09fcaada07e6%3A1429949225&click_sum=21f78582&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-44&frs=1&bes=1&sts=1&content_source=862d301a774433afcfede34cb8e51dcd6a16f6c3%253A1429949225",
    "title": "Personalized Easter Egg, Custom Wood Easter Egg, Easter Basket Gift, Personalized Easter Gift, 2023 Easter Gift Ideas, Kids --EGG-NW-ABC",
    "description": "Personalized Easter Gift 2023, New Easter Basket Gifts, Personalized Easter Gift, Custom Easter Eggs, Easter Gifts Ideas 2023, Easter Gift Ideas for Girls, Easter Basket Gifts for Boys, Easter Gift Ideas, Personalized Egg, Personalized Eggs, Wood Easter Eggs, Painted Easter EggsEtch This Out's new Personalized Easter Eggs are the perfect gift for your loved ones Easter Basket!Each Easter Egg features a professionally laser engraved design with your custom name or message.Our Easter Eggs have a flat base so they stand up, they are 2.5\" tall and 1.85\" inches wide.⚙️ Product SpecificationMaterial: Solid WoodSize: 2.5\" x 1.85\" inchesColor Options: Light Blue, Pink, Purple, Yellow, White, Raw Wood✅ Ordering & ProcessingWe make it our mission to process our orders fast and efficiently! You will be asked if you would like a proof upon adding your product to the cart. If you select No we will begin the production process right away for you! If you choose Yes on the proof, we will email you your proof of your order to ensure it is exactly how you envisioned it. We will work with you until you are completely in love with your new personalized gift and 100% satisfied with your order. Once we know you are completely satisfied with your and we receive your approval via email- Our team will start processing and making your unique gift!📦  Production ProcessIts time to get busy engraving! All orders are processed and shipped out within 24 hours of when we have received your approval of your proof.⏱️ Shipping TimesPlease be aware that shipping times may vary from 2-6 business days depending on the product and shipping class. First class mail generally takes 2-5 business days, while priority mail takes 1-3 business days to arrive.⭐ Satisfaction GuaranteeAt EtchThisOut, we know your are going to love your personalized product when you receive it. However If for any reason you are not satisfied with your order, we would be happy to assist you on replacing your item or fixing it for you.💲 Bulk OrdersWe are proud to offer bulk pricing on all of our products when purchasing 25 or more. Prices do vary based on the quantity you are looking for. Please send us a message about the quantity you are looking for and the zip code we will be shipping to.Personalized Night Lights Kids, Kid's Night Light, Children Night Lamp, Boys Room, Night Lights for Kids Kid’s Bedroom Decor, Children’s Lamp, Children’s Light, Personalized Night Light, Custom Night Light, Children’s Light, Kids Bedroom, Girls Room",
    "reviews": [
      "Very impressed with communication and the promptness!! Highly recommend!",
      "Bright color and nice engraving",
      "My grandkids thought these were very cute"
    ]
  },
  {
    "productId": "VdIjqhX8wE",
    "url": "https://www.etsy.com/listing/976311271/easter-basket-stuffers-easter-scrunchie?click_key=1c981c07600387f8e5d2e47d37f2883d9656fe04%3A976311271&click_sum=d6ab8115&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-45&bes=1&sts=1&content_source=94706dec4e201a24fbd40f8429fc97941cf22308%253A976311271",
    "title": "Easter basket stuffers-easter scrunchie-easter bunny gift-easter sunday gift-easter gift for girls-easter gift for kids-easter party favors",
    "description": "Looking for the perfect Easter gift for someBUNNY special?! These adorable velvet scrunchies would be the perfect addition to any Easter basket, Easter egg hunt prizes, Easter brunch party favors, or for the special peeps in your life!WHAT ARE YOU RECEIVING/PRODUCT DETAILS:________________________________________-ONE velvet scrunchie per card-Printed on WHITE cardstock with FOUR design choices (choose from drop down menu)*I have an assortment of soft & adorable velvet scrunchies (please see photos)*Please be aware that you will be receiving a variety of colors; specific color accommodations cannot be made at this time*Scrunchies are excellent quality...great quality elastic...can also be worn on wrist (stylish!) or as hair tie*Scrunchies and card come assembled; if you prefer to assemble yourself, please leave a note at checkoutIMPORTANT INFORMATION:________________________________________-Please select TEXT DESIGN from drop down menu*you'll have FOUR options:option one- \"SOME BUNNY LOVES YOU\"option two-\"YOU'RE MY FAVORITE PEEP\"option three- \"A GIFT FROM THE EASTER BUNNY\"option four- \"HOPPY EASTER w/name\"**PLEASE NOTE: only \"HOPPY EASTER\" requires a personalization (name)-At checkout, please make sure to provide NAME for the customization in the \"ADD YOUR PERSONALIZATION\" section**if you want ANYTHING customized, feel free to reach out so we can work on something together :)________________________________________THINGS TO NOTE...________________________________________**PLEASE make sure to provide a NAME in the \" Add your personalization\" section of listing**Please be aware that you will be receiving a variety of colors; specific color accommodations cannot be made at this time*Current processing time: 3-5 days*Orders will ship First Class Mail (via USPS) with a general 2-5 day transit time | I will be in contact with you in the \"CONVERSATIONS\" with updates on when your order is completed & shipped*Please contact me if you have any questions before purchasing :)© MichiMakesThings 2021 | All designs are copyrighted, remain the rights of the seller, and cannot be reproduced or altered in any way. You cannot claim this item as yours. For personal use only.",
    "reviews": [
      "Super cute! Great for Easter!",
      "Great item, super cute for basket filler",
      "Perfect for my 10-year-old niece that I ordered them for. Highly recommend."
    ]
  },
  {
    "productId": "lxLsxMcMt9",
    "url": "https://www.etsy.com/listing/989482706/3-organic-stuffed-bunnies-in-carrot-zip?click_key=4d86bbae9dff8058c353e610678cf614817b56d5%3A989482706&click_sum=545c71c2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-46&etp=1&sts=1&content_source=0a8e9533ae2baac32e45cb1e8b9f6dac395b0ed8%253A989482706",
    "title": "3 Organic stuffed bunnies in carrot zip purse, Easter bunny, Babyshowers, Home decor, Bunny plush, Children's gift",
    "description": "☆★ Please take your time to read shop policy, item descriptions before making a purchase.Listing of 3 bunnies in carrot zip purse.Cute bunny set is a great addition to your Easter decor or decorate your room. It will be a perfect Easter gift! Our bunnies are made with organic cotton and the inside is filled with hypoallergenic fiber filling.【Size】Carrot : 8\", Bunny : 2.5\"【Color 】Pink/Purple【Material】Organic cotton, cotton ✂【Gift】If you are looking for a gift, PLEASE buy a gift wrap(See Gift wrapping details)【Care】It is recommended to wash only by hand, with mild detergents, dried naturally.-----------------------------------------------------------------------✈ Ship worldwide by Fast-ship.co Mail Standard / Thailand post / PostNL / Asendia / USPS✈-- Instant tracking-- We ship Mon-Fri (ex. Holidays)-- To USA : Fast-ship.co Mail Standard via USPS mail service system : Estimated time delivery 10-14 days-----------------------------------------------------------------------➽ UPGRADE TO EXPRESS SHIPPING ➽-- Make your selection on the Shipping Method page✈ESTIMATED DELIVERY TIMES✈-- USA: 3 - 5 business days-- EU: 3 - 5 business days-- Canada: 4 - 6 business days-- Australia + New Zealand 4 -7 business days-- The rest of the world: 3 - 5 business days➽CONTACT PHONE NUMBER is required for including on the shipping label and courier delivery purpose.Please leave your phone number / note when you place an order.➽ PLEASE NOTE that the delivery is not available to P.O. Boxes. The area that appears \"Remote area\", an additional delivery fee will be charged.------------------------------------------------------------------------📷 The picture was taken in natural light.💻 Product color may slightly vary due to photographic lighting sources or your monitor settings.✔️ Any questions *Message seller* ✉🇫​​​​​🇦​​​​​🇨​​​​​🇪​​​​​🇧​​​​​🇴​​​​​🇴​​​​​🇰​​​​​Animal gift idea : https://www.facebook.com/tanmadeshop",
    "reviews": [
      "My K4 class loves playing with these",
      "Beautiful workmanship and great service!  I will buy for this shop again!",
      "absolutely adorable and beautifully crafted",
      "Great product and well made. Prompt service and reliable early delivery. Thanks"
    ]
  },
  {
    "productId": "sa0svzdGRz",
    "url": "https://www.etsy.com/listing/1431843111/hand-painted-easter-eggs-hanging-easter?click_key=61109d7e5ceac155b2d0649282af3e44ed6d413c%3A1431843111&click_sum=0fae6e62&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-47&frs=1&sca=1&content_source=2c4ac89327fa277303193eaed901ff3bdf0f3eec%253A1431843111",
    "title": "Hand-Painted Easter Eggs | Hanging Easter Eggs | Decorative Eggs | Floral Painted Easter Eggs | Set of 6",
    "description": "Hand-Painted Easter Eggs | Hanging Easter Eggs | Decorative Eggs | Floral Painted Easter Eggs | Set of 6Set of 6 hand-painted Easter Eggs are a unique and beautiful addition to your Easter celebrations. Each egg is carefully hand-painted with intricate designs and patterns. The eggs are made from high-quality wood and come painted in a variety of colors in a springtime palette. These Easter Eggs are perfect for decorating your home, table, or Easter basket. They also make wonderful gifts. The set of 6, 2.5\" wooden eggs comes in a half dozen paper egg carton suitable for gifting. Please specify if you would like the eggs with a screw eye/twine hanger or plain.",
    "reviews": [
      "Cutest li’l handpainted eggs just as described.",
      "These Easter eggs are even prettier in person! Very happy with this purchase!",
      "I just love my purchase!  Even prettier in person!",
      "i love this easter garland ~ it’s so perfect for my pantry and also my easter tree. this shop always ships so quickly ~ i love the colors on this paper garland ~ so pretty and fun!"
    ]
  },
  {
    "productId": "NoRZGYPPxT",
    "url": "https://www.etsy.com/listing/1164470913/personalized-easter-bag-jute-easter-bag?click_key=14f61f9c958b1a93bbf49a1f6a892afb0e0cb130%3A1164470913&click_sum=bfc501ee&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-48&bes=1&sts=1&content_source=61f014c236f237bf9f89e9061e3b3e8d7774d9f7%253A1164470913",
    "title": "Personalized Easter Bag | Jute Easter Bag | Easter bunny with name | Easter basket for children | gifts for Easter or as an Easter basket",
    "description": "Jute bag for children with padded handles. Perfect for collecting Easter nests or as a nice gift idea.Dimensions:20x20x11cmColors of rabbits:- rose metallic- blue metallic- turquoise metallic- white- light pink- Light Blue- light green- red- blue- gold- silver- black*other colors on requestMaterial and care instructions:- Material: 100% jute- Handle: Solid cotton- Colour: naturalInside is coated and can also withstand liquids and dirt. It is washable. Not suitable for washing machine and dryer.-----------------------------Important information:This article is made to your liking and is therefore non-returnable. Therefore, check your details before ordering or send us a message if you are unsure.Jute is a natural product, different strengths and colors of the fibers are part of the characteristic material and therefore do not constitute a reason for complaint!The decoration shown in the product image is not part of the scope of delivery.You can find more great personalized gifts here:https://www.etsy.com/de/shop/JelliesDesign",
    "reviews": [
      "The super fast shipping even surpasses some online giants 👍 Simply mega.\nThe bunny bag arrived lovingly packaged and I'm already looking forward to handing it over at Easter.\nThe rabbit picture and font look great.\nThank you very much ☺️",
      "Very pretty, decorative and individual! Exactly what I was looking for!",
      "I'm looking forward to Easter. The bag will make your eyes light up."
    ]
  },
  {
    "productId": "muGUzseSKB",
    "url": "https://www.etsy.com/listing/780518329/naturally-dyed-rainbow-wooden-eggs?click_key=6a21036b1f690350a1efb0e4daa70fe74e4df9d9%3A780518329&click_sum=185c2338&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-864753-1-49&bes=1&sts=1&content_source=3adea0cc16cf9f19df41051add63c3d15d03ed9c%253A780518329",
    "title": "Naturally-Dyed Rainbow Wooden Eggs - Chicken Eggs - Easter Decor - Home Decor - Eco-friendly Birch Wooden Eggs for Spring - Opt. Eye Hooks",
    "description": "PLEASE READ FULL DESCRIPTIONNaturally-dyed Rainbow Wooden Eggs are featured in gorgeous, earthy - tones!Eco-Friendly wooden eggs!Eggs measure 2 1/2\" tall.Miniature 1 1/4\" eggs are also available.Ditch plastic this spring and switch to wooden eggs perfect for spring home-decor, filling baskets, or egg hunts for children!Option for eye hooks for easy spring decorating!Eggs come in sets of 6 (one of each color) or 12 (two of each color) or 24 (four of each color) or 48 (eight of each color):Earthy, muted red, orange, yellow, green, blue, and purple!KEEP OUT OF SUNLIGHT TO PRESERVE NATURAL DYE.Our eggs are hand-dyed and there may be slight variations in color. The \"middle\" band of the egg will appear lighter in color due to these being wood turned eggs.Our natural dyes are made with veggies and spices.The dyes penetrate the wood and allow the natural grain pattern to shine through.Eggs are sealed with 100% organic beeswax and organic jojoba oil for a beautiful, smooth finish.No harsh or dangerous chemicals!Comes in a drawstring bag for easy storage and travel.Each egg is either 2.5\" tall with rounded ends resembling a real chicken egg or 1 1/4\" tall with rounded ends resembling a real robin egg.Keep miniature 1 1/4\" tall eggs out of reach of children under 3. Supervise use.Made in the mountains of Maine by Mountain Mom Studio <3",
    "reviews": [
      "Quick shipping and the wooden eggs are so pretty! Great quality and just so fun!",
      "Perfect Easter eggs to add to my collection! As pictured and arrived quickly.",
      "Very nice quality and fast shipping! Thank you !!! ❤️"
    ]
  },
  {
    "productId": "DPlKUeGRxW",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=7e8a3837239974f70e4691aab67254e27ef6ea8f%3A1567221560&click_sum=702b7792&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!",
      "Super quick delivery, item looks impeccable. Highly recommend. I bought it as a gift and multiple people said \"That is the nicest charcuterie board I have ever seen\""
    ]
  },
  {
    "productId": "HiRfByyBfw",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=73aab1523e2eacdd7d8eda04b5948ac33166cb2e%3A1544035118&click_sum=a5afd793&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "NQWLyqpFlV",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=e95b81fa79dafe1c34430106950c99ab572de451%3A747068567&click_sum=824cb869&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!"
    ]
  },
  {
    "productId": "PTbmDhReiB",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=bd19a73e7e1d1d65da3e2ef5130db75e767c9782%3A654638870&click_sum=cfc55d03&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "DxrLQVLnik",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=b137694e2da507cf6a32b50149266c5a10a52690%3A1355783916&click_sum=5c142a7b&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist"
    ]
  },
  {
    "productId": "lbsYAuKDZr",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=297105d35ea5e7ee02d3846b3383afc42ad867f3%3A1411614241&click_sum=da50dcf7&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!",
      "The only thing I didn’t consider was my outlet is sideways where I wanted to put it and the prongs on this base are not able to be turned. The item itself is great though!"
    ]
  }
]
