[
  {
    "productId": "utAkRUeDYC",
    "url": "https://www.etsy.com/listing/1459028401/personalized-cooler-for-dad-fathers-day?click_key=3f4395ecec284f22836d9c27c9cf7a29262c1a0e%3A1459028401&click_sum=bf657f17&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-1&pro=1&frs=1&etp=1",
    "title": "Personalized Cooler for Dad, Fathers Day Gift, Mens Gift, Wooden Cooler, Backyard Decor, Custom Cooler, Backyard Patio Furniture",
    "description": "The perfect housewarming, wedding gift, anniversary gift, or just for you!! This cooler is great to display drinks inside or outside with a handmade Frio removable liner that makes refilling and cleaning a breeze!*SIZE & CAPACITY● This cooler holds around 24 cans● Dimensions 24”Long x 12”Wide x 10”Tall*ABOUT THIS ITEM● Handbuilt in Texas from Western Cedar● Removable insulated liner snaps in with buttons● Laser Engraved Personalization● Can stay outdoors, does not need to be inside.*HOW TO ORDERTo order, select your style then enter what you want engraved. Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only to request a proof please make a note when placing your order.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.**Social Media:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product.  We appreciate every opportunity to earn your business!  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Awesome ice chest! Great high quality product!!!!",
      "Beautiful cooler!! It was a gift that was immediately put to use!",
      "As advertised, fast shipping. Thanks!"
    ]
  },
  {
    "productId": "KGpcslmPtW",
    "url": "https://www.etsy.com/listing/529445058/mini-bird-nest-stake-rusty-metal-garden?click_key=1d2e10cb89eeb4fe5af6df8336717b4359273abe%3A529445058&click_sum=36ecf977&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-2&pro=1&etp=1",
    "title": "Mini Bird Nest Stake | Rusty | Metal Garden Stake | Metal Yard Stake | Wild Bird Art | Metal Bird Art | Bird Gift for Mom | Garden Art S907",
    "description": "Mini Bird Nest Stake | Rusty | Metal Garden Stake | Metal Yard Stake | Wild Bird Art | Metal Bird Art | Bird Gift for Mom | Garden Art S907RAvailable in green, rust, and white.Dimensions: Approximately 7.5 x 7.5 x 32.5 inches tallSKU# S907RFavorite our Etsy shop and check us out on Social Media for more nature inspired home decor!Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "Such a lovey touch to my garden!",
      "Very cute and artsy in my perennial garden",
      "GREAT CUSTOM RUSTY METAL BIRD NEST EVERYTHING THING ABOUT NEST AS ADVERTISED"
    ]
  },
  {
    "productId": "XAnIvfPWxA",
    "url": "https://www.etsy.com/listing/1339317020/sun-with-bell-hanging-ornament-gifts-for?click_key=2d81e14c7a94c02ebffcf36a318069281fe7a9c8%3A1339317020&click_sum=63fc8c93&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-3&pro=1&etp=1&sts=1",
    "title": "Sun With Bell Hanging Ornament | Gifts for Mom | Garden Decor | Yard Art | Patio Decor | Metal Art | Gardening Gifts | Wind Chimes | Decor",
    "description": "Sun With Bell Hanging OrnamentAdd a healthy dose of sunshine to your outdoor space with this sunny ornament.About the productEvery garden relies on sun to thrive. With this hanging ornament, you can pay homage to the star that makes your favorite plants and flowers possible—and you can do it in style. With intricate details and a flamed metal finish, this piece isn’t just sunny—it’s a true source of life!Why we love itThis ornament is the perfect gift for a new homeowner. After all, you can’t go wrong with something as universally-beloved as the sun.Shipping detailsMost orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote dad, “We’re going as fast as we can! Promise!”)Measurements6” x 6” x 15”MaterialsHandcrafted, flamed metal.DetailsQuick, frustration-free installation.Backed by our friendly, one-year warranty",
    "reviews": [
      "Cute and compact. I love the way it sounds when the wind blows.",
      "This is just a beautiful photo. Thank you for sharing this. I am glad you are loving it :) We truly appreciate your business and looking forward to being your preferred choice for garden decors 💚",
      "Cute and quality item! Def recommend!",
      "Awesome! We're so happy knowing you like the Sun with bell handing ornament, Courtney. Thank you for your business! 💚",
      "Love it!! A+++ seller…looks awesome on my porch",
      "Yay! I can only imagine how lovely the Sun with bell in your garden. We are so grateful with your purchase and we're very happy knowing you're loving the product. Thank you for your business! ❤️",
      "Love this item. Picked my own gift at white elephant so I could keep it for myself.",
      "We're so happy reading your review. Glad to know you love it ❤️ Thank you for trusting our small business :)"
    ]
  },
  {
    "productId": "FUupeJHxTY",
    "url": "https://www.etsy.com/listing/1496449931/exquisite-mosaic-table-a-unique?click_key=31210f1ee551e8e497d16d456ae122d5c45e1981%3A1496449931&click_sum=cba7c424&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-4&pro=1&frs=1",
    "title": "Exquisite Mosaic Table: A Unique Statement Piece for Your Home outdoor dining table dining table, these table used patio table, coffee table",
    "description": "Introducing our extraordinary mosaic table, a true masterpiece that will elevate the style and elegance of your living space. Handcrafted with meticulous attention to detail, this stunning table showcases the artistry and beauty of mosaic craftsmanship. The intricate mosaic design, composed of carefully selected tiles, creates a mesmerizing visual display that is sure to captivate anyone who sets eyes on it.Our mosaic table is not just a functional piece of furniture, but a work of art that brings a touch of sophistication to your home. The expertly crafted mosaic pattern features a harmonious blend of colors and textures, adding depth and visual interest to the table's surface. Each tile is carefully placed and secured to ensure durability and longevity.This coffee table is more than just a place to rest your drinks or display your favorite decor items. It becomes a focal point of your living room, sparking conversations and impressing guests with its unique design. The sturdy construction and quality materials used in its creation guarantee that it will withstand the test of time, providing you with years of enjoyment.Whether you prefer a modern or a more traditional aesthetic, our mosaic table seamlessly integrates into any interior style. Its versatile design allows it to be used as a coffee table, an accent piece, or even as a stylish centerpiece in your dining area. The possibilities are endless, and the versatility of this table ensures that it will complement your existing decor effortlessly.We understand the importance of customization, which is why we offer a range of options to personalize your mosaic table. Choose from different shapes, sizes, and color palettes to create a piece that perfectly matches your unique style and preferences. Our skilled artisans will bring your vision to life, creating a custom-made mosaic table that is truly one of a kind.✅ Infos :-Place Origin : Morocco ( FEZ )-Materials    : Organic CLAY-Color          : Every Table has unique petterns (mosaic tiles ), colors and sizes✅ Take care of your Moroccan Mosaic Table :- Wipe your ceramic table only with a soft cloth or sponge,- Clean your table by hand gently✅ Need Help We are here for you Contact Us :-Please do not hesitate to contact us via etsy. we will get back to all messages with in 24 hours✅ Packaging and Shipping- The Mosaic tables Packed in bubble wrap with other packing materials, placed in a wooden box and shipped withe care.- All of our products are shipped with FedEx.- We ship All the week except for Saturday, Sunday and holidays.- After you have placed your order, you will receive a confirmation message requesting a phone number. We need it for the tracking documents.- We will provide a tracking number once your item is shipped- We take a lot of pride in our items and will always make sure they are very well packed and protected for shipping.- Please be aware of delays on shipping that are out of our control such as Customs holds, Holidays, weather delays or other disruptions.✅ MONEY BACK GUARANTEEYou are covered by the Returns & exchanges policy of our Shop policies.We want all our customers to be completely satisfied!Thank you for visiting",
    "reviews": [
      "Top transaction. Very nice carpet.",
      "The pillow I purchased was even more beautiful in person, and of exceptional quality. Heavy wool with saturated colors. Shipping was super fast and communication was a breeze. I highly recommend this shop.",
      "Beautiful quality, packaged very well and I’ll definitely be ordering from this shop again in the future. Thankyou so much!",
      "Rug is beautiful. Seller was incredibly helpful, responsive and communicative and the item arrived at quickly and well-packaged. couldn’t have asked for a better experience."
    ]
  },
  {
    "productId": "MtdtPagy4s",
    "url": "https://www.etsy.com/listing/1576995418/amazing-mosaic-table-handmade-round?click_key=04774fc5dd0c226c920951ef7249c12107e1a2ee%3A1576995418&click_sum=0c30a9b3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-1&pro=1&frs=1&sts=1&content_source=3f6497a5b6d12a2833a5df94d6666e20e3c40d19%253A1576995418",
    "title": "AMAZING MOSAIC TABLE, Handmade Round Green Table, Traditional Custom Made Flower Design,  Luxurious Outdoor Patio Furniture For Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric design in diffrent colors. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades, creating a warm and inviting look.The mosaic pattern on the table consists of a variety of colors, including vibrant blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.CONTACT US FOR MORE CUSTOM MADE ORDERS , WE ARE OPEN TO NEW DESIGNS !GET YOUR IRON CHAIRS FOR YOUR TABLE USING THIS LINK :https://www.etsy.com/listing/1502709918/set-of-moroccan-iron-chairs-handmade",
    "reviews": [
      "Love my jade green table!! Excellent communication with Muhammad and the table was made and dispatched very quickly. Looking forward to eating a beautiful middle eastern feast at this table!🥰",
      "This table is beautiful and perfect. Thank you so much. Would not hesitate to buy from you again.",
      "I'm extremely satisfied. Seller contacted us immediately. Package came super quickly. The goods were very well packaged. Top seller. Big business, congratulations. THX and peace"
    ]
  },
  {
    "productId": "erKgabYxVX",
    "url": "https://www.etsy.com/listing/1682152411/large-flowerpot-for-plants-of-all-kinds?click_key=1c9b5134df478273b00b5c597841adc8d693dfe8%3A1682152411&click_sum=7f6c9637&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-2&pro=1&cns=1&sts=1&content_source=9da6c4dee21ebc3ee675c018a56cd3ff25738d52%253A1682152411",
    "title": "Large Flowerpot for Plants of all kinds (Gradient Blue color) - 8\" Diameter by 7\" Tall",
    "description": "This 3D printed pot has a great look. Just add your plant and enjoy!  Approximately 8\" diameter by 7\" tall with a 5.5\" opening.*I do not put drain holes in the bottom of the pot unless you want me to.  The decision is up to you.  If you want them and let me know, I will put them in before I ship it or you can do it yourself if you decide you want them later.*If you are interested in different colors, sizes, etc. please contact me with your request and we'll see if it can be worked out.*Note: 3D printing is not an exact science and due to natural variations in the 3D printing process and hand assembly units may contain small blemishes that will in no way affect the quality.  I take pride in my work and strive to provide the best quality possible.**Plant not included",
    "reviews": [
      "I can't say enough how much I LOVE these planters and ordered this one special for a Christmas Cactus given to me by my grandmother who passed recently. It had to have just the right planter to create the elegance and this planter was perfect.",
      "It looks great!   Thank you for your kind words. I’m so glad you like my planters and I appreciate your support and business! - Ben",
      "Everything was perfect and he was very pleasant to do business with",
      "I needed a little help and got response immediately. It was smaller then I imagined and lighter in color but still beautiful",
      "Very nice lightweight pot. I really like it. Thank you"
    ]
  },
  {
    "productId": "jTWtxuXLjm",
    "url": "https://www.etsy.com/listing/1654582853/set-of-2-angel-statue-with-solar-lantern?click_key=74d004bdbc37167e5e8dc4b552c3dde920cb7a7f%3A1654582853&click_sum=1ef33d87&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-3&pro=1&content_source=c86fbd4010332c9f725cc26235015f1499eba448%253A1654582853",
    "title": "Set of 2, Angel Statue With Solar Lantern, Yard Art, Garden Decor, CHOOSE Color",
    "description": "* Dim: 15\" H x 6\" L x 5\" W.* Beautiful Statue Twin Angel Solar LED with White lantern.* Light Up From Dusk to dawn up to 8 hours (Depending on the placement location).* Material: Cold Cast Ceramic",
    "reviews": [
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it.",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!"
    ]
  },
  {
    "productId": "jSGZgQfqIY",
    "url": "https://www.etsy.com/listing/1459026657/personalized-cooler-for-dad-outdoor?click_key=351e1f2e2b2020cb0597cfc4be4cfabd5143dbfc%3A1459026657&click_sum=19851432&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-4&pro=1&frs=1&etp=1&content_source=8c675cbde20ea46748ef5febd84f1fc8203b4c24%253A1459026657",
    "title": "Personalized Cooler for Dad, Outdoor Patio Furniture, Fathers Day Gift, Mens Gift, Wooden Cooler, Backyard Decor, Custom Cooler",
    "description": "The perfect housewarming, wedding gift, anniversary gift, or just for you!! This cooler is great to display drinks inside or outside with a handmade Frio removable liner that makes refilling and cleaning a breeze!*SIZE & CAPACITY● This cooler holds around 24 cans● Dimensions 24”Long x 12”Wide x 10”Tall*ABOUT THIS ITEM● Handbuilt in Texas from Western Cedar● Removable insulated liner snaps in with buttons● Laser Engraved Personalization● Can stay outdoors, does not need to be inside.*HOW TO ORDERTo order, select your style then enter what you want engraved. Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only to request a proof please make a note when placing your order.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.**Social Media:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product.  We appreciate every opportunity to earn your business!  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Was bought as a Christmas present for people who host outdoor parties often. They loved it. The quality of the cooler is great. A definite upgrade on a plastic cooler!",
      "Love it! Great as a gift",
      "A nice item to add to patio activities."
    ]
  },
  {
    "productId": "kWZxHzXFWt",
    "url": "https://www.etsy.com/listing/1688366261/4-seater-demounted-wooden-garden-sofa?click_key=042057f2be19c58a97eeaa45eb7cdd7fd4dc5da3%3A1688366261&click_sum=7d6a8008&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-5&pro=1&frs=1&content_source=09db77f85c4d51d340e9884477b9f829a2a1e707%253A1688366261",
    "title": "4 Seater Demounted Wooden Garden Sofa, Modern Garden Patio Furniture, Best-Quality Luxury Outdoor Sofa",
    "description": "\"Welcome to the epitome of outdoor comfort and craftsmanship with our Hazar 4 Seater Sofa, meticulously handcrafted from First Class Finland Northern Pine Wood. Designed for both durability and style, this sofa features waterproof cushions made from fabrics prioritizing human health, ensuring a comfortable and worry-free lounging experience.Crafted entirely by hand, this sofa boasts a 100% wood construction, promising a long lifespan and a timeless appeal. Its demountable, modular, and lightweight design offers versatility and ease of transportation, while its resistance to ultraviolet sunlight ensures lasting beauty even under the sunniest skies.Say goodbye to mold and fungus worries as our sofa remains unaffected, thanks to its premium materials and construction. Sink into luxurious comfort with high-quality sponges, while the convenience of zipper-equipped cushions allows for effortless cleaning whenever needed.It is enhanced its durability and aesthetic with Polisan Brand Water Based Exterior Protector, offering extra protection against the elements. For maintenance, simply treat the wood with teak oil or a water-based protector to keep it looking its best.Engineered with precision, our sofa is assembled using steel screws specially designed for our production, ensuring reliability without the risk of rusting or breakage. Installation is a breeze with our comprehensive package, including a practical installation diagram and all necessary parts.Please note, like all wooden products, we recommend retightening the mounting bolts one month after assembly for optimal performance. Elevate your outdoor space with the Hazar 4 Seater Sofa, where craftsmanship meets comfort in every detail.\"Product Dimensions:4 Seater Sofa: H90cm*W80cm*L188cmThe installation manual will come with the product.***Ship worldwide***",
    "reviews": []
  },
  {
    "productId": "qlIFKATzSN",
    "url": "https://www.etsy.com/listing/527476744/quoth-the-raven-nevermore-raven-metal?click_key=ef8ddcb39c4400ce75c63e97dfd6897c30042482%3A527476744&click_sum=5e6acbe2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-6&pro=1&etp=1&content_source=4e4e8fec41d6c5e85c5b693b96ac0f13f6372837%253A527476744",
    "title": "Quoth the Raven, Nevermore, Raven Metal Fence Decor, Rusted Metal Garden Art, Metal Bird Art, Metal Garden Gift, Metal Accent Piece, B758",
    "description": "Quoth the Raven, Nevermore, Raven Metal Fence Decor, Rusted Metal Garden Art, Metal Bird Art, Metal Garden Gift, Metal Accent Piece, B758Please note that the Stump is not included with The Raven - It's available to purchase in the miscellaneous categorySKU# B758 Dimensions: 10 x 11.5 x .5 in.Please favorite our Etsy shop and follow us on Social Media:Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "Love it! It will be perfect on my porch.",
      "Rusty Raven is awesome and looks amazing on my pergola. Built to last and has character in the details.",
      "Arrived on time. Already on my garden trellis."
    ]
  },
  {
    "productId": "JTPblVRrbs",
    "url": "https://www.etsy.com/listing/1683647393/silly-garden-chicken-ornament-colourful?click_key=0336ba506a0fc987717f7cd5b3117edc26c8567b%3A1683647393&click_sum=c8c96bb3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-7&pro=1&content_source=50e1bf91bdc451a730b974785ef86c7c02900c6e%253A1683647393",
    "title": "Silly Garden Chicken Ornament | Colourful Resin Art Lawn Decor | Home Outdoor Decorative Bird | Eccentric Wacky Bright Lawn Sculpture Kids",
    "description": "🐔 Garden Silly Chicken Ornament | Colourful Resin Art Lawn Decor | Chicken Outdoor Decor Home | Chicken Ornament Garden | Lawn Home Sculpture 🐔✨ What's included:🐔 1x Garden Silly Chicken Ornament (choice of 9 colours)✅ Material: Resin✅ Size: 7.8*19.6cm🚚 Free and fast shipping💵 30-day money back guarantee✅ Handcrafted and handmade💖 Thank you for choosing Cal's Craft Store! We specialise in handcrafted home decor, carefully crafted with attention to detail. Each piece is made from scratch, ensuring its uniqueness and quality.💖 Your support means the world to us and allows us to continue creating beautiful items for your home. Thank you for supporting handmade!",
    "reviews": []
  },
  {
    "productId": "xLznyajuFj",
    "url": "https://www.etsy.com/listing/1166770730/table-for-ramadan-thanksgiving-table?click_key=47f6291511b8f8ec4a3d51b5ea21c2525a3c366d%3A1166770730&click_sum=13419fd5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-8&pro=1&frs=1&sts=1&content_source=36ef1b55c6b08d1a048d12cc421d3c35f0cdfbe9%253A1166770730",
    "title": "Table for ramadan ,Thanksgiving table decor, picnic table folding table, boho picnic , wood, wood table,portable table,Boho picnic table",
    "description": "Thanksgiving table* 180cm-70 cm table (71 ınch-28 ınch)33 cm high (13 inh)*This product is completely handmade and very durable.*Each package is carefully wrapped to ensure safe delivery,Boho picnic table,boho beach picnic table***If you want to make special production, please contact****** the table is brown* Europe: 7-14 days;* USA & Canada: 10-17 days;* Australia & everywhere else: 10-30 days***Damaged products are covered by our warranty",
    "reviews": [
      "Exactly as pictured on website.  Purchased for a baby sprinkle but will also use for birthday parties and other events such as picnics/pool parties.  I’m thinking of purchasing another one.  It can easily store away plus no need for extra chairs. Just floor pillows!  Love it!",
      "I absolutely love the table and I will definitely buy another in the near future!!",
      "I own a luxury picnic company and have been using these tables for years. They are the perfect size, store easily and are top quality. My first set of tables are still going strong after 3 years! Just bought a new set in a lighter color and couldn’t be happier! Beautiful! Shipment was super fast! I would absolutely recommend these tables!"
    ]
  },
  {
    "productId": "UBNbJTkqAc",
    "url": "https://www.etsy.com/listing/1666095846/2-pack-gorgeous-rose-solar-lights?click_key=b32466363e66b77fe56c0b2b8ee12dc35fae50d1%3A1666095846&click_sum=3ed620e7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-5&pro=1&frs=1&sts=1",
    "title": "2 Pack - Gorgeous Rose Solar Lights, outdoor front or backyard decorations. Beautiful Day or Night. The Perfect Gift",
    "description": "These Gorgeous Solar Lights will transform your front or backyard into beautiful work of art!- SOAR POWER - Turn the 'ON / OFF' Switch at the bottom 'ON'. Let the Sun charge it for at least 4 hours and enjoy the power of the Sun to light up your garden.- 4 GORGEOUS COLORS - Red, White, Yellow and Pink color imitation orchid will look gorgeous during the day or night.- FLEXIBLE STEMS - The flexible stems can be moved around till you are satisfied.- PERFECT GIFT - These Solar Lights are the perfect gift for anyone special in your life. They are perfect as a housewarming gift!",
    "reviews": [
      "Bright and colorful \nCan’t wait to put them out",
      "Gorgeous wind chime with beautiful colors!",
      "Great product. I love how it lights s up different colors. It gives you a sense of peace."
    ]
  },
  {
    "productId": "dOquSMTBXL",
    "url": "https://www.etsy.com/listing/815247527/outdoor-patio-colorful-abstract-throw?click_key=96bb7bfbfbdb3d43b6e1e239e9c0c0b1b087b238%3A815247527&click_sum=839d9e10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-6&pro=1&frs=1",
    "title": "Outdoor Patio Colorful Abstract Throw Pillow Intuitive Art Pillows Abstract Artist Watercolor Painting Outside Cushions Artwork Garden Decor",
    "description": "FREE SHIPPING!!\"Rose Street\" is one of my original abstract artworks transformed into unique outdoor throw pillows. The outdoor pillows have UV protection, and are waterproof / mildew resistant.Cut and sewn to order in the USA.All the art and design you see in my store is unique and sold EXCLUSIVELY through my Sincerely Joy brand ✌️THANK YOU SO MUCH FOR YOUR SUPPORT OF MY ART!➤ C.Cambrea Art printed on both sides.➤ The pillow is filled and sewn shut.➤ Durable 100% spun Polyester Poplin fabric.➤ Tumble dry low, do not bleachAVAILABLE SIZES:➤ 16\" x 16\"➤ 18\" x 18\"➤ 20\" x 20\"🌸SHIPPING: These pillows are made to order so kindly allow 4-6 business days for printing and shipping prep.➤ Fav my shop if you like this. Etsy will notify you when i post new work ✌️🌸 AS A THANK YOU FOR THE SUPPORT OF MY ART all customers receive a 10% off coupon upon checkout. Good for your next purchase with me! Every purchase enables me to continue to do what I love and your support is so appreciated! ❤︎Let’s Connect:☀︎ Read more about the products and brand: http://www.sincerelyjoy.com/☀︎ Instagram:@ccambrea☀︎ Patreon:https://www.patreon.com/ccambrea☀︎ Pinterest:https://www.pinterest.com/SJstore/© C.Cambrea Art🌸 Sincerely Joy",
    "reviews": ["Very happy with my purchase!", "Love it so much! Awesome"]
  },
  {
    "productId": "yLOiEJtf0U",
    "url": "https://www.etsy.com/listing/1682835878/child-adult-wood-flower-swing-indoor?click_key=e82f0c63c04c15b537d0aaab1dc0af1b47ac8092%3A1682835878&click_sum=f80b8858&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-7&pro=1",
    "title": "Child Adult Wood flower swing Indoor Outdoor, Porch swing with rope, Outdoor swing stand for adult, swing chair stand, Wood swing bench",
    "description": "🌸 Child Adult Wood flower swing Indoor Outdoor, Porch swing with rope, Outdoor swing stand for adult, swing chair stand, Wood swing benchElevate your living space with our stunning Floral Swing, a perfect blend of elegance and playfulness. Handcrafted with care, this unique indoor swing chair is designed for both your living room and children's spaces, adding a touch of charm to every corner.Perfect as a charming addition to children's rooms, living room decoration or even restaurants and photo studios.💧order preparation time: 1-3 business daysKey Features:✨ Floral Elegance: Adorned with a captivating flower pattern, our swing seamlessly integrates into any home decor style.❇ Quality Craftsmanship👶 Kids Room Decor🛋️ Living Room Decor💢Ideal for Restaurants and Photographers✅ Positive Impact on Children❤Handcrafted with care and attention to detail🔰Suitable for indoor and outdoor use💯Our swings are 100% handmade and wooden.♻Eco-friendly materials for a sustainable choice🎁nice gift idea✨ Eye-Catching Home Accent: Make a statement with this stylish indoor swing that doubles as a decorative masterpiece.DIMENSIONSwood size: 65 x 20 cm (25.6 x 7.87 inches)Swing load up to 120 kg.Size of rope: 2- 2.5 metersIf you let us know your hanger dimensions, we can send them in the sizes you want. After placing your order, if you want dimensions other than the specified dimensions, please let us know via message.-----------------------(𝙋𝙇𝙀𝘼𝙎𝙀 𝘾𝙊𝙉𝙏𝘼𝘾𝙏 𝙈𝙀 𝙁𝙊𝙍 𝙔𝙊𝙐𝙍 𝘾𝙐𝙎𝙏𝙊𝙈 𝙎𝙄𝙕𝙀𝙎!!)---------------- ---------------It can be used as decoration in photo shoots, housewarming parties, restaurants and cafes. It may also be a good idea for furniture decoration. It can be hung outdoors and indoors.🌴Swings are made of pine and oak.This wooden swing is brushed, varnished and coated with paint that protects the wood from moisture and UV rays.natural swings have rounded edges, making them safer.⛔Two carabiner clips are included in the package to hang the swing.Swing hanging hardware is NOT INCLUDED.⚠️ SECURITY:Do not leave your child unattended!!! Swings are designed to be used under 100% adult supervision. We are not responsible for any injuries resulting from misuse of our product.⚠⚠FOR ROPE DIMENSIONS LARGER THAN 3 METERS;SINCE WE DO NOT HAVE SPACE AT THIS HEIGHT, WE ADD THE ROPE TO IT AND SEND IT. YOU JUST THREAD A ROPE THROUGH THE HOLES AND TIE A KNOT ACCORDING TO YOUR OWN MEASUREMENTS.EVERYTHING OTHER THAN THIS COMES PREPARED🅾🆃🅷🅴🆁 ​ 🆂🆆🅸🅽🅶 ​ 🅼🅾🅳🅴🅻🆂https://www.etsy.com/shop/ElitedesignsforyouTR?ref=profile_header🌟 Order Yours Today and Blossom Your Space! 🌟",
    "reviews": [
      "I was in contact with many nice sellers on etsy. He was by far the best. He responds to all questions and requests. Very helpful and very nice. Responds very quickly and really tries very hard. You don't need to worry. The price is fair. Swing is one to one as in the photo.",
      "Very fast shipping very happy with the item"
    ]
  },
  {
    "productId": "NILelEaBdj",
    "url": "https://www.etsy.com/listing/1437604536/green-sun-lounger-with-backrest?click_key=5e2cce3a0716e2e11942c42743a269b7385cd77a%3A1437604536&click_sum=87e9b3fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-8&pro=1&frs=1&etp=1",
    "title": "Green Sun Lounger with Backrest - Lightweight Camping Chair - Adult Folding Picnic and Summer Chair - Seaside Towel to sunbathe",
    "description": "Experience the ultimate relaxation and bask in the warm sun with our green beach chair, also known as a seaside lounger. Expertly crafted with a specially designed folding structure, this chair is the perfect companion for your next beach trip, allowing you to soak up the sun while enjoying the soothing sound of the waves.Our portable beach lounger is perfect for those who love to sunbathe and relax in the great outdoors. With its comfortable wooden back support and adjustable recline, you can easily find your desired position and enjoy the scenery around you. Plus, its lightweight and foldable design makes it easy to carry with you wherever you go, whether it's to the beach, camping, or simply lounging in your own backyard.Don't settle for a mediocre outdoor chair that doesn't meet your needs. Choose our high-quality seaside towel and sun lounger and take your outdoor experience to the next level.Dimensions:Roll Condition: 27.55in / 70cmHalf open: 43.03in / 110 cmFully open: 62.99in / 160cmCarrying capacity:120 kg / 265 lbProduct Information:Experience the ultimate comfort and relaxation with our innovative and stylish foot hammock. Our design is based on the formula of a healthy rest, which is to bring your feet closer to heart level and relieve blood pressure.Crafted with 100% cotton, our hammock twill fabric is not only durable but also soft and gentle on your skin. You'll love the comfortable feel of our foot hammock, which is also machine washable for easy cleaning.We've used beech wood to create the recline bars, ensuring maximum durability and long-lasting use. The lightweight design, weighing only 750 grams, makes it easy to carry with you wherever you go, whether you're on a bicycle, motorcycle, skateboard, or roller skates.It has a much more durable structure than ordinary camping chairs thanks to its baked beech wood legs and the extra lined pocket where the legs enter.With four different options for height and recline, you can adjust our foot hammock to your desired level of comfort. The snaps on the fabric make it easy to use with shoes, preventing any dirt or pressure on the fabric, and also allows for easy wrapping on sticks.Our foot hammock is not just functional, but also adds a touch of style to any space. You can attach clip-on items between the knitting ropes, or even decorate your wall with colorful mini-long hammocks for a unique and personalized touch.Invest in our foot hammock today and take the first step towards a healthier and more relaxing lifestyle!*Hanging ornaments are not included.Feedback & CommunicationCustomer service is very important to us. Do not hesitate to raise any questions before or after your purchase. I look forward to responding to your messages. You will make me very happy if you make your valuable comments with visuals after the product purchase.ShippingI carefully pack your products and send them by express cargo. Cargo delivery times;3-7 Days for USA,3-5 Days for Europe,5-10 Days for Australia and other countries.",
    "reviews": [
      "The quality is good. Matched the description. I love it",
      "Hi Jennifer, I really appreciate your nice feedback. I think the great thing about the folding chair (minlong) is that it is so simple yet has 4 different seating and reclining options. I hope you enjoy using it.",
      "Perfect!",
      "Hi Conor, I am grateful for your nice feedback. I wish you to use the folding chair on good days.",
      "Purchasing and shipping the lounger was completely uncomplicated, very friendly and nice seller. Arrived here well packaged. Nice, sturdy fabric, well made. Simple but great idea, works great! Thank you very much ;)",
      "Hallo Marie, zunächst einmal vielen Dank für deinen netten Kommentar und dein Feedback! Du bist wirklich ein sehr netter Mensch. Ich freue mich sehr, dass dir meine \"Chaiselongue\" gefallen hat und dass du ein angenehmes Einkaufserlebnis mit diesem Produkt hattest.\nIch habe das Produkt auch als \"Campingstuhl\" betrachtet und die Vielseitigkeit des Designs ist perfekt für Outdoor-Aktivitäten. Die Verwendung natürlicher Materialien trägt zu seiner Langlebigkeit und Umweltfreundlichkeit bei. Ihre Zufriedenheit mit der aufmerksamen und stabilen Lieferung und Ihr Feedback sind für mich sehr wertvoll. Wenn Sie weitere Fragen oder Wünsche haben, stehe ich Ihnen gerne zur Verfügung",
      "Super beach chair, good quality!\nVery nice Ali!",
      "Hallo Martina, vielen Dank für dein freundliches Feedback. Die Nutzung des Stoff-Liegestuhls ist äußerst angenehm und Kundenzufriedenheit hat für mich stets oberste Priorität. Ich bin sicher, dass es bei dir sehr stilvoll aussehen wird. Ich wünsche dir angenehme Tage mit dem Liegestuhl."
    ]
  },
  {
    "productId": "RofMWpLKqT",
    "url": "https://www.etsy.com/listing/701499318/garden-statue-metal-red-ant-with-solar?click_key=ddb9d77be3424b335d4cf38a67a645089eb17f81%3A701499318&click_sum=5e9bd12b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-9&pro=1&frs=1&sts=1&content_source=c61d1c73f6a5b831514ddc7dab968c7d45b3712f%253A701499318",
    "title": "Garden Statue, Metal Red Ant with Solar Powered LED Lights, Outdoor Figurine for Garden, Lawn, Yard and Patio Decoration and Ornament",
    "description": "ADD COLOR CHARM TO YOUR GARDEN: This metal yard art figure will add some color charm to your garden. The vibrant design turns this red ant into perfect landscape decor. This cute garden accent is a perfect housewarming gift for your beloved ones.EASY TO INSTALL: No wire installation. Just switch it on. The highly effective solar panel gets a full charge of the battery within 5 to 8 hours in sunlight. The fully-charged battery powers the two high quality cool white LED lights for up to 4 hours.HIGHLY PORTABLE DESIGN: You can place this charming yard statue virtually everywhere by gently adjusting its steel wire legs and the spring neck to have everything in the right position. It is easily placeable on the lawn, on the tree, on the lane, on the table, on the bench, on the terrace, on the window ledge, both outdoor and indoor.DURABLE: Three-layer UV resistant high-quality painting will not fade from the sunlight and will protect this metal garden ornament against rusting and corrosion caused by the rain and the moisture in your garden.ALL SEASON FELLOW FOR THE KIDS: Children can play with it during the day and enjoy its glowing eyes in the evening.MAINTENANCE-FREE: The light sensor automatically activates the LED lights at night and the solar panel starts charging again the battery in the morning.ECO-FRIENDLY: This perfect garden decor uses 100 percent renewable energy and is made of 95 percent recyclable materials. No additional power cost.Specification:1. Material: Steel2. Battery: 1 x R1S80H-A1 1.2V NI-MH Rechargeable Battery (Included)3. LEDs: Two4. Light Color Temperature: 5,500 K (Cool White)5. Solar Panel: Monocrystalline6. Switch: Slider ON/OFF switch7. Charging Time: 5 - 8 Hours8. Run Time: Up to 4 Hours9. Ant Dimensions: 10.2 x 10.6 x 4.7 Inch (H x L x W)10. Weight: 0.7 pound11. 100 % Renewable Energy12. 95% Recyclable Materials",
    "reviews": [
      "Great adorable item for the garden!   Its eyes do indeed light up every night and is very susceptible to porch lights turning off... in a good way!   If you can find your ant, flash on and off your porch lights and your ant will light up!  My Mom loves it and so do all of our kids.  I will say the one we received has a drooping head, but outside of that it is as described.",
      "We loved it. As cute as the picture and nice quality. Thank you Etsy!!",
      "This is a real cute little guy.",
      "So darn cute.  Arrived quickly after I ordered it.  Very pleased with my purchase."
    ]
  },
  {
    "productId": "2CbdvBUamj",
    "url": "https://www.etsy.com/listing/1387812487/concrete-turtle-garden-statue-outdoor?click_key=a9c287f5b569a6833d1e85a5dbb112f1535d5a12%3A1387812487&click_sum=36fd7769&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-10&pro=1&frs=1&sca=1&sts=1&content_source=906a7641b1f723495443790c5f602ce088264922%253A1387812487",
    "title": "Concrete Turtle Garden Statue Outdoor Decor Cement Lawn Ornament 7.5\" Stone Tortoise Yard Sculpture Reptile Art Statuary Figurine Gift Idea",
    "description": "A concrete turtle garden statue is perfect for garden lovers of all ages.This whimsical statue is made from concrete and feature a realistic turtle head an shell.The statue is finished with decorative concrete details and stand about 3.5 inches tall and 7.5 inches long.This garden decoration is sure to add delight to an garden space.Height: 3.5 inches tall.Length: 5 inches side to side.Width: 7.5 inches front to back.The weight of this garden statues approximate 5 pounds.Handmade USA here for you.Over two decades of experience in the garden sculpture industry.Professionally packaged.Safe arrival assured.Ships out within 3 business days.Customer Satisfaction Guaranteed.Ok thank you!",
    "reviews": [
      "I adore my turtle statue !!  It's very well crafted and looks beautiful on my window sill.  Also, the turtle was well packaged to ensure that it arrived unscathed-it's perfect !!  Excellent Customer Service !! AAAA+++++",
      "Thank you for your glowing feedback! I'm thrilled that you adore the turtle, and I'm delighted it arrived safely. Your satisfaction means a lot, and I'm grateful for your kind words. If you ever need anything else, feel free to reach out. Thank you for your support!",
      "Better than expected, my granddaughter loves it!",
      "Extremely small.  Not happy with purchase for the money.  Lesson learned.",
      "Hello. We have an extremely liberal customer centric return policy.  We cater to those who recognize hand crafted quality and great customer service.  \"Quality never goes out of style.\"",
      "Fabulous statue! We will definitely be ordering more from this shop. I was worried about breakage, but Robert packed it so incredibly well. Very very pleased.",
      "Thank you for your fabulous review! We're delighted you love the Angel Statue and appreciated my careful packaging. Your satisfaction and plans to return to our shop mean everything to us. We can't wait to provide more treasures for you in the future. Warm wishes and thank you!"
    ]
  },
  {
    "productId": "jTmAhDCYXP",
    "url": "https://www.etsy.com/listing/1640236354/iridescent-metal-solar-fairy-yard-art?click_key=ac71dd7de292cb0c22fab8d415924c1b3ba6c86d%3A1640236354&click_sum=f7df8076&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-11&pro=1&content_source=f0d0faea6f47a2d477dc5132722f8cc8ce22d402%253A1640236354",
    "title": "Iridescent Metal Solar Fairy, Yard Art, Garden Decor, CHOOSE Style",
    "description": "STAKE* Dim: 11-5/8\" W x 2-1/8\" D x 36-1/8\"H, (include 4-5/8\" ground stake).* Featuring lighted wings.==================================================================HANGING* Dim: 7\" W x 6-1/4\" D x 19\" H, (include 11\"L hook & chain).* Glass-petaled flower with a warm white LED light glowing inside and a fairy sitting on top.=================================================================* Jazz up your yard with a magical, whimsical silhouette fairy.* Material: Metal, Acrylic",
    "reviews": [
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it.",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!"
    ]
  },
  {
    "productId": "BNXdESHlnB",
    "url": "https://www.etsy.com/listing/1517837016/solar-garden-lighting-bronzed-kettle?click_key=a4fe14958a160e85a6525f09d0824abe7faddae8%3A1517837016&click_sum=0fab5d54&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-12&pro=1&content_source=85b8b952e387a644eb8ba545ab2f1f356f1e63a4%253A1517837016",
    "title": "Solar Garden Lighting Bronzed Kettle",
    "description": "This solar light is perfect for garden decor, porch decor, patio decor, solar lights outdoor, yard lights, yard decor, party lights, party supplies, party decor and more!Waterproof.36 flashing LED's lights total. Light string is 23.6\".Includes shepherd hook.Bronze colored can.",
    "reviews": [
      "The solar kettles are so pretty at night. They look as if the string of lights is water pouring into your flowers. A really great price.",
      "Very pretty still raining here so haven’t seen them light up",
      "Nice light and great customer service"
    ]
  },
  {
    "productId": "FKEUgmLpaC",
    "url": "https://www.etsy.com/listing/942867222/stained-glass-custom-color-yard-garden?click_key=d437c9c0fb1e2ce95514ce3d7e5704073831919b%3A942867222&click_sum=8d8925c9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-13&pro=1&frs=1&content_source=1a62f7013190dffd24add4d1d5669ca29ad305ee%253A942867222",
    "title": "Stained glass Custom Color  yard garden art , Plant Stake, Free Shipping! Send in a Message what colors you want",
    "description": "THE COLORS SHOWN ARE SAMPLES OF ONES WE HAVE MADE AND ARE AVAILAVLE!We have stock colores listed on here to pick from also!PLEASE MESSAGE ME THE COLORS YOU WANTThis is for a CUSTOM COLOR plant stake the ones shown are for examples of colors and not available  at all times we will try to make your color choices as close as possibleStained glass and copper garden art plant  stake.This can be used indoors or outdoors Size 3 1/2 x 21 inches tall after you install it.There are steel stakes inside the copper tubing to make it stable.The one shown is available or we can make it in any color you want we have 100’s of glass colors.Size 3 1/2 x 21 in after it’s in the groundiowaartglassstudio.com319-212-1904Free shippinghttps://www.etsy.com/your/shops/IowaArtGlassStudio/tools/listings/1107174646",
    "reviews": [
      "Beautiful piece . Reached out a couple times but didn’t hear back from seller . That wasn’t so awesome but his work is great. It was delayed compared to when it said was shipped . But in the end , it’s beautiful and perfect .",
      "These two stained glass columns are sweet.  I chose colors that were a bit too subdued so they are not as dramatic as I hoped but that was my choice.  The execution was great.",
      "Item is absolutely gorgeous! Shipping was a little slow, but turned out to be well worth it."
    ]
  },
  {
    "productId": "HuTQhpgiRY",
    "url": "https://www.etsy.com/listing/1523090187/fiddlehead-fern-leaf-sign-rusty-rustic?click_key=6631ef2448128e6c750855138c23317c6958292d%3A1523090187&click_sum=a1646f05&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-14&pro=1&frs=1&content_source=c260a896932baffc5ce71d276b0da55bd15ccb7a%253A1523090187",
    "title": "Fiddlehead Fern Leaf Sign Rusty, Rustic Metal Garden Sign, Metal Yard Art, Outdoor Garden Decor, Garden Marker, Rustic Decor, Gifts for Mom",
    "description": "🎯Built To Last quality: Made of 100% UV steel with a thickness of 1mm, our rusty metal stakes are weather proof and scratch resistant. They have been pre-soaked - to begin the rusting process and will continue to age over time and become more beautiful.🎯 Home decoration: These durable stakes are designed to capture attention and exude rustic appeal while enhancing your living space. Excellent addition to your home, garden, or cemetery.🎯 Gift of Love: A perfect idea if you are finding a birthday gift, a housewarming gift, a Mother’s Day/ Father’s Day/ Christmas gift for your family or friends. These beautifully designed grave markers can be used to honor a lost loved one or as a commemorative sign for a special memorial plant in your garden.🎯 Widely used: These rustic metal stakes can be installed anywhere indoors or outdoors, though it is recommended to place them in an area away from direct sunlight and water to ensure the product's durability.🎯For easy installation, it is advisable to dig a hole first, place your stake, and then backfill. This will prevent any damages or breakages to your rustic garden stake.If you have any questions, feel free to contact us for more details. Thank you!",
    "reviews": [
      "Just as described, would buy again",
      "I ordered this for the fiddlehead, but all 3 are beautiful!  Can't wait to use them.",
      "These are just what I wanted.",
      "Great product. It looks amazing. Thanks"
    ]
  },
  {
    "productId": "SKvnlVyFTM",
    "url": "https://www.etsy.com/listing/104042676/hippo-garden-sculpture-hippopotamus-lawn?click_key=db00c9b6c3b97c52fac967b605799cc84e67236b%3A104042676&click_sum=69120c5d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-15&pro=1&frs=1&etp=1&content_source=125cefafd8f348a154460b3b45ba60b81e1b3a1a%253A104042676",
    "title": "Hippo Garden Sculpture, Hippopotamus Lawn Ornament, Teacher Christmas Gift, Birthday Garden Gifts, Yard Art, Cast Iron Decor, Statue, Xmas",
    "description": "Show your garden some love! With this handmade resin hippo garden sculpture. This hippo will look amazing on your lawn or patio throughout spring, summer, autumn and winter! They also make an amazing Christmas gift for the green fingered people in your life. They're also great birthday gift ideas, or for any other special occasion you can think of. Or why not treat yourself and order your own hippo garden sculpture today!I sculpted the original of this hippo garden sculpture. You will receive a resin casting of my work in the finish you choose as pictured above.You can choose from different finishes from the drop down menu above, including real stone or metal finishes. Each finish has either stone, bronze or iron mixed in to the resin to achieve the desired finish.Each type of finish requires a different amount of labour and also the cost of each type of powder varies, hence why the prices are different for each type. I also offer a cheaper painted option for people on a lower budget.Please choose carefully which finish you would like as you will receive the finish that comes through on your order. ✓Approx Measurements & Weight: ⇢• L 42cm x W 17.5cm x H 6.5cm - 1.5kgOther Item Details: ⇢• Cast with either real stone, bronze or iron powder mixed with resin to produce your desired finish.• Very hard and sturdy but also hollow cast to reduce weight for moving them around your garden.• Suitable to display outdoors in your garden all year round.• I also sell other sizes and styles of hippos for indoors or outdoors in my Etsy shop. If this sculpture hasn’t been quite what you were looking for, please visit:www.etsy.com/uk/shop/MartsArtSculpturesto see my full range of sculptures.Other Order Details: ⇢• 📞 Please add your phone number as a note at checkout so I can add it when ordering your postage label, as my couriers require me to do so. I will never sell or share your personal info with anyone apart from the courier. Please read my full list of policies including my privacy policy below.• When you place an order you are agreeing to my Etsy shop's policies terms and conditions. ✓• 🎁 Add a FREE gift message at checkout, and I’ll print it out and add it to the parcel for you.• Add gift wrap option at checkout for just £5 extra. Gift wrap will be unisex.🎁• If you want your gift to be delivered directly to the recipient, please use their address at checkout.Social Media:Please share this listing with your friends and family to show them what wonderful things you’ve found! Also please favourite this listing and my shop so you can easily find me again!Thanks for stopping by!Copyright © 2011 Martin Pool, Mart's Art Sculptures - All rights reserved.",
    "reviews": [
      "I love this! My parents will adore him nestling in their garden. Thank you.",
      "That's fantastic! I'm pleased you like it so much and I hope your parents will too! Thanks for your feedback! :)",
      "Great quality with such detail. Not cheap but suspect it will last a long, long time. Grandchildren will love it. Thank you",
      "That’s fantastic! I’m really pleased you like your hippo sculpture! Wish I could do them a bit cheaper but the time it takes, expense of materials and selling fees dictates the price. As you say I hope you and your family enjoy it for many years to come! Thanks for your feedback! 😁",
      "Beautiful item and totally love it. Looks amazing in my garden xx\nThank you 🙏",
      "That's fantastic! I'm so pleased you're happy with your hippo sculpture! Thanks for taking the time to leave feedback!"
    ]
  },
  {
    "productId": "UHXevZUmxZ",
    "url": "https://www.etsy.com/listing/1535537315/2860-inch-h13-inch-handmade-folding?click_key=8a2da20179c9922dfc36e224da0b81005ece00cb%3A1535537315&click_sum=3aef9cb4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-16&pro=1&frs=1&content_source=8604c21e48e543f10a4fac2faf8765e6b0a7c9c6%253A1535537315",
    "title": "28*60 Inch-H:13 inch Handmade Folding Wooden Table, Baby Shower Party, Picnic Table, Beach Table, Boho Table, Patio Table,Thanksgiving Table",
    "description": "*Completely handmade folding table from pine tree with high quality and 6 legs28* 60 inch-H:13 inch70* 150 cm High:35 cmWeight: 11,02 lb, 5kg*This folding table is totally handmade with high quality.*Every package is carefully wrapped to ensure safe delivery.*Every order is shipped with express shipping.*If you want to have a folding table with speacial and different sizes, please contact with us. (For Example: The length of the legs*Every product is under our warranty.*We are here to answer every question, just share it with us.",
    "reviews": [
      "Beautiful table, fast delivery. Highly recommend.",
      "thank you so much Ashley 😊",
      "Good \nWorth it \nMaterial is good",
      "Thank you so much 😊",
      "Wonderful product, very satisfied with how quick it shipped",
      "Thank you so much Emily 😊🙏🏼",
      "It was delivered at the beginning of the expected timeframe! It is sturdy and beautiful. Very happy with this purchase.",
      "thank you so much 😊🙏🏼"
    ]
  },
  {
    "productId": "NnMqVdzgRG",
    "url": "https://www.etsy.com/listing/1204362019/tall-dipped-plant-stand-wood-accent?click_key=72d00882f89bab826b43b1c4742fe44b51feb96f%3A1204362019&click_sum=5d9ec815&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-9&pro=1&frs=1",
    "title": "Tall Dipped Plant Stand, Wood Accent Stool, Tall Dipped Paint Decorative Stand",
    "description": "Handmade Decorative Wooden Stool that can be used to match any of your decor needs.With an 8\" or 10” top, these can be customized to fit any of your needs.This stool is available in 6 different height options- 12”, 16”, 20”, 24”, 28”, and 30”.Message me for custom options! Stain Colors, Paint, Etc. A few of the options are shown in the pictures but the options to customize your stool are endless!If you would like something different than what is already listed please message me.If you are looking for similar items or other wooden home decor, check out our shop!The purpose of this item is for decoration and not designed as a seat. If you would like a seat please reach out about a custom item.***This item is made from actual wood, therefore there may be knots or imperfections in the wood****If this paint style isn’t for you, check out our other listings to see additional options!",
    "reviews": [
      "Exactly the size and color my Mom was looking for.",
      "Absolutely perfect!",
      "Perfect thanks",
      "Great plant stand and arrived ahead of scheduled arrival date. Pleased that my special request was fulfilled. Would recommend."
    ]
  },
  {
    "productId": "oicOSdKAuL",
    "url": "https://www.etsy.com/listing/1575369273/classy-mosaic-table-custom-made-handmade?click_key=dc2c5e18ac73eb5b0f90063c00b1084f14e7eb02%3A1575369273&click_sum=e231fd7e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-10&pro=1&frs=1&sts=1",
    "title": "CLASSY MOSAIC TABLE, Custom Made Handmade Round Table, Moroccan Mosaic Tealish And Cyan Blue Table, Luxurious Patio Furniture For Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric design in diffrent colors. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades, creating a warm and inviting look.The mosaic pattern on the table consists of a variety of colors, including vibrant blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.GET YOUR IRON CHAIRS TO GO WITH THIS BEAUTIFUL TABLE  :https://www.etsy.com/listing/1502709918/set-of-moroccan-iron-chairs-handmade",
    "reviews": [
      "The customer service really helpful. Very pleased with the response. Definitely will recommend this company to purchase item. Beautiful tables.😘",
      "Great chair, looks nice outdoors",
      "Very nice and helpful seller!Beautiful side table, perfectly made to measure and in customized colours, well packed and fast shipped. 👍👍👍👍",
      "As the picture, well made and good quality.  Arrived quickly and well packed."
    ]
  },
  {
    "productId": "KN7ygqJCYN",
    "url": "https://www.etsy.com/listing/1401150183/pair-of-fireplace-andirons-2-fireplace?click_key=cce010a1546f47ba2c34c820ffad1a810adf7c71%3A1401150183&click_sum=3004e37a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-11&pro=1&frs=1&cns=1&sts=1",
    "title": "Pair of fireplace andirons (2) - fireplace set Feuerböcke bronze and iron andirons",
    "description": "Ancient pair of andirons depicting two crossed tritons, upper part in the shape of an urn finished with a pine cone.Object pair of andironsPeriod: late 19th century, early 20th century, ItalyIn good condition, it has a small hole under the base of the urn and iron bent over time. the attached photos which give a clear idea of ​​the object and are an integral part of the descriptionHeight: 23.5 centimeterswidth: 16.5 centimetersdepth: 36 centimeters",
    "reviews": [
      "Very pleased! As pictured and responsive seller.",
      "Delivered in perfect condition, exactly like the picture, I love it, thank you",
      "Love the fireplace fender! Received much faster than expected since it was coming from Italy. Perfect experience.",
      "This was an amazing find for our outdoor fireplace adjacent to our master bedroom. It was as if this were designed for the space couldn’t be happier.",
      "I'm so happy that everything went as you expected. A thousand thanks"
    ]
  },
  {
    "productId": "CAkaprgglu",
    "url": "https://www.etsy.com/listing/1488746885/8-10-hanging-plant-holder-tray-for?click_key=5125af8c4bb11c7a118fd7d34d653c3174ab29c9%3A1488746885&click_sum=4c44616a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-12&pro=1&frs=1&sts=1",
    "title": "8” 10” Hanging Plant Holder Tray for Outdoor Patio or Indoor Home Decor Tray, Indoor Hanging Tray, Wall Hanging Large Planter Tray, Ribbed",
    "description": "Elevate the elegance of your living space with our 3D printed Hanging Plant Tray. Meticulously designed for both indoor and outdoor use, this tray is an ideal blend of functionality and minimalist aesthetics. Available in both 8\" and 10\" sizes, it is a perfect fit for various decor themes.Main image is Black.Dimensions: LxWxH in inches8” - 8.2 x 8.2 x 1.2 with 8 inch inner diameter. Perfect for styling small plant pots, or our propagation stations.10” - 10.2 x 10.2 x 1.2 with 10 inch inner diameter. The most versatile size, our favorite is a large 8” pot.INCLUDES : screw in black hook, 12-14” length of premium hemp cord, durable tray. If you would like longer/shorter length of cord please leave your preferred measurements in the notes!Our Hanging Plant Tray is more than just a decorative piece. With its large surface, it accommodates different plant sizes, showcasing your love for greenery in the most stylish way possible. Its unique wall-hanging design adds a touch of modernity to any space, whether it's your patio, living room, kitchen, or bedroom.Crafted with precision using the latest 3D printing technology, our planter tray guarantees durability and longevity. The material used is weather-resistant, allowing you to display your favorite plants outdoor without worrying about harsh weather conditions. Inside, it becomes a beautiful indoor hanging tray that brings nature closer to your everyday life.Its minimalist design complements various decor styles effortlessly. Whether you have a modern, rustic, or traditional theme, our Hanging Plant Tray blends in seamlessly while adding a touch of sophistication. Its neutral color palette makes it easy to match with any color scheme, amplifying the beauty of your plants.Easy to install and maintain, our Hanging Plant Tray is designed with convenience in mind. It can be hung on any sturdy wall, adding depth and interest to your vertical space.Discover the transformative power of adding greenery to your space. Order our 3D Printed Hanging Plant Tray today and breathe new life into your home or patio. Hurry, limited stock available!",
    "reviews": [
      "Great communication. Great product. Fast Shipping!",
      "Super nice, exactly as described. Can't wait to put my Orchid in her new pot.",
      "I am very happy that I purchased this! Very pleased with how it looks."
    ]
  },
  {
    "productId": "iwizU8HR1W",
    "url": "https://www.etsy.com/listing/1644730221/garden-creature-with-faucet-flashing?click_key=fb5409ae31eec787287c2f3a3386a7c833c55e99%3A1644730221&click_sum=8c50b13e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-17&pro=1&sca=1&content_source=f57ca49c43dd0d10cdcdb24d55cfd4ea5ab9dfcd%253A1644730221",
    "title": "Garden Creature With Faucet Flashing Solar Stake, Yard Art, Home Decoration, CHOOSE Style",
    "description": "* Appx Dim: 7.25\" L x 5'' W x 2\" D (Overall 36'' in height).* Faucet Solar Stakes are designed to look and feel realistic, with colorful layers and three dimensional figures.* String of LED lights embedded in the center to give the effect of running water.* A hand-painted and available in Bumble Bee/Humming Bird/Butterfly and leaves adorn the sides of the stake.* Material: MetalNOTE: COLOR APPEARANCES WILL VARY ON EACH COMPUTER MONITOR, THEREFORE; COLORS MIGHT BE SLIGHTLY DIFFERENT IN PERSON.",
    "reviews": [
      "Love this!!!!!",
      "Very cute! My mom loved it for her backyard.",
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it."
    ]
  },
  {
    "productId": "ZQiRjuwZqM",
    "url": "https://www.etsy.com/listing/830866647/metal-hummingbird-bouncy-farmhouse?click_key=4f980584d41d7494bf501d7e9814c753b16d86a2%3A830866647&click_sum=94dc9bc9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-18&pro=1&frs=1&sca=1&sts=1&content_source=11846b1166c2703c7756adcbc1e9122ac290a476%253A830866647",
    "title": "Metal Hummingbird Bouncy - Farmhouse Rustic - - Garden Decor - Wind Chimes - Garden Bouncy",
    "description": "This hummingbird is part of our farmhouse bouncy collection. We want to give this collection a more rustic look but still, bring our whimsical and fun decor to your backyard.The hummingbird has marbles sandwiched between two pieces of galvanized metal. And we finished it off with a distressed and rusted finish.Material: Metal & MarbleApprox. 15”L x 8.25”W x 1.5”H(Spring: 9”)",
    "reviews": [
      "Very happy with the quality of the bouncy I received.  Well made, arrived quickly and wonderful customer service.",
      "Absolutely love the hummingbird. Beautiful addition to my yard.",
      "This is adorable. Just as pictured and was shipped very fast.",
      "Beautiful quality and speedy shipping."
    ]
  },
  {
    "productId": "5xNpsWMMPk",
    "url": "https://www.etsy.com/listing/1195975629/classic-garden-columns-blowing-leaves?click_key=505f8f131805252164485029b87f91a89de1635f%3A1195975629&click_sum=beaa9f3f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-19&pro=1&frs=1&sts=1&content_source=9a80f7d6b4a8fd4f9bf561f4f380ca21711e75d7%253A1195975629",
    "title": "Classic Garden Columns - Blowing Leaves - Garden Decor - Garden Statue - Well Cover - Landscape Light Cover",
    "description": "Garden columns are a great way to add visual contrast to your garden, flower bed or deck.  This blowing leaf garden design is cut on all four sides so it looks great from anywhere in your yard. Each column is welded by hand and pre rusted so it will blend in with your landscape as soon as you place it in your space.  They work great as a stand alone monolith or combine 2 or more for extra texture.  They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DGarden Column TOP:https://www.etsy.com/listing/1521161735/garden-column-lid-succulent-planter-box?click_key=033619dc41177fff88fd543c6b4e41b0a59aea5a%3A1521161735&click_sum=23261f22&ga_search_query=lid&ref=shop_items_search_1&pro=1&frs=1&sts=1***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture and finish all of our work from a small shop in Tennessee.  Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum and glass combined.  88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.HARDWARE INCLUDED - Our work comes ready to mount with predrilled holes and 4 x 6\" long garden stakes to stabilize each column.SOLID STEEL CONSTRUCTION - Our garden columns are made from 16 ga mild steel, about the thickness of a dime.  Designed to last many years without maintenance inside or out.",
    "reviews": [
      "These are so beautiful and amazing!  They look so gorgeous on our front porch…we added lights for a soft touch♥️",
      "Purchased this sculpture as a “new home” gift for my sister. She loves it!",
      "Great communication with the shop and the item looks just as I imagined it!"
    ]
  },
  {
    "productId": "lhXyosxJJP",
    "url": "https://www.etsy.com/listing/1476215397/open-petal-flower-hanging-ornament-red?click_key=d1fdd48c0434205af78fe062322a85d8dafff4a9%3A1476215397&click_sum=44ca5e78&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-20&pro=1&sts=1&content_source=99bbd9d9908c42f7a7f28f3f469ccb0cc1f13f97%253A1476215397",
    "title": "Open Petal Flower Hanging Ornament, Red | Gifts for Mom | Garden Decor | Yard Art | Patio Decor | Metal Art | Gardening Gifts | Wind Chimes",
    "description": "Open Petal Flower Hanging Ornament, RedAdd a touch of red to your outdoor space with this show-stopping flower ornament.About the productWith its ruby red tones and intricate details, this hanging ornament makes quite the statement—even if it’s only showing off a single flower. Bold and romantic, the ornament stands out anywhere and everywhere. We especially adore it suspended from a leafy tree, where a verdant background really makes those red petals pop.Why we love itWhile flowers offer colors for a few months of the year, pieces like this hanging ornament allow gardeners a chance to showcase their favorite hues regardless of the season.Shipping detailsMost orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote dad, “We’re going as fast as we can! Promise!”)Measurements8” x 1” x 18”MaterialsHandcrafted, flamed metal.DetailsQuick, frustration-free installation.Backed by our friendly, one-year warranty.",
    "reviews": [
      "Love this shop and this new addition did not disappoint. Another beauty!",
      "Love it!",
      "It’s as beautiful as I thought it would be"
    ]
  },
  {
    "productId": "nyrmEsMiKv",
    "url": "https://www.etsy.com/listing/1610426528/butterflies-on-arch-wind-chime-gifts-for?click_key=50fd38cb7946fcf78082b4118bad1f97ad04fabe%3A1610426528&click_sum=4d4a4243&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-21&pro=1&sts=1&content_source=f82cea48d227d946bba385a72aa95d29456f01c0%253A1610426528",
    "title": "Butterflies on Arch Wind Chime | Gifts for Mom | Garden Decor | Yard Art | Patio Decor | Metal Art | Gardening Gifts | Wind Chimes | Decor",
    "description": "Butterflies on Arch Wind ChimeTurn any outdoor space into a butterfly garden with this wind chime.No luck with that butterfly garden? Happens to the best of us. Fake it ‘til you make it with this handcrafted wind chime. With nine ornate, flamed metal butterflies and seven functional bells, your outdoor space won’t just flutter… it’ll sing, too.DIMENSIONS: 17” x 7.5” x 3”MATERIAL: Handcrafted, flamed metal.DETAILS: Quick, frustration-free installation. Backed by our friendly, one-year warranty.WHY WE LOVE IT: There’s no such thing as too many butterflies--and a wind chime is the perfect way to add more texture to your porch, garden, or yard.SHIPPING DETAILS: Most orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote Dad, “We’re going as fast as we can! Promise!”)",
    "reviews": [
      "So beautiful! This will be a gift. I know this chime will be loved.",
      "Sweet! We truly appreciate your business with us. I am sure the recipient would love it. ❤️ Thank you again, Deborah!",
      "Love it made well on my patio porch",
      "Thanks for sharing this, Joan. Glad you love it. If there is anything that we need to improve, just let us know and we'll appreciate it :) Take care!",
      "Beautiful wind chime and made fantastically! Can’t wait until Spring! Packaged great and shipped quickly! Thank you!",
      "We're glad you love it! We are working so hard not only to create beautiful products with good quality but provide the best service to our customers. Thank you for your business :)"
    ]
  },
  {
    "productId": "JfpKOMZqNb",
    "url": "https://www.etsy.com/listing/527484150/metal-hand-painted-warbler-on-forget-me?click_key=2a2e02b6e85f9691a7492937d8515fb68c7f37fd%3A527484150&click_sum=e28c22dc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-22&pro=1&content_source=05a67ec5e02a109c66f40592df1e0c651f264d9a%253A527484150",
    "title": "Metal Hand Painted Warbler on Forget-Me-Not Flowers Garden Art | Warbler Silhouette | Rusted Yard Art | Garden Gifts | B762P",
    "description": "The Warbler with Flower Stake is a bright and airy piece of metal artwork that will incorporate subtle color and springtime essence into your backyard or garden year-round. This lovely metal garden art can easily be inserted into a large flower pot, flower bed, or nearly anywhere in your backyard!The Warbler with Flower Stake is made of recycled steel and pre-treated to create our signature rusted texture and natural look. It also features hand-painted details which highlight the iconic bright blue color of the forget-me-not flower, as well as shading on the leaves and the warbler’s chest.Forget-me-nots are a unique type of flower which bloom and spread quickly and are known for their iconic tiny blue petals. While its real name, Myosotis, comes from a Greek word meaning ‘mouse’s ear,’ which it was thought to resemble, there are many legends on how it received its famous nickname.Dimensions: 6\" wide x 23\" long (including stake).",
    "reviews": [
      "In my other bedroom window with the flowers metal decor. Bird morning greeter likes it too.",
      "This was a gift.  Was well received. TY",
      "The perfect birthday gift for our bird-loving friend. Five-star seller.",
      "Beautifully made and fast shipping!"
    ]
  },
  {
    "productId": "DcpoagNJON",
    "url": "https://www.etsy.com/listing/1282658714/armillary-stake?click_key=38c6ad00538a7d831fedc7a72bc95895f3695619%3A1282658714&click_sum=75b8a4e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-23&pro=1&frs=1&etp=1&content_source=3ea391127d275a1313fbe6e461b3d1ffd9e4dc3c%253A1282658714",
    "title": "Armillary Stake",
    "description": "The Rust Birds Armillary Stake is a beautiful and unique piece of garden art that is sure to add a touch of elegance to any outdoor space. The stake is made of high-quality iron that has been hand-rusted to create a stunning weathered look. The intricate design of the armillary sphere is sure to catch the eye of any passerby.The Rusty Birds Armillary Stake is perfect for any garden, and it would make a great addition to any customer's inventory.Here are some of the features of the Rusty Birds Armillary Stake:Made of high-quality ironHand-rusted for a stunning weathered lookIntricate design of the armillary spherePerfect for any gardenWould make a great addition to any customer's inventoryIf you are looking for a unique and beautiful piece of garden art, the Rust Birds Armillary Stake is the perfect choice. Order yours today!Dimensions: Aprox. 60\" x 15\"",
    "reviews": [
      "Wonderful. It’s so cute in my garden. Shipped really fast. Highly recommend this shop",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed."
    ]
  },
  {
    "productId": "epbQBjawxs",
    "url": "https://www.etsy.com/listing/1690873871/fisherman-wind-chime-garden-angler?click_key=8a07edd1e912fe742b523ecfef5af1990aea123d%3A1690873871&click_sum=cc53d5c6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-24&pro=1&frs=1&sca=1&content_source=49b18663267f28b1914fb0b624d81abfd4011d81%253A1690873871",
    "title": "Fisherman Wind Chime Garden - Angler Garden Decoration - Garden Ornaments - Hanging Wind Chime - Wind Spinner - Wooden Wind Chime - Outdoor Decor",
    "description": "Fisherman Wind Chime Garden - Angler Garden Decoration - Garden Ornaments - Hanging Wind Chime - Wind Spinner - Wooden Wind Chime - Outdoor Decor🦋If you have any questions, you can always write us a message🦋🏡TODAY 20% OFF ALL ITEMS✅14 day right of withdrawal & money-back guarantee!➡️Material: wood and iron➡️In the package: 1x Fischer wind chime➡️Size: (see variants)🚚 Fast & Free Shipping!📦 5-8 days manufacturing📦 2-8 days delivery worldwide🏡Agapelya is not just a shop, but a matter of the heart that has its origins in my own longing for unique garden decoration. The idea came about when I was searching in vain for special accents for my own garden and finally decided to put my creative energy into creating unique outdoor treasures.The story of Agapelya began in my own green retreat, when the search for attractive garden decorations became a passionate journey. Frustrated by the monotony of the market, I didn't want to wait any longer and started creating my own little world of garden magic.Fisherman Wind Chime Garden - Angler Garden Decoration - Garden Ornaments - Hanging Wind Chime - Wind Spinner - Wooden Wind Chime - Outdoor Decor",
    "reviews": []
  },
  {
    "productId": "TZTbwqpLku",
    "url": "https://www.etsy.com/listing/1416149190/saddle-up-plant-stand-canyon-sky-8-stand?click_key=258d8588ae5c6858b64b247d17fae7fb87a0e8ec%3A1416149190&click_sum=e5ee2d49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Saddle Up Plant Stand - Canyon Sky - 8\" Stand Perfect for Displaying Plants - 3D Printed Aesthetic Apartment Décor",
    "description": "This sturdy little stand reminds me of a horse, she carries a LOT of weight so throw your big plant on Saddle and she'll keep it sturdy with her knocknees. Tested to 60 pounds!Saddle Up Plant Stand are 8 in tall, 10 in wide, and 8 in deep.-------------------------------------------------We are a completely queer owned and operated 3D Print Shop and Design studio, focused on achieving sustainable, equitable pay and the most earth-friendly material sourcing we can manage. We collaborate to build our own printers and design our own models and grow together as a group of creative friends. These are 3D Printed from our home printer farm, we give as much attention as we can to the quality of these prints, striving for smooth surfaces, nice matte finishes, well placed seams, lack of stringing etc. While there may be very small imperfections on some prints, we really try not to ship anything with significant printing flaws. If you do have issues with your print, we are more than happy to work out a return and refund. :)All our prints are made with corn-based PLA plastic",
    "reviews": [
      "A+++ Incredibly cute and very sturdy. Fast shipping",
      "My new favorite plant stand. The colors and shape are so cute!",
      "Very uniquely e. I love these pieces.",
      "Shipping was fast, I’m using this mini stand to place my wifi router on. Looks great!"
    ]
  },
  {
    "productId": "TuvTWFYgpx",
    "url": "https://www.etsy.com/listing/1499286275/outdoor-pillows-uv-waterproof-pillow?click_key=7eed1916c9909653e2ff90ad7650ef25659da526%3A1499286275&click_sum=6a1bec4f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-14&pro=1&frs=1&sts=1",
    "title": "Outdoor Pillows- UV & Waterproof Pillow, Colorful Chinoiserie Monkey and Umbrella Cushion, Accent Vibrant Pink, Garden, Patio or Deck Décor.",
    "description": "❤Bring the spirit of nature to your loved ones or your home. 🍄❤ Chinoiserie Monkey & Umbrella Cushions are the perfect addition to your garden or outdoor space for a cozy and stylish look - it’s a wonderful way to personalize your space and can really lift a space from ordinary to spectacular. Easily bring patterns of wide nature into your garden or purchase it as a gift for a special friend or family member.❤Browse for more unique nature pillows and pillow-cover designs in our shop:https://www.etsy.com/shop/CoolDesignGiftsStore?ref=seller-platform-mcnav&search_query=pillowDesign by Elena Design Studio❤DESCRIPTION❤❤100% Spun Polyester❤100% Polyester pillow included❤UV ray-resistant, water & mildew-resistant❤Double sided print- mirror image.❤Sewn seam closure❤Comes in 3 sizes-16x16, 18x18, 20x20 inches❤Made in USPlease reach out to us if you have any questions/concerns about anything!Thank you for choosing CoolDesignGiftsStore!",
    "reviews": [
      "the item is great quality",
      "Very good quality. Thank you.",
      "It’s beautiful and I love it",
      "Gorgeous pillows! They ship quickly"
    ]
  },
  {
    "productId": "VlsegxqxqR",
    "url": "https://www.etsy.com/listing/250420955/cedar-raised-garden-bed-deep-kit-double?click_key=b8e185efd6845eb41337bb3b56dc0a0984fdef83%3A250420955&click_sum=14f1f554&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-15&pro=1&frs=1&etp=1",
    "title": "Cedar Raised Garden Bed Deep Kit (Double 2x3) - Christmas Gift for Gardener Wedding Gift for Her Housewarming Gift for Mom Dad",
    "description": "No screws, tools or pounding into the ground!  Simply the easiest raised beds to put together.  We fit each bed prior to shipment so a quick, frustration-free installation is guaranteed.  Beds can be assembled and ready to plant in as little as 5 minutes.  No handyman needed!  Perfect for children, seniors, busy families or those with debilitating conditions such as arthritis.  Each board is inspected numerous times throughout the building process.  You won't find twisted, warped, or cracked boards here, or those with knots falling out!  Made from 100% natural untreated Western Red Cedar, the professional gardener's choice of material.  Naturally rot & insect resistant.  The best choice for organic vegetable gardening.  Mix and match with our ever expanding selection of beds and planters as your garden grows!Raised garden bed kit dimensions: 2 feet wide x 3 feet long (6 inches deep) and 2 feet wide x 3 feet long (6 inches deep).  Depth is 12 inches when stacked.  5/8\" thick.Constructed of sustainably managed Western Red Cedar (Rough Sawn).  100% natural and chemical free.  Mortise and Tenon joinery.  Simple, no tool and splinter free assembly.  Easy to transport.  A beautiful, double deep gardening bed.  Use as two separate beds or stack them as one 12\" double deep bed.  Joining brackets included.  Deep beds allow more planting in a smaller space, such as Square Foot Gardening.Made of highly revered and durable Western Red Cedar.  The Hand Crafted Mortise & Tenon joints are the strongest available, while adding Old World style & charm.  Extremely durable and easy to assemble, they will last for many years.  Made in America with American materials.*Inner (planting) dimensions are a bit smaller due to the mortise & tenon joints.-Raised Garden Bed Kit Proudly Made in Homer Glen, Illinois USA.-Constructed of Select Western Red Cedar. Aromatic and Naturally Insect & Rot Resistant.-Handcrafted Mortise & Tenon Joinery. The Strongest Corner Joints Available.-Easy to Assemble in Seconds, No Tools Required. Perfect for a Children's Garden. Splinter Free!-100% Natural and Chemical Free. Safe for Vegetables and Best for Organic Gardening.Please contact us for a combined shipping quote for multiple items.  Of course, we will always refund you the difference if you don't!Don't be fooled!  All cedar is not created equal.Cedar is a broad term that can refer to a number of different wood species, and none of them have the same decay and weather-resistance properties as Western Red Cedar, the species containing natural chemical compounds that make it rot and disease resistant.However, vague naming practices can lead to confusion and deception when trying to make the best choice.  Aromatic Cedar is actually a variety of juniper tree that’s marketed under the name Aromatic Red Cedar.  Port Orford Cedar is actually a variety of cypress and it’s not what you’re looking for either, if you desire true cedar.“Cedars” are also imported from overseas, most notably Chinese cedar, explaining why exporters are eager & happy to trade on the reputation of authentic cedar. Where is your cedar coming from!Western red cedar is the most abundant cedar available in the U.S. and Canada.  Primarily grown in British Columbia, it also can be found in western Washington and Oregon.  Western red cedar is also the clearest and most decay resistant cedar.  Its abundance and properties make the species popular across the country.  Western Red cedar is the dominant choice in the Northeast due to natural characteristics of the product that make it very stable, durable and weather resistant.  Western Red Cedar is twice as stable as other softwood species.  The natural oils are resistant to insects and decay.Visit Timberlane Garden's shop here:https://www.etsy.com/shop/TimberlaneGardensStandard Raised Garden Beds:https://www.etsy.com/shop/TimberlaneGardens?section_id=17418373Deep Raised Garden Beds:https://www.etsy.com/shop/TimberlaneGardens?section_id=197957922 Tier Raised Garden Beds:https://www.etsy.com/shop/TimberlaneGardens?section_id=197958543 Tier Raised Garden Beds:https://www.etsy.com/shop/TimberlaneGardens?section_id=19800775Raised Garden Bed Sets:https://www.etsy.com/shop/TimberlaneGardens?section_id=19795834Small Raised Garden Beds:https://www.etsy.com/shop/TimberlaneGardens?section_id=19795878Cedar Planters:https://www.etsy.com/shop/TimberlaneGardens?section_id=17418375Garden Trellises:https://www.etsy.com/shop/TimberlaneGardens?section_id=18006476Garden Decor:https://www.etsy.com/shop/TimberlaneGardens?section_id=17425755RAISED BEDS 2x3 Cedar SET Planters Vegetable Garden Boxes Outdoor Planters Large Planters Herb Garden Boxes Garden Planter Boxes Garden Beds Timberlane Gardens",
    "reviews": [
      "These boxes were easy to put together and look great in our little garden!",
      "Quality product, great correspondence from seller!",
      "Ordered Planter Box on March 31, 2023, with expected delivery April 10 -15, 2023.\nReached out to owner on April 11, 2023 and was told Item to be shipped tomorrow.\nPlanter Box finally delivered on April 19, 2023.\nOnly 3 Stars given due to delivery being much later than originally lead to believe when initially ordered.\n Luckily it was for personal use and not a gift !",
      "Due to the violent storms and deadly tornadoes that struck Arkansas, Illinois and Indiana on 3/31, we were without power for 26 hours, including a full work day. This time lost is extremely difficult to overcome when you are a very small business, as most will understand. I will not complain, as we are very fortunate and so many were not. I am especially proud of my team, who pulled together and put in the extra effort to quickly overcome these challenges. Thank you. \n\n\"It's not what you look at that matters, it's what you see.\" Henry David Thoreau"
    ]
  },
  {
    "productId": "FNEYoVhaS3",
    "url": "https://www.etsy.com/listing/1148248896/hand-painted-garfield-odie-and-pooky?click_key=fd2101bc307c085f719b8c556d00b0eb74e7c650%3A1148248896&click_sum=861e94d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37502-5-16&pro=1&sts=1",
    "title": "Hand Painted Garfield, Odie and Pooky yard art/ yard art/ Garfield/ Garfield outdoor/ Wooden yard art",
    "description": "*INDOOR/FREE STANDING BASES ARE NOW AVAILABLE*Display items inside, on a porch, patio or anywhere you would like!Please let me know in the \"personalization\" section which base you would like.If no selection is made then an outdoor base will automatically be sent. Garfield trick or treatMeasure approximatelyGarfield, Odie and Pooky 47\" tallThis is made from 1/2\" Fir plywood.It is handcrafted, hand painted and then coated with 2 coats of poly-urethane which is applied to the front and back for protection. The backs are painted with either gray or white exterior paint. It will come with a piece of metal conduit that can be attached to the back to make it easy to display in your yard.MADE TO ORDER*all of my items can be increased in size up to 48” tall. Please note shipping rates do increase at 48” tall. However, I can ship up to 3 items per box. Please contact me for 48” tall prices*Production and processing time do vary throughout the year depending on my current open orders and up coming holidays.  It is common for my shop to temporarily close without notice due to high volumes of sales. This is very common during the Halloween and Christmas seasons so please order in plenty of time. At the peek of the holiday season processing times can reach 4-8 weeks. Again please order early to insure that your item makes it in time for the desired holiday. I am unable to rush orders due to the volume of sales my shop receives. To find my current processing time click the link that says “shipping” in this listing.Want a Christmas item by Thanksgiving? I suggest ordering before September or October. Processing time usually reach 4-8 weeks during this busy time. Again, please be sure to check current processing time found under the “Shipping” link.Want a Halloween item by Oct. 1st? I suggest ordering in August. Processing time usually reach 4-6 weeks during this busy time. Again, please be sure to check current processing time found under the “Shipping” link.",
    "reviews": [
      "My son and I love Garfield so this is a nice addition to my yard! Saved it as a Valentine’s Day decoration because there are al types of love.  And Garfield loves Pookie & Odin just in his Garfield way. Combined this item with my other purchase of Cupid’s. Worked great!",
      "Looks great. Can't wait to take it to camp!"
    ]
  },
  {
    "productId": "rfWwtGxoQp",
    "url": "https://www.etsy.com/listing/1569270487/personalized-for-dad-engraved-wood?click_key=384f2e02740525a5bb333bf4aa5b530b8abeedbf%3A1569270487&click_sum=c8ee381d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-25&pro=1&frs=1&sts=1&content_source=d86bd0bf14d7fa5f6cc996fc2e7cb4ac439d07ca%253A1569270487",
    "title": "Personalized for Dad, Engraved Wood Outdoor Table, Father's Day Gift, Gift to Papa from Kids, Manly Dude Gift for Men",
    "description": "Let this table be the first thing you grab when you head out to the beach, backyard, or outdoor concert. The table conveniently folds for storage and is easily set up by putting the metal locking pin into place. The fiberglass rod is durable and makes staking into the dirt, sand, or grass a breeze (you can even put it into a planter on your deck or balcony). The top has space for two beer bottles, pint glasses, solo cups, soda cans, bottle of water, etc., and plate of your favorite snacks. Table comes equipped with a bottle opener, so you'll never have to remember to bring one again. One of the two carrying handles doubles as a handy phone holder to keep your phone safe and in sight -- a great feature for the beach to keep pesky sand off your device. There's also a purse hook on the leg to keep your bag upright and out of the dirt.We built this for our love of the outdoors and a need to enjoy our draft beer from a glass at our small town brewery. Our mesh camping chair cup holders results in many lost ounces of hoppy goodness.  Elevate your outdoor adventure whether it is a day at the beach, an outdoor festival, or on vacation in the mountains enjoying an epic sunset! If you love beer and the outdoors, you need this. A great gift for any beer lover!Features:Lightweight designBottle openerCup holder is 3.25” diameter- Holds 2 beer bottles, pint glasses, solo cups, soda cans, bottle of water, spiked seltzer, etc.Space for snacks or small platePhone slot -- great for sitting in Adirondack chairs or keeping your phone out of the sand at the beach.Purse/bag hook to keep bags off the groundFiberglass rod that will not rust2 carrying handlesCollapsible for easy storageFor the wine lovers:https://www.etsy.com/listing/977249645/portable-wine-table-backyard?ref=shop_home_active_1&frs=1*** HOW TO ORDER ***1. Select the stain color of the wood.2. Select engraving option. Options are as follows:- No Engraving- Custom Name/Phrase: In the personalization section , please include the text you would like on your table. To separate text onto a different lines, use a backslash (/). (Example: Williams/Est. 2019) Names will have larger text on top line and small text on bottom line. Phrases will have text all same size. See images for example.- Initials: Up to 3 characters. Each one will be separated by a line (|). See images for example.- Preset Phrases: \"I'll Clink to That!\", \"If you can read this, sit down and have a beer\", \"Let the good times flow\"Have a brewery or restaurant or want to give as a corporate gift? Please contact me to discuss engraving your logo and bulk purchasing.Dimensions(does not include stake): 22\"h x 12\"w x 11\"dFolded Dimensions(does not include stake): 27\"h x 12\"w x 4\"dThe table comes packed flat and is simply joined together with one bolt. Finished with a food grade waterproof finish to protect the wood.",
    "reviews": [
      "Great transaction. Great gift. Thank you!",
      "Thank you for your review!",
      "Super durable and nice! Perfect for a gift",
      "Thank you for your review!",
      "Awesome table for the beach",
      "Thank you for your review!",
      "I was surprised that I needed to put this together myself and the instructions were not clear to me.  I used the pictures to get them together.  It looks like they will be useful for the family I ordered them for.",
      "Thank you for your business and review. Assembly is very easy it's just one bolt and comes with assembly instructions."
    ]
  },
  {
    "productId": "VlieWYmGWq",
    "url": "https://www.etsy.com/listing/30181835/shademaster-tree-face-concrete-garden?click_key=a64f02d581d1379bb3950afc00a97fab2d29a3bb%3A30181835&click_sum=e5da2cfe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-26&pro=1&frs=1&sts=1&content_source=c6cbb92d372e83750b18c40346268fb4b9bdd129%253A30181835",
    "title": "ShadeMaster Tree Face Concrete Garden Decor",
    "description": "ShadeMaster is my ode to John Lennon... He measures approximately 12\" X 14\" when installed. All weather concrete and custom tint ensures durability in all seasons. Sturdy galvanized hooks on the back of each feature install easily and harmlessly with six deck screws (included). One year warranty but ShadeMaster should be around for years.",
    "reviews": [
      "fast service great product !!!",
      "He is absolutely hilarious! Thank you!",
      "Item is of Excellent quality and met all expectations. Fair price."
    ]
  },
  {
    "productId": "CfyCkgxDjX",
    "url": "https://www.etsy.com/listing/1437604536/green-sun-lounger-with-backrest?click_key=33a20351ae223480073de572e01a4e79a8c73060%3A1437604536&click_sum=b69b5f83&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-27&pro=1&frs=1&etp=1&content_source=96a01cccf5b6658c7e549b6715cc0cc0ffbe0245%253A1437604536",
    "title": "Green Sun Lounger with Backrest - Lightweight Camping Chair - Adult Folding Picnic and Summer Chair - Seaside Towel to sunbathe",
    "description": "Experience the ultimate relaxation and bask in the warm sun with our green beach chair, also known as a seaside lounger. Expertly crafted with a specially designed folding structure, this chair is the perfect companion for your next beach trip, allowing you to soak up the sun while enjoying the soothing sound of the waves.Our portable beach lounger is perfect for those who love to sunbathe and relax in the great outdoors. With its comfortable wooden back support and adjustable recline, you can easily find your desired position and enjoy the scenery around you. Plus, its lightweight and foldable design makes it easy to carry with you wherever you go, whether it's to the beach, camping, or simply lounging in your own backyard.Don't settle for a mediocre outdoor chair that doesn't meet your needs. Choose our high-quality seaside towel and sun lounger and take your outdoor experience to the next level.Dimensions:Roll Condition: 27.55in / 70cmHalf open: 43.03in / 110 cmFully open: 62.99in / 160cmCarrying capacity:120 kg / 265 lbProduct Information:Experience the ultimate comfort and relaxation with our innovative and stylish foot hammock. Our design is based on the formula of a healthy rest, which is to bring your feet closer to heart level and relieve blood pressure.Crafted with 100% cotton, our hammock twill fabric is not only durable but also soft and gentle on your skin. You'll love the comfortable feel of our foot hammock, which is also machine washable for easy cleaning.We've used beech wood to create the recline bars, ensuring maximum durability and long-lasting use. The lightweight design, weighing only 750 grams, makes it easy to carry with you wherever you go, whether you're on a bicycle, motorcycle, skateboard, or roller skates.It has a much more durable structure than ordinary camping chairs thanks to its baked beech wood legs and the extra lined pocket where the legs enter.With four different options for height and recline, you can adjust our foot hammock to your desired level of comfort. The snaps on the fabric make it easy to use with shoes, preventing any dirt or pressure on the fabric, and also allows for easy wrapping on sticks.Our foot hammock is not just functional, but also adds a touch of style to any space. You can attach clip-on items between the knitting ropes, or even decorate your wall with colorful mini-long hammocks for a unique and personalized touch.Invest in our foot hammock today and take the first step towards a healthier and more relaxing lifestyle!*Hanging ornaments are not included.Feedback & CommunicationCustomer service is very important to us. Do not hesitate to raise any questions before or after your purchase. I look forward to responding to your messages. You will make me very happy if you make your valuable comments with visuals after the product purchase.ShippingI carefully pack your products and send them by express cargo. Cargo delivery times;3-7 Days for USA,3-5 Days for Europe,5-10 Days for Australia and other countries.",
    "reviews": [
      "The quality is good. Matched the description. I love it",
      "Hi Jennifer, I really appreciate your nice feedback. I think the great thing about the folding chair (minlong) is that it is so simple yet has 4 different seating and reclining options. I hope you enjoy using it.",
      "Perfect!",
      "Hi Conor, I am grateful for your nice feedback. I wish you to use the folding chair on good days.",
      "Purchasing and shipping the lounger was completely uncomplicated, very friendly and nice seller. Arrived here well packaged. Nice, sturdy fabric, well made. Simple but great idea, works great! Thank you very much ;)",
      "Hallo Marie, zunächst einmal vielen Dank für deinen netten Kommentar und dein Feedback! Du bist wirklich ein sehr netter Mensch. Ich freue mich sehr, dass dir meine \"Chaiselongue\" gefallen hat und dass du ein angenehmes Einkaufserlebnis mit diesem Produkt hattest.\nIch habe das Produkt auch als \"Campingstuhl\" betrachtet und die Vielseitigkeit des Designs ist perfekt für Outdoor-Aktivitäten. Die Verwendung natürlicher Materialien trägt zu seiner Langlebigkeit und Umweltfreundlichkeit bei. Ihre Zufriedenheit mit der aufmerksamen und stabilen Lieferung und Ihr Feedback sind für mich sehr wertvoll. Wenn Sie weitere Fragen oder Wünsche haben, stehe ich Ihnen gerne zur Verfügung"
    ]
  },
  {
    "productId": "RtqhiHExEV",
    "url": "https://www.etsy.com/listing/700800096/a-set-of-6pcs-fairy-garden-accessories?click_key=4156a2fcf30c0a74b3887ac3cf4e0f6764875e4e%3A700800096&click_sum=3eab46be&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-28&pro=1&pop=1&content_source=cfae948e910d13aa7e3a0637d96fd52ebb6aa755%253A700800096",
    "title": "A Set of 6pcs Fairy Garden Accessories Miniature Chairs, Table and Ceramic Pots Garden Decor, Fairy Accessories & Supplies",
    "description": "*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*Quantity: 6pcs  ( miniature all items shown in photos)Material: ironSize:Ceramic Pots height aprrox.1.5~3.6cmtable diameter 8cm height 4.5cmchair height 8cm*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*´¨¨*·..·*Just message me with any questions",
    "reviews": [
      "Very nice. just what I wa\nnted.  Thanks",
      "It was very cute and my grandmother loved it",
      "So pleased with my table & chairs,Love the teapot & sugarbowl the lids for the sugar bowl & teapot fitted perfectly.",
      "exactly as depicted and perfect for my project"
    ]
  },
  {
    "productId": "nzBYpSPkVa",
    "url": "https://www.etsy.com/listing/789645731/welcome-stone-welcome-landscape-rock?click_key=cdab7d0aca54b0f261ea1acee4efd5a29ae2fa83%3A789645731&click_sum=cacf57df&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-29&pro=1&frs=1&content_source=04df44eecec668722576d3a84782961532aedcd8%253A789645731",
    "title": "Welcome Stone - Welcome Landscape Rock - Engraved -Garden Stone - House Entry - Yard Decor - Garden Decor",
    "description": "This Welcome Stone is the perfect way to greet guests and make them feel at home. We designed this distinctive boulder with a clear, easy-to-read font and balancing flourishes that draw the eye. Every stone is crafted in the USA and made to order with solid, enhanced concrete.The natural-looking boulder is rough-hewn with a unique shape that is personalized just for you. It measures 15 x 15 inches and 21 x 21 inches, on average, so you can make a positive first impression and lead guests up to your door or down a long driveway. This stone is the perfect way to create a focal point and enhance your curb appeal.Easily install the stone with a central stake for added stability. You can choose between sandstone and greystone color options to seamlessly match your landscaping. Unlike most stone signs, our premium stones are engraved, filled with monument-grade paint, and sealed with an all-weather finish. Design A Stone lasts a lifetime because family and friends are always welcome!- 15 x 15-inch & 21 x 21-inch- Solid concrete- Engraved and decorated with monument-grade paint- Easy installation with ground stake- Available in sandstone and greystone finish- Easy-to-read- Proudly Made In The USA",
    "reviews": [
      "What a gorgeous piece of stonework! Completely made a typical, bland mailbox landing look amazing! Thank you!",
      "Fabulous purchase. Looks great in yard!",
      "Love this!  Perfect gift to give!",
      "Perfect addition to our front yard!"
    ]
  },
  {
    "productId": "LEuWFipRSu",
    "url": "https://www.etsy.com/listing/1187428106/sun-and-moon-solar-wind-chime?click_key=77c0e98ce956cef51a7fa23bee424ccf95980950%3A1187428106&click_sum=cb5c4d22&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-30&pro=1&content_source=734bdc8e3c472020ca9cb0c693943a717f9f3c90%253A1187428106",
    "title": "Sun and Moon Solar Wind Chime",
    "description": "This sun and moon solar wind chime is perfect for garden decor, porch decor, patio decor, solar lights outdoor, yard lights, yard decor, party lights, party supplies, party decor and more! Hang from fences, pergolas, porch, and patio.Waterproof. ABS plastic.RGB changing color.Solar panel 2V/120MA.Includes rechargeable 600mAh Ni-MH battery.6 LED colorful variable lamp beads.",
    "reviews": [
      "Very pretty still raining here so haven’t seen them light up",
      "My sister loved this product",
      "I love it it looks great",
      "Beautiful sun and moon solar lights!"
    ]
  },
  {
    "productId": "T4IyGoY1Pi",
    "url": "https://www.etsy.com/listing/977277417/stained-glass-paw-print-yard-art-free?click_key=6ec1b1000d6466804ace318763f8ccfd34deb4d0%3A977277417&click_sum=047805b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-31&pro=1&frs=1&content_source=8b1e4cf463569ac5bf71694e55393ab22ed68de1%253A977277417",
    "title": "Stained glass paw print yard art, Free Shipping.",
    "description": "Custom colors pick the colors you want from our list on the 2ed inage in the listingThis is for a Large Paw PrintPick 2 to 4 coloresJust message my what you wantAdd some color to your yard with these large real stained glass and copper sun catchers.These are just samples of what we can make for you, you can pick your own colors and we will custom make one for you.  Each one is a one of a kind.  They are 34 inches tall and over 9 inches wide and come with 1/2 inch solid steel mounting stakes so there safe to leave out year round.  Free Nation wide shipping.I make these custom to your choice of colors I stock 1000's of square feet of stained glass so I'm sure I have colors that you like.I make lots of different designs and will be adding more soon.",
    "reviews": [
      "My mother in law loved this for her garden",
      "Beautiful Christmas gift for my mom that just lost her pup 6 mos ago. Great customer service and such pride in his work. Thanks a million.",
      "Awesome quality and just overall a beautiful piece of art!",
      "My third purchase from IowaGlass and it did not disappoint.  I recently had to put my first dog down and bought the piece to remember him.  The seller was great at reaching out about colors and the shipping was quick and packaged well. Very pleased with the purchase."
    ]
  },
  {
    "productId": "gbRGrb4ldr",
    "url": "https://www.etsy.com/listing/1533328654/balcony-bar-terrace-table-patio-folding?click_key=a6c8d03a029b6f51292adde2d2f7723df35ea164%3A1533328654&click_sum=32220e78&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-32&pro=1&frs=1&sts=1&content_source=f4ac61ecdf9eb8a8e5b3e76d34285dbaf3795011%253A1533328654",
    "title": "Balcony Bar Terrace Table, Patio Folding Furniture Decor, Handmade Midcentury Modern, Foldable Walnut Wooden Garden Dinning Table",
    "description": "Discover our beautifully A handmade & handcrafted foldable - folding garden & porch & terrace or patio balcony railing bar table, the ideal addition to any balcony or small terrace. With this versatile product, you can host guests while optimizing your outdoor space.What sets our bar table apart is its unique mechanism, making it compatible with all balcony rails, whether round or square, ranging from 1\" (2.5 cm) to 6.3\" (16 cm) in thickness.Choose from a variety of sizes, or customize the dimensions to suit your needs perfectly. Mounting is a breeze, with pre-assembled steel brackets that make setup quick and easy, taking only 10-15 minutes.Sizes & Dimensions:XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)For custom bar table please contact us.Crafted from high-quality birch wood sourced from countries rich and industrial forests, our bar table is built to withstand adverse weather conditions. With static painted stainless steel brackets and special paint and varnish for enhanced sun and rain resistance, it's designed to endure. You can give as gifts for your neighbour for new home or house warming .Please note that each piece of solid wood ( walnut, white, black) is handcrafted, resulting in unique variations in wood grain, knots, and color. Embrace the individuality of our product.Installation is a breeze with pre-assembled brackets and our easy-to-follow assembly instructions, including a helpful video format. In just 10-15 minutes, you can mount the bar table without hassle.You can use your indoor or outdoor home  - farmhouse furniture decor.Our foldable design maximizes outdoor space, providing a surface for hosting or dining without occupying floor space when not in use.With adjustable steel brackets, this bar table accommodates round and flat railings, ensuring compatibility with various balcony types, ranging from 1\"-6.3\" in width.SHIPPING: Working with DHL, FEDEX, and TNT, your order will arrive in 3-4 business days. Tracking information will be provided after dispatch.For any questions, please don't hesitate to message us. Experience the convenience and charm of our balcony railing bar table today!",
    "reviews": [
      "This worked perfectly for my balcony.  Love it! So easy to raise up and down.",
      "Thank you for your lovely review! We're thrilled you find the balcony bar table perfect. Enjoy your new spacesaver table.",
      "The quality and service were great - we love our new balcony bar!",
      "Thank you for your lovely review and beautifull photo! We're thrilled you find the balcony bar quality. Enjoy your new patio table. It looks amazing on your lake house",
      "Solid workmanship on this folding balcony bar - my husband installed in no time and seller communication was great!",
      "Thank you"
    ]
  },
  {
    "productId": "UlrnuAKGUg",
    "url": "https://www.etsy.com/listing/1444829900/personalized-wedding-gift-outdoor-wood?click_key=f492e55073726f9f45b5824975f4e7d9787f781b%3A1444829900&click_sum=6b7e061b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-33&pro=1&frs=1&etp=1&content_source=fb7890e5bfb0ebe320017f221b69e49e430ce551%253A1444829900",
    "title": "Personalized Wedding Gift, Outdoor Wood Cooler, Patio Furniture, Gifts for Couples, Custom Cooler, Backyard Decor",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @friocoolersFollow us on Instagram @friocoolersFollow us on Youtube @friocoolersThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Ordered this as a team gift for my boss' wedding - it came out perfectly and the seller was super helpful with multiple changes to the mockup. Delivered on time and we were able to enjoy using this for a backyard get together! Would definitely recommend :)",
      "Great wedding gift!!  Beautiful and classy!",
      "Great quality, sturdy! \nBeautifully done…"
    ]
  },
  {
    "productId": "jCVNyzZqbk",
    "url": "https://www.etsy.com/listing/996435507/suncatcher-fox-moon-and-flowers-stained?click_key=97b8434f71be6937223d102ae9462db403e9bf88%3A996435507&click_sum=a8a57e0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-34&pro=1&frs=1&etp=1&content_source=8a5908d05ea78bc6d513b1c615e77f4013057eb2%253A996435507",
    "title": "Suncatcher fox moon and flowers Stained glass Wall decor for room Hand made gift Mothers day gift idea",
    "description": "Suncetcher fox, moon and flowers - the original design will appeal to connoisseurs of beauty.Hello dear buyer! Welcome to our authorship stained glass decors store!We are Olha and Daria, founders of this store and people who create beauty for you. We have been engaged in stained glass for over nine years.In this difficult time, work saves us and your smiles warm us. We love our business and do our best to ensure that you are satisfied with the fact that you turned to us.We can also create individual works. If you have an idea that you really want to implement, then we will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live color may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!",
    "reviews": [
      "Absolutely beautiful pieces. These are a steal.",
      "I fell in love with the fox right after my first order. I knew I had to have it and it is now proudly in my office window so it can brighten my day anytime I need it to. Love this artist 💜 I will absolutely be purchasing more!!",
      "arrived in perfect condition and my best friend loved it when she opened it! stunning work!"
    ]
  },
  {
    "productId": "EStJnFTjtE",
    "url": "https://www.etsy.com/listing/826324521/triple-bell-spiral-wind-chime-wind?click_key=a098311e53260d83bb0da53ff4c5d9ff49b41167%3A826324521&click_sum=00b801b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-35&pro=1&etp=1&sts=1&content_source=11d487fc0aaf0e668de23f5b6181e2f30e753fa1%253A826324521",
    "title": "Triple Bell Spiral Wind Chime, Wind Chimes, Rustic Wind Chimes, Gardening Gift, Garden Decoration, Garden Art, Gardener Gift, Gardening",
    "description": "Triple Bell Spiral Wind ChimeWhoever said good things come in threes probably had this wind chime right outside their office! After all, it’s pretty perfect! Three understated-but-iridescent, curvy strands feature handcrafted, rustic bells in this stunning mobile, which makes an excellent housewarming gift. Wherever you choose to display it, insist on a space that truly showcases its classic beauty and handcrafted, high-quality details.Dimensions: 10\" w x 1\" d x 39.5\" hEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and wind chimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and wind chimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "This was a gift for my best friend and she absolutely loved the wind chimes.",
      "Sweetest! Thank you for trusting us and for your business. Glad to know your best friend loved it. :) We appreciate you!",
      "I had found this wind chime locally. My sister in law loved it. I gave her mine and ordered one for myself. It’s beautiful and different from any chime we have. And we have a lot!  Would definitely order from this vendor again.",
      "Yay, thanks so much, Linda! Nothing is sweeter than reading a feedback from a happy customer :) Thank you again!",
      "Very pretty\nSounds beautiful \nWell made and looks great"
    ]
  },
  {
    "productId": "znmut8GDHf",
    "url": "https://www.etsy.com/listing/1388897334/concrete-pan-garden-statue-large-outdoor?click_key=2f2536473c9133d859a1ea401ca990822f48986e%3A1388897334&click_sum=68dc5172&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-36&pro=1&frs=1&sca=1&sts=1&content_source=5a883acdb071fd775e0c106d9b73b33e835f14ab%253A1388897334",
    "title": "Concrete Pan Garden Statue Large Outdoor Stone Cement Yard Playing Flute Greek Sculpture Decor Lawn Ornament Pagan Art Statuary Gift Idea",
    "description": "Discover the magic with our 14\" Concrete Pan Statue, effortlessly playing the flute in a natural cement hue.This elusive piece blends ancient charm with modern resilience, promising proven quality and a maintenance-free experience.Love your garden more as Pan's timeless melody saves you from the ordinary.Easy to cherish and guaranteed to enchant, it's the simple way to add a touch of whimsy now.Embrace the freedom of effortless beauty and save time for what truly matters.Height: 14 inches tall.Length: 7.5 inches side to side.Width: 7 inches front to back.This garden decor weighs about 26 pounds.Handmade in the USA here for you.Over two decades of experience in the garden sculpture industry.Professionally packaged. Safe arrival assured.Free shipping.Ships out within 5 business days.Customer Satisfaction Guaranteed.Ok thanks!",
    "reviews": [
      "Shipped so fast and packed very securely.",
      "Thanks, one of my favorite statues!",
      "This pan statue is so beautiful!  It was packaged so carefully and arrived super quickly. I love it",
      "Thank you for the wonderful feedback! I'm thrilled that you love the pan statue. It was a pleasure serving you, and I'm glad that it arrived safely. Thanks again for your support!",
      "So fun! Love this little statue! Great addition to our garden.",
      "This is an awesome statue ! Very detailed and evocative of ancient Greece. Was going in the garden but its so magnificent He is proudly ensconced on the front porch for all to see ! The packing for shipment was outstanding as well, thank you so much !"
    ]
  },
  {
    "productId": "aZtBVJlAmW",
    "url": "https://www.etsy.com/listing/1531261760/large-concrete-angel-statue-for-garden?click_key=9ce8e7867948c60c131400a40ad4daf984591891%3A1531261760&click_sum=fe8ae049&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-37&pro=1&frs=1&sca=1&sts=1&content_source=c4af756e2222f81d8f370598e10e2774fff0b247%253A1531261760",
    "title": "Large Concrete Angel Statue For Garden Stone Cherub 18\" Outdoor Cement Lawn Ornament Gravestone Yard Sculpture Cemetery Statuary Gift Ideas",
    "description": "Introducing our breathtaking 18 inch tall, female concrete angel garden statue.This magnificent piece exudes grace and tranquility, making it the perfect addition to your outdoor oasis.Crafted with meticulous attention to detail, this angel statue captivates as she kneels in deep contemplation, her chin delicately resting upon her hand.Made from high-quality concrete, this statue showcases the natural beauty of cement in its elegant, soft-hued color.Whether nestled among vibrant flowers or placed in a serene corner of your garden, this angel statue brings an ethereal touch that will inspire and uplift.Evoke a sense of serenity in your outdoor space with this stunning female concrete angel garden statue.Enchanting in design and timeless in its aesthetic, it is the perfect accent piece for those seeking a captivating blend of beauty and tranquility.Height: 18 inches tall.Length: 10 inches side to side.Width: 10 inches front to back at the base.Weight is approximately 40 pounds.Handmade in the USA here for you.Over two decades of experience in the garden sculpture industry.Professionally packaged. Safe arrival assured.Free shipping.Ships out within 5 business days.Customer Satisfaction Guaranteed.Ok thanks!",
    "reviews": [
      "Fabulous statue! We will definitely be ordering more from this shop. I was worried about breakage, but Robert packed it so incredibly well. Very very pleased.",
      "Thank you for your fabulous review! We're delighted you love the Angel Statue and appreciated my careful packaging. Your satisfaction and plans to return to our shop mean everything to us. We can't wait to provide more treasures for you in the future. Warm wishes and thank you!",
      "Is absolutely beautiful, I felt in love with the angel when I open the box thank you so much",
      "Great communication! We love the fountain top. It is exactly what we wanted!!",
      "Thank you so much for your feedback! We are thrilled to hear that you love the fountain top and that it's exactly what you wanted. The photo you shared of the fountain operating looks fantastic! We truly appreciate your support and hope it brings joy to your space. Please feel free to reach out if you need anything else. Happy fountain gazing!",
      "It was just as I expected. It was a gift, and he loved it❤️",
      "Thank you for your kind words! I'm thrilled to hear that the fireman garden statue was just as expected and that it was a perfect gift. I'm so glad he loved it! ❤️ If you have any questions or need assistance in the future, don't hesitate to reach out."
    ]
  },
  {
    "productId": "fEudlUlxOn",
    "url": "https://www.etsy.com/listing/543269349/warbler-and-forget-me-not-flowers-stake?click_key=daab3e8db13e56b0e7c5fc97944f738054123b06%3A543269349&click_sum=477921fc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-38&pro=1&etp=1&content_source=0bfbf3df26c838c0f13a1f0d774fca7447260953%253A543269349",
    "title": "Warbler and Forget-Me-Not Flowers - Stake | Hand Painted | Wild Bird Art Gifts | S918P",
    "description": "Warbler and Forget-Me-Not Flowers - Stake | Hand Painted | Wild Bird Art Gifts | S918PThe cheerful warbler is one of the most common birds in North America.Each Piece is painted by hand, colors and styles may differ slightlySKU# S918PDimensions: 6\" wide x 23\" long (including stake)Favorite our Etsy shop and check us out on Social Media for more nature inspired home decor!Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "What a fun gift for my gardening friend. She loved it!",
      "What a great addition to my spring plants and garden!",
      "Super cute, and shipped quickly!",
      "Thank you for the wonderful plant stake."
    ]
  },
  {
    "productId": "DYMaSClykE",
    "url": "https://www.etsy.com/listing/1286115820/outdoor-decor-rusty-hippo-garden?click_key=f3d1d4f75b74adc6b6143b4fc64bdace08cc58c7%3A1286115820&click_sum=7a57205c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-39&pro=1&frs=1&content_source=4c27f4fd07eeb0b1909147a045674ca071d0f1c8%253A1286115820",
    "title": "Outdoor Decor, Rusty Hippo Garden Ornaments, Patio, Dad Birthday Gift for Him, Get Well Soon Gift, Unique Christmas Gift Ideas, Thank You",
    "description": "Show your garden some love with this handmade pair of rusty resin / cast iron hippo garden ornaments. This pair of hippos will look amazing on your lawn or patio! They also make an amazing iron anniversary or get well soon gifts for the green fingered people in your life. They're also great if you're looking for unique Christmas gift ideas, or a gift for any other special occasion you can think of. Or why not treat yourself and order your pair for your garden today!I sculpted the original sculptures of these garden hippos. You will receive a pair of rusty resin / iron castings of my work as pictured above.You can also choose from different finishes from the drop down menu above. Including other real metal finishes that are made in a very similar way. Each type has a different type of real metal powder mixed in to the resin, either bronze, iron or stone to achieve the desired finish.Each type of finish requires a different amount of labour and also the cost of each type of powder varies hence why the prices are different for each type. I also offer cheaper painted options for people on a lower budget.Please choose carefully which finish you would like as you will receive the finish that comes through on your order. ✓Discounts: ⇢• You Save £18.00 when buying from this listing compared to buying these hippos individually!Approx Measurements & Weight: ⇢• The hippo head - L 55.5cm x W 31cm x H 11.5cm - 2.6kg• The smaller hippo - L 42cm x W 17.5cm x H 6.5cm  - 1.5kgOther Item Details: ⇢• Cast with real iron powder mixed with resin (cold cast iron).• Hollow cast to reduce weight for moving them around your garden.• Real rusty finish! Not a paint effect!• The rust patination on your hippos will vary from that seen in the pictures as this is a natural rust,                   but will look essentially the same.• The rusty finish is left unsealed to create what is know as a living patina, that may continue to rust to some degree over time once you've placed your sculpture(s) in your garden.• As the rust finish is real, some rust residue may come off on your hands when handling. If so simply wash your hands after handling.• I also sell other sizes and styles of hippos in my Etsy shop. If this sculpture hasn’t been quite what you were looking for, please visit:www.etsy.com/uk/shop/MartsArtSculpturesto see my full range of sculptures.Other Order Details: ⇢• 📞 A phone number is required by the couriers I use before I can purchase your postage label. This applies to ALL customers. Please add one as a note at checkout to avoid any delay in the dispatch of your order. I will never sell or share your personal info with anyone apart from the courier. Please read my full list of policies including my privacy policy on my Etsy shop homepage:www.etsy.com/uk/shop/MartsArtSculptures• When you place an order you are agreeing to my Etsy shop's policies terms and conditions. ✓• 🎁 Add a FREE gift message at checkout, and I’ll print it out and add it to the parcel for you.• Add gift wrap option at checkout for just £5 extra. Gift wrap will be unisex.🎁• If you want your gift to be delivered directly to the recipient, please use their address at checkout.Social Media:Please share this listing with your friends and family to show them what wonderful things you’ve found! Also please favourite this listing and my shop so you can easily find me again!Thanks for stopping by!Copyright © 2011 Martin Pool, Mart's Art Sculptures - All rights reserved.",
    "reviews": [
      "They are perfect thank you",
      "That’s fantastic! Glad you’re happy with your hippo sculptures! Thanks for your feedback 😁",
      "Great quality and as depicted.\nThis is a gift and my wife loves it.\nThe vendor was very responsive and friendly.",
      "That’s fantastic! Glad your wife loves her hippo sculptures! Thanks for your feedback! 😁",
      "Really love these, they look perfect and will certainly be getting more from this seller."
    ]
  },
  {
    "productId": "lJkUOyTcAH",
    "url": "https://www.etsy.com/listing/1195939207/monstera-leaf-garden-columns-jungle?click_key=b14bfbf14b705743993796b10a68c48cdfb47ebe%3A1195939207&click_sum=5511cfc8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-40&pro=1&frs=1&sts=1&content_source=504efc5376a0f545acc59cd8be3703db931b27ce%253A1195939207",
    "title": "Monstera Leaf Garden Columns - Jungle Garden - Garden Decor - Garden Statue - Well Cover - Landscape Light Cover",
    "description": "Garden columns are a great way to add visual contrast to your garden, flower bed or deck.  This unique monstera leaf design is cut on all four sides so it looks great from anywhere in your yard.  Two different patterns are featured on each half so you can mix and match to your preference. Each column is welded by hand and pre rusted so it will blend in with your landscape as soon as you place it in your space.  They work great as a stand alone monolith or combine 2 or more for extra texture.  They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DGarden Column TOP:https://www.etsy.com/listing/1521161735/garden-column-lid-succulent-planter-box?click_key=033619dc41177fff88fd543c6b4e41b0a59aea5a%3A1521161735&click_sum=23261f22&ga_search_query=lid&ref=shop_items_search_1&pro=1&frs=1&sts=1***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture and finish all of our work from a small shop in Tennessee.  Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum and glass combined.  88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.HARDWARE INCLUDED - Our work comes ready to mount with predrilled holes and 4 x 6\" long garden stakes to stabilize each column.SOLID STEEL CONSTRUCTION - Our garden columns are made from 16 ga mild steel, about the thickness of a dime.  Designed to last many years without maintenance inside or out.",
    "reviews": [
      "Great quality! Looks fantastic in my yard, thanks!",
      "These arrived today, good quality and extremely well packed. They look great on my front porch.",
      "I bought a few of these columns and they were gorgeous! They made amazing Christmas gifts and I can't wait to see them in the garden."
    ]
  },
  {
    "productId": "JeBkKrqFSP",
    "url": "https://www.etsy.com/listing/1551916068/stained-glass-and-cedar-yard-art?click_key=36801a708d75d4b3df6be61d18c31080d1ae3f74%3A1551916068&click_sum=8165c70c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-41&pro=1&frs=1&content_source=8b7c5eae5dee8fb979828c00db99bac23b96c2ff%253A1551916068",
    "title": "Stained glass and Cedar yard art Suncatcher.  Red,Yellow & Orange mix. Free shipping",
    "description": "This is a Red, Yellow & Orange mix7 1/2 x 34 inchesComes with a steel base you and step on or if the ground is to hard you can hammer it in the ground and slide the frame into it no assembly required.This is real stained glass like the glass that has been used in stained glass studio and real cedar.We will also do custom colors in any colors you like.My unique mounting system has a steel angle iron base that that is easy to install",
    "reviews": [
      "Great items! Will continue to buy from them",
      "Just lovely - put in my garden.",
      "It is a Beautiful garden accent."
    ]
  },
  {
    "productId": "xLhVnLoX1t",
    "url": "https://www.etsy.com/listing/662262393/adirondack-chair-tables-wine-barrel?click_key=a34648c8b1236e73c330d8160722d63cc68aef6f%3A662262393&click_sum=9b89bd15&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-42&pro=1&frs=1&etp=1&sts=1&content_source=0f68a752cab4b0544d3302d29cffeee2472e79dc%253A662262393",
    "title": "Adirondack Chair, Tables, Wine Barrel Chair, Wine Barrel Furniture , Rustic Chair, Patio Chair, Outdoor Furniture, Barrel Chair",
    "description": "Martellas is family owned.  We run our little business from the comfort of our home.  We value each customer as it is our neighbor.  Thank you for shopping with us.Patio Set:Our beautiful Adirondack Chairs are Wine Barrel Chairs' specialty and popular.  Each chair is handcrafted from reclaimed oak wine barrels once used by Napa California vintners.  Each chair takes on a unique look from the toasting of the barrel and the aging of the wine.  Each chair is oiled and sealed with four coats of durable marine varnish to ensure years of beauty.  What sets our chairs apart is the craftsmanship, and attention to detail all while only using the best staves from a barrel.  Complete your set with an American Wine Barrel Flag.  When people see it you'll know why you got it.Each piece of the barrel/chair has had its edges round (3/8\" radius) before assembly. NO SHARP EDGES!!Simple assembly is required.  All Chairs and tables vary in wood grain and markings.  We only use the best of our supply for the highest quality.Rough Measurements:Chair: 32 x 29 x 42 inchesTable: 22 x 18 inches",
    "reviews": [
      "I only leave like 2 reviews a year.  Only if something is really good or the other thing. This product hits the really good button, the photos and description of the items are spot on, great quality, my expectations were fully met.",
      "Wow Mac. I’m honored for your kind words. 😊 Thank you!",
      "Beautiful met all expectations and then some!",
      "Thank you!  Enjoy, Relax, and Cheers.",
      "Absolutely love these!  Just what I wanted!",
      "Monte was extremely easy to communicate with and answered all my questions quickly. There was a bit of a shipping glitch in the beginning (no ones fault) and Monte was quick to respond and the issue was resolved. The chairs and table are utterly gorgeous-  very well made and just as expected! These will be a feature of our summer enjoyment for years to come. Thank you so much."
    ]
  },
  {
    "productId": "bcwgsHJCix",
    "url": "https://www.etsy.com/listing/1000521793/pine-cone-wind-chime-outdoor-chimes?click_key=9d3dc027adff25c148caae89b7c04b8fe8a9fc73%3A1000521793&click_sum=16a18289&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-43&pro=1&sts=1&content_source=9dd78e3148eafd21c1aa473cdd858cbad51ef71a%253A1000521793",
    "title": "Pine Cone Wind Chime | Outdoor Chimes | Squirrels | Patio Art | Metal Art | Garden Decor | Yard Art | Balcony | Wind Chimes | Gardening Gift",
    "description": "Pine Cone Wind ChimeAdd a touch of woodland charm to your outdoor seating area with our Flamed Pine Cone Wind Chimes. This nature-inspired set offers artful presence via a stout branch which holds a series of five upside down pinecones crafted of flamed metal. Beautifully detailed from top to bottom, this set offers five bells for a soft, pleasant sound. Like all wind chimes in our Happy Gardens collection, these have been individually handcrafted, and will bring lasting beauty to your patio, porch, or garden.Five metal pinecones with five bellsFlamed finishDimensions: 18” L x 3.5” W x 26” HEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and windchimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and windchimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!Other collections of interest include our garden wind spinners and yard rain chains. Other products of interest include:Pine Cone Rain ChainPine Cone Hanging OrnamentPine Cone With Bell Ornament",
    "reviews": [
      "Beautiful item. Purchased as a gift.",
      "Beautiful well crafted!",
      "Beautiful unique item, well crafted, fast shipping, thank you!"
    ]
  },
  {
    "productId": "gtSKOTxCtF",
    "url": "https://www.etsy.com/listing/1306703846/suncatcher-cardinal-bird-and-moon?click_key=817b34bde65c2cedc7c0e557107c1b095a1df7c8%3A1306703846&click_sum=7a39502f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-44&pro=1&frs=1&etp=1&content_source=d2693dcfa8a9c4b74aa83566e3fa0d74ab008027%253A1306703846",
    "title": "Suncatcher cardinal bird and moon Stained glass Art Wall room decor Home decor Window panel decor Birthday gift idea",
    "description": "Cardinal suncatcher is our author's design. Composition of a cardinal seated on the moon with cherry branches.The cardinal symbolizes the courage and passion that this little bird carries. Red is interpreted as the color of life and energy.Hello dear buyer! Welcome to our authorship stained glass decors store! We are Olha and Daria, founders of this store and people who create beauty for you. We have been engaged in stained glass for over nine years. In this difficult time, work saves us and your smiles warm us. We love our business and do our best to ensure that you are satisfied with the fact that you turned to us.We can also create individual works. If you have an idea that you really want to implement, then we will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live color may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!",
    "reviews": [
      "Beautiful quality! I ordered multiple items for Christmas and everyone loves them.",
      "Absolutely love how this looks! My mom was really happy when she opened it for the holidays.\nSeller was also helpful with shipping updates! Thank you!",
      "Beautiful piece of art! Will definitely buy from them again"
    ]
  },
  {
    "productId": "mKOwpatngG",
    "url": "https://www.etsy.com/listing/1067760917/art-deco-inspired-abstract-stained-glass?click_key=844545fd7bd107208cd07bc89a563397fd99cd78%3A1067760917&click_sum=7cf08991&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-45&pro=1&frs=1&sca=1&sts=1&content_source=98800b956acac51069cab0184ec4261b65b6132d%253A1067760917",
    "title": "Art Deco inspired abstract stained glass mobile / suncatcher. Etsy Design Awards 2023 finalist!",
    "description": "Introducing our stunning Art Deco inspired abstract stained glass mobile suncatcher!This exquisite piece of art is a harmonious fusion of modern design and the timeless beauty of stained glass. Handcrafted with meticulous attention to detail, this mobile suncatcher will add a touch of elegance and charm to any space or will make a unique and thoughtful gift for art enthusiasts, lovers of Art Deco style, or anyone who appreciates the beauty of handcrafted artwork. It comes ready to hang with a sturdy chain, making it effortless to adorn your favourite spot!Inspired by the iconic Art Deco era, this suncatcher features sleek geometric shapes, clean lines, and beautiful colours. The combination of translucent and wispy glass creates a mesmerising play of light and shadow, transforming any room into a captivating display of colour and movement.Crafted using the traditional copper foiling technique, each glass piece is carefully cut, shaped, and meticulously soldered together. The copper foil enhances the structural integrity of the suncatcher, ensuring its durability and longevity. It is designed to withstand the test of time and bring joy for years to come!The abstract design of this suncatcher allows for endless interpretation, making it a versatile piece that complements a variety of interior styles. Hang it in a sunny window, and watch as the sunlight dances through the glass, casting enchanting patterns on your walls and floors. Alternatively, display it as a centrepiece in your living room, bedroom, or even your office space for a touch of sophistication.Dimensions:* Overall height (including chain): 54cm (21in approx)* Width: 15.5cm (6in approx)* Depth: 1cm (0.4in approx)Materials:* Stained glass in a variety of beautiful colors* Copper foil* Solder* Black thread* Brass tube* Chain for hangingDue to the nature of its materials and being completely handmade, each piece color and shapes can slightly vary and have some imperfections.It’s not due to lack of care, it’s just part of the process. But that is what makes them so special! No two pieces are the same :)Care Instructions:To ensure the longevity of this stained glass suncatcher, handle it with care and avoid placing it in areas with high humidity or extreme temperature changes. Suction cups are not recommended, please use a hook or nail.  Clean gently with a soft cloth or duster to maintain its brilliance.Add a touch of timeless elegance and captivating beauty to your space with our Art Deco inspired abstract stained glass mobile suncatcher. Embrace the charm of this unique piece of art and let it illuminate your surroundings with its enchanting play of colors and shapes. Order yours today and let the artistry of stained glass transform your space into a haven of sophistication!To see more of my designs please visit my shop :)https://www.etsy.com/uk/shop/multipleshapes",
    "reviews": [
      "The sound is beautiful as it lightly clinks when the heater kicks on.",
      "I bought one for myself last year and loved it so much, just bought this one for my sister. It's beautiful.",
      "I purchased this stained glass sun catcher as a Christmas gift for my daughter. She absolutely loved it! Beautiful piece of art. Customer service was a delight to deal with and answered all my questions expeditiously."
    ]
  },
  {
    "productId": "lcYMJrwOBn",
    "url": "https://www.etsy.com/listing/557392986/h-potter-tabletop-glass-torch-outdoor?click_key=25eda93474445a2cfab700793f80dadff89387a9%3A557392986&click_sum=e3770c8e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-46&pro=1&frs=1&sts=1&content_source=4e6707dfcacd98cf25c6cb756c60611d81e25ae3%253A557392986",
    "title": "H Potter Tabletop Glass Torch Outdoor Lighting Patio Lighting, Deck, Balcony, Backyard Decor Copper Snuffer Holiday Garden Wedding Gift Idea",
    "description": "Introducing the stunning H Potter tabletop torch set - the perfect addition to any outdoor space or event. Crafted with quality and designed for elegance, this set comes complete with 4 hand-blown glass torches set in a sturdy metal frame. Each torch measures 15.25 inches in diameter at its widest and stands at an impressive 16 inches tall.Boasting a generous oil capacity of approximately 16 oz., these torches will burn for hours, casting a warm and inviting glow over your patio, garden, or backyard. While oil is not included with the set, we recommend a clear burning fuel for optimal performance.These torches feature thick, hand-blown glass and are accented with a sleek black powder-coated metal frame, along with copper top and snuffer caps. Please note that due to the handcrafted nature of the glass, there may be some slight variations and small air bubbles in each torch.This tabletop torch set is not just functional, but also serves as a stunning centerpiece for any occasion. Whether it's a summer BBQ, an outdoor dinner party, or a cozy evening with loved ones, these torches will create a warm and inviting ambiance that will leave a lasting impression on your guests.So why wait? Add the H Potter tabletop torch set to your collection today and elevate your outdoor space with its charm and elegance.H Potter is a family owned business that takes extreme pride in creating distinctive home and garden accents. We’ve spent the last 25 years designing and manufacturing indoor and outdoor décor products for your home and garden with over 100 designs including terrariums, lanterns, trellises, window boxes, planters, & torches. We put significant resources into the design, quality, function, and look of each H Potter item, using only quality materials including stainless steel, hand-blown glass, and dramatic copper. We don’t cut corners to save money—we believe our customers deserve only the best.**Due to the high cost of shipping, we will no longer be shipping to Hawaii or Alaska.Visit H Potter's Etsy store to find more unique home and garden treasures:https://www.etsy.com/shop/HPotterMarketplaceTo see more torches offered by H Potter click here:https://www.etsy.com/shop/HPotterMarketplace?ref=simple-shop-header-name&listing_id=833166878&section_id=22123777If your package is returned to us due to the order being refused or an incorrect shipping address entered on the order, you will receive your refund less the cost of shipping and less a 10% restocking fee.",
    "reviews": [
      "Looks like really nice quality and workmanship.  Bought as a Christmas present.",
      "I’m so glad I believed the reviews on this centerpiece and made the splurge. This thing is very LARGE which is awesome because it is so stunning and utilitarian outside. I don’t think the scale shows this advantage in the photos. This would make the most amazing house warming gift! It basically replaces a firepit for us, we enjoy the dramatic fire gazing. The craftsmanship for this price is incredible. My tight husband is even impressed. Quality Garden Art.",
      "Awesome!",
      "This item is hands-down, the finest purchase I’ve made in any recent memory. In 2018, I saw this on Pinterest and it was the very first item I saved because it was consistently sold out. Fast forward to last month… we gave our back deck a beautiful facelift with new fabrics, furniture and umbrella. What was missing was a centerpiece. My only vision was that gorgeous oil-burning lamp I’d saved several years before. I found it on Etsy from the same seller, it was delivered in no time, packed amazingly, and every bit as beautiful and well-made as I hoped!!!  Order this! It is a show-stopper and plenty heavy enough to withstand typical weather once filled with oil! Easily embellished with ivy and matching florals of your choosing. Thank you H. Potter!!!"
    ]
  },
  {
    "productId": "ZsGTYQYpp3",
    "url": "https://www.etsy.com/listing/1368344178/modern-bird-feedero-minimalist-bird?click_key=022f216c04b273157cb0d529373443e494fb7842%3A1368344178&click_sum=884d57b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-47&pro=1&sca=1&sts=1&content_source=7900a7209133be0728d137a3081575d200c9874d%253A1368344178",
    "title": "Modern bird feeder | minimalist bird feeder | bird house | hanging bird feeder | bird lover",
    "description": "A modern and high-quality bird feeder for all nature lovers who appreciate their garden or balcony and enjoy observing nature in all seasons.We manufacture modern, minimalist bird feeders that blend beautifully with your area's nature and beautify your favorite corner of the garden or balcony. You will enjoy watching the birds and feel good knowing that birds in your garden have a reliable, plentiful source of food to keep them well-fed and thriving. Did you know that for birds, feeders can aid survival during migration and harsh winters? Let's help them!The entire shell of our bird feeder is made of powder-coated galvanized steel that will withstand all weather conditions. It is painted in black matte, which gives this bird feeder a sleek, modern, and minimalistic look.The platform is finished with two panels made of Siberian larch, seamlessly connecting it to nature and preventing the seeds from being scattered on the ground. Both front sides of the feeder are open so the bird can land and fly away without feeling threatened.The bird feeder does not need to be assembled, you can hang it right out of the box. You also get 2m of black rope in your package for that purpose.Our birdhouse is also a perfect present for Christmas, New Year, birthdays, or housewarming parties. It will be appreciated by your loved ones, your friends, and your neighbors, especially if they love nature and birds.Handmade in Europe, Slovenia.ABOUT•  high-quality materials,•  modern design,•  attention to detail,•  durability,•  handmade,•  a finished product, no assembly needed,•  family production,•  dimensions: 36 x 29 x 29cm (L x W x H),•  Weight 3,5kg•  unique gift for Christmas, New Year, birthdays, housewarming parties...•  If you have any questions, please contact us,•  we ship via DHL Express, GLS, Pošta SlovenijeVisit my shop for morehttps://www.etsy.com/shop/LIVIOurbanGarden",
    "reviews": [
      "I could believe how fast this parcel came - I told my mother to not get her hopes up about receiving it before Christmas, and I arrived very well in advanced! The product itself is beautiful! She loves it and cannot wait for the birds to start using it",
      "Very sturdy and well built.  The birds took to it immediately.",
      "I absolutely love the feeder + everyone compliments it because it’s unique and beautiful."
    ]
  },
  {
    "productId": "kTsMCYNnel",
    "url": "https://www.etsy.com/listing/1078880515/butterfly-solar-powered-led-wind-chime?click_key=338b52cb80c4248b90d301fa4d0cd98aeb206b27%3A1078880515&click_sum=391792e7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-37503-5-48&pro=1&content_source=1b39fdb280ef927b2b7a7647fe0e3ed667045ba6%253A1078880515",
    "title": "Butterfly Solar Powered LED Wind Chime, Color Changing, Outdoor Decoration, Patio Lighting",
    "description": "Solar Powered LED Color Changing Butterfly Wind ChimesAutomatically recharges and saves power, no batteries necessary!High quality and made with careColors are beautiful and illuminate at nightHooks easily, and very smooth set up processPackaged very securely with bubble wrapPlease feel free to send me a message with any questions you may have!",
    "reviews": [
      "This is really beautiful, love it",
      "Item is nice. Miraculously- since UPS damaged the box so badly. I would recommend a little more packing next time but otherwise okay.",
      "I love it!"
    ]
  },
  {
    "productId": "joOTwsUlFA",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=bc50d4dc4427298ba3e123026f8bee0af51761b9%3A1567221560&click_sum=0151539b&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!"
    ]
  },
  {
    "productId": "uNVlMFzFSG",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=57d36c9a591d8c23cb2394ae3125f1525e782d9e%3A1544035118&click_sum=c501c346&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "liJmVphPHA",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=c05c726156f3aacd6d986dacb43fa5609c5a3751%3A747068567&click_sum=02590bde&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!"
    ]
  },
  {
    "productId": "atJQJZlUwI",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=f5dadf416c23ffdf7a8f57e7fedf658f4133900f%3A654638870&click_sum=e4ddf80c&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "yohURazjrj",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=abc57305ec3729b0d8fc9a8fbfa1f64928da8df1%3A1355783916&click_sum=b80dedd5&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist",
      "Perfect very pretty it was very fast"
    ]
  },
  {
    "productId": "k8TnTknvaA",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=58e816d8a93b1c79ab130b0f3f4dc326a06b4ebd%3A1411614241&click_sum=37416ae3&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!",
      "The only thing I didn’t consider was my outlet is sideways where I wanted to put it and the prongs on this base are not able to be turned. The item itself is great though!"
    ]
  }
]
