[
  {
    "productId": "ALutzKNjCi",
    "url": "https://www.etsy.com/listing/1040827125/house-warming-personalized-cooler?click_key=4a6862479c85309a1920835fad5eed80944b14e8%3A1040827125&click_sum=0d5b07b0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-1&pro=1&frs=1&etp=1",
    "title": "House warming personalized cooler.  Excellent home accessory!",
    "description": "The perfect housewarming, wedding gift, anniversary gift, or just for you!! This cooler is great to display drinks inside or outside with a handmade Frio removable liner that makes refilling and cleaning a breeze!*SIZE & CAPACITY● This cooler holds around 24 cans● Dimensions 24”Long x 12”Wide x 10”Tall*ABOUT THIS ITEM● Handbuilt in Texas from Western Cedar● Removable insulated liner snaps in with buttons● Laser Engraved Personalization● Can stay outdoors, does not need to be inside.*HOW TO ORDERTo order, select your style then enter what you want engraved. Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only to request a proof please make a note when placing your order.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.**Social Media:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product.  We appreciate every opportunity to earn your business!  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Quick and easy purchase they loved",
      "Great communication with the seller. Fast shipping. It can easily be used inside on a counter if desired. I might add a clear coat of stain to seal the wood prior to gifting.",
      "great item and great customer service",
      "My order was perfect! It’s exactly what I hoped for and I loved giving it as a gift."
    ]
  },
  {
    "productId": "vxBpnXIWdT",
    "url": "https://www.etsy.com/listing/527640948/metal-hand-painted-gold-finch-on?click_key=bc84209ef572b8a796a6005b40aa537b5b040e96%3A527640948&click_sum=bb7766d4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-2&pro=1&etp=1",
    "title": "Metal Hand Painted Gold Finch on Coneflower Garden Art | Gold Finch Silhouette | Echinacea Flower | Rusted Yard Art | Garden Gifts | B770P",
    "description": "Introducing our beautiful Metal Hand Painted Gold Finch on Coneflower Garden Art! This delightful piece will add a touch of nature's charm to your garden or outdoor space. The exquisite hand-painted gold finch perched on a coneflower creates a stunning visual appeal that will capture everyone's attention.Crafted with high-quality metal, this garden art is built to withstand the elements and remain vibrant all year round. Its eye-catching design adds a pop of color and a sense of serenity to any garden or patio.Best of all, we have great news for you! We are now offering this lovely garden art at a new low price, making it even more affordable to bring the beauty of nature to your outdoor oasis. Don't miss out on this fantastic deal and order yours today!Please note that the Stump is not included with The GoldfinchCheck out our other hand painted birds such as our Chickadees and Berries (search ‘B772P'), Bluebirds on Spring Willows (search ‘B776P'), or Hummingbird on Salvia Flower (search ‘B769P')Dimensions: approximately 10.5\" tall x 7.5\" wide",
    "reviews": [
      "I couldn’t have been more pleased with the item. It looks great!",
      "Gorgeous gold finch and cone flower.  Will be a nice colorful accent to our dormant winter garden.  Thanks for your kindness and quick delivery.  A++++ seller.",
      "Great product and fast shipping!!!",
      "Beautiful!  Even more colorful than I thought it would be!"
    ]
  },
  {
    "productId": "OfiosweYsD",
    "url": "https://www.etsy.com/listing/826335407/dragonfly-with-bells-wind-chime-wind?click_key=79a0c33b6fd11dab0cbb83c8b1b8dcf43ba9634c%3A826335407&click_sum=1a22e5e0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-3&pro=1&bes=1&sts=1",
    "title": "Dragonfly with Bells Wind Chime, Wind Chimes, Tree Decor, Garden Decoration, Gardening Gifts, Yard Art Decor, Garden Ornaments, Gardening",
    "description": "Dragonfly with Bells Wind ChimeLooking to add twice the sensory delight to your garden with just one simple accessory? Look no further than our Dragonfly with Bells Wind Chime! This sculpted, suspended dragonfly features eight bells that ring effortlessly in even the lightest of breezes, bringing both beauty and melody to your garden. Ready to hang, this piece also makes a lovely and frustration-free gift. As always, this wind chime has been individually handcrafted.Sculpted dragonfly with 7 bellsReady to hangDimensions: 10.5” L x 1.5” W x 22.5” HWeight: 0.6 lbsEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and windchimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and windchimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "It’s as beautiful as I thought it would be",
      "Beautiful wind chime! Would recommend.",
      "Exactly what was promised, thank you."
    ]
  },
  {
    "productId": "oAqooWBSQM",
    "url": "https://www.etsy.com/listing/1666049430/2-pack-gorgeous-orchid-solar-lights?click_key=a716655df0eef4a14eefc0472340b0d069ee75f9%3A1666049430&click_sum=82fb8f7e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-4&pro=1&frs=1&sts=1",
    "title": "2 Pack - Gorgeous Orchid Solar Lights, outdoor front or backyard decorations. Beautiful Day or Night. The Perfect Gift",
    "description": "These Gorgeous Solar Lights will transform your front or backyard into beautiful work of art!- SOAR POWER - Turn the 'ON / OFF' Switch at the bottom 'ON'. Let the Sun charge it for at least 4 hours and enjoy the power of the Sun to light up your garden.- GORGEOUS COLORS - A purple and pink colored imitation orchid will look gorgeous during the day or night.- FLEXIBLE STEMS - The flexible stems can be moved around till you are satisfied.",
    "reviews": [
      "Well packed and ornament is just as described.",
      "These orchids are beautiful day or night! \nHappy with my purchase",
      "Bright and colorful \nCan’t wait to put them out",
      "Gorgeous wind chime with beautiful colors!"
    ]
  },
  {
    "productId": "NjudHhdEwc",
    "url": "https://www.etsy.com/listing/1642349919/wood-flower-shelf-display-rack-3-tier?click_key=83549155d59f17f88feb6ef4ca0eac6a60dc46f1%3A1642349919&click_sum=ad3faee8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-1&pro=1&frs=1&content_source=85ed8cd9ea46a8e7ea3425da57f7f9e825159c34%253A1642349919",
    "title": "Wood Flower Shelf Display Rack 3 Tier Plant Stands for Living Room Bedroom Outdoor Balcony Garden Patio Metal Wood Corner Pot Holder",
    "description": "The black plant stand is 28\" high overall, and the large wooden board size at the bottom is 11\" (a wider and thicker base is enough to maintain the stable and balance). The simple look is perfect for displaying your lovely plants without taking up too much space, elegant yet practical.3 Tier plant stands indoor features an asymmetrical tiers design, the minimalist structure can perfectly fit into the corner of your home, and adds spice to an empty corner while saving space, allowing you to maximize use of space.While other plant stands can only be used indoors, our metal plates have a hollowed-out design that is aesthetically pleasing and has drainage & light transmission functions, allow your lovely plants to grow healthily.",
    "reviews": [
      "Fits really well and looks great in my living room. Easy to put together. \nWould definitely buy more.",
      "These were so easy to put together and well made, will be buying one more now!",
      "This is a great item! We put it together quickly, & it’s perfect to get your small plants up & off the ground! Thank you"
    ]
  },
  {
    "productId": "EpfOSuiUQa",
    "url": "https://www.etsy.com/listing/1326953977/44-nc-22-nc-wooden-table-car-picnic?click_key=6d93b533946c8291250a7895cc7819aa06c7d113%3A1326953977&click_sum=dd3dc48e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-2&pro=1&frs=1&etp=1&sts=1&content_source=31327f9fe20a86e7d5cca9a4408a530691a43043%253A1326953977",
    "title": "44 ınc- 22 ınc, wooden table, car picnic table, folding table, boho picnic ,wooden gift,portable table,Boho picnic table, handmade furniture",
    "description": "110cm-55cm44ınc-22ınc*****If you want to print a brand or name, please share your name or brand with us in the message section.******This product is completely handmade and very durable.*Each package is carefully wrapped to ensure safe delivery,Boho picnic table,boho beach picnic table***If you want to make special production, please contact**** Europe: 7-14 days;* USA & Canada: 10-17 days;* Australia & everywhere else: 10-30 days***Damaged products are covered by our warranty***",
    "reviews": [
      "Great product, very happy with it!",
      "Great quality. Will order again",
      "Seller contacted me ahead to make sure I knew the size I was purchasing after I had asked about another product. Was very good customer service. Table is great. Really liked how I could have something etched into the table. Really fast shipping and great quality"
    ]
  },
  {
    "productId": "czyhAVQfbr",
    "url": "https://www.etsy.com/listing/1617851117/solar-butterfly-wind-chimes-for-outdoor?click_key=8b146ca83cd7c3ca32cfde5dbd33f47d9070a7c6%3A1617851117&click_sum=5d722aaa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-3&pro=1&content_source=3bb8a0fa80eb829880e6c116ef382baf01fdef48%253A1617851117",
    "title": "Solar Butterfly Wind Chimes for Outdoor, Women Gifts for Christmas Decorations Outside Lights Hanging Mobile Decor for Garden Patio",
    "description": "About this item【Womens Gifts for Christmas 2023】: Our solar butterfly are well-packed christmas gifts for mon and grandma: Our solar butterfly are well-packed with upscale beautiful gift boxes, and are surely a decent gift choice for you. It serve as a way to help express your care and cherish for others. Especially on Christmas, this is always a ideal gift for your mother, wife, grandma, sister, or friends.(GIFTS FOR MOM ,MOM GIFTS,BIRTHDAY GIFTS FOR MOM,GRANDMA GIFTS, GARDEN GIFTS FOR MOM)【Perfect Christmas Gift for Women】: Wind chimes help to attract positive energy and bring good luck, bring this present to the women you loved. Whenever come to the solar butterfly wind chimes , she can simply feel as if she is in a garden, where the wind chimes relieves her stress, reduces her anxiety, and refreshes her mind. Give the solar butterfly wind chimes as a Christmas gifts, sympathy gifts, birthday gifts, housewarming gifts, Thanksgiving gifts, Mothers Day gifts, etc.【Gardening Decor Lights gifts for mom】: The solar butterfly will changing color 6 - 8 hours (after fully charged) at night automatically.This is unique decoration to hang on the garden trees, fences,lawn,shepherd Hook for garden clearance, the butterfly wind chime flies gently in the breeze.It surprise your mom to get such vivid garden gifts.【Solar Outdoor Decoration Lights】: The wind chimes are solar powered. After a day of direct sun the wind chimes will automatically glow in the dark at night. All kinds of beautiful colors and they change colors in the process. The solar wind chimes are waterproof for outdoors and have two stytle of hook for hanging.You can easily hang butterfly wind chimes on doors, window and any other places you like.【Interesting Yard Decoration】: The outdoor wind chimes can illuminate your garden, terrace, bedroom windows, front yard, garden, camping ground. Enjoy coming home in the evening and being greeted by your favorite butterfly lighting the way for you as you walk up to the house.You can also hang the solar wind chime outside the bedroom window as a chandelier and nice decoration.From the brandThe wind chimes mean a lot of blessing and happiness.Wind chimes help to attract positive energy and bring good luck. Get these wind chimes to your mom, grandmom, mom in law, sister, wife, daughter. They can get your support and power from these gifts wind chimes.Unlike the traditional ones ,these solar wind chimes help you feel relaxed when mixing colors and beautiful lights, add a romantic atmosphere to the night.Product DescriptionButterfly Solar Wind Chimes - Indoor & Outdoor Decoration Solar Lights for Your Garden, Yard and Party-Gifts for WomenUnique Decor Gift for Important People in Your Life！-The solar butterfly wind chimes is the best present for Christmas, Thanksgiving Day, Birthday, Anniversary,Mother's day , etc.-Christmas Solar Lights for Outside, Birthday Gifts for Friends Sister and Mon,Fun Patio Decor with Waterproof.",
    "reviews": [
      "Exactly as described. Beautiful on my frontporch after dark",
      "Arrived quickly. Appears to be sturdy. Will be putting in with bouquest of flowers",
      "The item is exactly what I ordered"
    ]
  },
  {
    "productId": "ZyVPTxtZiQ",
    "url": "https://www.etsy.com/listing/1497868669/sloth-hanging-planter-planter-indoor?click_key=aa706a43cbab15265a07c417ba046c52104b8833%3A1497868669&click_sum=90840a7b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-4&pro=1&sca=1&sts=1&content_source=2744f1e96ff15666a145b024ed334e03cdb4c72f%253A1497868669",
    "title": "Sloth hanging Planter, Planter Indoor Pots, Hanging Pots Modern Plant Holders with Rope and stick for Succulents Cactus Herbs Small Plants",
    "description": "Unique sloth planter hangs like a hammock for your favorite succulents. I made it with clay, some part is pottery wheel throwed.Glossy ceramic planter with engraved details and string for hanging. Color: satin beigeDo you want something special in your home or garden decoration? Check out this cute sloth hanging planter!- This lovely hanging planter will brighten up any space- Your little potted plants will never go unnoticed with this eye-catching succulent plant stand- The size is ideal for succulents, cacti, air plants or other plants- You can add visual interest to your walls, windows, desk or tables- It is handmade from high quality ceramic- This hanging planter can be easily hung anywhere indoorsSize: ~18x23 cm.Rope and stick included.",
    "reviews": [
      "Although one of the stems broke it was an amazing product and I fixed it easily with help from the seller",
      "Wonderful craftsmanship. Very nice pottery",
      "Beautiful products and great communication"
    ]
  },
  {
    "productId": "xhG9MXqAIG",
    "url": "https://www.etsy.com/listing/1449215085/butterfly-garden-stake-sign-mothers-day?click_key=61f04296a480eb1ceed67d97726be444ee5f0460%3A1449215085&click_sum=706c0f85&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-5&pro=1&frs=1&sts=1&content_source=44a6d246949b5140a30d005e594728b5c6e3759d%253A1449215085",
    "title": "Butterfly Garden Stake Sign, Mother's Day Gift, Outdoor Gift Idea For Mom, Metal Powder Coated Butterfly Yard Sign",
    "description": "Looking for a unique Mother's Day gift? How about a butterfly garden stake sign! This metal yard sign is made out of powder coated steel and features a beautiful butterfly design. It is the perfect addition to any outdoor garden or yard. Makes a great gift for any occasion! Give this wonderful gift today!*MORE GARDEN STAKE IDEAS FROM OUR STORE*https://www.etsy.com/listing/970506664/custom-garden-yard-stake-mothers-day?click_key=3f52fbdf2c23fe5ff61c28b42c44e606f81e079d%3A970506664&click_sum=728ae8b5&ga_search_query=GARDEN&ref=shop_items_search_20&pro=1&frs=1https://www.etsy.com/listing/1214830073/custom-floral-garden-metal-yard-stake?click_key=b953194051821c8ddb8c1fb39324de582bfec12c%3A1214830073&click_sum=4032fd8f&ga_search_query=GARDEN&ref=shop_items_search_23&pro=1&frs=1https://www.etsy.com/listing/1407848172/customizable-metal-hummingbird-yard?click_key=639b02a598195fc54349cc85711f401030d16592%3A1407848172&click_sum=9549bb5b&ga_search_query=HUMMINGBIRD&ref=shop_items_search_7&pro=1&frs=19\" stakes are made from 16-gauge steel and 14 through 36\" stakes are made from 14-gauge steelAll of our signs are sanded smooth, and powder coated with a durable UV powder coat to endure the elements for many years to come.Sizing is for the height of the sign including the stakes.4x9 inches (flowerpot size)8x14 inches13x19 inches16x24 inches20x30 inches24.5x36 inches*If you would like a proof before production, leave that in the notes to seller as well.  PROOFS ONLY PROVIDED UPON REQUEST. *All of our signs are laser cut for the most detailed precision, sanded smooth, and powder coated with a durable UV powder coat to endure the elements for many years to come.*NOTE* Custom request changes or add ons made to the current design, (font change request, adding images, removing images, rearranging the original layout, etc.) may require an additional add on fee.   Please message us with your request for details prior to purchase, so that an additional listing can be sent to you before we begin the project if needed.  Add ons for these changes vary from $10-$35.-Add on charges will not be applied for wording changes if the listing asks for your wording/personalization.PLEASE REFER TO THE COLOR KEY PICTURE IN THE LISTING BEFORE ORDERING.*All custom sales are final*-Shipping is generally 2-5 business days from the date order was placed.   Due to the start of the Holiday season, October-December shipping may take 2 to 3 weeks.-Free shipping excluded from Hawaii/Alaska, APO/FPO, US Protectorates, & at times for larger items shipped to P.O boxes (we may need a physical address to ship some larger items, we will message if needed). Please contact us before purchase if your order/address is in any of these categories, and we will look into the best shipping method to get you your item.Sign up for our newsletter for more exclusive deals!https://www.speedfabrication.com/apps/seguno/subscribe",
    "reviews": [
      "The Spring butterflies with flowers metal lawn decoration is absolutely beautifully designed and made with high-quality material.  This is the second metal lawn sign I purchased because of the  quality of the items.  Also, it was well packaged.  I plan to purchase a fall sign in the future.  \n\nI highly recommend purchasing signs from this company.",
      "Love these signs! Collecting for outside decor for all the seasons.",
      "Beautiful! Love the detail and shade of yellow. Purchased one for a friend and one for myself.  We both love it. Great communication from the seller.  Thank you!"
    ]
  },
  {
    "productId": "cbuiBLdSeS",
    "url": "https://www.etsy.com/listing/1518848692/bird-feeder-garden-decor-outdoor-yard?click_key=080822e9de56525fd00d453325e9643202ff94f5%3A1518848692&click_sum=4919a4e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-6&pro=1&frs=1&content_source=ea52b5ea5e6c1751b867e0560a74e318361cc7fa%253A1518848692",
    "title": "Bird Feeder Garden Decor, Outdoor Yard Decor, Lawn Decor, Porch Decor, Home Decor, Room Decor, Resin Decor, Desk Ornament",
    "description": "✦ See our entire collection here: https://www.etsy.com/shop/TheGardenHeavenItem: Bird FeederMaterial: CeramicType: Garden DecorSize: 16 x 8 cm / 6.2 x 3.1 inNote:The size of the product is measured by hand. The real object is placed horizontally, and there may be an error of 1-3 cm. Please pay attention to this factor when purchasing! All product pictures are taken in kind. Due to differences in lighting and displays, there may be color differences with the actual product. Such problems are not product quality problems. The final color is subject to the actual product.",
    "reviews": [
      "Quick response to my question and the garden chicken decorations are amazing!",
      "High quality, great accessory for your nerdy house decor. 🖖🏻",
      "Great quality. Item matched the description. Met my expectations",
      "Cute and small. Perfect for indoors."
    ]
  },
  {
    "productId": "gOVgqXXeXU",
    "url": "https://www.etsy.com/listing/1239448482/set-of-2-fluttering-dragonfly-crystal?click_key=71d87102c30384a1cb929454b7697805e213f9f4%3A1239448482&click_sum=1dfee190&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-7&pro=1&bes=1&sts=1&content_source=20b42ba403c22e29b3d5964613262862158e237c%253A1239448482",
    "title": "Set of 2 fluttering dragonfly crystal glass brilliant cut sparkling dragonfly with fabric wings that flutter in the wind 9 to 12 cm color selectable",
    "description": "Fluttering dragonflies crystal glass set of 2 brilliant cut sparkling dragonfly with fabric wings that flutter in the wind 9 to 12 cm color selectable",
    "reviews": [
      "Excellent  gift. Really made my day.",
      "Thank you 💕",
      "Beautiful on my deck in the flowerpot.",
      "💕Thank you so much",
      "Beautiful colorful dragonflies TOP!!!😍 Thank you.",
      "Herzlichen Dank 💕",
      "Very beautiful and very original. Everything was well packaged, arrived quickly and in good condition8\nWell done and thank you very much!",
      "💕Merci madame"
    ]
  },
  {
    "productId": "JxDfMmYdnW",
    "url": "https://www.etsy.com/listing/1224041955/balcony-table-space-saver-balcony-bar?click_key=efd1324e0aab973b2fcfaf509ca25d93249b2f50%3A1224041955&click_sum=557c883f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-8&pro=1&frs=1&sts=1&content_source=01a2510d83c05560709d8a508c05088b41aa8269%253A1224041955",
    "title": "Balcony Table Space Saver, Balcony Bar Table for railing, Wooden Patio Bar, Patio table, Folding Table for Terrace, custom folding table",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.You can check our other balcony bar table in here:https://www.etsy.com/shop/PureWoodesign?ref=seller-platform-mcnav&section_id=38610171Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.Our Balcony Bar Cover DETAILS :XXSmall: 15.7\" Length (40 cm)XSmall: 21\" Length (53.5  cm)Small: 24\" Length (60 cm)Medium: 31.5\" Length (80  cm)Large: 39.5\" Length (100 cm)Xlarge: 47.3\" Length (120 cm)2Xlarge: 59\" Length  (150 cm)3XLarge: 70.8\" Length  (180 cm)4XLarge: 78.7\" Length  (200 cm)5XLarge: 86.6\" Length  (220 cm)6XLarge: 96.4\" Length  (245 cm)Made with polyester.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.Pack Details:We are shipping your furniture with a durable hard box !We can also make a pack free of charge 😊Shipping:We are making your furniture as a custom order and crafted one by one meticulously.As a team, we’re working to serve your ring as soon as possible! Please check current shipping time when you order 😊FREE shipping & EXPRESS Shipping worldwide. 😊I am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Customer Service:We are always here to serve you! Whenever you want to ask something, please do not hesitate to get in touch with usThank you for reading all the details! If so, please click the “Favorite Shop” to follow our new furnitures and to get news about updates and discounts! 😊",
    "reviews": [
      "Ömer was an excellent seller to work with. I had a question/concern about the finish I chose and he answered me quickly and assured me I’d be happy with my end result. He was right- I’m super happy. The shelf arrived SUPER fast after he informed me it was shipped— like 2 days fast from Turkey to Texas. \n\nRecommend this product and seller 11/10. Thank you Ömer 🙏🏼",
      "Great communication with seller shipped super fast",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony bar table quite beautiful. Your satisfaction means the world to us. Enjoy your new spacesaver table!",
      "So classy, made my deck beautiful. Excellent craftsmanship, great customer service and very fast shipping. I have bought four so far and will buy more from this seller. One of the best.",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony bar table so classy, excellent craftsmanship. Appreciated great customer service and fast shipping. Your satisfaction means the world to us. Enjoy your spacesaver table!"
    ]
  },
  {
    "productId": "qNynNLyZah",
    "url": "https://www.etsy.com/listing/1627322570/luxe-beach-umbrella-for-beach-or?click_key=d0cbb62a45b0017a1d704b0b37f97c5f465d3f7b%3A1627322570&click_sum=4d612959&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-5&pro=1&sts=1",
    "title": "Luxe Beach Umbrella for Beach or Backyard Leisure",
    "description": "Luxe Beach Umbrella for Beach or BackyardMid-size outdoor white umbrella perfect for the beach or your backyard. Comes with a matching carrying bag.SpecificationsSet Up Time: Under 1 MinutePole Diameter: 1.25 Inches (3.175 CM)Weight: 11.5 Lbs (5.2 Kilograms)In Carry Bag:48 Inches Height7 Inches Width7 Inches DeepIn Use:91.5 Inches Height74 Inches Canopy DiameterCare:Store indoors, inside the carry case only when completely dry.Avoid the use of harsh chemicals. Use soap and water and spot clean problem areas.If the item gets wet from the beach or weather, make sure it is completely dry before putting it away in storage.Avoid direct exposure to chlorinated or salt water to preserve the natural beauty of the item.",
    "reviews": [
      "Absolutely gorgeous umbrella, high quality and well packaged. Comes with a cover that has two straps to make it easy to transport. Cover is also great for storage. Highly recommend this product. Thank you Humble Abode!",
      "Beautiful and refined and elegant!",
      "Beautiful and refined and elegant!",
      "These were great for my niece's wedding. Great item and experience."
    ]
  },
  {
    "productId": "GoRg5zdLmc",
    "url": "https://www.etsy.com/listing/1614920451/plant-stand-for-indoor-plant-pots?click_key=fc72a8534ddb29d884ffc1044fe8b2cf8e36214f%3A1614920451&click_sum=67aa3dbf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-6&pro=1&frs=1&etp=1&sts=1",
    "title": "Plant Stand for Indoor Plant Pots - Perfect for House Plants and Plant Lovers, Gift for Plant Lover, Art Deco Planter Stands",
    "description": "A Unique Indoor Bespoke Plant Stand is a great addition for any plant pot with drainage hole to add elevation. This stand can be used as a plant stand, end table, nesting table or even an elevated stool on a countertop for more storage. A sleek and art deco look.Made with high-quality plant based materials that are recyclable and biodegradable, although these will last for years to come. Stylish, Functional and Sustainable!Main image is beige.The Unique saucer feature provides an area for water to drip while also being a cute stand. Functional and Sturdy to hold your heaviest of plants.  Use this stool as a prop in your next video or photography shoot. Lightweight,  small round table is strong and sturdy. Get into your Cottagecore room decor with this beautiful crafted, eco-friendly stand.Mix and Match the color shelf with color legs that you desire. We have provided a picture of most color combinations. Create the perfect aesthetic indie room decor.Dimensions:Small:Height - 3.5 inchesShelf - 5.8 x 5.8 inchesGreat to use as a small centerpiece for table, counter, or island.Medium:Height - 5.5 inchesShelf - edge to edge 6.8 inchesGreat for medium sized plants that you want to elevate from a surface.Large:Height - 6.5 inchesShelf - 9.8 x 9.8 inchesGreat for larger plants to use on the floor.MAX WEIGHT 100 Pounds.Table comes fully assembled and ready to display right out of the box, making this the perfect gift.NoteOur items are 3D printed with PLA - a type of thermoplastic polymer derived from Upcycled materials like Corn, Beets, and Wheat Grass. PLA is 100% biodegradable, recyclable and compostable! This eco-friendly way if manufacturing products may result in some blips or blemishes, keep this in mind when ordering.PLA Is very strong and sturdy. Sudden bumps or falls will not harm these items as they are designed to withstand unexpected life happenings.Our goal is to make sure every planter has minimal layer lines and surface imperfections. We only ship planters we would be proud to plant in.Every End Table is thoroughly tested upon shipment for sturdiness and strength.",
    "reviews": [
      "Great communication. Great product. Fast Shipping!",
      "Super nice, exactly as described. Can't wait to put my Orchid in her new pot.",
      "I am very happy that I purchased this! Very pleased with how it looks."
    ]
  },
  {
    "productId": "YDc9GykVpC",
    "url": "https://www.etsy.com/listing/1119094663/wood-plant-stool-wood-accent-stool?click_key=513148768489db0d64229fbc0e2a63d80fa6e32c%3A1119094663&click_sum=c93d0f2a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-7&pro=1&frs=1",
    "title": "Wood Plant Stool, Wood Accent Stool, Reverse Dipped Stool",
    "description": "Handmade Decorative Wooden Stool that can be used to match any of your decor needs.With an 8\" or 10” top, these can be customized to fit any of your needs.This stool is available in 6 different height options- 12”, 16”, 20”, 24”, 28”, and 30”.The following stain options are available:-Dark Walnut-Special Walnut-Aged Barrel-Golden Oak-Natural.Message me for custom options! Stain Colors, Paint, Etc. A few of the options are shown in the pictures but the options to customize your stool are endless!If you would like something different than what is already listed please message me.If you are looking for similar items or other wooden home decor, check out our shop!The purpose of this item is for decoration and not designed as a seat. If you would like a seat please reach out about a custom item.***This item is made from actual wood, therefore there may be knots or imperfections in the wood****",
    "reviews": [
      "Very good quality and the finish is beautiful. Very sturdy. If you are thinking about getting on just go for it!!",
      "The stool is good looking and arrived quickly given my specific wishes. Nice there are so many options for the stool. I am using it as a plant stand, so I chose to have the seat and top of the legs painted",
      "What a beautiful plant holder! It holds my cactus perfectly and really blends in with our kitchen furniture. Thank you for the great design and secure packaging!"
    ]
  },
  {
    "productId": "NbFQugsaSR",
    "url": "https://www.etsy.com/listing/1496887857/mosaic-table-handcrafted-moroccan-mosaic?click_key=7de49521e7dc730472ab05716f982bf99d8b4f49%3A1496887857&click_sum=2877ef6b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-8&pro=1&frs=1",
    "title": "Mosaic Table Handcrafted Moroccan Mosaic Table - Exquisite Artistry for Your Home Décor can be used patio table, coffee table,interior decor",
    "description": "Elevate your home décor with our handcrafted Moroccan mosaic table, a true masterpiece of artistry and craftsmanship. Each table is meticulously crafted by skilled artisans in Morocco, using traditional techniques passed down through generations. With its vibrant colors, intricate patterns, and exceptional quality, this mosaic table is sure to become the centerpiece of any room.Made from the finest materials, including authentic Moroccan tiles and sturdy base, our mosaic table boasts durability and elegance in equal measure. The tabletop features a stunning mosaic design inspired by Moroccan motifs, adding a touch of exotic flair to your living space.Whether you're looking for a stylish side table for your living room, a charming bistro table for your patio, or a unique accent piece for your bedroom, our Moroccan mosaic table is the perfect choice. Its versatile design blends seamlessly with any décor style, from traditional to modern, making it a timeless addition to your home.Not only is our mosaic table a functional piece of furniture, but it's also a work of art that reflects the rich cultural heritage of Morocco. Each tile is hand-selected and placed with precision, resulting in a table that is as beautiful as it is unique.In addition to its aesthetic appeal, our mosaic table is also practical and easy to maintain. Simply wipe it clean with a damp cloth to keep it looking its best for years to come.Bring a touch of Moroccan charm to your home with our exquisite mosaic table. Whether you're treating yourself or looking for the perfect gift for a loved one, this table is sure to delight and inspire.✅ Infos :-Place Origin : Morocco ( FEZ )-Materials    : Organic CLAY-Color          : Every Table has unique petterns (mosaic tiles ), colors and sizes✅ Take care of your Moroccan Mosaic Table :- Wipe your ceramic table only with a soft cloth or sponge,- Clean your table by hand gently✅ Need Help We are here for you Contact Us :-Please do not hesitate to contact us via etsy. we will get back to all messages with in 24 hours✅ Packaging and Shipping- The Mosaic tables Packed in bubble wrap with other packing materials, placed in a wooden box and shipped withe care.- All of our products are shipped with FedEx.- We ship All the week except for Saturday, Sunday and holidays.- After you have placed your order, you will receive a confirmation message requesting a phone number. We need it for the tracking documents.- We will provide a tracking number once your item is shipped- We take a lot of pride in our items and will always make sure they are very well packed and protected for shipping.- Please be aware of delays on shipping that are out of our control such as Customs holds, Holidays, weather delays or other disruptions.✅ MONEY BACK GUARANTEEYou are covered by the Returns & exchanges policy of our Shop policies.We want all our customers to be completely satisfied!Thank you for visiting",
    "reviews": [
      "Top transaction. Very nice carpet.",
      "The pillow I purchased was even more beautiful in person, and of exceptional quality. Heavy wool with saturated colors. Shipping was super fast and communication was a breeze. I highly recommend this shop.",
      "Beautiful quality, packaged very well and I’ll definitely be ordering from this shop again in the future. Thankyou so much!"
    ]
  },
  {
    "productId": "lTDPTYGqPK",
    "url": "https://www.etsy.com/listing/973014580/ruby-throated-hummingbird-steel-metal?click_key=fad5457a39784549811d39518b476a4f03ef9128%3A973014580&click_sum=bb1898af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-9&pro=1&frs=1&sts=1&content_source=4e51cd077aa0ad63145f484d4e5b18868ddc23b2%253A973014580",
    "title": "Ruby Throated Hummingbird Steel Metal Bird Yard Garden Art  - Free Shipping",
    "description": "Handmade Male Ruby Throated Hummingbird sitting on a branch, guarding the feeders because they all belong to him!!  Slightly larger than life size 6 X 5 Metal Yard Art made from thick, sturdy 12 ga. steel.  Yard Art has an attached metal mounting plate for super easy, quick mounting on trees, fence posts, porch railings, etc. requiring only 1 screw. (self tapping screw included).Black powder coating for a long lasting finish with painted red throat.The perfect gift for backyard birders!Handmade in the beautiful Blue Ridge Mountains of Virginia USAThis artwork is a 2D item made from flat 12 ga. steel. It is meant to be a silhouette with a realistic look once mounted.* 30 Day return policy - There is a 30 day return policy on all of our artwork. If there is any issue with your item please contact us through Etsy messages so it can be resolved.* Handle with Care <3 This artwork is made from metal and may have sharp edges. Take care in handling. It is not  toy. Do not allow children or pets to play with this artwork.Please mount it in a safe area and ENJOY :)",
    "reviews": [
      "It looks great so I’m keeping it",
      "Just what I was looking for",
      "Breath takingly beautiful.  Arrived quickly and is so lovely.  Can't wait to install this in the garden. Would buy again and also recommend the vendor.  Splendid!!!",
      "Love this!!  Beautifully made, good quality!"
    ]
  },
  {
    "productId": "pVNVjrFMrP",
    "url": "https://www.etsy.com/listing/1671709534/shimmering-bells-with-butterflies-wind?click_key=ebb53cdb704b8e2b00776a499637a4fb38dbc0a2%3A1671709534&click_sum=f5e32f2a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-10&pro=1&sts=1&content_source=dbe90dbfe7ecd22059548079a04b712a24377baa%253A1671709534",
    "title": "Shimmering Bells with Butterflies | Wind Chimes, Tree Decor, Garden Decoration, Gardening Gifts, Yard Art Decor, Garden Ornaments, Gardening",
    "description": "Shimmering Bells with ButterfliesIf you love butterflies, this is the wind chime for you. Transform your outdoor space with this enchanting, inspiring piece, made from verdigris butterflies and metallic, copper bells. These colors play up in just about every garden or lawn, tying together all sorts of flora, fauna and garden decor. Perfect for the porch or patio, it’s equally welcome as a unique door hanger. Like all items in Happy Gardens’ shimmering bells collection, this set has been individually handcrafted, and is designed to last years and years.Dimensions: 13” W x 21” HWeight 1.2 lbsEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and wind chimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and wind chimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "I purchased this item as a gift and it arrived very quickly and expertly packaged to avoid crushing or tangling the butterfly strands. The gentle sound of the small bells is lovely and the butterflies are rusticly painted in a vibrant color that will make a beautiful accent in the gift recipient's garden. She loved it!",
      "Oh, just lovely! It's so sweet reading happy comment from a happy customer. Thank you so much for trusting our small business ❤️",
      "It’s as beautiful as I thought it would be",
      "Absolutely beautiful. Exactly as pictured and described."
    ]
  },
  {
    "productId": "RvKcNFQpVj",
    "url": "https://www.etsy.com/listing/952918363/hummingbird-stained-glass-hummingbird?click_key=50fedcd62c9839eb9e85ee761aa31b9da9b01bbe%3A952918363&click_sum=c773fe24&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-11&pro=1&sca=1&content_source=220b7b74c65e28718262b479318b9c3f540cc47b%253A952918363",
    "title": "Hummingbird stained glass Hummingbird Floral support stake Stained glass Hummingbird window decor",
    "description": "Shiny stained glass Hummingbird Floral stake very delicate decoration for your home and garden.Price include gift&safe packaging.High 12.5\"All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me for details.Any item can be customized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Hello! I ordered this item in December to be a gift in January. Kateryna emailed me to let me know of possible delays during the holidays and at customs. When the birds arrived, they were in one piece! She packaged them so well that all I needed to do was wrap the box in gift wrap. The quality of her work is outstanding and professional. You can see she puts all her heart into its craftsmanship! Worth the wait!",
      "Lovely colorful stained glass hummingbird on a thin rod that will be stuck into one of our plant pots.  Thank you!",
      "Beautiful, realistic hummingbird.  Very well packaged and shipping was great.  It arrived in time for Christmas.  I highly recommend this shop."
    ]
  },
  {
    "productId": "jUoaiqmJff",
    "url": "https://www.etsy.com/listing/1009781332/solar-lightslanterns-riley?click_key=23ca7eeec1414d44b3ba8f547846e884e1068242%3A1009781332&click_sum=346286c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-12&pro=1&frs=1&sts=1&content_source=96da7d57b45b982d4a46db82e3c496f253173b73%253A1009781332",
    "title": "Solar Lights/Lanterns \"Riley\"",
    "description": "Add a bit of class and ambiance to any patio, backyard, deck, or venue with this unique solar powered iron cage lantern with unique Edison style LED bulb. Fully weatherproof and automatic. 100% solar powered with a large capacity 3.7V 1200mah lithium ion battery. Under ideal conditions up to 4 hours of light is provided at night based on a fully day in the sun charging. The product must be located in an area that receives direct sunlight on all solar cells during the day for best performance. An on/off switch is included.Custom color options are available for an additional $10.95.",
    "reviews": [
      "Thx x x z d",
      "This was a gift for our daughter in law, she was very pleased with the lantern.  It will look good on her porch.",
      "I didn’t see the item as it shipped directly to the recipient as a gift. It arrived quickly and she loved it!"
    ]
  },
  {
    "productId": "jzfxZzKpWe",
    "url": "https://www.etsy.com/listing/822807522/vertical-cedar-herb-small-vegetable-and?click_key=c666e2d34ac22a0ab50bc93676dac9c05170854f%3A822807522&click_sum=8af9cbaa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-13&pro=1&frs=1&etp=1&content_source=6b7db7817c756e2c2c7c8c47a29e732799be23be%253A822807522",
    "title": "Vertical CEDAR Herb, Small Vegetable and Flower Garden",
    "description": "Perfect CEDAR Raised Flower and Herb Garden is just the right size for any patio, porch, deck or rooftop space!This beauty features 100% completely natural Cedar!  We never use pine, pallet, ply, particle or pressed wood in any of our creations. If you want a quality planter capable of growing head turning flowers, healthy organic herbs, strawberries and small vegetables CHOOSE A DEMEYER WOODCRAFTS CEDAR PLANTER.Cedar, due to it's natural oils, is extremely moisture, rot and insect resistant so you can go ahead and plant directly in the boxes.   Additionally small holes are drilled in each box to allow proper drainage to keep your planter looking beautiful and growing gorgeous healthy plants.  Many of our customers have found that this is not only a great outdoor planter but it is also great for an indoor herb garden.Beware of planters priced lower. These are often made of pine. This is because a pine planter will be a  moldy rotting planter even with treatments after a season. Many are also treated with toxic chemicals.Compare our reviews to the reviews of less valuable imitations and you will see why experie, quality technique and quality materials make all the difference in the product you receive.  No one builds a better all cedar planter for the value than we do.We build in Iowa, purchase our lumber in Iowa and all of our lumber is natural American lumber.Each box in our Perfect Cedar Flower and Herb Garden is approximately 6\" high x 6\" deep across the bottom x your choice of width.Your planter ships with the boxes assembled.  The legs will require very simple assembly.  We pre- drill the holes so that you can simply attach the screws provided with a basic Phillips Screwdriver.Don't forget to add our exclusive Super Soft and Gentle CEDAR Mulch to your order to keep your new plants moist and healthy!Best of all we now partner with the National Forest Foundation to plant a tree  in a national forest with every order we receive!",
    "reviews": [
      "Item is exactly as described",
      "Superior! Very sturdy and are pure craftsmanship! \nThank you",
      "Great quality and easy to assemble!"
    ]
  },
  {
    "productId": "woolJCgDyC",
    "url": "https://www.etsy.com/listing/1526709627/meditating-yoga-dog-garden-statue?click_key=15278c20e9ba0f800c2a93ceeed396db375314cb%3A1526709627&click_sum=eb4068ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-14&pro=1&frs=1&content_source=737b0f8b8fa4db84c41bef42772700e7cbce0dbc%253A1526709627",
    "title": "Meditating Yoga Dog Garden Statue",
    "description": "Item: Yoga DogMaterial: ResinType: Garden StatueSize: 9 x 12 cm",
    "reviews": [
      "My first one arrived broken and the seller was very responsive and nice to work with.  Received my replacement today and it’s exactly as pictured! Very cute",
      "Quick response to my question and the garden chicken decorations are amazing!",
      "High quality, great accessory for your nerdy house decor. 🖖🏻"
    ]
  },
  {
    "productId": "NCwFmHTpdt",
    "url": "https://www.etsy.com/listing/1106960223/hanging-butterfly-with-bell-yard-art?click_key=06c84af162817e5393539a4496608412ce78886b%3A1106960223&click_sum=d72c490f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-15&pro=1&sts=1&content_source=0f7a2e273bfb0bb3ecf768fd4cc9f439242dce55%253A1106960223",
    "title": "Hanging Butterfly with Bell | Yard Art | Garden Decor | Gifts for Mom | Gardening | Butterfly Art | Metal Art | Patio Art | Home Decor | Art",
    "description": "Hanging Butterfly with Bell OrnamentAre butterflies strong enough to carry bells? Nope. But our Hanging Butterfly with Bell Ornament doesn’t play by the rules. Delicately handcrafted with fine details, this butterfly holds a tiny bell that will chime wherever it hangs. It's just charming and unique enough to punch up any outdoor space, without becoming a distraction.Dimensions: ﻿9.5\" w x 6\" d x 12\" hFeatures a bell and small wire hook for hangingShowcases a handcrafted butterflyTimeless, flamed metal finishEasy to hangBacked by our Happy Gardens guaranteeCAREFULLY HANDCRAFTED - Our ornaments are intricately designed and then produced using high-quality, durable materials that are perfect for the Great Outdoors.EASY TO ASSEMBLE AND CLEAN - Each of our ornaments is as frustration-free as possible. Rest assured that all assembly will be straightforward, and that you’ll be enjoying your new decor the very same day it arrives. All our ornaments can be cleaned without hassle, too.DESIGNED TO DELIGHT - Our ornaments are beautiful and unique. That means they’ll stand out not only in your garden, but also in the gardens of those you love. We work tirelessly to source products that make great gifts and are markedly different from what mainstream sellers are offering. You can rest assured every item we stock is special and will make a great gift--or make your neighbors totally jealous! �TOP-OF-THE-LINE QUALITY - We take pride in every item we sell. All of our ornaments have been individually chosen for their beauty and durability. We work with only the finest craftspeople, and often choose sturdy-but-beautiful materials like steel and stone to increase the longevity of our ornaments.NO-RISK 1 YEAR WARRANTY - Our collection of ornaments is backed by a one-year, limited replacement warranty and our top-notch customer service. If your purchase doesn’t meet your expectations, just let us know within a year. We’ll replace it, give you a refund or make it right.",
    "reviews": [
      "Absolutely beautiful I love just looking at the craftsmanship.",
      "Perfect! I am so happy to know you like it. Thank you for your business",
      "This is a gift for my mom. She will love it🩷",
      "This butterfly is beautiful! I love it so much and am excited to give it as a gift!",
      "Love the 2 butterfly’s & all wind chimes I ordered are the perfect size"
    ]
  },
  {
    "productId": "iyuIQcMmui",
    "url": "https://www.etsy.com/listing/1316682710/71-nc-28-nc-table-thanksgiving-table?click_key=1957aa4215269f28740b67bda1ed1d2869c5296c%3A1316682710&click_sum=f1f97959&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-16&pro=1&frs=1&etp=1&sts=1&content_source=00dd49116ff85a5bd44a700776fa093215122848%253A1316682710",
    "title": "71 ınc-28 ınc table ,Thanksgiving table decor, picnic table folding table, boho picnic , wood, wood table,portable table,Boho picnic table",
    "description": "wooden table, picnic table, boho large table, car picnic table, suitcase table, picnic trolley floor, car folding table, boho picnic table, folding outdoor table, wooden table, wooden coffee table, camp, dinning table, blue table, balcony table, patio table, long table.Picnic party event luxury boho chic photoshoot tablepicnic table,handmade furniture,boho picnic table,folding table,picnic table low,low picnic table,boho table,wooden picnic table,tableThanksgiving table* 180cm-70 cm table (71 ınch-28 ınch)I met etsy 1 year ago and worked for months on a custom design for me and I am proud to serve you as the first manufacturer to design and sell this type of picnic and camping tables.This table is specially produced for nature lovers and completely natural materials are used. It is a handmade product, not a fabricated production. each table is produced with hours of work.This table made of natural pine wood has been completely dried and sanded. Its legs are made of durable hornbeam wood. In case the center of the table collapses over time, the middle leg has been added.All cargoes are made by express and are delivered to all over the world within a maximum of 7 days. In order not to be damaged in the cargo, packaging is made with special production materials all over the table.I can do custom production. All you have to do is contact me. I can produce any size you want.As bigwoodworkers, you can rest assured that as the first manufacturer and seller of these tables, I will do my best to provide you with quality service.*****If you want to print a brand or name, please share your name or brand with us in the message section.******This product is completely handmade and very durable.*Each package is carefully wrapped to ensure safe delivery,Boho picnic table,boho beach picnic table***If you want to make special production, please contact****** the table is brown* Europe: 3-5 days;* USA & Canada: 3-7 days;* Australia & everywhere else: 3-9 days***Damaged products are covered by our warranty",
    "reviews": [
      "I so love 💕 this item I’m glad I made the purchase",
      "Beautiful tables, although upon opening the latch broke off."
    ]
  },
  {
    "productId": "vlGFmdBtEC",
    "url": "https://www.etsy.com/listing/1683152522/waterproof-william-morris-chrysanthemum?click_key=77ed1d575756e5e1cd738098d7a9c4a15e5ac251%3A1683152522&click_sum=b8298504&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-9&pro=1&frs=1&sts=1",
    "title": "Waterproof William Morris \"Chrysanthemum\" Toile Pillow - Victorian Toile Vintage Floral Outdoor Pillow -William Morris Yellow Toile Cushion",
    "description": "❤ William Morris \"Brer Rabbit\"  vintage pattern cushions are the perfect addition to your garden, outdoor or indoor space for a cozy and stylish look - it’s a wonderful way to personalize your space and can really lift a space from ordinary to spectacular. Easily bring traditional patterns into your garden or purchase it as a gift for a special friend or family member.❤Browse for more unique nature pillows and pillow-cover designs in our shop:https://www.etsy.com/shop/CoolDesignGiftsStore?ref=seller-platform-mcnav&search_query=pillow❤DESCRIPTION❤❤100% Spun Polyester Canva-made from specially spun polyester threads, these pillows retain their shape and don't wrinkle. No need for ironing❤100% Polyester pillow included-these outdoor pillows are very comfortable due to the sturdy pillow filling❤UV ray-resistant, water & mildew-resistant-these pillows are UV ray and water-resistant, allowing them to stay vibrant in any outdoor setting❤Double sided print❤Sewn seam closure❤Comes in 4 sizes-16x16, 18x18, 20x20, 20x14 inches❤Made in USPlease reach out to us if you have any questions/concerns about anything!Thank you for choosing CoolDesignGiftsStore!",
    "reviews": [
      "the item is great quality",
      "Very good quality. Thank you.",
      "It’s beautiful and I love it"
    ]
  },
  {
    "productId": "ehcMyJzdFZ",
    "url": "https://www.etsy.com/listing/822807522/vertical-cedar-herb-small-vegetable-and?click_key=3d8fb25bd9f7a2a997d4d115ffb8cecece64ccd0%3A822807522&click_sum=45cf5403&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-10&pro=1&frs=1&etp=1",
    "title": "Vertical CEDAR Herb, Small Vegetable and Flower Garden",
    "description": "Perfect CEDAR Raised Flower and Herb Garden is just the right size for any patio, porch, deck or rooftop space!This beauty features 100% completely natural Cedar!  We never use pine, pallet, ply, particle or pressed wood in any of our creations. If you want a quality planter capable of growing head turning flowers, healthy organic herbs, strawberries and small vegetables CHOOSE A DEMEYER WOODCRAFTS CEDAR PLANTER.Cedar, due to it's natural oils, is extremely moisture, rot and insect resistant so you can go ahead and plant directly in the boxes.   Additionally small holes are drilled in each box to allow proper drainage to keep your planter looking beautiful and growing gorgeous healthy plants.  Many of our customers have found that this is not only a great outdoor planter but it is also great for an indoor herb garden.Beware of planters priced lower. These are often made of pine. This is because a pine planter will be a  moldy rotting planter even with treatments after a season. Many are also treated with toxic chemicals.Compare our reviews to the reviews of less valuable imitations and you will see why experie, quality technique and quality materials make all the difference in the product you receive.  No one builds a better all cedar planter for the value than we do.We build in Iowa, purchase our lumber in Iowa and all of our lumber is natural American lumber.Each box in our Perfect Cedar Flower and Herb Garden is approximately 6\" high x 6\" deep across the bottom x your choice of width.Your planter ships with the boxes assembled.  The legs will require very simple assembly.  We pre- drill the holes so that you can simply attach the screws provided with a basic Phillips Screwdriver.Don't forget to add our exclusive Super Soft and Gentle CEDAR Mulch to your order to keep your new plants moist and healthy!Best of all we now partner with the National Forest Foundation to plant a tree  in a national forest with every order we receive!",
    "reviews": [
      "Item is exactly as described",
      "Superior! Very sturdy and are pure craftsmanship! \nThank you",
      "Great quality and easy to assemble!"
    ]
  },
  {
    "productId": "bezfkYRGFJ",
    "url": "https://www.etsy.com/listing/1349271297/aphrodite-statue-graffiti-art-original?click_key=977914c92e2abcae52e604890891dce2cdafbf09%3A1349271297&click_sum=ef45f0f6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-11&pro=1&frs=1&cns=1",
    "title": "Aphrodite Statue Graffiti Art Original Street Art Sculpture Home Decor",
    "description": "Aphrodite Statue Graffiti Art Original Street Art Sculpture Home DecorI create each design using mixed materials in order to deliver unique art pieces! Explore my store to check on other beautiful handmade designs!Material: Cast AlabasterAlabaster is a natural stone very similar to marble, it's a really solid material that ensures endurance!All statues are molded and then finished by hand.Measures 20 inches tall (50cm), 12 inches wide, 8inches deep and Weights 29lbs (13.5Kg)<YOU CAN MESSAGE ME TO CREATE A CUSTOM DESIGN FOR YOU!Shipping: I ship using registered airmail (in most cases express delivery via courier at no extra cost). You will receive a tracking number and updates on the estimated delivery!+++Express Delivery!+++ Professional packaging!+++ Gift Wrapping upon request!+++ Replacement in case of damage!",
    "reviews": [
      "She's beautiful!  In my home office I like surround myself with what I find visually pleasing.  This sculpture is a wonderful addition.  Communication with the seller was great as the first piece arrived broken.  Response time was prompt, and I received a replacement without issue.",
      "AWESOME product! Item arrived in perfect condition one month after order was placed...well worth the wait!",
      "Very happy with purchase! Fast shipping! Highly recommend this seller!"
    ]
  },
  {
    "productId": "ZMAXlNOhEP",
    "url": "https://www.etsy.com/listing/597947272/metal-flowers-metal-garden-art-sculpture?click_key=50a2c0e3f8c0683838adb6f26314671f01c54ab4%3A597947272&click_sum=39c7b4ce&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Metal Flowers, Metal Garden Art Sculpture, Set Of 9 Garden Stakes, Dandelion, Flower Pods, Garden Set",
    "description": "Metal Garden Art GroupingThis Art Piece Consists Of 9 Individual Stakes That Can Be Bent & Twisted Into A Desired Grouping. Even The The Stakes Are Able To Be Bent.Perfect To Fill Out An Area Thats Hard To Grow Or Add A Delightful Contrast.Create Your Own Personal Presence In A Simple And Stylish Way.Stakes Measure 18 inches long and ball grouping on top measures about 4x4 inches.****Long stakes are 28 to 36\" and are available only at limited times",
    "reviews": [
      "The metal flowers have a unique look that adds a lot of interest to my planters.",
      "I bought this item for a friend and she loved them.",
      "They’re so cute and will look great in the garden. The shipping was so quick too!",
      "I love these rustic flowers.  The quality is A+ and they arrived in less than a week.  The flowers were well packaged and I so appreciated a gifted heart as a thank you.  I love hearts by the way so thank you again!"
    ]
  },
  {
    "productId": "PMtQRkMHQN",
    "url": "https://www.etsy.com/listing/1006715034/rusty-metal-wren-steel-wren-decoration?click_key=26c6c1767541c21c08ebc54bbe0119e60a56ebf7%3A1006715034&click_sum=643fd209&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-17&pro=1&frs=1&etp=1&content_source=75770a16455a17b957354dbe0539366bec85f3a7%253A1006715034",
    "title": "Rusty Metal Wren - Steel Wren Decoration - Jenny Wren - Rusty Bird - Wild Bird Art - Woodland Creatures  - Garden Decor",
    "description": "Wren garden or home decoration. Part of our tiny bird collection.  Would look great on a tree, fireplace, window frame or anywhere else the little fella can be mounted.Includes bracket with fixing hole.Precision cut from thick steel and then rusted using our unique all natural formula.  The item you receive will be pre-rusted and ready to admire in your home or garden.The Wren is around 7.6cm high (3 inches)We use high quality thick steel to last many years.Shipped worldwide, current shipping times are displayed.  Express shipping upgrades available.",
    "reviews": [
      "Great item, arrived on time.  Would buy again from this shop.",
      "Love this it looks great on my planter.",
      "Love the birds. Smooth delivery. All good. Thanks"
    ]
  },
  {
    "productId": "YWLytZasgf",
    "url": "https://www.etsy.com/listing/682825220/ships-in-2-days-metal-hummingbird-and?click_key=cdd694fc47c0acf0c16ab211a449a79240f5540a%3A682825220&click_sum=bd5c6777&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-18&pro=1&frs=1&sts=1&content_source=c9ac62553469ed9967f1fec049b48b9936399335%253A682825220",
    "title": "Ships in 2 Days | Metal Hummingbird and Flower Garden Stake - Steel Gardening Decor - Bird Yard Art Marker - Metal Lawn Decor - Garden Art",
    "description": "*2 DAY SHIP ONLY APPLIES TO RAW STEEL FINISH, THIS REFLECTS OUR PROCESSING TIME FROM ORDER DATE TO SHIPMENT DATE NOT TOTAL TIME TO ARRIVE AT YOUR DOOR.  PLEASE ALLOW AN ADDITIONAL 3 DAYS FOR POWDER COAT FINISHES.Let this metal garden stake add some rustic charm to your outdoor space. This steel hummingbird and flower yard art is perfect for your garden, yard, or patio. This bird marker is a great way to add some beauty to your garden decor!ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding images, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 10\" wide x 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.-Finish OptionsRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "Arrived quickly and its well-made!!! Will fit nicely in our garden.",
      "The outdoor red gloss metal Hummingbird and flower garden stake is so beautiful! Excellent quality. I can’t wait for hummingbird season. Will definitely order from this business again. Thank you!",
      "My Mom loved it for her birthday",
      "I purchased this as a gift for my friends' garden.  It arrived quickly.  They love it!"
    ]
  },
  {
    "productId": "wFanQzYqHm",
    "url": "https://www.etsy.com/listing/1201376855/dragonfly-solar-wind-chime-garden-decor?click_key=305b62957f51b54daa8b14117e30243bd8e835d9%3A1201376855&click_sum=4e43133d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-19&pro=1&content_source=cd0ee6039b105b47a03df2aca6dc362604d8131c%253A1201376855",
    "title": "Dragonfly Solar Wind Chime, Garden Decor, Porch Decor, Patio Decor, Solar Lights Outdoor, Yard Light, Yard Decor",
    "description": "This dragonfly solar wind chime is perfect for garden decor, porch decor, patio decor, solar lights outdoor, yard lights, yard decor, party lights, party supplies, party decor and more! Hang from fences, pergolas, porch, and patio.Perfect for gifting! Mother's Day, birthdays, housewarming, Christmas, and more!Waterproof. ABS plastic.RGB changing color.Solar panel 2V/120MA.Includes rechargeable 600mAh Ni-MH battery.6 LED colorful variable lamp beads.",
    "reviews": [
      "Beautiful item. Colors are vibrant.",
      "Excellent beautiful bought for a Christmas present",
      "Love it. And fast delivery. Thank you.",
      "They are very cute, but I only give 3 Stars since they arrive with 2 broken winds. The box didn't have any damage, but the Item.",
      "I am very sorry to hear that the item came damaged and I do apologize. I would have offered a refund or replacement right at the time of the delivery if you would have gotten in touch with me. Even still, I am more than happy to offer that now. Please send me an email or message through Etsy and let me know which you would prefer. Thank you!"
    ]
  },
  {
    "productId": "RkytvBUOlT",
    "url": "https://www.etsy.com/listing/968890954/hummingbirds-and-bells-rain-chain-gifts?click_key=346ae5694f2d7eb78ed2ffc97da07a7fd59999a6%3A968890954&click_sum=76078116&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-20&pro=1&sts=1&content_source=6873a6972a06e31b3a960c0bb20aa13aa3d57665%253A968890954",
    "title": "Hummingbirds and Bells Rain Chain | Gifts for Mom | Garden Decor | Yard Art | Patio Decor | Rain Chains | Metal Art | Gardening Gifts | Art",
    "description": "Hummingbirds and Bells Rain ChainCelebrate beautiful garden visitors while treating your home, garage, or garden shed to a wonderful accent. Our Flamed Hummingbirds and Bells Rain Chain features sculpted hummingbirds atop slender branches. Bells hang from circular frames, adding a lovely chiming sound whenever breezes blow.With a flamed finish, this piece offers warm, glowing colors that look different in every light. Like all décor from our Happy Gardens collection, this rain chain has been individually handcrafted, and will bring lasting beauty to your landscape.Flamed metal finishDimensions: 4.5” W x 98” HALWAYS HANDCRAFTED - Our rain chains are expertly crafted by hand, and it really shows. You’ll notice intricate details on your rain chain you just don’t encounter everyday.EASY TO INSTALL AND CARE FOR - Your rain chain will come with simple, easy-to-understand assembly instructions. We want you to enjoy your purchase the very same day it arrives! Plus, caring for your rain chain is a breeze and will ensure it lasts for years to come.UNIQUE AND COMPELLING - Like all our products, this rain chain was expertly selected by our Happy Gardens team. Why? Because it’s beautiful, functional and special!BUILT TO LAST - As always, we’ve diligently ensured that this beautiful rain chain is more than just easy on the eyes! The artisans who crafted this piece have chosen top-quality, durable materials so this rain chain can weather storm after storm.BACKED BY A NO-STRESS WARRANTY - We offer a one-year, limited replacement warranty on our rain chains. If you are unhappy with your purchase for any reason, simply call or chat with us and we will help make it right.",
    "reviews": [
      "I ordered it for my mom's birthday, she will love it!",
      "Mom loves it.  Less expensive than what some shops around here are selling it for.",
      "We are happy to know you move loves it. :) This is one of the reasons why we strive to make beautiful products. Thanks for your feedback, Natalie!",
      "Really beautiful and well made"
    ]
  },
  {
    "productId": "yIiYzYZqfp",
    "url": "https://www.etsy.com/listing/1663735851/set-of-2-ceramic-koi-fish-yard-art-decor?click_key=723c3fe2d1185dc4510d1b1634b17403a6e3e517%3A1663735851&click_sum=9ff8d19b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-21&pro=1&frs=1&content_source=d09e560727c8b5f9c8183c2405818c616e273a3a%253A1663735851",
    "title": "Set of 2 Ceramic Koi Fish Yard Art Decor Garden Sculptures and Statues Garden Fish Art for Outdoors Patio Lawn Pond Home Decoration",
    "description": "The fish sculpture has elegant and attractive design and colors for wonderful visual enjoyment. Waterproof paint, not afraid of the wind, sun and rain, and can be used outdoors for a long time, adding a marine atmosphere to your home or garden.The garden decor koi fish is made of resin,size: 10.6x5.5x4 inch,Comes with iron rods for easy insertion where you want it.The fish garden sculptures & statues easy in use: This garden art ornament needs no tool,there are 2 screw holes at the bottom, which are very solid, can be placed anywhere you want.The koi fish decor garden sculptures & statues can make your garden come alive as the prettiest decoration on your garden corner lawn. At the same time, these fish sculptures can also be used as interior decoration, placed on desks, windowsills, wine cabinets, game rooms, etc., to perfectly embellish your home environment.",
    "reviews": [
      "Item arrived 2 days ahead of schedule.\nThe Koi are painted ceramic suggesting more expensive copper ones. They are delightful. I know this sounds strange but they seem to have a bit of personality. I’ve had koi and goldfish in my pond for over 10 years. It is too early to put them outside so no photo.",
      "Item shipped fast very happy",
      "Love these octopus legs. I was so excited to put them in my plant."
    ]
  },
  {
    "productId": "tjRcmpTmRy",
    "url": "https://www.etsy.com/listing/673460249/metal-hand-painted-house-wren-on?click_key=bed3446b7ade339d88aa61e9474cc886f9cd22bc%3A673460249&click_sum=6876dbb4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-22&pro=1&content_source=f6d1d229865d51cf7deb88a3c8fd98f1b404d088%253A673460249",
    "title": "Metal Hand Painted House Wren on Rhododendron Garden Art | Wren Silhouette | Rhododendron Flower | Rusted Yard Art | Garden Gifts | B781P",
    "description": "Please Note that the Birch Stump is not included in the purchase of The House Wren on Rhododendron.The Metal Hand Painted House Wren on Rhododendron Garden Art is a delightful decoration for your garden. It features a beautiful little house wren, crafted from metal and hand-painted with vibrant colors, perched on a lovely rhododendron branch. This garden art adds a touch of nature's charm to any outdoor space.Great news! The price for this charming piece of art has been lowered, making it more affordable than ever before. Now, you can bring the beauty of a house wren and rhododendron into your garden without breaking the bank. It's the perfect addition to create a welcoming and enchanting atmosphere in your backyard. Don't miss this opportunity to enhance your garden with this adorable hand-painted Metal House Wren on Rhododendron Garden Art at the new low price.Dimensions: approximately 7\" tall x 5\" wide",
    "reviews": [
      "I love this bird and the purple flowers are lovely. I actually bought one as a gift and decided I wanted one for myself!",
      "This bird is wonderful and the painted flowers are a beautiful touch!",
      "I am a repeat customer, who loves Rusty Birds designs!"
    ]
  },
  {
    "productId": "ovZVIvns4y",
    "url": "https://www.etsy.com/listing/965723163/stained-glass-yard-garden-art-stained?click_key=e2b07cbbb55603f12c91607c1ed06748c9eff78a%3A965723163&click_sum=a5f15c04&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-23&pro=1&frs=1&content_source=2aa5e865ee2c253fb1f532c63226943ecc1dbdd6%253A965723163",
    "title": "Stained glass yard, garden art, stained glass & copper garden stakes Rainbow Free shipping",
    "description": "This is a stock Color there can be no changes in colors.I have a listing for custom colors please go there to order a custom color oneAttention colors may not match exactly. Stained glass sheets will vary in color.This is our Rainbow colors.This is real stained glass like the glass that has been used in stained glass windows for 100’s of years.Each circle is wrapped in real lead came and the frame is real 1/2 copper tubing and soldered together.Large frame is 9in x 34inSmall frame is 6in x 32inFree Shipping on any of them.We will also do custom colors in any colors you like.My unique mounting system of 2-  steel stakes that you pound into the ground and slide the copper frame.   over them it will insures they will withstand it wind. outdoorsThey have a copper frame to protect the glass and give it a look of elegance.",
    "reviews": [
      "Highly recommend seller - beautiful work, fast shipping and very well packed.",
      "Stained Glass Yard Art gift? 5 stars! Recipient loved the stunning colors & craftsmanship. Transformed their yard into a sun-kissed wonderland. Thoughtful, unique, and keeps on giving joy. Highly recommend!",
      "This is a Christmas gift, so I haven’t seen it yet.",
      "We’ll made & beautiful. Item exactly as pictured and described. Arrived quickly and in perfect condition"
    ]
  },
  {
    "productId": "gGenLIKnnF",
    "url": "https://www.etsy.com/listing/1471495496/butterfly-garden-column-garden-decor?click_key=6710d9d06eb3c87432dac29ae0b03744df6b189c%3A1471495496&click_sum=4190f0bc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-24&pro=1&frs=1&sts=1&content_source=8458a4c8ef4572ae14cad0f136f067bdef42adcc%253A1471495496",
    "title": "Butterfly Garden Column - Garden Decor - Garden Statue - Well Cover - Landscape Light Cover - Utility Cover",
    "description": "Garden columns are a great way to visually contrast your garden, flower bed, or deck. This Butterfly garden design is cut on all four sides so it looks great from anywhere in your yard. Each Side has a unique scene that looks as though the butterflies are flying upward as you walk around the entire column. Each column is welded by hand and pre-rusted so it will blend in with your landscape as soon as you place it in your space. They work great as a stand-alone monolith or combine 2 or more for extra texture. They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DGarden Column TOP:https://www.etsy.com/listing/1497954166/garden-column-lid-succulent-planter-box?click_key=ef8651495b30767d5b75cc49002b3c56c933dd8e%3A1497954166&click_sum=35cd154c&ga_search_query=lid&ref=shop_items_search_1&frs=1&sts=1***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture, and finish all of our work from a small shop in Tennessee. Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum, and glass combined. 88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.HARDWARE INCLUDED - Our work comes ready to mount with predrilled holes and 4 x 6\" long garden stakes to stabilize each column.SOLID STEEL CONSTRUCTION - Our garden columns are made from 16 ga mild steel, about the thickness of a dime. Designed to last many years without maintenance inside or out.",
    "reviews": [
      "Wonderful column.  Can't wait to add it to my garden.  Ordered some solar lights to go into it\n Highly recommend and would buy again.",
      "This was so much better than expected.  Very high quality. Heavy duty.  Beautiful. Can’t wait to put it in my yard.",
      "the columns are an great addition to the yard everything about columns as advertised with fast safe delivery"
    ]
  },
  {
    "productId": "MiMKxjVtje",
    "url": "https://www.etsy.com/listing/1386823695/oriental-mother-of-pearl-planter-box?click_key=b38351936ff6df57deed6fa5d90394aa50099fb3%3A1386823695&click_sum=38156ac1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-13&pro=1&frs=1",
    "title": "Oriental Mother of Pearl Planter Box / Trash Can",
    "description": "This Oriental lacquer planter box is hand made with rich Chinese black lacquer and inlaid with mother of pearl geisha ladies. A Chinese palace scene is hand painted on two sides with hand detailed brass hardware on the other two sides. Use as a wastepaper basket, a flower pot makes or as a wonderful décor statement in your home. Made with solid wood, no assembly required. Three pieces in total: stand, base and removable steel planter liner. Purchase now, supplies are limited on our quality handmade imports.* 3 piece set: box, galvanized steel planter liner & stand* Dimensions in inches: 12\" W x 12\" D x 18\" H* Black lacquer with mother of pearl geisha ladies",
    "reviews": [
      "well made but smaller than advertised",
      "The item met my expectations.",
      "great base for my vase, fits perfect!",
      "Very nice lamps. Shades are also okay."
    ]
  },
  {
    "productId": "kqXnUtAeHo",
    "url": "https://www.etsy.com/listing/1576995418/amazing-mosaic-table-handmade-round?click_key=234ef7e64ba7d836f3365f9dc86bf74250840c05%3A1576995418&click_sum=58c1afd6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-14&pro=1&frs=1&sts=1",
    "title": "AMAZING MOSAIC TABLE, Handmade Round Green Table, Traditional Custom Made Flower Design,  Luxurious Outdoor Patio Furniture For Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric design in diffrent colors. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades, creating a warm and inviting look.The mosaic pattern on the table consists of a variety of colors, including vibrant blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.CONTACT US FOR MORE CUSTOM MADE ORDERS , WE ARE OPEN TO NEW DESIGNS !GET YOUR IRON CHAIRS FOR YOUR TABLE USING THIS LINK :https://www.etsy.com/listing/1502709918/set-of-moroccan-iron-chairs-handmade",
    "reviews": [
      "Love my jade green table!! Excellent communication with Muhammad and the table was made and dispatched very quickly. Looking forward to eating a beautiful middle eastern feast at this table!🥰",
      "This table is beautiful and perfect. Thank you so much. Would not hesitate to buy from you again.",
      "I'm extremely satisfied. Seller contacted us immediately. Package came super quickly. The goods were very well packaged. Top seller. Big business, congratulations. THX and peace"
    ]
  },
  {
    "productId": "xi26wAkZgt",
    "url": "https://www.etsy.com/listing/1254518059/black-balcony-table-space-saver-balcony?click_key=6d2996187e3f24de3a3388fe62d2802e67f33297%3A1254518059&click_sum=cde6fd13&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Black Balcony Table Space Saver, Balcony Bar Table for Railing, Wooden Patio Bar table, Folding Table for Terrace, Custom Folding Table",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.FREE & EXPRESS SHIPPINGFREE shipping (USA) & EXPRESS Shipping worldwide.FAST DELIVERYI am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Any questions please message me.",
    "reviews": [
      "Seller was so prompt and the quality was exceptional!",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony bar table great quality. Your satisfaction means the world to us. Enjoy your new table!",
      "Omer was very helpful and the bar table very quickly and as described. Will recommend to anyone that wants to install a bar on their balcony or terrace.",
      "Thank you so much for your lovely feedback and beautiful black balcony bar table photo! We're thrilled to hear that you find balcony railing deck table as described. Your satisfaction means the world to us. Enjoy your new terrace table! It looks amazing.",
      "Customer service was amazing. Love the product. I can’t speak highly enough about the customer service. Really refreshing and easy. Thank you for such a great product!",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony railing table quite beautiful. Your satisfaction means the world to us. Enjoy your new spacesaver table!"
    ]
  },
  {
    "productId": "kWvuNuJRCK",
    "url": "https://www.etsy.com/listing/1525151266/large-antique-wooden-stand-norwegian?click_key=313d8bd5859762d6880e3f86280dbbe7ca995210%3A1525151266&click_sum=538457a8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456642-3-16&pro=1&frs=1&sts=1",
    "title": "Large Antique wooden stand - Norwegian primitive cheese making bentwood bucket",
    "description": "Stunning cheese making bucket from the 1800s.This bowl with three legs has a fantastic pataina and wear, with its beautiful and rare blue color.This one has been given new ribbons around once upon a time, as shown in the pictures, one ribbon is cracked, but it gives this rare object charm and history.This was used in cheese production in the 1800s.If you collect Norwegian and Nordic folk art or want a one of a kind center piece, then this is something to consider.Great as a special Christmas gift for someone you love or for yourself.Dimension:43 cm wide / 16.92 inches wide.47 cm high / 18.50 inches high.If you have questions about the product, feel free to contact us.Price includes, cheese bucket as well as shipping costs.******************************We pack all goods carefully, so that the goods arrive whole and neat.We hope and see your order.If you have further questions, do not hesitate to get in touch.Hope to see you again.We also have an etsy store that are dedicated to art, wall art and hand made Norwegian art.You find this store by clicking on the link below:https://www.etsy.com/no-en/shop/Estatefinds2023Havea good day.",
    "reviews": [
      "It came in a very lovely, strong box. It was as pictured. It was packed beautifully, and everything was very safe and secure. I will definitely buy again. Shipping to the USA by regular mail is slow, but Federal Express and DHL are very expensive. I wish I were closer so shipping costs, etc., were lower, but I am happy anyway!",
      "It came in a very lovely, strong box. It was as pictured. It was packed beautifully, and everything was very safe and secure. I will definitely buy from this dealer again. I wish I were closer so shipping costs, etc., were lower, but I am happy anyway!",
      "Beautiful old knitting set. I recommend this amazing shop"
    ]
  },
  {
    "productId": "wuVycugXIO",
    "url": "https://www.etsy.com/listing/1179796748/metal-standing-rabbit-yard-art-with?click_key=6d5a00f5731192adee27dc490fb1c77bda524072%3A1179796748&click_sum=11f874ee&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-25&pro=1&content_source=cb6a22f5f0730b36d151fe63a1da9886f5c3c5f5%253A1179796748",
    "title": "Metal Standing Rabbit Yard Art with Stake- Steel Bunnies- Metal Art- Garden Stake-Metal Yard Art-  Staked Rabbit-Easter Spring Decor",
    "description": "* Note: Our bunny  and other artwork is being copied by other sellers. Our artwork is hand drawn original artwork by myself made on the computer and then cut with CNC plasma machine. If you see artwork that looks just like ours, they are infringing on our copyrights.•Made from heavy-duty 16 gauge hot rolled steel and cut with CNC plasma•8 inches wide by 14 inches tall.It has two stakes at the bottom and they are both 3 inches long.*Available in Multiple Powder Coat Finishes*-Stone Satin Black-Soft Satin White-Porsche Silver-Grey/Black Vein-Alvord Beige-Oil Rubbed Bronze-US Penny Vein-Black Copper Vein-Burnt Copper-Ironstone Copper-Canyon Copper II-Gold Bar Gold•All of our powder coat finishes can withstand the toughest conditions and are UV resistant.*Also available in Bare Metal*-The item will arrive bare metal with no sealant or finish. This will allow the metal to slowly rust into a beautiful patina over time.Our artwork is built to last and can be used indoor or outdoor.Easy to install. Just slide the stakes into the ground and it is good to go!A cute decoration for Easter, bunny garden, or great for in the landscaping year round!We are a local business out of Sparta, TN. We appreciate you for supporting small business owners!",
    "reviews": [
      "I love my purchase. It looks so cute in my yard",
      "Seller very helpful. Great quality.",
      "Adorable bunny.  I love it.",
      "Really cute and fast ship too. Many thanks"
    ]
  },
  {
    "productId": "eHiRgGKwbQ",
    "url": "https://www.etsy.com/listing/1555083010/housewarming-gift-for-backyard-lovers?click_key=724950d0bb1fba1e82038960e7d3fc25fe11d6b9%3A1555083010&click_sum=9f130ce4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-26&pro=1&frs=1&sts=1&content_source=4f5689c17bc03ad3da7305d347dc4e489600fc5a%253A1555083010",
    "title": "Housewarming Gift for Backyard Lovers || Beach Camping || Folding Outdoor || Beer Table || FREE ENGRAVING **Free Shipping**",
    "description": "Let this table be the first thing you grab when you head out to the beach, backyard, or outdoor concert. The table conveniently folds for storage and is easily set up by putting the metal locking pin into place. The fiberglass rod is durable and makes staking into the dirt, sand, or grass a breeze (you can even put it into a planter on your deck or balcony). The top has space for two beer bottles, pint glasses, solo cups, soda cans, bottle of water, etc., and plate of your favorite snacks. Table comes equipped with a bottle opener, so you'll never have to remember to bring one again. One of the two carrying handles doubles as a handy phone holder to keep your phone safe and in sight -- a great feature for the beach to keep pesky sand off your device. There's also a purse hook on the leg to keep your bag upright and out of the dirt.We built this for our love of the outdoors and a need to enjoy our draft beer from a glass at our small town brewery. Our mesh camping chair cup holders results in many lost ounces of hoppy goodness.  Elevate your outdoor adventure whether it is a day at the beach, an outdoor festival, or on vacation in the mountains enjoying an epic sunset! If you love beer and the outdoors, you need this. A great gift for any beer lover!Features:Lightweight designBottle openerCup holder is 3.25” diameter- Holds 2 beer bottles, pint glasses, solo cups, soda cans, bottle of water, spiked seltzer, etc.Space for snacks or small platePhone slot -- great for sitting in Adirondack chairs or keeping your phone out of the sand at the beach.Purse/bag hook to keep bags off the groundFiberglass rod that will not rust2 carrying handlesCollapsible for easy storageFor the wine lovers:https://www.etsy.com/listing/977249645/portable-wine-table-backyard?ref=shop_home_active_1&frs=1*** HOW TO ORDER ***1. Select the stain color of the wood.2. Select engraving option. Options are as follows:- No Engraving- Custom Name/Phrase: In the personalization section , please include the text you would like on your table. To separate text onto a different lines, use a backslash (/). (Example: Williams/Est. 2019) Names will have larger text on top line and small text on bottom line. Phrases will have text all same size. See images for example.- Initials: Up to 3 characters. Each one will be separated by a line (|). See images for example.- Preset Phrases: \"I'll Clink to That!\", \"If you can read this, sit down and have a beer\", \"Let the good times flow\"Have a brewery or restaurant or want to give as a corporate gift? Please contact me to discuss engraving your logo and bulk purchasing.Dimensions(does not include stake): 22\"h x 12\"w x 11\"dFolded Dimensions(does not include stake): 27\"h x 12\"w x 4\"dThe table comes packed flat and is simply joined together with one bolt. Finished with a food grade waterproof finish to protect the wood.",
    "reviews": [
      "Awesome and great work love 💕 it",
      "Thank you for your review!",
      "Ordered this as a gift.  The recipients love it!  Thank you!",
      "Thank you for your review!",
      "Appreciated the craftsmanship. Nice work!!",
      "Thank you for your business and review"
    ]
  },
  {
    "productId": "gIP3FaFQdr",
    "url": "https://www.etsy.com/listing/1649766524/worn-elegance-85-h-distressed-red-solid?click_key=db23d7fdaaca09d79b91695007863a7ab31cac69%3A1649766524&click_sum=693be8cc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-27&pro=1&frs=1&content_source=3bd6222d47355fc558a37906ef2537382cb51d26%253A1649766524",
    "title": "Worn Elegance 8.5\" H Distressed Red Solid Wood Birdhouse | Hanging Garden Bird House for Outdoor Delight",
    "description": "Worn Elegance 8.5\" H Distressed Red Solid Wood Birdhouse | Hanging Garden Bird House for Outdoor DelightNATURAL and HANDMADE - The birdhouse is constructed of natural wood and metal,eco-friendly and safe. The wooden planks for house body are chipped and painted by hand. The metal pieces strengthen the roof part for the birdhouse, make it very sturdy and durable, and prevent the birdhouse from being damaged from rain, wind, dropping or attacking by other animals.VINTAGE and ELEGANT - The birdhouse is made to be rustic and distressed in order to fit the outdoor garden environment, but is suitable as a great indoor decoration as well. Also it's absolutely appropriate as a gift for your friend who is interested in birds or gardening.DRESS and FEED - With this 6.5\"L x4.25\"W x8.5\"H birdhouse, you are not only dressing your garden but also offering your feathered friends a cozy home. We offer you 100% satisfaction guarantee for the birdhouse to avoid birds living in defective nest. Your bird friends get house warranty in our store. If displayed outdoors, please protect this hanging sign from inclement weather.EASY to INSTALL and CLEAN - Top of the birdhouse has a ring for hanging. To hang the birdhouse, simply attach the ring hole to a desired location (tree, house, banner, etc.) with rope or hook. If you choose to use this as a functional birdhouse, it should be cleaned out once per season to make room for the next house guest. To simplify cleaning, the back panel opens with a concealed door. No tools required and clean up is a breeze.WONDERFUL DESIGN - This vintage tone hand-crafted distressed solid wood birdhouse featured with natural wood slatted roof will add sense of beauty and fun to any of your garden, backyard or patio, and offer a safe and sweet home for your lovely feathered friends.",
    "reviews": [
      "They are very nice and well made",
      "It’s perfect for my vintage yard decor vibe!",
      "I got this for a birthday gift for my friend in another state. She loves birds and loved the gift!"
    ]
  },
  {
    "productId": "vBgeFdFlpi",
    "url": "https://www.etsy.com/listing/1093024188/hanging-sun-moon-and-stars-ornament-yard?click_key=75f4a57dd54eb16a5e850706968076d28041d727%3A1093024188&click_sum=1dbae19c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-28&pro=1&sts=1&content_source=33c75c912284456e1a0a1c09deea02e59b35dbdf%253A1093024188",
    "title": "Hanging Sun, Moon, and Stars Ornament | Yard Art | Garden Decor | Gifts for Mom | Gardening | Gardening Gift | Metal Art | Patio Art | Decor",
    "description": "Hanging Sun, Moon, and Stars OrnamentBring the stars closer to your backyard with our Hanging Sun, Moon, and Stars Ornament. Starting with the moon at its center, this handcrafted piece continues outward with sun rays, extending into uniquely detailed stars. With a metal flame finish and easy-to-hang chain, you’ll want to put this ornament where everyone can see!Dimensions: 18\" w x 1\" d x 22\" hShowcases handcrafted sun, moon and starsTimeless, flamed metal finishEasy to hangBacked by our Happy Gardens guaranteeCAREFULLY HANDCRAFTED - Our ornaments are intricately designed and then produced using high-quality, durable materials that are perfect for the Great Outdoors.EASY TO ASSEMBLE AND CLEAN - Each of our ornaments is as frustration-free as possible. Rest assured that all assembly will be straightforward, and that you’ll be enjoying your new decor the very same day it arrives. All our ornaments can be cleaned without hassle, too.DESIGNED TO DELIGHT - Our ornaments are beautiful and unique. That means they’ll stand out not only in your garden, but also in the gardens of those you love. We work tirelessly to source products that make great gifts and are markedly different from what mainstream sellers are offering. You can rest assured every item we stock is special and will make a great gift--or make your neighbors totally jealous! �TOP-OF-THE-LINE QUALITY - We take pride in every item we sell. All of our ornaments have been individually chosen for their beauty and durability. We work with only the finest craftspeople, and often choose sturdy-but-beautiful materials like steel and stone to increase the longevity of our ornaments.NO-RISK 1 YEAR WARRANTY - Our collection of ornaments is backed by a one-year, limited replacement warranty and our top-notch customer service. If your purchase doesn’t meet your expectations, just let us know within a year. We’ll replace it, give you a refund or make it right.",
    "reviews": [
      "Very nice sun that is soon to be hanging in my garden!!",
      "Glad you like it, Claire. Thank you so much for your business ❤️",
      "This purchase exceeded my expectations.",
      "Thank you for your review, Marquessa. We are happy knowing you like the product. We value your business!",
      "Looks lovely in my yard",
      "Awesome! Glad you like it, Victoria 💚"
    ]
  },
  {
    "productId": "LsElfSs61k",
    "url": "https://www.etsy.com/listing/1521161735/garden-column-lid-succulent-planter-box?click_key=6e6342b4daf09f952e833058259084fadf438af8%3A1521161735&click_sum=b4eb80c9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-29&pro=1&frs=1&bes=1&sts=1&content_source=5b28ca6fdee2e21f108c3babe9226032c6711006%253A1521161735",
    "title": "Garden Column Lid - Succulent Planter Box - Garden Decor - Bonsai - Handmade Gift - Lid or Planter ONLY (Garden Column NOT included)",
    "description": "***COLUMN NOT INCLUDED***Lid or Planter ONLYColumns can be purchased below:https://www.etsy.com/shop/makertable?ref=seller-platform-mcnav&search_query=columnAdd these tops to your garden column! You can select a regular top or a top that works as a planter. The Top Lid is easily removable with a one-inch lip. The Planter top is 4\" deep to plant simple succulents or plants. Each column is welded by hand and pre-rusted so it will blend in with your landscape as soon as you place it in your space. They work great as a stand-alone monolith or combine 2 or more for extra texture. They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture, and finish all of our work from a small shop in Tennessee. Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum, and glass combined. 88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.SOLID STEEL CONSTRUCTION - Our garden column tops are made from 16 ga mild steel, about the thickness of a dime. Designed to last many years without maintenance inside or out.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DSTYLE:LID TOP a simple top then can easily be removedPLANTER TOP that is 4\" deep to add some simple succulents or other plants to your garden column",
    "reviews": [
      "These were the perfect addition to my columns…wish I had ordered them sooner!",
      "We bought the columns earlier and thought these toppers would finish the look…LOVE, LOVE, LOVE!",
      "This seller was excellent. I had several chats where my questions were answered very satisfactorily.  The item I purchased is beautiful!  I am thrilled.  I love that it is reclaimed metal and made by a small business. I highly this seller!"
    ]
  },
  {
    "productId": "fYVAA4EYKM",
    "url": "https://www.etsy.com/listing/960965673/floral-support-stained-glass-hummingbird?click_key=29ef9154466212d6d54bfb63ab36a680d8e6d74f%3A960965673&click_sum=a22d14d8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-30&pro=1&etp=1&content_source=f16c4cfe1381048a78ca05ac5609a5ca0169b5df%253A960965673",
    "title": "Floral support stained glass Hummingbird pot stake glass Hummingbird Gift for gardener Christmas gift for mom",
    "description": "Bright and cute plant stake flying Hummingbird we made from stained glass. It's hard to take eyes off from such decor.DIMENSIONS:Height 12.5 inchWidth 4.3 inchPrice include gift&safe packaging and window fixture.All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me in private messages for details.Any item can be customized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Beautiful and perfect gift. Highly recommend.",
      "I bought these for my friend and had them directly shipped to her. She LOVES them and was so touched. They’re beautiful and perfect for her sunny office. Shipping took a while but that’s to be expected so not an issue, tracking was accurate. Highly recommend and thinking of buying for myself!",
      "The hummingbird plant stake is a beautiful piece that adds  an eye-catching touch of art to a small-to-mid size houseplant.  The piece was very well crafted and looks wonderful against the dark green foliage of the plant that we have it in currently.  VitrageArtSouvenirs was a pleasure to purchase from and I will definitely look for future purchases from this store.  Beautifully done VitrageArtSouvenirs!"
    ]
  },
  {
    "productId": "wRmRFWwFty",
    "url": "https://www.etsy.com/listing/584079760/sun-catcher-garden-art-with-mirrors?click_key=00867fd5e01df00772294a2e1fb8f92a1f8c3b81%3A584079760&click_sum=b812491e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-31&pro=1&frs=1&sts=1&content_source=e46ca3cb49847704990f7b50607008abca510a42%253A584079760",
    "title": "Sun catcher garden art with mirrors & crystal clear rhinestones,  mirror garland, outdoor wedding decor,  party decoration, teacher gift",
    "description": "These are crystal-clear rhinestone strings of tree jewelry.  The mirrors and clear rhinestones maximize the reflection of the sun, moon, street lights ... and it's just magical!  Take a look at the video to see the reflective lights that dance around!!Fancy Tree Jewelry adds whimsy and fun to any outdoor space year round! Everyone loves the tiny reflections and the bursts of sparkle that scatter and dance when the wind catches and the sun or moon is shining. Tough enough to withstand summer heat and the winter freeze, these unique dangling sun catchers are magical and dazzling.Strings adorned with mirrors, acrylic rhinestones or glass beads, some with crosses or snowflakes, strung from branches, hanging from your deck or porch will add whimsy to your outdoor space. These catch the breeze as it wafts by and the mirrors scatters the sunlight to create a magical ambiance. Add a bit of whimsy by hanging several strings.Hang your Fancy Tree Jewelry from tree branches, garden hooks, off your deck, anywhere you need a little bling! Leave out rain and shine, summer and winter!All weather! That's right, you never have to take these inside. These are tough little buggers, and easily handle the extreme cold to the extreme heat!  These are made with #15 fishing line, acrylic rhinestones, glass beads ...  materials that are made to withstand any type of outdoor condition, from the minus 20 degrees of the upper mid-west to the extreme heat of the Arizona summers.Fancy Tree Jewelry would be the perfect accessory to dress up your garden year round, and they would also make the perfect gift!!🩵 LENGTH / SIZE: These are 12\", 24\", 36\", 48\", and 60\"  long.🩵 FREE HOOK with each string of Tree Jewelry purchased!🩵 MIRRORS: The mirrors are hand-cut, and so this means the edges are very sharp! Please be extra careful when touches, especially those little hands. Each is approximately 1/2\" in size.🩵 HOW TO HANG: Each string has a loop at one end. Loop it over a small branch using the hook so that the string can dangle freely.🩵 CARE & MAINTENANCE: You can leave these out year round, through summer heat and winter cold. Every once in a while, you can wipe clean the mirror to make sure they sparkle & reflect!🩵  If you need your Tree Jewelry sooner, for an event or gift deadline, you can now upgrade your order to EXPEDITED!  Add this to your cart, and your order will be jumped to the front of the queue!!   Use this link:https://www.etsy.com/listing/100860490/tree-jewelry-garden-art-rush-my-order🩵 SHIPPING TIME: 2-3 business days within the USA with USPS Flat Rate Shipping.  Each string is hand-made and will be packaged for safe shipping.  You will receive a tracking number to track your package!🩵 INTERNATIONAL ORDERS: I have a set price for shipping to international destinations.  Each order is different, depending on order size, weight, and country, and so shipping prices vary greatly.  I will REFUND the difference to you once actual shipping costs are calculated.  I do NOT make money on charging extra!!  If you are unsure of what your costs will be, send me a message with your intended order and your address.  I will calculate for you and give you a good estimate of what to expect.  Thanks for understanding!!🩵 GIFTS: We can ship our Fancy Tree Jewelry directly to your gift recipient. We are happy to include a complimentary gift note and even gift wrapping for the occasion!  Please send us the text you'd like to use in the notes to the seller field",
    "reviews": [
      "Love the sun art so pretty I will order in colors next time prices are good that you",
      "Thank you Judy!",
      "I have ordered from this site three times now, alway very well done.",
      "Thank you Roberta!",
      "These are the absolute best!! Better than I’d anticipated. The light play in my garden is sensational. Beautiful, happy creations!!",
      "Thank you Amber!"
    ]
  },
  {
    "productId": "PefecPyNDe",
    "url": "https://www.etsy.com/listing/1694251535/portable-beer-table-groomsman-gift-best?click_key=2b70f97a6b29c814b8a34775158921f9c4792898%3A1694251535&click_sum=12cd0d50&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-32&pro=1&frs=1&sts=1&content_source=6c534527c992c3e8da0adf9100dcaf84c47f491b%253A1694251535",
    "title": "Portable Beer Table || Groomsman Gift || Best Man Gift || Wedding Party Favor || Bachelor Party || FREE ENGRAVING **Free Shipping**",
    "description": "Let this table be the first thing you grab when you head out to the beach, backyard, or outdoor concert. The table conveniently folds for storage and is easily set up by putting the metal locking pin into place. The fiberglass rod is durable and makes staking into the dirt, sand, or grass a breeze (you can even put it into a planter on your deck or balcony). The top has space for two beer bottles, pint glasses, solo cups, soda cans, bottle of water, etc., and plate of your favorite snacks. Table comes equipped with a bottle opener, so you'll never have to remember to bring one again. One of the two carrying handles doubles as a handy phone holder to keep your phone safe and in sight -- a great feature for the beach to keep pesky sand off your device. There's also a purse hook on the leg to keep your bag upright and out of the dirt.We built this for our love of the outdoors and a need to enjoy our draft beer from a glass at our small town brewery. Our mesh camping chair cup holders results in many lost ounces of hoppy goodness.  Elevate your outdoor adventure whether it is a day at the beach, an outdoor festival, or on vacation in the mountains enjoying an epic sunset! If you love beer and the outdoors, you need this. A great gift for any beer lover!Features:Lightweight designBottle openerCup holder is 3.25” diameter- Holds 2 beer bottles, pint glasses, solo cups, soda cans, bottle of water, spiked seltzer, etc.Space for snacks or small platePhone slot -- great for sitting in Adirondack chairs or keeping your phone out of the sand at the beach.Purse/bag hook to keep bags off the groundFiberglass rod that will not rust2 carrying handlesCollapsible for easy storageFor the wine lovers:https://www.etsy.com/listing/977249645/portable-wine-table-backyard?ref=shop_home_active_1&frs=1*** HOW TO ORDER ***1. Select the stain color of the wood.2. Select engraving option. Options are as follows:- No Engraving- Custom Name/Phrase: In the personalization section , please include the text you would like on your table. To separate text onto a different lines, use a backslash (/). (Example: Williams/Est. 2019) Names will have larger text on top line and small text on bottom line. Phrases will have text all same size. See images for example.- Initials: Up to 3 characters. Each one will be separated by a line (|). See images for example.- Preset Phrases: \"I'll Clink to That!\", \"If you can read this, sit down and have a beer\", \"Let the good times flow\"Have a brewery or restaurant or want to give as a corporate gift? Please contact me to discuss engraving your logo and bulk purchasing.Dimensions(does not include stake): 22\"h x 12\"w x 11\"dFolded Dimensions(does not include stake): 27\"h x 12\"w x 4\"dThe table comes packed flat and is simply joined together with one bolt. Finished with a food grade waterproof finish to protect the wood.",
    "reviews": [
      "Great customer service, arrived on time",
      "Great design and execution, highly recommend, don’t hesitate, get one now!",
      "Thank you for your review!",
      "Awesome and great work love 💕 it",
      "Thank you for your review!"
    ]
  },
  {
    "productId": "vOeSstTokZ",
    "url": "https://www.etsy.com/listing/1044934947/circle-spiral-mobile-hanging-mobiles?click_key=229413642a01e9cfe99a2043627930c26d49ebfb%3A1044934947&click_sum=b63b0138&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-33&pro=1&sts=1&content_source=1e47a2987293c06cc057180b1444b23cd15a3cdf%253A1044934947",
    "title": "Circle Spiral Mobile | Hanging Mobiles | Gifts for Mom | Garden Decor | Balcony Chimes | Outdoor Chimes | Wind Chimes | Patio Art | Wall Art",
    "description": "Circle Spiral MobileThe circle of life is ever-present in the garden; our Contemporary Flamed Circles Mobile celebrates the changing of the seasons in a subtle, sophisticated way. This exquisite piece features a seemingly endless cascade of open circles, which surround angled discs that play with the light as it changes throughout each day.Its bell-free design is both enchanting and quiet. Like all spiral mobiles in our Happy Gardens collection, this one is individually handcrafted, and will bring long-lasting beauty to your home’s landscape.Quieter, bell-free designDimensions: 8” D x 25” HWeight: 1.8 lbsEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and windchimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and windchimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "Loved the chimes for my yard!",
      "This purchase was super awesome",
      "Item was heavier weight than I expected (in a good way) and is high quality. Photos and descriptions were accurate which is always important to me! Shipping was timely, even during the holidays. Would purchase from here again.",
      "Awesome! Your feedback is one of the reasons why we won't stop thinking of ways how to deliver not only beautiful products but great service. We appreciate your business and we appreciate you. Take care! :)"
    ]
  },
  {
    "productId": "VuIXwps55R",
    "url": "https://www.etsy.com/listing/601193958/rusty-metal-dinosaur-raptor-velociraptor?click_key=94b85f6a9dbcb54a3183fe765a7f8039a7669524%3A601193958&click_sum=35857ac7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-34&pro=1&frs=1&etp=1&content_source=d13a781ad5cd1e1a0021129e7e45747c18ad2e9a%253A601193958",
    "title": "Rusty Metal Dinosaur Raptor - Velociraptor - Garden Ornaments - Art - Raptor - Dino - Jurassic Park - T-Rex - 3D Dinosaur",
    "description": "70cm Long (25.5 inches) and 39cm high (15.35inch)This is the ultimate garden ornament, a raptor stomping around!  This would look amazing for kids or big kids like me in any garden.  Stand him on the wall to scare the neighbours or enjoy him hiding in the flower beds, wherever you place him he will look stunning.We have other 3d sculptures in our shop and more to come, click the following link to see them all https://tinyurl.com/36dbkbt5THIS IS NOT A TOY.  Keep away from Children, display purposes onlyPrecision cut from steel and then rusted using our unique all-natural formula.  The item you receive will be pre-rusted and ready to admire in your garden.70cm Long (25.5 inches) and 39cm high (15.35inch).   Item is fully assembled, welded and rusted ready for use.We use high quality thick steel to last many years.Shipped worldwide, current shipping times are displayed.  Express shipping upgrades available.",
    "reviews": [
      "arrived on time and well made",
      "So, this is now my most favorite piece of art I own. I don’t even want to put her outside. I absolutely love her.",
      "Loved this item! So unique and cute",
      "Absolutely perfect and even better than I was expecting!"
    ]
  },
  {
    "productId": "0DSFYkNUWT",
    "url": "https://www.etsy.com/listing/1147577859/wood-nightstands-bedside-table-mid?click_key=5dbf0a481cfc1db81a0b713c26ceeeaf01889160%3A1147577859&click_sum=0d920990&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-35&pro=1&frs=1&sts=1&content_source=7cf44adf096e94936a23ee7b92ed072ebadac9e4%253A1147577859",
    "title": "Wood Nightstands Bedside Table, Mid Century Side Table, Wood Nightstand, Bedroom Furniture, Handmade House Decor,boho table, boho picnic",
    "description": "Wooden Bedside Table | Mid Century Side Table, Solid Wood Nightstand, Bedroom Furniture, Handmade House Decor40 cm - 20 cm deep 32 cm table legs:40 cm ----15 inc- 7.5inc deep 12 inc, table legs: 13 incThis nightstand is completely handmade and made of premium pine wood. feet can be easily attached and dismantled.* Europe: 7-14 days;* USA & Canada: 10-17 days;* Australia & everywhere else: 10-30 days***Damaged products are covered by our warranty***",
    "reviews": [
      "Beautiful handcrafted table, arrived so quickly and is a stunning nightstand. It is well made, looks great and I'm thrilled with it.",
      "I bought 2 and they look great!",
      "The nightstand is made of great quality and is very sturdy. What surprised me the most though was the quick shipping. I found nothing to complain about!"
    ]
  },
  {
    "productId": "wgSbACxIEJ",
    "url": "https://www.etsy.com/listing/908140614/shimmering-bells-with-small-leaves-wind?click_key=72998f16793ba55ff1953b5b7d200ecdebf60ec5%3A908140614&click_sum=c32e7e59&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-36&pro=1&sts=1&content_source=49616bf6a27781e79cf4b64002a7c7e68b6c9e1e%253A908140614",
    "title": "Shimmering Bells with Small Leaves, Wind Chimes, Metal Art, Tree Decoration, Garden Decor, Gardening Gifts, Yard Art, Patio Art, Rustic Art",
    "description": "Shimmering Bells with Small LeavesLittle breezes provide graceful swaying motions, encouraging tiny copper bells to sound their soft, sweet voices. Verdigris leaves celebrate the passing of seasons while adding a lovely contrast. Suspended from a simple verdigris branch with a pretty hanging chain to match, this beautiful set of shimmering bells delights the senses. Like all Happy Gardens mobiles, this one is handcrafted, and brings lasting beauty to your home.Copper bellsContrasting verdigris leavesDimensions: 10.5” W x 32” HEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and windchimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and windchimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "Beautiful, packaged with love and shipped quickly",
      "Love it! Glad to know you love this beautiful piece too ❤️❤️❤️ Thank you for trusting our small business. Take care!",
      "It's very unique and different. I love the bells. Great quality.",
      "Beautiful! Thanks for sharing this lovely photo, Holly! :)",
      "I bought this for a birthday gift and she loved it. Very nicely made. It's a different look for a wind chime, that's why I picked it. Very happy with this purchase."
    ]
  },
  {
    "productId": "tnW3EseluX",
    "url": "https://www.etsy.com/listing/812427340/mini-birds-on-rocks-stone-statues-set-of?click_key=5893677021bdfce256f37b80906f8bf4b6c5b070%3A812427340&click_sum=9adef0da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-37&pro=1&sts=1&content_source=c19f0b70081d81503b047836b4e0fa9733cbff9e%253A812427340",
    "title": "Mini Birds On Rocks Stone Statues - Set of 3, Garden Statues, Outdoor Sculpture, Outdoor Decor, Patio Statue, Yard Art, Garden Decor, Decor",
    "description": "Mini Birds on Rocks Stone Statues, Assorted Colors - Set of 3They say good things come in threes, and we couldn’t agree more. After all, our Mini Birds on Rocks Stone Statues are sold as a trio, and they are cute as can be. These statues look good in every style of home and garden, and make an excellent gift for a new homeowner or neighbor. They’re tiny enough to look just right in a rock garden, on your windowsill or even in a small potted plant. As always, this set has been individually handcrafted by talented artisans.These are sold as a set of three per order.Assorted colorsHandmade with terra cotta and natural stoneDimensions:2.5”L x 2” W x 3” H2.5” L x 2” W x 4” H2.5” L x 2” W x 6” HHANDCRAFTED WITH LOVE - Our garden statues are made by hand with reclaimed river stones by some pretty incredible people. The Honduran manufacturer who provides us with these statues dedicates a portion of his proceeds to improving life for these artisans.EASY TO INSTALL AND CARE FOR - When you receive your statue, the hard work will have already been done. Rest assured you (or the lucky recipient of your gift!) will have this item on display in no time. And cleaning and caring for the statue will be a breeze, too.TOTALLY ADORABLE - Our animal-themed garden statues are so cute, our customers almost can’t stand it. Order your favorite animal, or create an outdoor menagerie and collect ‘em all.MADE WITH QUALITY MATERIALS - Unlike many garden statues available for sale, the ones we offer at Happy Gardens are made from only the best products like real river stones and heavy-duty steel.BACKED BY A FRIENDLY ONE-YEAR WARRANTY - If you have a problem with your garden statue within a year of purchase, just call us! Our customer service team is proud to stand by our one-year limited replacement warranty.",
    "reviews": [
      "I bought these twice I loved them so much",
      "Oh, thank you so much for trusting us and doing business with us, Catherine. I appreciate your lovely feedback. Happy holidays!",
      "Adds nice color to my native garden.",
      "The item was exactly what I thought it would be and will be great for an outdoor garden.",
      "a lovely and very cute set"
    ]
  },
  {
    "productId": "cvLndkJmVN",
    "url": "https://www.etsy.com/listing/1104507617/scroll-hearts-multicolor-wind-chime-wind?click_key=8908a22d35f6731219866bf85006c5c8e85f1e2e%3A1104507617&click_sum=76c761a6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-38&pro=1&sts=1&content_source=85d8c622a2cd26cacc7085cfafa8c64bc9e8e135%253A1104507617",
    "title": "Scroll Hearts Multicolor Wind Chime | Wind Chimes | Gifts for Mom | Patio Art | Gardening | Metal Art | Garden Decor | Yard Art | Home Decor",
    "description": "Scroll Hearts Multicolor Wind ChimeFeel some extra love in your garden with the Scroll Hearts Multicolor Wind Chime. There’s something for everyone in this melodic wind chime, with its three vibrant hearts in ruby, sapphire, and emerald. Hanging from a handcrafted, swirled centerpiece, tiny bells ring sweetly in any breeze. This is just the kind of garden decor that makes your neighbors ask: “Where do you shop for all this adorable stuff?”Dimensions: 12” l x 1.25” w x 28” hFeatures miniature bellsShowcases three hearts hanging from a swirled centerpieceTimeless, flamed metal finishEasy to hangBacked by our Happy Gardens guaranteeEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and windchimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and windchimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "Love this item! It looks awesome! Thanks",
      "Such a lovely photo. Thanks for sharing this, Connie. I am glad you love it. Thank you so much for your business!",
      "I just love this wind chime. I plan to order more for gifts.",
      "Sweet! Glad to know you love it, Peggy. ❤️ Thank you for your business",
      "Perfect for the garden - very well made."
    ]
  },
  {
    "productId": "sQ5bVJOkhr",
    "url": "https://www.etsy.com/listing/1683008863/gorgeous-hummingbird-and-butterfly-solar?click_key=5968d7297c1f5295f8a6cc746724142e555d4381%3A1683008863&click_sum=473a3305&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-39&pro=1&frs=1&sts=1&content_source=60614bf4aea3ea81e9a28e29b4aa4eff3f17c97d%253A1683008863",
    "title": "Gorgeous Hummingbird and Butterfly Solar Light Wind chime | Perfect as an outdoor, front or backyard decor. The Perfect Gift for him or her",
    "description": "These Gorgeous Hummingbirds and Butterfly Solar Light Wind chimes will transform your front or backyard into beautiful work of art!- SOAR POWER - Turn the 'ON / OFF' Switch at the bottom 'ON'. Let the Sun charge it for at least 4 hours and enjoy the power of the Sun to light up your garden.- GORGEOUS COLORS - These wind chimes will alternate between different colors at night transforming your front and / or backyard.- PERFECT GIFT - These wind chimes are the perfect gift for him or her. Perfect as a house warming gift or for any special occasion to anyone special in your life.",
    "reviews": [
      "Item arrived well packed and protected, and is a gorgeous decoration.",
      "Bright and colorful \nCan’t wait to put them out",
      "Gorgeous wind chime with beautiful colors!"
    ]
  },
  {
    "productId": "ODUzzngjRJ",
    "url": "https://www.etsy.com/listing/860605596/lily-cup-chimes-garden-stake-garden?click_key=f7e78140f563d7ad155348b27b22079f304e4d42%3A860605596&click_sum=2ef319de&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-40&pro=1&sts=1&content_source=7923ccad414c503362782660c73c74449e888c94%253A860605596",
    "title": "Lily Cup Chimes Garden Stake, Garden Stakes, Floral Garden Stake, Garden Decor, Landscape Decor, Yard Stakes, Gardening Gifts, Rustic Art",
    "description": "Lily Cup Chimes Garden StakeA diminutive bell nestles inside each of the blossoms on our Lily Cup Chimes, emitting a soft, pleasing sound with every caress of the breeze. Supported by a strong metal stake at its base, this staked chime set features five individual lilies, which sway gently to provide a touch of movement. Like all Happy Gardens chimes, this set is handcrafted, and will bring lasting beauty to your outdoor environment.Flamed finishDimensions: 19” L x 19” W x 55” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you outDon't forget we also have a great range of rain chains and wind spinner products.Other products you may be interested in include:Triple Calla Lily Garden StakeStanding Birds Garden StakesBell Spiral Garden StakeSpice Bird Rain Gauge",
    "reviews": [
      "Sturdy and well made. Haven’t heard the chimes yet but it’s a beautiful addition to my garden.",
      "Such a lovely photo! Thank you for sharing this, Jane. I am glad you like it. :)",
      "The item was just what I wanted.",
      "This was packaged very well and shipped quickly.  Because this is winter, I can't tell you how it looks (and sounds) in the garden but I am looking forward to putting it out in the Spring!"
    ]
  },
  {
    "productId": "dviqEBDzEa",
    "url": "https://www.etsy.com/listing/1513850373/garden-decor-outdoor-rustic-red-metal?click_key=bad3d006d9a0e719769d0091760ca739b6fb71a2%3A1513850373&click_sum=a62d5f1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-41&pro=1&frs=1&content_source=8df11e81a25769341eb9173a463eebcef59c295f%253A1513850373",
    "title": "Garden Decor Outdoor Rustic Red Metal Agave Yard Art, Handmade Cactus Tequila Plant Sculpture Patio Backyard Lawn Ornaments",
    "description": "Inspired by natures beauty, this metal agave is sure to impress. This piece is 100% handmade from steel and features a beautiful, durable finish. Our artificial succulent is perfect for adding a rustic, yet modern feel to any garden or home interior. It's extremely sturdy, and the unique design will make it stand out in your landscaping. The vibrant colors of each hand painted spine will add personality and flair to any space. To ensure it's sturdiness and beauty, each piece is welded by hand and is sprayed with an acrylic sealer to prevent fading. There are many great benefits of owning an artificial plant, one being maintenance. No need to water, prune nor fertilize. It is also allergy friendly.STURDY & STRONG💪🏽 We have designed our steel agave plant to be as sturdy as possible, replacing the flimsy stake with a larger and stronger base that can either be beautifully displayed or easily buried to make it appear as if it's growing from out of your garden. Each spine is securely welded, enforcing its original position and is sure to never bend nor break.HANDMADE🖐🏽 Our tequila sculpture is 100% handmade and hand painted in Mexico, where the unique natural Mexican maguey plants originate. Our rustic Aztec desert decoration brings beautiful gifts from Mexico's soil to your home. As these artificial agaves are handcrafted individually, no two are exactly the same, imperfections and dimensions may slightly differ.NO INSTALLATION REQUIRED 🔨 Tools not necessary. This plant comes completely finished and ready to set up as soon as you unpackage it. NO screws, NO bolts, NO extra work. Save the energy here by simply setting the agave wherever you desire.WEATHERPROOF💦 Made of heavy duty steel, our faux lawn ornament will handle any of the outdoor elements thrown its way. Through rain and dusty desert wind storms, the thick materials will never bend and the base is certain to keep it in place.INDOOR AND OUTDOOR USE🏡 If you are looking for decorations to spice up your front garden, backyard, patio, or even the interior of your home, your search ends here. This cute metal statue allows you to get creative with your inner designer self.PRODUCT DIMENSIONS:24\"X12\"X12\"WEIGHT:5 LBSAs each piece is hand crafted, dimensions may slightly differ.",
    "reviews": [
      "Perfect condition, fast shipping, the easiest purchase!",
      "Excellent service and product! Thank you!",
      "We loved the first rustic red cactus so well that we ordered another! The first metal art piece welcomes visitors as they arrive at our front door. The second one sits proudly on one of our fire place hearths. And, if you look closely, you can see a 'little cousin' but instead of the stunning red, it's a rich green. Both items were packaged to avoid any damage, and as a bonus, they arrived quickly. The red cactus is deep red with gold-tones. The green is perfect as a compliment. The green isn't dull or overly bright. Each has colors that draw you in depending on a light source. These are excellent. Hope you purchase and love them as much as we do."
    ]
  },
  {
    "productId": "ERMZIDUJYE",
    "url": "https://www.etsy.com/listing/1497889082/suncatcher-saturn-with-ghosts?click_key=748ec0594fed54e665fb02d125e5b460a72cd6e4%3A1497889082&click_sum=1256616f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-42&pro=1&frs=1&etp=1&content_source=b6ec76ff95756e2b5d2549928ec4a0cee82bfc1c%253A1497889082",
    "title": "Suncatcher Saturn with Ghosts Dreamcatcher Stained glass Halloween decor Cosmos Art Space theme Wall decor for a room Gothic home decor",
    "description": "Saturn with ghosts is not a standard combination of two very relevant topics. We believe that this is the perfect piece of art for your home, which will be relevant for Halloween and beyond. If you or your friends love space theme or Halloween theme this will be a perfect decoration for you or as a gift. This decor is cute, funny and gothic at the same time, and the iridescent glass we used emphasizes the non-standard nature of the dream catcher. We must also add that photos cannot convey the real beauty of this art.Hello dear buyer! Welcome to our authorship stained glass decors store!We are Olha and Daria, founders of this store and people who create beauty for you. We have been engaged in stained glass for over nine years.In this difficult time, work saves us and your smiles warm us. We love our business and do our best to ensure that you are satisfied with the fact that you turned to us.We can also create individual works. If you have an idea that you really want to implement, then we will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live color may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!",
    "reviews": [
      "The item was exactly as described and looked beautiful. Would buy from this shop again.",
      "Beautiful!! I love love love this so much. I have a whole collection of sun catchers and this is definitely at the top of my faves. Exactly as pictured if not better I would order again",
      "It was packed very well and came undamaged. Beautiful piece!"
    ]
  },
  {
    "productId": "JQREkGXnyH",
    "url": "https://www.etsy.com/listing/1322405633/butterfly-tree-wall-decor-flamed-24-wall?click_key=89074c2b7709c939e75eb7a130a42533887a107e%3A1322405633&click_sum=3b87c4f2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-43&pro=1&etp=1&sts=1&content_source=3020f605c85263a418cdfbf7e20d09dadf226c1f%253A1322405633",
    "title": "Butterfly Tree Wall Decor, Flamed, 24\" | Wall Decor | Wall Hanging | Home Decor | Garden Decor | Housewarming Gift | Metal Garden Art | Art",
    "description": "Butterfly Tree Wall Decor, Flamed, 24\"Give any wall or fence a touch of whimsy with this bursting-with-butterflies wall hanging.About the productWith dozens of flamed metal, handcrafted butterflies sprouting from the branches of an ethereal tree, this wall hanging is anything but ordinary. Mount it to a drab wall, a fence, the exterior of your garden shed—any space that needs a bit of charm. No matter where you place it, this ornate piece is sure to start a conversation.Why we love itAll too often, we ignore the exterior walls of our home. But with this wall hanging, it’s easy to bring life to any space.Shipping detailsMost orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote dad, “We’re going as fast as we can! Promise!”)Measurements24” x .5” x 23.5”MaterialsHandcrafted, flamed metal.DetailsQuick, frustration-free installation.Backed by our friendly, one-year warranty.",
    "reviews": [
      "It’s as beautiful as I thought it would be",
      "Absolutely beautiful. Exactly as pictured and described."
    ]
  },
  {
    "productId": "WezCgAELwv",
    "url": "https://www.etsy.com/listing/1682195408/garden-skull-20-creepy-garden-decor?click_key=9d240139447b3627d9fa3947f43d838058a1b5fe%3A1682195408&click_sum=03cc9ebf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-456643-3-44&pro=1&sts=1&content_source=30ff98bdb1eb2d6fcae93662292682aa07a67728%253A1682195408",
    "title": "Garden Skull 2.0, Creepy Garden Decor, Garden Gifts, Halloween Garden Decor, Concrete Human Skull, Spooky Garden Decor,",
    "description": "Introducing Garden Skull 2.0, a stunning and unique addition to your garden or home decor. This painted concrete garden decoration portrays a lifelike human skull that appears to be emerging from the ground, creating a striking and eye-catching centerpiece. Weighing 8.5 pounds, this life-size skull is crafted with exceptional attention to detail, ensuring a remarkably realistic appearance. Whether displayed in your yard or indoors, Garden Skull 2.0 will undoubtedly become a conversation starter and an intriguing focal point. Add a touch of intrigue and personality to your surroundings with this one-of-a-kind garden decoration.",
    "reviews": [
      "Second time purchasing as my wife liked it so much there was a theft of a skull, so I ordered thee more!",
      "As described and better than expected. Quick shipping and care in packaging. Would buy again.",
      "Great communication and details of arrival.  Purchased as a gift and the skull is adorable."
    ]
  }
]
