[
  {
    "productId": "KMBuYHlN1E",
    "url": "https://www.etsy.com/listing/1029698212/man-accessory-leather-keychain-with?click_key=80864a26a29f93c64ce04c9a43c85d376426432f%3A1029698212&click_sum=3c7097a2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-1&pro=1&etp=1&sts=1",
    "title": "Man accessory - Leather keychain with photo, personalized gifts for him, keychain for him, gift ideas for men, unique photo gift for man",
    "description": "This keychain is a symbol of love that he can carry every day. These gifts for him, are about feeling valued and remembered.Personalize the leather keychain with initials or a name, print on a metal insert any photo that holds a special place, and engrave heartfelt wishes adding an emotional value to the gift for him.Whether it's for your father, brother, husband, or friend, these personalized gifts for him speak volumes. Celebrate the moments, big or small, with this photo keychain, which is a representation of your bond and a reminder of your care.🍀 Premium Craftsmanship: Made of 100% genuine leather🍀 Quality Material: A stainless steel tag inside🍀 Durability Assured: Made with sturdy hardware🍀 Unique Branding: Complimentary personalization on the leather🍀 Vibrant Pictures: Full-color printing on the metal tag🍀 Customizable Text: Laser-etched text on the metal tagPERSONALIZATION OPTIONS:🎁 Embossing on the front leather part is a free option for all keychains◽ 1 side with Text: your text inside on the tag◽ 1 side with Photo: your photo inside on the metal tag◽ 2 sides: 1 photo + 1 text inside / 2 photos inside◽ 3 sides: 3 photos / 2 photos+text / 1 photo+2 texts inside◽ 4 sides: 4 photos / 3 photos+text / 2 photos+2 texts / 1 photo+3 texts◽ 5 sides: 5 photos / 4 photos+1 text/ 3 photos+2 texts / 2 photos+3 texts /1 photo+4 texts◽ 6 sides: 6 photos / 5 photos+1 text / 4 photos+2 texts / 3 photos+3 texts /  2 photos+4 texts / 1 photo+5 texts✒️ Turn your handwritten notes into engraved messages inside the keychain, crafting a keepsake with a deeply personal touch🐾 Include symbols like paws or hearts to make the engraving even more specialMEASUREMENTS:◽ Width 2.0”◽ Height 2.5”➕ To update or add more cherished memories, you have the option to buy an additional metal insert. For easy access, follow the link provided:https://www.etsy.com/listing/1539942280/additional-tags-for-the-keychain-only❔ Have questions or need assistance? Feel free to contact me, and I'll be happy to help!",
    "reviews": [
      "Great quality my husband loves it",
      "I really like how it looks.!!!",
      "Excellent. My husband love it"
    ]
  },
  {
    "productId": "SnLJw8lGbd",
    "url": "https://www.etsy.com/listing/1480472291/personalized-walnut-keepsake-box-wedding?click_key=538500bb86af2c606126634d1778df900a41d85f%3A1480472291&click_sum=a4710385&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-2&frs=1&bes=1&sts=1",
    "title": "Personalized Walnut Keepsake Box, Wedding Memory Box, Wedding Keepsake Box, Anniversary Gift, Bridal Shower Gift, Gift For Couple",
    "description": "This Walnut Keepsake Box is perfect to keep your most cherished memories!  Personalized just for you or someone special.  Keepsake boxes make a great gift to store all their treasures.  Available in two sizesHow To Order:Enter names and date in the personalization box.Details:Medium SizeOutside Measurements: 10\" x 8\" 4.125\"Inside Measurements: 9.125\" x 7.125\" x 3.5\"Laser EngravedXL SizeOutside measurement: 12.625\" x 9.125\" 5.5\"Inside measurements: 12\" x 8.5\" 5\"Laser Engraved**If the design you choose has an image (ex. wreath, \"Our Story\", \"Adventures\", etc.) it is part of this design and will be engraved on the Keepsake Box unless the Customer requests for it to be removed**PLEASE READ: Due to the nature of wood, some boxes may engrave slightly lighter or darker than the photo shows. Natural characteristics of wood will include knots, faint lines in the grain, minor cracks, blemishes, coloring and rough edges or corners. Each wooden box is unique due to natural wood elements.",
    "reviews": [
      "Beautiful box. The picture does not do it justice. Just breathtaking",
      "The expectations I had were exceeded and I’m absolutely blown away.",
      "Amazing quality, very special indeed!"
    ]
  },
  {
    "productId": "SvfcmdrJeE",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=6c852596c1c2e5f6cc64603ea5eec77c12e859ec%3A1567221560&click_sum=da5291e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-3&pro=1&frs=1&etp=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "My mom loved it. Excellent size and use of space with the drawers and edges.",
      "Love Love Love… it’s perfect!",
      "Great service. Cute product. Thank you!",
      "This product exceeded my expectations. I chose not to get it engraved for my co worker, but that didn’t disappoint her. The quality of the product was perfect. I would definitely recommend buying one for yourself or as a gift. Thank you so much for providing a quality product."
    ]
  },
  {
    "productId": "2IEnJaOscx",
    "url": "https://www.etsy.com/listing/1128749687/bridal-shower-gift-personalized-wedding?click_key=5d1c50fb851538ffe1392be61691082d08435b43%3A1128749687&click_sum=327358d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Bridal Shower Gift | Personalized Wedding Gift Last Name Established Sign Anniversary Gift Engagement Gifts Valentines Day Gift | Wood Sign",
    "description": "Personalized wooden family name sign.>>>PERFECT FOR<<<--- Bridal Shower Gift--- Wedding Gift--- Anniversary Gift--- Engagement Gift--- Valentines Day GiftThis sign is available in three sizes : 9.25\" x 23\" (as shown), 11.25\" x 28\", or a 11.25\" x 36\".The sign is made using a two tone stain finish on 3/4\" Solid Pine that's finished with a sealer. Each sign includes a sawtooth hanger on the back for quick and easy hanging. Notice the 3D lettering and images that pop right out of the sign. This unique and beautifully crafted sign is truly one of a kind.Every sign is handmade out of premium quality pine. We finish our signs with an indoor/outdoor sealer but do not recommend placing outdoors in the direct elements. Provide partial protection from these elements if placed outside.-------------------------------------------------------------------------------------------Please message us if you have any questions.Thank You!",
    "reviews": [
      "Absolutely stunning! I bought this as a bridal shower gift for my sister and I know she is going to love it! Would absolutely purchase from this shop again!",
      "I am sorry to give you 4 star on quality put the y in Taylor toke out the 4 in the date",
      "Absolutely beautiful! Perfect for our Wedding and home!!"
    ]
  },
  {
    "productId": "nHbUtSxFwp",
    "url": "https://www.etsy.com/listing/1287970412/modern-return-address-stamp-wedding?click_key=7dc297b99a9ce7f3e0fa29a3e8e361254e9c009e%3A1287970412&click_sum=b9bcfec4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Modern return address stamp | Wedding Stamp | Save the date | Self ink stamper | Wood handle | Housewarming Gift | Family Stamp | Minimal",
    "description": "You just found the best quality return address stamp on Etsy!🎁 𝗧𝗛𝗘 𝗣𝗘𝗥𝗙𝗘𝗖𝗧 𝗚𝗜𝗙𝗧💎 𝗤𝗨𝗔𝗟𝗜𝗧𝗬 𝗖𝗥𝗔𝗙𝗧𝗠𝗔𝗡𝗦𝗛𝗜𝗣✨ 𝗘𝗟𝗘𝗚𝗔𝗡𝗧 𝗗𝗘𝗦𝗜𝗚𝗡🌟 𝗠𝗢𝗡𝗘𝗬-𝗕𝗔𝗖𝗞 𝗚𝗨𝗔𝗥𝗔𝗡𝗧𝗘𝗘We love this stamp, and we hope you will too. If for any reason you are not satisfied, we will give you your money back, guaranteed!----------𝗣𝗥𝗢𝗗𝗨𝗖𝗧 𝗢𝗣𝗧𝗜𝗢𝗡𝗦- SELF INK STAMP = inkpad is built into the stamp and inks design with colors: Black, Blue, Red, Green, Purple- WOOD HANDLE STAMP =  inkpad not includedSIZESWood Stamp: 1 x 2.5 in.Self Ink Stamp: 1 × 2.5 in.----------Follow these easy steps to customize & complete your order:♡ 𝗖𝗛𝗢𝗢𝗦𝗘 𝗬𝗢𝗨𝗥 𝗢𝗣𝗧𝗜𝗢𝗡𝗦Wood stamp with handle, wood stamp with no handle, or self-ink stamp♡ 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗭𝗘 𝗜𝗧Use the \"Personalization Box\" or \"Notes to Seller\" to let me know the details of your stamp. Please copy & paste this template:Text above: The MoldovansText below: 395 Marvella Cir Rockledge, PA 93466♡ 𝗗𝗜𝗚𝗜𝗧𝗔𝗟 𝗣𝗥𝗘𝗩𝗜𝗘𝗪 (OPTIONAL - ADDS 2-3 DAYS)If requested, I'll send you a digital preview via Etsy messages within 2-3 business days. I ask that you please keep an eye on your Etsy messages and email. The quicker you approve your preview, the faster I can ship it to you 🙂If there's no response, I'll attempt to contact you a second time before I begin production as-is.♡ 𝗣𝗥𝗢𝗗𝗨𝗖𝗧𝗜𝗢𝗡 𝗔𝗡𝗗 𝗦𝗛𝗜𝗣𝗣𝗜𝗡𝗚 𝗧𝗜𝗠𝗘𝗟𝗜𝗡𝗘Production: please allow 2-3 business days after your digital preview is approvedShipping: the average shipping time is 3-5 business days---Can you rush my order?Of course! I offer options to expedite production and shipping.Please contact me before placing your order, so I can make sure that you can get your stamp delivered to you in time 🙂",
    "reviews": [
      "I love it! It's very sharp and crisp. Came super quick too!",
      "Great gift for a friend - thanks!",
      "Great so excited to use it!",
      "Quick delivery on stamp. Great product and can’t wait to order more for future stamps"
    ]
  },
  {
    "productId": "AFfLzRIFzf",
    "url": "https://www.etsy.com/listing/609674321/customized-cat-socks-put-your-cute-cat?click_key=b6ef74a75cd551ce2a13c7d23f93f497ddde2f97%3A609674321&click_sum=16c63944&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-2&frs=1&etp=1",
    "title": "Customized Cat Socks - Put Your Cute Cat on Custom Socks, Cat Lovers, Cat GIft, Cute Cat Personalized, Cat Gift Socks, Fathers Day Gift",
    "description": "Get custom socks with your very own fur babies face on them! They make the perfect gift for anyone who loves their cat! Perfect for any holiday, birthday, or anniversary! Handmade by local part time moms in Portland, Oregon every pair is made to order.HOW TO SEND IMAGESYou will receive an emailed link within 30 minutes of placing your order to upload your images for us to crop. If you can't find your link in your email, feel free to message us and we can send over Etsy message as well. By default we crop the face, so please leave a note on the upload page if you would like it cropped differently.Small (Youth Shoe Size 12-3) (Women's Shoe Size 4-6)Medium (Youth Shoe Size 3-6) (Men's Shoe Size 6-9) (Women's Shoe Size 6-10)Large (Men's Shoe Size 9-12) (Women's Shoe Size 10-15)Extra-Large (Men's Shoe Size 12-17)GROUP DISCOUNTSIf you are looking to buy more than 25 pairs please message me and I can get you our group discount pricing!Feel free to message us with any other questions and we will get back to you ASAP.Photo Socks, Custom Socks, Socks, Personalized Socks, Custom Printed Socks, Picture Socks, Photo Gift, Custom Photo Socks, Photos on Socks, Gift idea, Mother's Day, Father's Day, Christmas Gift, Stocking Stuffer, Birthday Gift, Perfect Gift Idea, Cat Lover Gift, Gift for Cat Lover, Puppy Gift, Anniversary, Wedding, Fur Baby, Softest Comfortable SocksFor best results of washing these socks, we recommend turning them inside out, washing with similar colored laundry in cold water, and air dry to prevent shrinking. Do not use bleach!As all of our products are 100% customized, everything we sell is one of a kind. Due to this, we cannot accept returns. In the case of a damaged/faulty product, we are happy to work with you to get you a replacement. In this case, contact us and we will resolve the issue.",
    "reviews": [
      "Item came as was expected",
      "For a gift, great quality. Fast delivery",
      "I bought these as a Christmas gift and they're perfect",
      "Already recommended to multiple coworkers!"
    ]
  },
  {
    "productId": "kudWAMqKJX",
    "url": "https://www.etsy.com/listing/1404216335/personalized-wedding-gift-for-couple?click_key=727e925300f20c0367459db84ac0946d2365e560%3A1404216335&click_sum=7306247b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-3&pro=1&frs=1&etp=1",
    "title": "Personalized Wedding Gift for Couple, Custom Last Name Sign with Wedding Date, Farmhouse Pallet Sign for Bridal or Couples Shower Gift",
    "description": "Our signature wood family name sign features an elegant hand-drawn script font that beautifully commemorates the establishment of a family.   These unique one-of-kind signs make for an especially thoughtful wedding or anniversary gift, a stunning entryway statement and a treasured family heirloom.Each sign at Heritage Sign Co. is handcrafted by our family for your family in our Chicago workshop from locally sourced lumber.🖤 DETAILS:• Highest Quality Baltic Birch Wood• ½” Thick Backboards• ¼” Thick Precision Laser-Cut Lettering• Multiple Stain Options• Unpainted Natural Letters or Optional Painted Letter Upgrade• Sawtooth Hanger Included• 3 Sizes Available• 2 Wording Options Available, See Listing Photos🖤 3 SIZES AVAILABLE:• Small - 6 ¼” h x 23” w (name only, no established date)• Medium - 9 ⅜” h x 23” w• Large - 12 ½” h x 28” w🖤 2 WORDING OPTIONS AVAILABLE:We get it.  Not everyone loves the way their last name looks plural.  That's why we've created a new format available for you, offered in multiple products.  Please read through the listing photos to see how we will make your name plural.  If you don't like the way your name looks grammatically plural, you can add \"Family\".  The formatting for this alternative option is shown in our listing photos.You are welcome to choose between the default, \"The (Last Name)s\" \"est (20XX)\" or \"The (Last Name) Family\" \"est (20XX)\" with our alternative formatting.  For the latter, please mention this in your order notes to ensure accommodation.Please note, the small size does not include a date.🖤 PROOFS:Want to see your sign before it gets put into production?  No problem!  To add a proof to your order, simply add the digital proof listing below to your cart along with your wooden sign you would like to receive a digital proof of.  Please note that this will increase the production time of your order.  A full proof is a black & white digital PDF showcasing the exact way it will be cut with any thickening of lines and attachment of letters.  Please note that we provide proofs for customers who have placed orders and are unable to provide proofs for those who have not yet purchased.Digital Proof Add-On:https://www.etsy.com/listing/1217767575/digital-proof-add-on🖤 DIGITAL FILE OPTION:Don't need the sign, but would love a digital file of your name in this gorgeous calligraphy script to use in your other wedding decor?  No problem!  Select the digital file option and leave us a note for the dimensions and file format you would like and we can create your name in any size.  Please be specific if you want the full design with \"est wedding year\" and the \"bars\" adjacent to it or if you would just like your name.  We are happy to substitute wedding years for wedding dates as needed.If no specific details are given, by default we will send you the size large 28\" x 12.5\" digital file in PDF format.  If you do not include a wedding year or date we will omit those details and only send you the name i.e. The Johnsons.  Please note that we will send your digital fileto the email associated with your Etsy account.  Formats available include PDF, PNG, JPEG, SVG or AI.  Font is not editable in any format.  In AI (Adobe Illustrator) format the text will be vectorized and fully scalable.🌟 SHOP OUR OTHER BESTSELLING SIGNS! 🌟Our Botanical Frame Family Name Signhttps://www.etsy.com/listing/1001328656/round-family-last-name-sign-with?ref=shop_home_recs_3&pro=1&frs=1Our Modern Stylized Serif Typeface Family Name Signhttps://www.etsy.com/listing/1029262303/rustic-last-name-sign-for-unique-gift?ref=shop_home_active_1&pro=1&frs=1Our Vintage Typeface Family Name Signhttps://www.etsy.com/listing/1029225411/rustic-last-name-sign-for-unique-gift?ref=shop_home_active_2&pro=1&frs=1Our Round Wooden Monogram Wreathshttps://www.etsy.com/listing/1027200371/wooden-round-monogram-sign-with-wreath?ref=shop_home_recs_4&pro=1&frs=1Our Custom Wedding Guestbookhttps://www.etsy.com/listing/1015087275/custom-wedding-guest-book-decor-layered?ref=shop_home_recs_5&pro=1&frs=1🖤 FINE PRINT:Please note that each sign is made to order with natural wood.  Both wood grain and wood stain will vary from each individual sign.  This is a quality to be treasured for its uniqueness.Signs are stained on front and sides. Back is left unfinished with optional sawtooth hanger taped to back for install.  Many customers opt to instead use gorilla or 3M mounting tape for an easier install, and for this reason we do not attach the sawtooth hanger so that you have the option.We have several wonderful graphic designers that specifically design all personalized orders that are placed through HeritageSignCo. If you have a specific request (particularly regarding spelling or non-family names), you MUST leave a note on your order at checkout. If you placed your order and forgot to leave a note at checkout, please send us a message ASAP. Please note that personalized orders get made and pushed into production very quickly, so if you let us know post checkout, we cannot guarantee accommodation before the item goes into production.Most items are shipped UPS ground.  Please note that UPS will not ship to PO Boxes, please enter a valid street address at checkout.Handmade in America • Chicago ILHeritage Sign Co. © // Est. 2021 // All Rights Reserved",
    "reviews": [
      "Great service and fast delivery",
      "This sign is so cute and is perfect for our wedding! It is beautifully made and good quality.",
      "Amazing quality! Very fast shipping. Very happy with my purchase :) my in laws love their wedding gift!",
      "Looks great and my daughter and her husband loved it!"
    ]
  },
  {
    "productId": "QXlnwVDWJA",
    "url": "https://www.etsy.com/listing/1093485520/personalised-luxury-scarf-mothers-day?click_key=9e150c53db7bf36db60486248524267aecc21e0a%3A1093485520&click_sum=cb8ae9cb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-4&etp=1&sts=1",
    "title": "Personalised luxury scarf, Mother's day Gift, Birthday Gift, Gift for her, Christmas gift",
    "description": "Luxury embroidered Laurel Vine Scarf, the perfect accessory all year round but particularly key during autumn and winter.  Give a gift that will be treasured for many years to come, or treat yourself to something special.Shown in Caramel and embroidered using our gold thread.   IMPORTANT - please choose a thread colour from the thread chart and leave this information in the note box at the checkout. If no thread colour is requested your scarf will be embroidered using our gold thread.KEY FEATURES:1. Luxury soft touch yarn2. Oversized design3. Measures 186 x 47 cm4. Unisex scarf with tassle trim5. Eight scarf colours6. 20+ thread colour options - please visit our extensive scarf category to see examples of other thread colours used.7. Your name embroidered with a beautiful heart/leaf design beneathPERSONALISATION: please leave one name to be embroidered - PLEASE do not leave a gift message if you're not purchasing the gift box option, thank you.CAPITALS & INITIALSPLEASE NOTE we don't embroider in capital letters for this font, the alphabet shown is to show you how the first letter (captial) will look, all other letters will be lowercase.  If you'd like capital letters please get in touch to discuss this with us.ADD A LUXURY GIFT BOX & NOTECARDWhy not add one of our branded Magnetic Gift boxes to complete your purchase.  Perfectly sized to hold our luxury scarves and beautifully wrapped inside acid free luxury tissue paper.  We will use either black, white or grey tissue paper unless you request one of these three colours.  Included is a personalised notecard printed with your gift message.  Please leave this message with your order at the checkout.Our luxury gift boxes have a soft magnetic closure that's invisible to the eye, so sturdy are these luxury boxes that the recipient can even use it as a keepsake box for other items.  We can can also send it straight to the recipient if you leave their address at the checkout.PROFESSIONALLY EMBROIDEREDWe only use the very best in the industry, we're proud to say that our top of the range 16 needle industrial embroidery machine is widely used commerically by many well known brands.   You can therefore be certain that the quality of our embroidered products is second to none.SEE THE FULL RANGE OF SCARVES HEREhttps://www.etsy.com/uk/shop/CreativeBlossom3?ref=hdr_shop_menu§ion_id=35837117LIFESTYLE PHOTOS: please note only the items described above are included in the sale.  Any products featured alongside the described product will not be included in the sale.  We pride ourselves on taking lifestyle photos to show the product within a lifestyle setting to show off the beauty of our products.This is an *original design ©Creative Blossom*As laid out by the UK intellectual Property Office and governed by UK Copyright law (The Copyright, Designs and Patent Act 1988)",
    "reviews": [
      "Beautiful quality and great delivery time.",
      "Bought as a gift. My sister loved it",
      "Could NOT be more pleased. They are beautiful, and I m so very appreciative of you getting them to me in time!!  Recomend these 150%!"
    ]
  },
  {
    "productId": "5KuzEOYszP",
    "url": "https://www.etsy.com/listing/1040973552/jute-bag-with-initials-mothers-day-gift?click_key=054b0358c0941e1db1ff075f6b227133d6e2467b%3A1040973552&click_sum=ce6c0c57&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-5&etp=1&sts=1",
    "title": "Jute bag with initials | Mother's Day gift | Birthday present Mum | Hens party | Personalized Bridesmaid gift idea | Farewell gift teacher",
    "description": "Jute bag for you and your little one with padded handles. The perfect gift idea.(No set offer, please personalize each bag size individually! Shipping costs are only calculated once.)❤︎ Our jute bag is perfect- for your purchases- for collecting herbs, mushrooms, berries,- Mother's Day gift,- Gift for grandma or aunt or best friend- as a souvenir for the girlfriend- Gift to yourself❤︎ Product Information & FeaturesSizes:Mini: 20 x 20 x 11 cm (picture)Small: 26 x 22 x 14 cm (pictured)Large: 30 x 30 x 19 cmJumbo: 42 x 33 x 19 cm (picture armchair)Material and care instructions:- Material: 100% jute- Handle: Solid cotton- Colour: naturalInside is coated and can also withstand liquids and dirt. It is washable. Not suitable for washing machine and dryer.❤︎ PersonalizationMotif and font color: freely selectable.Font colors (large letter / text):- White black- Black / White (as in picture)- Gold / Black- Silver black- Rose / White- You are welcome to add other color combinations under special request. We have significantly more color options, just ask.EXPRESS:Would you like to receive your order faster? Please note our express processinghttps://www.etsy.com/de/listing/1169392478/express-editing-----------------------------Important information:Personalized items are made to order and are therefore non-returnable. Therefore, please check your details before ordering or send us a message before placing an order if you are unsure about the design. If you do not request a preview for approval, the visualization is the responsibility of our design team and does not constitute a reason for complaint if your idea deviates.Jute is a natural product, different strengths and colors of the fibers are part of the characteristic material and therefore do not constitute a reason for complaint!The decoration shown on the product image is not part of the scope of delivery.You can find more great personalized gifts here:https://www.etsy.com/de/shop/JelliesDesign",
    "reviews": [
      "Everything great. Any time. Just beautiful",
      "Ordered and received the next day! Just wow 🤩 ☺️ Thank you 🙏🏻",
      "1A quality and lightning fast delivery 🚚 ♥️♥️♥️♥️"
    ]
  },
  {
    "productId": "cfjpMftCOx",
    "url": "https://www.etsy.com/listing/945331869/personalised-couple-bucket-list-journal?click_key=091974561955302feff6be86a93dfaa1c1e5bdf5%3A945331869&click_sum=5171029d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-6&frs=1&etp=1&sts=1",
    "title": "Personalised Couple Bucket List Journal",
    "description": "This bucket list journal is the perfect way to tick off and record all your adventures with your favourite person!Personalise with your chosen names and personalise the illustration to suit.Each bucket list journal has a tick off list chart with space for you to jot down and record your feelings and memories from the experience, allowing you to keep all those special moments safe.-----------------Personalisation Options:Women (On Left) & Man (On Right), Man & Man or Woman & WomanSkin colour options: Light, Medium, DarkHair colour options: Black-Long, Brown-Long, Auburn-Long, Blonde-Long, Grey-Long, Black-Short, Brown-Short, Auburn-Short, Blonde-Short, Grey-Short, Bald.Please kindly note these options are set.-----------------Made from:The pages of this book are made from 100gsm FSC® and EU EcoLabel certified paper and bound in a quality satin card giving it a soft touch feel.All our notebooks are designed, printed and bound in our studio in Surrey.-----------------Dimensions:W15cm x H21cm",
    "reviews": [
      "Very happy with this purchase! Nice product that's well made. We're excited to start working our way through it and checking boxes!",
      "Lovley item, exactly as pictured&Described. Great seller",
      "Really listened to what I wanted! Love it!",
      "My partner loved this gift"
    ]
  },
  {
    "productId": "sKyHBZJkXG",
    "url": "https://www.etsy.com/listing/1531728115/personalized-greenery-jewelry-dish?click_key=828a63e6b697d2e79e0dd649880f11c576055ad1%3A1531728115&click_sum=3c243a8f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-7&etp=1&sts=1",
    "title": "Personalized Greenery Jewelry Dish • Perfect Bridesmaid or Best Friend Gift • Minimalist Custom Name Gift for Her • Ring Dish • Birthday",
    "description": "Personalized greenery ring dishes are the perfect bridesmaid  or best best friend gift. Our jewelry dishes are super high quality and will become an instant heirloom. Personalize your dish with name and your choice of gold, rose gold, silver, or plain edge. Each dish is kiln fired in our Pennsylvania studio.F E A T U R E S• Material: High Quality Kiln Fired Ceramic• Dimension: 4in. diameter• Rim Finish: Gold ∙ Rose Gold - Silver or Plain• All our jewelry dishes are custom made by hand in our studio ♡• WE DON'T USE: Paint pens, stamps, vinyl transfers, polymer clayO T H E R ∙ I N F O R M A T I O N• All items are nicely packaged ready to gift.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 3 - 6 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)M O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/littlewormstudioI N S I D E ∙ S C O O P• IG: @littlewormstudioThank you so much for visiting and hope you enjoy shopping with us ♡Kathleen ♡",
    "reviews": [
      "Have got this for two gifts now and both people have loved it!",
      "It was the perfect birthday gift for my stepmom!",
      "Great quality product. Highly recommend",
      "It was beautiful and it was quick shipping"
    ]
  },
  {
    "productId": "LUMQgfmpRp",
    "url": "https://www.etsy.com/listing/1036017496/personalized-family-name-sign-crossword?click_key=0035f66240ee3691db64d7e3c7cfb8b94d9f6611%3A1036017496&click_sum=d6cb7964&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-8&frs=1&etp=1&sts=1",
    "title": "Personalized Family Name Sign, Crossword Scrabble Print, Custom Family Letter Tile Print, Name Puzzle, Last Name Sign, Best Friend Gifts",
    "description": "Personalized Family Name Sign Print with Crossword Scrabble Letter Tile Style.Personalized with the names of your loved ones (family members, best friends, etc.)===== How to Order =====Please in the personalization section, write down:1. The names that you wish to be included.2. Other words that you'd like to include, for example, \"LOVE\" or \"FAMILY\".3. The title at the bottom of the print, for example, \"The Jones Family\" or \"Our Family\".4. For print-ready files, please enter the size of the print. You will receive an email with a high-quality 300dpi PDF file for printing.5. For physical prints, frames are not included. It's only the prints that will be sent to you.You will receive a draft for your approval within 24-48 hours of ordering. Please remember to check your Etsy messages so that your print can be sent out as soon as possible.===== Printing & Shipping =====The print would be printed on high-quality matte cardstock or a large-format matte bond poster roll. Physical prints will be professionally printed and shipped to you within 3-5 business days. Please make sure your shipping address is up to date.*All these posters are designed by me. It is for your personal use only. You may not share, alter, make copies, or re-sell these posters or their digital files. Please kindly direct anyone who is interested in purchasing these posters to my Etsy shop. Thank you!",
    "reviews": [
      "I loved how quick the response was and how they helped me.",
      "Thank you for supporting our small business.",
      "Family loves it. Cute and unique.",
      "Thank you for supporting out small business.",
      "So accommodating and easy to work with! Love my final product!",
      "Thank you so much for your positive feedback!"
    ]
  },
  {
    "productId": "GPktJDQpVH",
    "url": "https://www.etsy.com/listing/1532612369/custom-makeup-bag-personalised?click_key=ac0401767553b915e68d034ce5cb24932f95be96%3A1532612369&click_sum=d7bcdbcc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-5&pro=1&frs=1&pop=1&sts=1",
    "title": "Custom Makeup Bag, Personalised Bridesmaid Gifts, Wedding Gift, Travel Toiletry Bag, Cosmetic Bag, Birthday Gift for Her, Mother's Day Gift",
    "description": "💕Indulge in the elegance of velvet with exquisitely makeup bag & toiletry bag.  are a cute gift for women, It’s a practical and memorable gift for them. Handcrafted with care and precision, this bag serves as a luxurious home for all your beauty essentials.  is also a perfect thank you gift, birthday gift, maid of honor gift, mother's day gift, and much more...is perfect for travel!Want it faster? Expedited Production & Expedited Shipping Service is available.See this link:https://www.etsy.com/listing/1373117202- Material: 100% Italian Velvet- Customized Heat Stamp (Gold by default)- Size: Perfectly sized to accommodate all your beauty essentials or your bathroom items: toothbrush, cream, face moisturizer, brushes etc- Good for travel: small and easy to carry- Personalization: Add your name or initials for a custom touchEach bag can be personalized with the name of your loved one, top quality guaranteed.ANY QUESTIONS? Send me a message and I will be there to help.",
    "reviews": [
      "Great bag and fast shipping!",
      "Quality and appearance of the makeup bags are amazing! Will definitely be purchasing more as gifts throughout the year! There was a slight hiccup in one personalization. Seller was quick to respond and send a new one promptly! Great business!",
      "Received one of these as a gift for Christmas. Ordered one for my sisters birthday. Nice makeup bag!"
    ]
  },
  {
    "productId": "xBazgRvoQA",
    "url": "https://www.etsy.com/listing/1621353766/personalized-grandma-sweatshirt-with?click_key=c63545a205505391538a28bbb419406edb2aa12d%3A1621353766&click_sum=9e971073&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-6&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Grandma Sweatshirt with Grandkids Names on Sleeve, Custom Granny Sweater, Est Date Gramma Sweatshirt, Gift for Grandma,pr436",
    "description": "Personalized Grandma Sweatshirt with Grandkids Names on Sleeve, Custom Granny Sweater, Est Date Gramma Sweatshirt, Gift for Grandma!!!IMPORTANT!!!!FOR LONG SLEEVE SWEATSHIRT, PLEASE MAKE SURE YOU CHOOSE THE SWEATSHIRT  OPTION FROM THE SHIRT SIZE LISTING.If you are not sure how to choose it, please contact us.*** HOW TO ORDER ***1.Select Shirt STYLE and SIZE from 1st drop down2.Choose the SHIRT-SWEATSHIRT OR HOODIE  COLOR  from the 2nd drop down3. Check your shipping address to make sure it's correct4. Complete checkout***DISCRIPTION***-Personalization box is only for design/text color information.- We have 3 different tshirt brand that we use, if you only want one particular brand please ask the seller for availability, if you do not ask we will ship the available brand.(Bella Canvas-Gildan soft style-Laviva)***PRODUCT INFO***BELLA CANVAS BRAND:- Bella Canvas Brand- Solid colors are 100% combed and ring-spun cotton- Heather colors are 52% combed ring-spun cotton, 48% polyester- Side-seamed. Retail fit. Unisex sizing. Shoulder tapingGILDAN BRAND :- 50% Cotton, 50% Polyester- Printed with the highest quality and durability- Wash on cold & hang to dry for best results*** SHIRT SIZING INFO ***Listing photos contain the measurements for the unisex Shirts-Sweatshirt-Hoodie. Double-check your measurements to make sure you order the proper size all since we do not offer returns/exchanges.*Width is measured across the shirt (armpit to armpit). 1\" below armhole.",
    "reviews": [
      "Grandma loved this birthday gift!",
      "Great quality and fast shipping!",
      "Amazing gift for a new grandparent!",
      "Great quality and love the color!!!"
    ]
  },
  {
    "productId": "kOqiNKUNsD",
    "url": "https://www.etsy.com/listing/1583248854/customized-leather-portfolio-custom?click_key=301ce512104e3683282e97e0f2c4328c39317ad4%3A1583248854&click_sum=64c658ea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-7&pro=1&frs=1&bes=1",
    "title": "Customized Leather Portfolio, Custom Refillable Portfolio, Personalized Zipper Portfolio, Corporate Gift,  Personalized Notebooks",
    "description": "This portfolio is made of high-quality leather to provide you with a superior writing and storage experience.📒 Size:Portfolio dimensions: 12x10 inchesLined Notepad Dimensions: 8.5x11.75 inches👜 Material: Synthetic Vegan Leather🎨Portfolio Color and Font Color Options: Black (Gold font), Gray (Black font), Marble (Black font), Rawhide (Black font), Dark brown (Gold font), Light Brown (black font) .🛒 :How to order1. Please select a portfolio color.2. Please select Position.3. In the personalization, please write your Design Choice and Name for the cover.✦ If you choose inside 1 or 2, please write the \" Quotes\" and/or \"Card Holder Name\".✦ Name is limited to 2 words only.✦ If time is a critical factor for you, feel free to get in touch with me.✦ If you have your own design or logo, please send it to me via message.🤗⛅ Introduction to the portfolio:① Leather material: This collection is made of high-quality leather material, high-end and elegant.② Soft fleece interior: protects your important documents and devices.③ Personalization: You can engrave your own text, slogan or logo on the interior.④ Business card bag: Can hold business cards.⑤ Replaceable notebooks with inner pages⑥ Security zipper: Keep your files and devices safe and secure.⑦ Middle pen slot⑧ Internal storage: enough space to safely store Tablet Computer or Other Items.⛅Wide range of applications:Whether you are a student, professional, traveler or creative, this versatile leather zipper bag can meet your diverse needs.Thank you for visiting and if you have any questions, please feel free to contact me!",
    "reviews": [
      "Just like in the picture! Good quality and will surely make my friend happy:)",
      "Exactly as advertised, would recommend 100%",
      "The delivery was faster even the promised, and the product really beautiful.",
      "Thank you, we finally received."
    ]
  },
  {
    "productId": "lMXvKpGsJL",
    "url": "https://www.etsy.com/listing/1097017861/personalized-name-necklace-gift-for-her?click_key=2a1c61e8732f18a858219a499cfeba0d75c3e758%3A1097017861&click_sum=146a8026&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-8&pro=1&frs=1&pop=1&sts=1",
    "title": "Personalized Name Necklace,  Gift for Her,  Personalized Gift, One of a kind Jewelry, Gold Name Necklace, handmade gift, Gifts for mom",
    "description": "Mothers Day gift NecklaceThis necklace brings you a chance to carry your name in style.We will design your name in a stylish unique logo.It is a passion for immaculate design and an innate understanding of the woman and her journey that drives Roberto Gold.Roberto Gold has always challenged traditional notions that endorse the view that jewelry was meant to display one's status and be worn sparingly.This Name Logo necklace is designed to make your daily wear meaningful, with artistic pieces that reflect your individuality, resonate with personal meaning, are crafted to be wearable, and celebrate your every day.Roberto Gold launched three years ago and what an amazing journey it has been. The pinch-me highlight would be coming to understand the magnitude of the community of wonderful clients around the world we created and who are the real heart of the brand.This piece of jewelry is designed especially for our 3rd anniversary.Features:⏺ MATERIAL: 925K Sterling Silver⏺ COLOR: Silver, 14k Gold, 14kRose GoldChain Lengths- 14 inches- 16 inches- 18 inches- 20 inchesPlease visit our name bracelet and earring listinghttps://www.etsy.com/listing/1576367253Letter Necklace, Initial necklace, name necklace, gifts for her, gold necklace, gift necklace, initial jewelry",
    "reviews": [
      "Beautifully made. I enjoy wearing it.",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️"
    ]
  },
  {
    "productId": "xRLGrsBJuj",
    "url": "https://www.etsy.com/listing/648256322/personalized-leather-journal-custom?click_key=e0578929d64f054807646ce75471aea422088938%3A648256322&click_sum=4d761c34&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-9&pro=1&etp=1&sts=1",
    "title": "Personalized Leather Journal, Custom Refillable Rustic Notebook, Leather Gift, Leather Diary, Traveler's Notebook Cover, DuPage",
    "description": "Write all about it. Keep your diary, notes and writings in an elegant leather journal crafted to last.Add firebranded initials for the perfect leather gift. Now available in eight different colors!- 𝐩𝐫𝐨𝐝𝐮𝐜𝐭 𝐝𝐞𝐭𝐚𝐢𝐥𝐬 & 𝐢𝐧𝐟𝐨𝐫𝐦𝐚𝐭𝐢𝐨𝐧 -✳ 3 SIZES: Find your ideal travel journal from three convenient sizes. All journals have a convenient pen loop.ෆ Pocket  (5.5” x 3.5”)ෆ Midi  (7” x 5”)ෆ Full  (8.25” x 5.75”)✳ FULL GRAIN LEATHER: Each leather journal  is crafted from minimally processed cowhide that varies in grain pattern and markings-for crafts as unique as you.✳ 88 PAGES: Each refillable journal insert has 44 sheets (88 pages total). Choose from blank or unlined pages. Additional journal refills can be purchased here:https://www.etsy.com/listing/655404145/✳ PERSONALIZED JOURNAL:  Customize your writing journal with firebranded initials. A personalized leather journal makes the perfect  gift for any occasion.- 𝐚𝐯𝐚𝐢𝐥𝐚𝐛𝐥𝐞 𝐜𝐨𝐥𝐨𝐫𝐬 -✳ Aqua Green✳ Black✳ Chestnut Brown✳ Cinnamon Brown✳ Green✳ Mahogany Brown✳ Rock Gray✳ Turquoise Green- 𝐩𝐞𝐫𝐬𝐨𝐧𝐚𝐥𝐢𝐳𝐚𝐭𝐢𝐨𝐧 𝐢𝐧𝐬𝐭𝐫𝐮𝐜𝐭𝐢𝐨𝐧𝐬 -𝑓𝑜𝑟 𝑓𝑖𝑟𝑒 𝑏𝑟𝑎𝑛𝑑𝑒𝑑 / 𝑚𝑜𝑛𝑜𝑔𝑟𝑎𝑚𝑚𝑒𝑑 𝑖𝑛𝑖𝑡𝑖𝑎𝑙𝑠✳ Please enter your request exactly as you’d like it to appear.ෆ 6 characters maximum (including spaces and special characters).✳ No inside embossing.✳ Fire-branded initials are available in Times New Roman font only.✳ Case-Sensitive: Enter your request exactly as you'd like it to appear.✳ Initials will be embossed on the bottom right.✳ Accepted Characters:ෆ All Latin UPPER and Lowercase Letters (ABC abc)ෆ All Numbers (0123);ෆ Special characters: , . ! @ # $ % & * ( ) - + ? ♥ “ෆ No accents or emoji- 𝐩𝐞𝐫𝐬𝐨𝐧𝐚𝐥𝐢𝐳𝐚𝐭𝐢𝐨𝐧 𝐢𝐧𝐬𝐭𝐫𝐮𝐜𝐭𝐢𝐨𝐧𝐬 -𝑓𝑜𝑟 𝑙𝑎𝑠𝑒𝑟 𝑒𝑛𝑔𝑟𝑎𝑣𝑖𝑛𝑔✳ Send your logo/artwork via Etsy messages.✳ Include placement (centered, bottom right, top centered, etc.) and size requirements (if applicable).✳ Proof will be provided within 24 hours (except weekends).𝑒𝑛𝑔𝑟𝑎𝑣𝑖𝑛𝑔 𝑟𝑒𝑚𝑖𝑛𝑑𝑒𝑟𝑠ෆ Logo/artwork must be finalized and in .png, .jpeg, .svg, .ai, .psd, or vector format.ෆ Black & white logo/artwork preferred.ෆ High-resolution images work best (at least 500px minimum). If a logo is too small and fine to create clear outlines, we will reach out to you for an alternate file.ෆ We do not offer custom design work.- 𝐦𝐨𝐫𝐞 𝐩𝐞𝐠𝐚𝐢 𝐜𝐨𝐥𝐥𝐞𝐜𝐭𝐢𝐨𝐧𝐬 -✳ More PEGAI travel items and collections:https://www.etsy.com/shop/PEGAI?section_id=36772866✳ More PEGAI bag designs and collections:https://www.etsy.com/shop/PEGAI?section_id=36786255✳ More PEGAI wallet designs and collections:https://www.etsy.com/shop/PEGAI?section_id=36786265- 𝐠𝐢𝐟𝐭𝐬 𝐟𝐨𝐫 𝐞𝐯𝐞𝐫𝐲𝐨𝐧𝐞 -✳ All PEGAI products are ready-to-ship. We know our crafts are popular choices for gifting to your loved ones.- 𝐟𝐫𝐞𝐪𝐮𝐞𝐧𝐭𝐥𝐲 𝐚𝐬𝐤𝐞𝐝 𝐪𝐮𝐞𝐬𝐭𝐢𝐨𝐧𝐬 -✳ Do you accept bulk orders?ෆ Absolutely! Kindly reach out to us for additional assistance.✳ How long is the processing time?ෆ Please give us two to three business days before we can ship your order. Processing time is different from shipping time.✳ How long is the shipping time?ෆ For Standard shipping, it might take three to seven business days before you can receive the package depending on your location and courier speeds.ෆ In a hurry? You can upgrade your shipping to 2-day Express Shipping upon checkout. Please note that “2Day” is just in reference to transit time, not the time it takes to personalize and fill your order.ෆ Free shipping is available for US customers if your order total reaches $35 and above.✳ Can I have my logo or artwork engraved on the journal?ෆ Yes! You may choose the \"Laser (Logo/Artwork)\" option above. Kindly send the logo/artwork to us via Etsy messages. Proof will be provided within 24 hours.ෆ Please note that laser engraving is not available for our Black DuPage journal because we're afraid that the logo, image, or request might be very readable when engraved.ෆ For the best laser engraving results, we highly recommend choosing light-colored leathers (Cinnamon Brown, Mahogany Brown, Turquoise Green, or Aqua Green).✳ Can I add fire branded initials and laser-engraved artwork on the journal?ෆ Yes! You can choose \"4 Characters + Laser\" in the options above. Proof will be provided for the laser-engraved artwork within 24 hours.✳ Can I engrave logo/artwork inside the journal?ෆ Yes! Logo/artwork can be engraved anywhere in the journal, but in only one surface.ෆ If you wish to engrave something on the outside AND inside, this will count as TWO laser engraving.ෆ You can purchase additional laser engraving here if you wish to engrave something on the inside and outside of the journal:https://www.etsy.com/listing/642184269/✳ There are marks and scratches on my journal. Is this a defect?ෆ No, marks and scratches on leather are not defects. These are on the leather by its nature. PEGAI only uses minimal finishes on these leathers to accentuate the hide grain's natural beauty and embrace the imperfect elegance of nature's intention.ෆ These finish types do NOT cover any imperfections such as bug bites, veins, fence scratches, and other markings that tell a story about the animal's life. To us, leather is a living object, and it has to be treated with respect at all stages of this crafting process.ෆ Please also note that our products are prone to scratches. Kindly refer to our leather care tips below to maintain the longevity of your Pegai products.- 𝐟𝐮𝐥𝐥 𝐠𝐫𝐚𝐢𝐧 | 𝐜𝐫𝐚𝐳𝐲 𝐡𝐨𝐫𝐬𝐞 𝐝𝐢𝐬𝐭𝐫𝐞𝐬𝐬𝐞𝐝 𝐥𝐞𝐚𝐭𝐡𝐞𝐫 -We tan only the cleanest and responsibility sourced heavy steer hides to perfection with our 5 decades old tanning recipes.We give the top layer a slight buff to achieve the nubuck look with a pleasant velvety feature. Then we infuse our secret combination of waxes to make this leather interactive to touch. The end result is a minimally finished full grain hide that will age beautifully with use.Enjoy and embrace the nature of leather that hasn’t been scrapped of its character for the sake of standardization and mass-manufacturing!- 𝐰𝐡𝐢𝐜𝐡 𝐢𝐭𝐞𝐦𝐬 𝐚𝐫𝐞 𝐫𝐞𝐭𝐮𝐫𝐧𝐚𝐛𝐥𝐞 -✳ 𝑢𝑛𝑢𝑠𝑒𝑑, 𝑛𝑜𝑛-𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑒𝑑 𝑖𝑡𝑒𝑚𝑠ෆ These items can be returned within 30 days of delivery. The customer will be responsible for their own return shipping method.✳ 𝑛𝑜𝑛-𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑒𝑑 𝑖𝑛𝑐𝑜𝑟𝑟𝑒𝑐𝑡 𝑖𝑡𝑒𝑚ෆ The team will send a pre-paid label so we can get the item back in the workshop. We will then replace it with the correct item or offer a full refund (whichever the customer prefers).✳ 𝑑𝑎𝑚𝑎𝑔𝑒𝑑 & 𝑑𝑒𝑓𝑒𝑐𝑡𝑖𝑣𝑒 𝑖𝑡𝑒𝑚ෆ Kindly send a picture of the damage or defect via Etsy messages so that we may further assist with repairs and replacements.✳ 𝑟𝑒𝑚𝑖𝑛𝑑𝑒𝑟𝑠ෆ Please note that personalized items that were correctly fulfilled and are not damaged nor defective are non-returnable and non-refundable.ෆ Shipping fees and customs fees (if applicable) are also non-refundable.ෆ Please note that due to the nature of our leather, we do not consider natural markings as item defects. This is simply because we only work with minimal leather finishes to accentuate the hide grain's natural beauty and embrace the imperfect elegance of nature's intention. These finish types do not cover any imperfections such as bug bites, veins, fence scratches, and other markings that tell a story about the animal's life.- 𝐨𝐭𝐡𝐞𝐫𝐬 -MORE PRODUCTS:https://www.etsy.com/shop/PEGAILEARN MORE ABOUT LEATHER: Follow our founder on his social media accounts: @tanner.leathersteinLEATHER CARE: Truly luxurious leather showcases its preserved grain characteristics.The appearance of vein marks, minor scratches, variations in color and grain marks are not defects, in fact they are the hallmark of true artisan grade leathers.To ensure the care and longevity of your Pegai craft:ෆ Store in a cool, dry place.ෆ Avoid prolonged exposure to sunlight or rain.ෆ Wipe away excessive moisture with a soft dry cloth.BRAND'S STORY: PEGAI was established in 2017 and is headquartered in Dallas, Texas. Their Chief Craftsman, Tanner Leatherstein, found that there is a lack of knowledge about leather in the general public. Not everyone knows how to assess if the leather is good or if it’s perfect for their needs. PEGAI addresses this problem in two ways.Through offering them examples of what good leather craftsmanship is under PEGAI. They created the brand to help people make a statement through premium leather goods in the most authentic and stylish way possible. Their hope is that people can enjoy leather in its natural beauty and lessen the gap between their expectations and experiences about leather.Through giving small craftsmen the opportunity to use the same leather that we use. PEGAI gave small craftsmen and hobbyists access to all of their unique, most beautiful, cleanest, and rarest leather hides. This is available in their other brand: Tannerstein.Thank you so much for visiting and please let us know if ever we can help you further!",
    "reviews": [
      "Item arrived quickly and was as described. Love the smell of leather",
      "This is super high quality!",
      "Quick shipping and great gift. Thank you!",
      "This was the best gift I’ve ever given someone. They loved it. The quality and attention to detail was great. 5 stars"
    ]
  },
  {
    "productId": "GuqnUoRnya",
    "url": "https://www.etsy.com/listing/1430684940/custom-engraved-birth-month-flower-wine?click_key=622c8085ec314d3ac915d2389efa3ffbd92ea319%3A1430684940&click_sum=ccb970f0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-10&etp=1&sts=1",
    "title": "Custom Engraved Birth Month Flower Wine Glass - Personalized Birth Flower Glass, Gift for Mom, Best Friend, Bridesmaids or Birthday Gift",
    "description": "A Gift They’ll Love…Give a gift your loved ones will appreciate and that is sure to last a lifetime.  These professionally engraved birthday month wine glasses make for a thoughtful gift for mom on mothers day, best friends, bridesmaids, sisters, bridal shower, etc.. Also, our personalized cups are individually boxed, so they are ideal for gift giving.To Place an Order…To order, first select the wine glass type you’d like. Then select the design…”Birth Month Flower”. To add a bit of personalization, you can also add in the name and birthday to be engraved on the glass as well. To see our full range of glass types and font styles, visit our Yay! Personalized Gifts Store at the top of this page.Other Glass Types and Designs…Looking for a different design or glass type?  You can see our wide variety of designs and glass types by visiting our Yay! Personalized Gifts Storefront:https://www.etsy.com/shop/YayPersonalizedGiftsor simply message for a custom order.Premium Quality Glasses & Engraving…Each of our glasses are chip resistant and made from high quality glass to ensure a longer lifetime.  Our glasses are permanently laser etched using industrial engraving machines, which gives you a cleaner, deeper engraving.  No cheap or hobby engraving... only high quality, professional level work.  Plus laser engraving is more durable than vinyl or screen printed designs, so your personalized gift is sure to last for years to come. All glasses are dishwasher safe and lead free.Custom Services Available…We offer a wide range of services to ensure you have the best experience and get the exact personalized engraving you want!  Would you like to add a custom message on the backside?  Need a proof or sample engraving?  Would you like our designers to help you with a custom design?  Ordering for multiple addresses? ...let our team help save you time by sending us a csv file with your addresses or designs and our team can handle the rest.  Contact us directly to request a custom service or see our store front.  Additional fees may apply.Fast Engraving and Shipping…We handle your order with care and ship it out fast!  Our Standard Timeframe is: 1. One business day for design. 2. One to two business days for engraving. 3. One day for USPS pickup. 4. Two to five days of transit via USPS from Ohio. If you need your order by a specific date, please contact us directly and we will do our best to accommodate.  We can cancel an order up to 6 hours after you place your order, but unfortunately, we do not accept returns due to customization.Handmade in Ohio…Your order is custom designed and professionally engraved by our team in Columbus, Ohio. If you have any custom design requests, questions about available glassware, or needs for volume discounts, please contact us directly, and we’d be happy to help.Cancellation and Returns…We accept cancellations up to 6 hours after you place your order. Unfortunately, we do not accept returns due to customization and engraved to order process, however if there is something wrong with your order, please do not hesitate to contact us so we may correct it for you.100% Satisfaction Guarantee…Each glass is individually wrapped in bubble wrap and gift box and then packaged in an exterior box to ensure safe delivery.  However, if your glass happens to break or you are not completely satisfied for whatever reason, please contact us. We will fully REPLACE your glass and make it right!",
    "reviews": [
      "Ordered this a birthday gift for my friend, and she loved it! It's a unique and personal gift, I recommend.",
      "Great product, described great and met expectations",
      "Was a perfect gift for someone who broke their favorite glass!",
      "I’ve ordered from this shop 3x now. Each time has been a wonderful experience with great quality!!"
    ]
  },
  {
    "productId": "QawfRDCtKg",
    "url": "https://www.etsy.com/listing/667282692/personalized-walletmens-walletengraved?click_key=cc62a252cf5b215f60e1508e91ed10ebca2aa870%3A667282692&click_sum=0534e278&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-11&pro=1&etp=1&sts=1",
    "title": "Personalized Wallet,Mens Wallet,Engraved Wallet,Groomsmen Wallet,Leather Wallet,Custom Wallet,Boyfriend Gift,Anniversary Gift for Him",
    "description": "🔥 STYLISH, SPACIOUS, SAFE and SENTIMENTAL. With handcrafted exquisite top-grain leather from Argentina, RFID blocking technology, and the option for custom engraving, this bifold wallet makes the perfect custom-made gift for him.Add initials, favorite catchphrase, quote or inside Joke,  even logo to make it extra unique and special! 😍🌈Color Difference: The first 5 pictures is \"Brown\", the next 3 is \"Black\", the last two is \"Tan\".Black and Tan has a more smooth surface. And tan is lighter than brown.👉 ENGRAVED MESSAGE INSTRUCTIONSAt the last page of checkout, below the Submit Order button, there is a box where you can “Add an optional NOTE to the seller.” Simply leave your engraving instructions there and you are all set! If you do miss this step, simply shoot us an message and we will make it right!- For \" Front Side Only \": The ENGRAVED MESSAGE can be either name or initials.For logo, there's an extra charge of $10, and please contact us and send a picture with a white background.- For \" Inside Right or Inside Left \" : The ENGRAVED MESSAGE can be up to 5 lines.  Approx. 4-5 words per line. We will center the message, except for 2-3 letters initials we will engrave at the corner.*We are only able to engrave exactly what the customer put. We're not responsible for any typo provided by the customer. If two slightly different version is provided, the typed instruction overrides the original version.Please make sure everything is correct before you submit the order. We'll do our best to answer any  change request, but no guarantee for any changes.Every single one of our beautiful wallet is handcrafted to perfection and subject to rigorous quality control standards. It comes in a quality, function and style that are unavailable from competing product:- It’s made with top grain ARGENTINIAN LEATHER that has a pleasant smell. It softens naturally with use and ages beautifully with time. The inside pocket material is nylon fabric.Classic Wallet:-Each of the 12 card slot is equipped with RFID BLOCKING lining, keeping your personal and financial info safe. 👮-Measuring only 4.3\" x 3.5\" when closed, our wallet has a huge capacity of 10 card slots in total-8 visible card slots, 2 hidden slots underneath each side,  and 1 NON-REMOVABLE Flip up ID Windows, which you can put ID or photos on both sides. It even has a split billfold to keep your money and receipts organized.👍Minimalist Wallet:-Each of the 6 card slot (2 are hidden on each side right under the 4 card slots) is equipped with RFID BLOCKING lining, keeping your personal and financial info safe. 👮-Measuring only 4.2\" x 3 x 0.4\" when closed, our wallet has decent capacity of 6 card slots (2 are hidden underneath on each side) and 1 ID Window, which is the back of the wallet. Let you carry all your essentials while keep the wallet thin.-Our wallet delivers the function and the style like any expensive wallet out there,  but only at a fraction of the cost. As a U.S.-based family business, we are passion about cutting out all the middleman so we can offer you the best deal possible.💰Our wallet makes a perfect gift for him on his Birthday, Anniversary, Graduation, Wedding, Thanksgiving, Christmas, or Father’s Day, or even just a treat for yourself! Click “Add to Cart” right now and order yours today!",
    "reviews": [
      "It was a great gift. He loved it very much!!!",
      "A gift for my husband. He likes it.",
      "I love the wallet. Looks great!"
    ]
  },
  {
    "productId": "aXTFLTweqb",
    "url": "https://www.etsy.com/listing/872950692/anniversary-gifts-personalized-cutting?click_key=bcda3d1b0cd6a927bf7bfad5ae9e010b0ce5a4ee%3A872950692&click_sum=92ef988c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Anniversary Gifts, Personalized Cutting Boards, Anniversary Gifts for her, Gifts for Couple, Gifts for Him, Gifts for Husband, Custom Boards",
    "description": "Custom engraved cutting board or cheese board with your choice of design! This professional-grade cutting board makes a great unique gift for any occasion! Easy to maintain board with high-quality construction of bamboo, maple, or walnut. Hand wash is recommended.>>>Due to the nature of bamboo, walnut and maple wood, the coloring, markings, knots, and rustic characteristics will vary and may result in lighter and darker areas in the engraving and wood boards.  Each board will be unique.<<<PRODUCT DETAILS:- All Boards Measure 14\" x 10\"- 0.80 inch THICK- Hand Wash Only. Polish with mineral oil for upkeepENGRAVING OPTION:Personalize any design with any name, date, or address!HOW TO ORDER:1. Select board material & engraving location2. Select design option3. Add your personalization in the instructions boxFAQ:WHEN WILL I GET MY ORDER?With \"Standard Shipping\" the order can arrive within 15 business days.For Faster Delivery, please select an upgraded shipping option at checkout!International Shipping: Standard international shipping is 2-3 weeks to your delivery country. Please note the BUYER is responsible for all duties and taxes accessed by your country. Potential duties and taxes are not included in your shipping price.HOW DO I CUSTOMIZE MY ITEM?Before you add the item to your cart, type your customization in the \"add your personalization\" box. At checkout there will also be a \"Add note to seller\" box where you can further describe your engraving details and personalization.DO YOU OFFER ANY DISCOUNTS?Yes! My current promotions and bulk purchase discounts can be found in the Announcement Section near the top of my Shop Home page!Follow me on Instragram & Facebook @engravemymemories and Pinterest @EngraveMM",
    "reviews": [
      "The quality is really nice and the shipping was fast even during the holiday season.",
      "PERFECT FOR BUSINESS ALL MY CLIENTS LOVE IT, GREAT CUSTOMER SERVICE HIGHLY RECOMMEND!",
      "This was such a fun gift for dad on his 50th birthday!",
      "It turned out beautiful & I can’t wait to display it"
    ]
  },
  {
    "productId": "BHkeQVIbMS",
    "url": "https://www.etsy.com/listing/1029301545/custom-star-map-print-night-we-met?click_key=91899345843917e7216f64a6c2fac6c36a8b426d%3A1029301545&click_sum=4ca7d9c0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Star Map Print, Night We Met Anniversary Gift, Night Sky Print, Star Map Poster, Wedding Gift, Constellation Print, Personalised Gift",
    "description": "Paper Emporium Co - Star Range - The Night We Met or Custom TitleOur Personalised 'Star Maps' are fully personalised to that special date. A simplistic yet stylish addition to existing home décor for a special anniversary gift with a personal touch!Before Printing I will always send a proof for your approval and can amend where needed :) Fully customisable to the location, dates and/or events that our special to you and your loved ones!!C U S T O M I S A T I O N:Before Printing I will always send a proof for your approval and can amend where needed :) Fully customisable to the location, dates and/or events that our special to you and your family!!P A P E R:I love paper and so use the finest premium stock. They are professionally printed ensure a beautifully rich & vivid finish. (Excluding Digital Only Purchase)F R A M E S:Enhance your star maps by selecting one of our frame options available for purchase with this listing. Each frame features a quality, thin profile black wood design, with no mounts (see listing images 2-10 for example)Need something else? Just drop me a message and ill get right back to you!S I Z E S:Choose from our wide range of sizes to suit your space perfectly:'A' Sizing (UK Standard)A5 - 14.8cm x 21cm / 5.8 x 8.3 inchesA4 - 21cm x 30cm / 8.3 x 11.7 inchesA3 - 30cm x 42cm / 11.7 x 16.5 inchesA2 - 42cm x 59.4cm / 16.5 x 23.4 inchesA1 - 59.4cm x 84.1cm / 23.4 x 33.1 inchesImperial Sizing5 x 7 inches8 x 10 inches11 x 14 inches12 x 16 inches16 x 20 inches18 x 24 inches20 x 28 inches24 x 36 inchesMetric Sizing30 x 40cm40 x 50cm50 x 70cm60 x 90cmLooking for another size? Just send me a message :)S H I P P I N G:- A4 Maps (and smaller) are sent in hard back envelopes- Larger Maps are well packed and sent inside a Postal Tube- Digital Only Option Sent Electronically Within 1-3 working days*D E L I V E R Y:Free and Fast Delivery. Maps will be dispatched within 1 or 2 working days of your order, depending on level of customisation required and your design approval**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Frames are for Illustration purpose only and are not included.Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Excellent work and very accommodating",
      "Excellent work and very accommodating",
      "Excellent work and very accommodating",
      "Excellent work and very accommodating"
    ]
  },
  {
    "productId": "nIKNGIDNPv",
    "url": "https://www.etsy.com/listing/1421865778/mom-puzzle-sign-mothers-day-gift-from?click_key=794495a784339b4c5f80e3ac487e381bf89dda0d%3A1421865778&click_sum=5bf09632&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-14&pro=1&frs=1&etp=1&sts=1",
    "title": "Mom Puzzle Sign Mother's Day Gift from Kids Husband Custom Engraved Wood Sign Piece That Holds Us Together Grandma Gift Personalized Unique",
    "description": "This sign is a unique and elegant way to give mom a meaningful gift for Mother's Day, birthday, or Christmas.  Handmade with love in our Michigan studio, this sign is a beautiful addition to modern farmhouse decor.  Customizable for other great women(or men!) in your life, such as grandma, mimi, nanny, granny, nonna, grams, or add a name instead.PRODUCT DETAILS:-Made from maple, birch, cherry wood, and MDF-Laser engraved and personalized with names-Measures 6\"x9\"-Request a paw print to be engraved next to your pet names! (Free of charge)-Request a heart to be engraved next to lost ones you'd like to commemorate. (Free of charge)-Purchase extra pieces to add in the future, with free engraving services for that piece.-Upgrade in size available, please inquire-An option of a display stand is available-You can also hang with a command strip or add hardware (not included)-Choose up to 12 names/puzzle pieces (includes mom)-Please refer to the diagram as to how names are placed based on the number of names requested to be engraved.PLEASE NOTE:-The longer the name, the shorter it will need to be to fit in the engraved area-Information given in the personalization box will be COPIED AND PASTED, so please check spelling and capitalization.-As  with all wood products, there will be natural imperfections and variations in the grain of the wood.Please feel free to message me with any questions! Thank youPlease read to understand how your order will be processed:-Production time and shipping times are different.  This info is shown before you placed the order and can be found under your purchases.-Due to the highly customized nature of our items, and that they are produced from various materials, we need time to make them. Our processing time is approx 3-10 days, depending on holidays and seasonal demands. Being a small studio, our products are truly made with love and care.-As part of our process, shipping labels are FIRST created to match with your order, then it moves into production. It will be shipped out a few days after the shipping label is created. Even though the shipping label has been created, this  does not mean it has been shipped.-Not providing complete information or providing incorrect info in the required fields for personalized items may delay production. Please check your Etsy emails for communication as we will attempt to get more info- this is the only way we communicate.  We do not text or email outside of Etsy.-Your package is traveling from our studio in Michigan.  The closer you are to us, the sooner you'll receive your item.  With Ground Advantage through USPS, that is usually 3-5 days.  With Priority, it is 2-4 days. The only exception for shipping guarantee is is if you purchased Priority Mail Express.  That is USPS GUARANTEED delivery within the next day or 2 day shipping.  They operate 365 days a year.-Once items leave our studio, we cannot guarantee shipping and delivery as it travels through USPS routes from our studio to you.  We are not responsible for lost packages and carrier delays since this is out of our control.-Est shipping time may be longer than noted in your purchase due to carrier delays, holidays, etc.-Tracking info is usually available 2-4 days after the shipping label is created.  Tracking info can be found in your order, however, this may not always be accurate or current. Tracking info is sometimes not updated at all until delivery. When packages are marked \"delivered\" but are not received, this may be a carrier delay or your item has been lost in the mail.-Any changes made to personalized purchases, such as a change in address, size, etc. may delay production.Please understand that once it leaves our studio, the package is in USPS hands and we have absolutely no control over the route it takes or how they process the packages to get to you.  We understand that it may seem like something we should be able to resolve when issues arise, but we are at their mercy.If you have any problems or questions about your purchase, please reach out to us.  We respond to every message within 24 hours. We highly request you reach out to us before leaving a review.  We pride ourselves in our products and services and will work with you to resolve all issues.Come check out behind the scene and store updates on our Instagram @gifter_studio!",
    "reviews": [
      "Great item got as gift for mom",
      "I bought this as a gift and the recipient loved it!",
      "Wonderful and a prefect gift"
    ]
  },
  {
    "productId": "jHuVrSyu9m",
    "url": "https://www.etsy.com/listing/1093127621/sliver-pet-portrait-keychainpersonalized?click_key=2f147cabef533ca662c2edc43a539319fce50e51%3A1093127621&click_sum=4d9734c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-15&pro=1&frs=1&etp=1&sts=1",
    "title": "Sliver Pet Portrait Keychain,Personalized Pet Dog Memorial Keyring,Engraved Photo keychain,Custom Lover Gift,Pet Memorial Gift,Dog Keychain",
    "description": "Welcome to ZebraHandmadeJewelry shop ♡---The Option Silver/Gold/Rose Gold refers to the color is plated on 925 Sterling Silver;Titanium Silver/Gold/Rose Gold refers to the color is plated on Titanium ;Copper Silver/Gold/Rose Gold refers to the color is plated on Copper.▫️ This adorable keychain is the perfect gift for someone you love,especially a pet mom/dad :) Giving her/him this lovely surprise and made her/his day!▫️ This piece is made by Hand.▫️ Custom made with any photo on the front - Accept Drawing/Handwriting/Logo/Pictures or any designs.[NOTE] -  I can make 2 or more fur babies on one pendant, please make sure the picture is clear enough so that I can see every baby clearly. :)❤❤❤[NOTE]-***The engraving quality mostly depends on your image quality.Usually I will engrave exactly the pictures you sent to me(Background will not be included).If you want to complete some parts or want to cut them, please specify.When your pictures are clear, I will not send a mock up unless you specify it.▫️ Custom made with any name/text on the back/Front  - Any special words you'd like to add on the back/bottom: Loved one's name, favorite word, meaningful sentences, etc.[NOTE] - If you'd like to add a heart, please use <3.I could also add the paw prints 🐾If you want to customize other symbols or special content, please send me a message first for checking. :)▫️ Material ▫️For Sterling Silver type - The pendant is made of 925 Sterling Silver/18K Gold plated 925 silver/18K Rose Gold plated 925 silver. All skin type friendly. The keyring is made of premium stainless steel.For Titanium type - The whole keychain is made of premium titanium. Dust-proof, water-proof. No extra care is needed compared with sterling silver one.For Copper type - The pendant is made of premium copper with silver/gold/rose gold plating. The keyring is made of stainless steel.▫️ Pendant size: 25mm/35mm/40mm/45mm.▫️ The exquisite keychain can be given to others on a special holiday or used by yourself▫️ If you have any other inquiry, please feel free to let me know through 'Message'.* How To Order*1. Choose the keychain Color & Size--Text2. Submit text and font if you'd like to add in the personalization box. (e.g.  Font 1, Lucy) The default font is Font 4 if you did not submit it.3. After order placed, please send your custom photo to me through 'Message' button with your order ID/Receipt ID (Not the transaction ID).^ STERLING SILVER JEWELRY CARE ^1. Keep away from water, sweat and cosmetics. (such as lotion, sun cream, hand cream) Avoid friction, and keep the luster of the keychain.2. Please wipe the keychain with a jewelry polishing cloth softly when cleaning.3. When not wearing/using it, please keep it dry and put it in a jewelry box.- PACKAGE DETAILS -📦 The keychain📦 A gift box📦 A gift bag📦 A polishing clothAgain, please feel free to let me know if you still have any inquiry, I will always be here to offer help. :)- More Product Options For You -I also make the picture keychain in round shape, please check the link below for details:https://www.etsy.com/listing/1083198852/pet-portrait-keychaincustom-photo?ref=listings_manager_gridI also make picture necklace, please check the details from the link below:https://www.etsy.com/listing/1162894859/23mm35mm-sterling-silvertitanium-custom?ref=listings_manager_gridFor more lovely jewelry, please check my shop home page :)https://www.etsy.com/shop/ZebraHandmadeJewelry?ref=seller-platform-mcnav",
    "reviews": [
      "Asked for a custom job, and through no fault of the seller first version didn't work out for me because it wasn't the right size for visibility. The seller was very accommodating to give me a discount to get a second version done that would work for my functionality great seller",
      "Turned out better than expected. It’s the perfect size and quality. Thank you so much!",
      "super great clarity of the image",
      "My original order was lost in the mail, and they were quick to make and send a new one to replace it. The keychain is super cute and made a great gift!"
    ]
  },
  {
    "productId": "4JlhpeNClI",
    "url": "https://www.etsy.com/listing/192245124/customized-stamped-spoon-your-message-on?click_key=205e1dfbb6af9d54c64fb8c498fa00518797ec1b%3A192245124&click_sum=cffd90ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-16&etp=1&sts=1",
    "title": "Customized Stamped Spoon, Your Message On Spoon, Personalized Gift, Stamped Vintage Spoon",
    "description": "The pattern of the spoon will vary depending on pieces that are currently in stock. I will always make sure they are just as beautiful! No two pieces will be totally alike because of the silver plate pattern, depth of impression and uniformity of letters.HOW TO ORDER:After adding the spoon to the cart, leave a message in notes to seller box exactly what you would like on your spoon. I can fit most messages, but will email you if there are any issues.Every vintage piece is lovingly hand stamped by me one letter at a time to create a unique treasure for you. Because of that, it is impossible to guarantee that letters will be perfectly aligned. I believe this lends to the charm of each piece. There will be some tool markings on each side of the silver plate, as shown in the photos.Since these wonderful vintage pieces have had years of prior use, imperfections should be expected and treasured! They may or may not show signs of wear that could include minor plate loss, scratches, and/or some pitting.Hand washing is highly recommended as this will help preserve the darkening of the letters. The darkening may wear some over time, however the stamping impression will remain.",
    "reviews": [
      "I’m going to order more!  I just need to think of more witty sayings.",
      "I received exactly what I ordered. Great spoon and an awesome gift. I’ll order from this shop again.",
      "So cute! Arrived even better than I expected and super quickly."
    ]
  },
  {
    "productId": "kyLawgStKA",
    "url": "https://www.etsy.com/listing/1076844282/anniversary-gift-for-himpersonalized?click_key=cd99d69ece83f3f227f538c3ec84b9f5c006943c%3A1076844282&click_sum=7a09695f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-9&pro=1&sts=1",
    "title": "Anniversary Gift for Him,Personalized Gift for Men,Fathers Day Gift for Dad,Christmas Gift for Him,Graduation Gift for Him,Groomsmen Gift",
    "description": "Anniversary Gift for Him,Personalized Gift for Men,Fathers Day Gift for Dad,Christmas Gift for Him,Graduation Gift for Him,Groomsmen GiftPersonalized Leather Dopp Kit Third Anniversary Gifts For Men Leather Toiletry Bag Birthday Gift For Dad Valentines Day Gift For Him Dopp Kit Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for HimHandmade Item%100 Genuine Leather - Best Quality Oil-Tanned Full Grain Cowhide LeatherSIZES:XL Dopp Kit:Approx. 9.5” x 4.5” x 4.5”Large Dopp Kit:Approx. 8” x 4” x 4”Small Dopp Kit:Approx. 6.75” x 3.5” x 3.25”PERSONALIZATION INSTRUCTIONSPlease tell us your personalization request in the “Add an optional note to seller” box during checkout. ***Add Initials: Max of 5 Characters***Want to order 10 or more items? Contact for bulk pricing!",
    "reviews": [
      "Delivered so incredibly fast. Very happy.",
      "Delivered so incredibly fast. Very happy.",
      "A repeat customer and another satisfied customer! A great quality product and it shipped quickly!",
      "Great quality and husband loved it!!"
    ]
  },
  {
    "productId": "DGlymqhOPL",
    "url": "https://www.etsy.com/listing/1151005672/fathers-day-gift-custom-handmade-belt?click_key=790eb5c5114e8e8b41684a3b30bc2f250e9c9443%3A1151005672&click_sum=cac609da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-10&pro=1&frs=1&bes=1&sts=1",
    "title": "Father's day gift - Custom Handmade Belt - Anniversary Gift - Engraved Leather Belt - Grooms Men Gift - Genuine Leather - Gift for Boyfriend",
    "description": "Custom Handmade Belt - Anniversary Gift - Engraved Leather Belt - Grooms Men Gift - Genuine Leather - Gift for Boyfriend - Best Man Gift🎇 Leather Belt from Specialeather 🎇A quality gift that can be used for a long time.Each men's belt is prepared according to your waist size.☄️ Materials – real european genuine leather and brass buckle.The best Anniversary, birthday or Christmas gift!If you are looking for a gift for your boyfriend or husband, check out these belts〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️🎇Personalization 🎇1. Choose a color2. Measure your belt size as you see in the photo3. Write the text you want to write in the personalization section4. ⚡️⚡️⚡️⚡️Please add your phone number in the notes section for shipping⚡️⚡️⚡️⚡️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️📦 Your order will be sent in max. 3 working days✈️ Delivered in 2 - 8 days📲 If you have a question on your mind, contact us immediately by sending a message.",
    "reviews": [
      "Fantastic and my husband loves it!",
      "Fast and easy great quality",
      "Love it!! beautiful leather work",
      "My husband liked his gift."
    ]
  },
  {
    "productId": "OKFrWTPSdx",
    "url": "https://www.etsy.com/listing/1616644063/the-grillfather-bbq-set-engraved-grill?click_key=eeb44c677631c57c615585bfcfc9cdc880a477a4%3A1616644063&click_sum=83f179f2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-11&pro=1&frs=1&bes=1&sts=1",
    "title": "The Grillfather BBQ Set, Engraved Grill Set, Custom BBQ Set, Grill Tools, Personalized Grill Set, The Godfather Gift, Grill Accessories",
    "description": "---------------------------------------------------------------------------- Please read entire description & view photos ----------------------------------------------------------------------------Introducing the NEW 11 Piece BBQ Grill Set! What a great gift idea for the avid grill master in your life!This grilling case can be engraved with your personalized details. Choose from 12 different designs! Made from solid maple wood and stainless steel this BBQ set is the choice for you. BBQ Gift set includes 1 bonus silicon cooking glove which is heat, slip and water resistant! *Please note, due to the nature of maple wood the engraving may appear in lighter and darker colors. It is recommended to store the box and tools inside to avoid weather damage.➤WHAT'S INCLUDED:- 11 Piece Set Includes: Maple Wood Travel Case, Spatula, Tongs, Brush, Fork, Knife, 4 steel skewers and 1 Heat Glove!- Case Measures: 18x6.25x3 inches- Set Weight: 4.5 lbs- Stainless Steel Tools- Personalized Engraving on box only➤➤DESIGN OPTIONS- Order blank or choose from 12 designs!- Custom Artwork/Logo is available for minimum +$25 artwork charge. Please message me for custom.➤➤➤HOW TO ORDER:1. Select Engraving Design2. PERSONALIZE: Put all engraving instructions in the \"Add your personalization\" box when adding to cart.Domestic Shipping: Standard shipping (5-10 business days) is a flat rate price of $9.95. Each additional product added is FREE to ship! Faster shipping upgrade options are available during checkout.International Shipping: Standard international shipping is 2-3 weeks to your delivery country. Please note the BUYER is responsible for all duties and taxes accessed by your country. Potential duties and taxes are not included in your shipping price.FAQ:WHEN WILL I GET MY ORDER?With \"Standard Shipping\" the order can arrive within 15 business days.For Faster Delivery, please select an upgraded shipping option at checkout!HOW DO I CUSTOMIZE MY ITEM?Put all engraving instructions in the \"Add your personalization\" box when adding to cart. Any additional details you can put in the Notes box during checkout.DO YOU OFFER ANY DISCOUNTS?Yes! My current promotions and bulk purchase discounts can be found in the Announcement Section near the top of my Shop Home page!",
    "reviews": [
      "Our gift receiver was very thrilled with the item. The only downfall was one of the brackets popped off as he opened it. He's fixing, but it was a disappointing moment. Overall, would order again and recommend.",
      "Great quality and fast shipping",
      "My husband loved this as a gift for his anniversary! Came within a couple of days and had awesome customer service!",
      "It was for a gift and my husband loved it. Thank you!"
    ]
  },
  {
    "productId": "Ale5pAylLA",
    "url": "https://www.etsy.com/listing/1476195806/personalized-leather-rfid-wallet?click_key=25bbcddadde4672c6a980eed8fff36ac69a52a3d%3A1476195806&click_sum=c978fbcc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-12&pro=1&sts=1",
    "title": "Personalized Leather RFID Wallet, Engraved Genuine Leather Custom Wallet, Anniversary Gift For Him, Men, Father, Dad, Husband, Boyfriend",
    "description": "👔 **Personalized Engraved Men's Wallet - Stylish and Unique** 👔Welcome! Discover the perfect blend of style and personalization with our personalized engraved men's wallet. Our wallets are not just functional but also offer a touch of sophistication. They make an exceptional gift choice for any occasion, combining practicality with sentimental value. ✨🎁📌 **Key Features** 📌✔️ **High-Quality Materials**: Our wallets are expertly crafted from premium leather or synthetic materials, ensuring durability and a comfortable touch. 🌟✔️ **Sleek Design**: The modern and elegant design of these wallets complements any setting, from business meetings to casual gatherings. 💼✔️ **Spacious Interior**: Our wallets offer organized storage and easy access for cards, cash, and important documents, thanks to various compartments. 📂✔️ **RFID Protection**: Select models come equipped with RFID technology to protect your cards and personal information from theft. 🔒✔️ **Personalization Option**: Elevate your gift by adding a name, date, or heartfelt message with our engraving service, making this wallet truly unique and cherished. 💌🎁 **Perfect Anniversary Gift**: Make your anniversary memorable with this thoughtful gift, expressing your love and commitment. 💑🎉🤵 **Ideal Groomsman Gift**: It's also a perfect choice to thank your best men for their support on your special day. 🎩👔🎄 **Great Christmas Gift for Him**: Surprise your loved ones with a stylish and practical gift this holiday season. 🎅🎄📏 **Dimensions**: This wallet measures at a convenient **4 x 4.7 inches**. 📐🎉 Explore our collection now to find the perfect personalized engraved men's wallet that suits your style and needs. We offer top-notch quality at affordable prices. Add to your cart today and elevate your style! 🛍️📦 Fast and Reliable Delivery: We strive to deliver your orders as swiftly as possible. 🚚🤝 Customer Satisfaction: Your satisfaction is our priority. If you have any questions or special requests, please don't hesitate to contact us. 🙋♂️🛒 Place Your Order Now: Discover a wallet that effortlessly combines style, functionality, and sentiment. Make every moment special with our Personalized Engraved Men's Wallet! 🛍️✨📌Important Notes:-Colors might exhibit subtle variations in person compared to what is seen on a computer screen, and please note that all our photos undergo editing. Each leather wallet undergoes laser engraving, hence there could be slight differences in the positioning of the design compared to the ones shown.-Engraving may be less visible on darker colors.-Every exquisite wallet in our collection is meticulously crafted from the finest Genuine Crazy Horse Leather, aging gracefully over time and naturally softening with use.-We can only engrave exactly what the customer provides in the personalization box. We are not liable for any typos provided by the customer. Please ensure that all details are accurate beforeDear Valued Customer,Could you please assist us by sharing your thoughts about our products on Etsy? Writing a review can be a valuable guide for other shoppers and helps us improve our business. Your feedback contributes to enhancing our service and product quality. Your satisfaction is our top priority, and we look forward to serving you better.Warm regards,  [NileLeatherUSA]",
    "reviews": [
      "Exactly what I wanted. Seller was great and very focused on making sure I got what I wanted.  10 out of 10. Thank you.",
      "I can't wait to give this to my son. Such a great quality and I love how I can personalize it to make it a special gift.",
      "It turned out great, my boyfriend loves it!",
      "Very nice wallet.  The monogram was perfect and made it extra special."
    ]
  },
  {
    "productId": "9XgZkJmhjp",
    "url": "https://www.etsy.com/listing/588901423/engraved-cutting-board-personalized?click_key=bfcc615871f1107e2d8142667f7166c136b0c06b%3A588901423&click_sum=f450b1a6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-17&pro=1&frs=1&etp=1&sts=1",
    "title": "Engraved Cutting Board, Personalized Wedding Gift, House Warming Gift, Personalized Cutting Board, Anniversary Present, Paddle Cutting Board",
    "description": "Surprise your mother, wife or girlfriend with a gift for her with our personalized cutting boards! They make an excellent anniversary gift or simply a self gift to add to your kitchen décor. Our cutting boards are laser engraved for a permanent finish. We do not use vinyl or stickers.WHAT'S INCLUDED?★ One laser engraved cutting board in your choice of walnut, cherry or bamboo. Our walnut and cherry boards in this listing are shipped uncoated in their natural wood finish. We recommend applying a food safe mineral oil prior to use to preserve the life of the board.★ Note - Due to the nature of real wood products, the actual shade and color of the engraving may vary slightly.★ORDERING NOTES★❶ Please see all photos for design and product options.❷ Double check all information before submitting order.★ Include any information needed for personalization. Example (Names, Date, etc.) If you would like to omit any portion of the design, please specify the change in the personalization field.Any information not included may be omitted.❸ Double check shipping address (make sure to include apartment number if applicable)★PRODUCTION AND SHIPPING★We pride ourselves in delivering your custom product to you in timely manner. We always do our best to ship orders as quickly as possible.If you need your items sooner, please add our rushed production listing. This listing ensures your order ships within 1-2 business days. We are not able to guarantee exact delivery dates.https://www.etsy.com/shop/FlowertownWeddings?section_id=19062302",
    "reviews": [
      "My sister and her husband will love this!! It arrived earlier than I expected which is great. Looks better than I thought!! Will definitely order again",
      "The product turned out great!",
      "Great quality. I love the cutting board",
      "Great quality. I love the cutting board"
    ]
  },
  {
    "productId": "tcuAslUPSJ",
    "url": "https://www.etsy.com/listing/1297173543/personalised-crystal-keyring-rose-quartz?click_key=07d830b7115f0ed1c4adcbdfd0cba3ed6b1eb727%3A1297173543&click_sum=36553e13&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-18&pro=1&etp=1&sts=1",
    "title": "Personalised Crystal Keyring | Rose Quartz | Butterfly | Name | Gold | Keys | Beads | Gold Chain | Pink | Charms | Spiritual",
    "description": "Personalised rose quartz charm keyring. With a butterfly charm and rose quartz beads.These keyring's are made to brighten up your keys. They are big enough to help you find your keys in your big bag but little enough to squeeze them into a small purse.If you want to change the crystals to match the butterfly then please write a note along with your order and I will do that for you.Please note:The crystals may vary in size and colourThe back of butterfly charm is goldButterfly colour may vary",
    "reviews": [
      "🌸 thank you so much",
      "Wow, this product is absolutely beautiful and of such high quality! I would highly recommend this seller to anyone. Thank you so much for providing such a wonderful product!",
      "Beautiful lovely quality and price"
    ]
  },
  {
    "productId": "dvqGoCuJMQ",
    "url": "https://www.etsy.com/listing/1576824434/family-christmas-ornament-personalized?click_key=7b8ee0063bf31c82e62d3cc05f6d1cd10f7f7a29%3A1576824434&click_sum=e4affb89&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-19&etp=1",
    "title": "Family Christmas Ornament - Personalized Ornament With Names - Christmas Tree Ornament",
    "description": "Make this holiday season extra special with our meticulously crafted Family Christmas Ornament. Designed to honor the essence of family and the joy of togetherness, this ornament is more than just a decorative piece—it's a cherished keepsake.The current year will be added to the ornament unless otherwise requested.PRODUCT DETAILS- Crafted from premium Baltic Birch- Available in Gold, Silver, and Natural wood finishes- Approximately 5-7\" tall",
    "reviews": [
      "Great product, just as ordered.",
      "Beautiful hand created gift! Perfectly cut and lettered! Even the ribbon is special!! My niece loved this!  It is hanging in her kitchen even now in March!  I an so excited to have found a gift that she really liked.",
      "Beautiful hand created gift! Perfectly cut and lettered! Even the ribbon is special!! My niece loved this!  It is hanging in her kitchen even now in March!  I an so excited to have found a gift that she really liked.",
      "Very cute and exactly what I wanted!"
    ]
  },
  {
    "productId": "brXJETMqIT",
    "url": "https://www.etsy.com/listing/525249434/custom-copper-money-clip-personalized?click_key=815ad5f6f0fc47c0b1102a210f6f3dcf3d2702d6%3A525249434&click_sum=db486c1d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-20&pro=1&etp=1&sts=1",
    "title": "Custom copper money clip - Personalized rustic money clip - Gift for him - Copper gift - Masculine gift - Groomsmen gift -Wedding party gift",
    "description": "This custom copper money clip is personalized with initials or name of your choice and given a rustic oxidized finish.  This makes a great personalized gift for your husband, dad, grandpa, groomsmen or any guy on your gift list.Copper clip is a thick 18 gauge copper, and it may be stamped with any personalization of your choice.  Clip is hand formed for a tight fit so that all of your money stays safe and secure.Please note:  Initials/personalization will be placed on the side of the clip, as shown, unless otherwise requested.♥ ♥ ♥ Check out more men's items here:https://www.etsy.com/shop/woobiebeans?section_id=12596682♥ ♥ ♥ Or visit my entire shop here:https://www.etsy.com/shop/woobiebeansNeed something a little different? Convo me with any custom orders, and I will work with you to come up with a completely custom design to meet your needs.Disclaimer: Part of the art of hand stamped jewelry is that each letter/character is hand stamped by the artist (well,me). All of the letters will not always be lined up perfectly or come out looking exactly the same....that is part of the charm. However, if you are looking for something that is completely uniform and in a perfect lined up pattern, you will need to look for machine engraved pieces.",
    "reviews": [
      "I do all my anniversary gifts by year, and this year is #7, it’s wool and copper,\nI can’t wait until 3/23, Esty and the unique small businesses come through all the time!!!\nMy husband will love this!!! Woobie Beans out did themselves!!!!!\nThank you \nLisa LGaddy",
      "I love the feel of the copper. Super simple and has replaced my wallet.",
      "That's great, Shane!  Thank you so much for your kind review!",
      "My husband loved it! Thanks!",
      "That's great!  Thanks so much for reviewing!",
      "Clip is absolutely wonderful and well made"
    ]
  },
  {
    "productId": "HKIqxXEaCP",
    "url": "https://www.etsy.com/listing/1513622571/custom-embroidered-tee-shirt?click_key=a5403730ccaeb19d9c708322d9ffa640a4d2e6a1%3A1513622571&click_sum=54bd7e36&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-21&etp=1&sts=1",
    "title": "Custom Embroidered Tee Shirt, Personalized Comfort Colors Shirt, Embroidered Shirt, Personalized Gift, Vintage Shirt, Holiday Gift",
    "description": "If you're looking at a way to create shirts with unique phrases to start conversations, we got you! Our shirts are a great way to show your support for mental health in a comfy and cozy way. Let's start wearing our hearts on our sleeves (literally). This is a great gift for men, women, moms, dads, friends, and even neighbors!Please read this before you order!Custom Embroidered Comfort Colors Short-Sleeve ShirtComfy Shirt6.1 oz., 100% ringspun cottonPreshrunk, soft-washed, garment-dyed fabricSet-in sleevesEmbroidered on a 4''x4'' AreaThis will be placed on the left chest area.LEFT CHEST Placement - Each line should be no longer than 10-19 characters, including spaces and punctuation. Anything above this recommendation will have visible shrinking and quality loss in the letters, which is likely to lead to disappointment.Be sure to triple-check for any typos, punctuation, line breaks, or any other issues that may arise. We do our best to clarify any issues we catch, but we may customize your item exactly as you type it, and we aren't able to offer refunds for any mistakes made on the customer's end. We want you to be happy, so please be careful when typing out your customizations! If you're unsure whether your personalization will be too long, feel free to message us to ask!*All embroidery designs may turn out slightly different. These are not mass-produced or factory-made, but hand-crafted by us here at Shirts of Affirmation! All sales are final and we do not accept exchanges.",
    "reviews": [
      "Got it as a gift, recipient loved it.",
      "The shirt material feels super soft and the embroidered is done precise! Would for sure recommend to anyone :)!\n\n\nOnly tipp: Size up if you would like to have the shirt more baggy. For reference I ordered the size medium",
      "Excellent product with designed text"
    ]
  },
  {
    "productId": "WzFxeQrbkg",
    "url": "https://www.etsy.com/listing/1274604054/egg-stamps-personalized-custom-egg-stamp?click_key=e78fee15293321315b6fe5e4af04dd277ec55da1%3A1274604054&click_sum=4913688a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-22&pro=1&etp=1&sts=1",
    "title": "Egg Stamps Personalized Custom Egg Stamp, Chicken Coop Idea, Chicken Egg Stamp, Farm Stamper, Chicken Gifts, Hen Mini Egg Stamp For Farmer",
    "description": "Introducing our custom Egg Stamp. It’s crafted with care and adds a touch of fun to your chicken eggs. Perfect for small farmers and backyard chicken keepers, this cute personalized egg stamp creates a unique egg, whether you're selling at a farmer's market or giving eggs to friends and family.🇱🇷 MADE IN THE USA____________________________________________🐓STAMP DETAILSTHE EGG STAMP - A 1-inch square stamp with a handle with .7 inch imprint to fit on eggs▪️ Premium wood with laser-engraved rubber for the clearest image▪️ Your design is also engraved onto the wood for easy I.D.▪️ Your final design will be sent to you▪️ If you order ink, it is not food gradeCUSTOMIZE IT!Please READ and leave your text in the personalization box:🐓 12 letters/spaces Max on Top🐓 11 letters/spaces Max on Bottom_______________________________________🐓PROOFS AND SHIPPING▪️ FREE PROOF: Personalized items receive a proof in Etsy convos in 1 BIZ DAY▪️ SHIPPING: USPS standard 1st Class or Priority Shipping upgrade is available▪️ TRACKING: You will receive an Etsy convo with tracking upon shipping💗 RUSH MY STAMP - Purchase this listing, if available, to speed up production;https://www.etsy.com/listing/450048984💗 MORE ITEMS IN OUR SHOP 💗https://www.etsy.com/shop/SouthernPaperAndInk____________________________________________Your satisfaction is guaranteed | Your custom stamp will arrive on time and will come as pictured. Thanks so much for stopping by! Jill",
    "reviews": [
      "The stamp is perfect. Thank you",
      "I love our stamp. Really cute",
      "Loved it! Can’t wait to gift it!",
      "Matched description, fast shipping, perfect gift."
    ]
  },
  {
    "productId": "NDeEPPLkFq",
    "url": "https://www.etsy.com/listing/749982839/14k-solid-gold-name-necklace?click_key=60222223b942e5b1cb5576e2520b470a34879e7b%3A749982839&click_sum=3aa67a31&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-23&pro=1&frs=1&etp=1",
    "title": "14k Solid gold name necklace , Personalized Name necklace , Gold name necklace , Personalized jewelry , Personalized Gifts , Christmas gifts",
    "description": "Name necklace gifts are one of the best ways to show your loved ones how much you value them. Combining beautiful jewelry with a loved ones name is never a failing idea. Our name necklaces are fully customizable from the font to the pendants, they are personalized to your liking. Order one of our 14k gold necklaces to show your appreciation to your loved ones.14k Solid gold name necklace is perfect gift for birthday.Hello, every woman loves personalized gifts. In fact, we all love personalized gifts. , we love to produce jewelry for women and children. We are happy to produce personalized gifts every day. As Solid Gold and Gold Plated, we can produce name necklaces, letter necklaces or any customization special for you as necklaces, bracelets, earrings. The most popular feature of personalized jewelry is that it makes people look strong. If you have a name necklace, no one can resist you. Show them who you are! Carry the names of your loved ones around your neck. It will give you energy. It will make you happy.We process the production stages of the 14K Solid Gold Name Necklace as handicraft. All of our products are perfect as they are handcrafted. We produce name necklace.DETAILS__________Materials:1) 14k Gold Filled, 2) Sterling Silver 3)  Rose Gold Filledand we have SOLID GOLDS.   It is a very high quality jewelry that you can use for a lifetime. If your budget is enough, I recommend you to buy Solid Gold.8k , 14k, 18k Solid goldAll raw materials are  Italia sourcedThe necklace can be personalized with NAME, NUMBER, WORDName size - lowercase letters are approximately 4 mm  and uppercase letters are approximately 6 mmPERSONALIZATION________________See font sample at last imageAT CHECK OUT Leave a note at \"Note to seller\" with NAME/WORD that you'd to have on the necklace, please specify the lowercase or uppercase letters. The necklace will say exactly the same as your note.MATERIALS__________________GOLD-FILLED JEWELRY:- Under normal wearing conditions and with proper care, your gold filled jewelry should last at least 2 years.- 14kt Gold-Filled jewelry is made by bonding a solid layer of 14kt gold on top of another metal, but this layer is 1000 - 10,000 times thicker than gold plating, resulting in a durable, long-lasting product that looks gorgeous like solid gold.- Gold-Filled jewelry can also be worn by people with sensitive skin.STERLING SILVER:- We use .925 Sterling Silver, which requires polishing from time to time from oxidation. You can easily restore silver back to shine with a polishing cloth or use a polishing lotion for that extra shine.SOLID GOLDS- We use 8K SOLID GOLD , 14K SOLID GOLD , 18K SOLID GOLD ._______________________________________► PROCESSING & SHIPPING♥ All items purchased will be shipped within 3-5 business days.♥ You can upgrade your shipping to UPS Express during check out if you want it quicker♥Standart Shipping Time : 8-20 days♥ Express Shipping Time : 1-3 business days.► CURRENT PRODUCTION TIMESAll items are made to order so please check the top of our policies page/shop announcement for the most up to date production and delivery times. If you need it sooner, please send us a message on Etsy► EXPEDITED SHIPPINGYou will be able to choose faster shipping options in the drop down menu when you check out. Ship times DO NOT include production times (please see above). However, if you select expedited shipping, we will try to get your order done faster.► PLEASE READ OUR POLICIES► ENTER OUR SHOP HEREwww.etsy.com/shop/YourNamesJewelry………………………………….Gold Name Necklace, Name Necklace, Custom Gold Name Necklace, Gothic Name  Necklace, Solid Gold Name Necklace , Mini Name Necklace  - Gift",
    "reviews": [
      "Great quality, arrived quickly and just as promised",
      "It’s a beautiful necklace I gave it to my daughter for Christmas. She loved it",
      "Second time ordering from this seller. Quick order and delivery. Love the smaller size option"
    ]
  },
  {
    "productId": "zlVeKDTiSg",
    "url": "https://www.etsy.com/listing/923618925/personalized-charcuterie-board?click_key=d211f1a348c24408e716b03d47e7e30bc416279c%3A923618925&click_sum=ce460baf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-24&frs=1&etp=1&sts=1",
    "title": "Personalized Charcuterie Board, Housewarming Gift, Wedding Gift, Anniversary Gift - Custom Cheese Board, Cutting Board, Serving Tray",
    "description": "Add a touch of elegance to any celebration with our personalized charcuterie board. This custom cheese board is a thoughtful wedding gift, bridal shower gift, engagement gift or Christmas gift that is sure to impress. The exquisite design and personalized engraving make it a unique housewarming gift or hostess gift that fits any style. Whether it's used as a sophisticated serving tray or a convenient way to display mouthwatering charcuterie delights, this charcuterie board is guaranteed to leave a lasting impression. Celebrate special moments and create memories with this personalized masterpiece.Elevate your entertaining game with this stunning personalized charcuterie board. Transform your kitchen into a stylish space with our personalized charcuterie board - a must-have for any home decor enthusiast. Crafted from a combination of luxurious marble and mango wood, this board is both elegant and durable. The mango wood provides a rustic feel, while the marble adds a touch of sophistication to your presentation.What makes this cutting board truly special is the personalization options. Choose to have your name, monogram, or a special message engraved onto the board to make it truly unique. The brass feet not only add to its elegance, but also elevate the board for easy serving and presentation.This handmade charcuterie board is the perfect addition to any dinner party, wedding, Anniversary or housewarming gift. It's large enough to fit a variety of cheeses, meats, and other snacks, making it ideal for entertaining. And thanks to its sturdy construction, it will last for years to come.If you're a foodie or simply enjoy hosting, this personalized cheese board is a must-have. Don't settle for a boring serving tray – impress your guests with this simple artisanal and beautifully crafted charcuterie board.Laser EngravedApproximately 14\"L x 8\"W x 1/2” ThickWood grain color will vary, no two pieces will look the same. Mango wood varies in color and may have streaks of yellows, browns, pinks and or greys.CARE INSTRUCTIONShand wash (both sides) immediately after use withmild dish soap; towel dry - never put in dishwasherto remove stubborn stains, create a thick pastewith baking soda and a small amount of water.smooth over stains, cover with plastic wrap and letsit overnight. remove plastic wrap and wipe witha damp cloth.for disinfecting, sprinkle with baking soda andclean with a lemon half (squeeze juice over baking sodaand use lemon half as a sponge)rinse well, dry thoroughlyto prolong the life of your board, apply cutting boardoil after the first few uses and then as needed toprevent the wood from drying out;light sanding optionalMakes the perfect personalized gift for a housewarming, wedding, engagement, bridal shower, anniversary, hostess gift, Christmas gift or realtor closing gift.Option to add on a set of 4 coasters and or 2 wine glassesMessage for a custom design/order",
    "reviews": [
      "Bought this for a friend as an engagement present and she loved it!",
      "Beautiful gift. I’d recommend. It turned out beautiful.",
      "Beautiful and great quality! Makes a great gift"
    ]
  },
  {
    "productId": "GZnmTEgnYU",
    "url": "https://www.etsy.com/listing/1102169549/you-choose-candle-message-spa-box-for?click_key=10841e26c8d14649c418e8b155a7aeea0d134267%3A1102169549&click_sum=77423156&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-13&pro=1&frs=1&bes=1&sts=1",
    "title": "You Choose Candle Message| Spa Box for Women| Personalized Gift",
    "description": "Is there someone you think is truly awesome – a coworker, friend, neighbor? Let them know by sending them one of our truly lovely gift boxes packed with thoughtful items …. and we can mail directly to them!Love Delivered ❤️GIFT BOX INCLUDES:✿ 9 oz. Scented Hand-Poured Soy Candle with a Cotton Wick & a 45 Hour Burn Life✿ 2 oz. Moisturizing Sugar Scrub (Lavender or Tangerine, selected at random)✿ 2 Lavender Shower Steamers✿ 4 Mouth Watering caramels✿ Decorative Matches✿ Crinkle Paper✿ Personal greeting card with your handwritten message!✿ Free Shipping➡️SHIPPING:✿ Shipped in a branded Gift Box Love Co box ready for gifting!✿ All gifts are shipped out 1-2 business days after the order was made. Additionally, as you're making your order, Etsy provides you with an estimated delivery date.✿ Please note, if you are shipping this as a gift, please update the shipping address to the giftees address. We will ship to the address you give at Etsy checkout.***✿ If an incorrect shipping address is given and the gift is returned back to our shop, the customer is responsible for paying the re-shipping fee.***✿ PERSONALIZATION can be made by leaving a message in the personalization area; please remember to ALSO INCLUDE YOUR OWN NAME. Messages written on the card are exactly as they were received in the order.✿ Please check the photos for instructions and answers on questions you might have.✿ No receipt or pricing information is included in our gift boxes.✿ We ship using USPS and FedEx depending on package size and delivery location.",
    "reviews": [
      "The person who received the gift loved it.",
      "Gift for MIL.\nShe will love it",
      "Several options to create a more personal gift. Great quality"
    ]
  },
  {
    "productId": "RevAg0TzVn",
    "url": "https://www.etsy.com/listing/1470545721/name-puzzle-1st-christmas-gift?click_key=879691ba72df9d7c87ebe31ef07108d0d2f71d53%3A1470545721&click_sum=a858495e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-14&pro=1&frs=1&bes=1&sts=1",
    "title": "Name Puzzle 1st Christmas Gift Personalized Busy Board Baby Gift First Birthday Baby Boy Girl Toddler Custom Wooden Puzzle",
    "description": "Looking for the best Baby Gift ?Personalized Wooden Busy Board with Name Puzzle is great gift for baby boy or baby girl First Birthday, 1st Christmas, Baby shower. Busy Board with Name Puzzle is great idea to turn the process of learning letters into a play! Sensory board improves fine motor skills, babies play with new objects, shapes, colors and studies them, it helps to develop logic, memory, finger grip and attention.👆Our Name Puzzle made from non-toxic high quality plywood, we carefully polish every detail, the pegs for letters and shapes are mounted very securely for the safety of your baby! (PEGS ARE INCLUDED IN THE PRICE)For painting we use safe Certified water based paint, the color can be chosen from the proposed options.📌Approximate Dimensions 📌*Length: 14.57 inches (37 cm)*Height:  9 inches (23 cm)📐The specified sizes refer to a puzzle up to 6-7 letters. The size of your puzzle will depend on the number of letters in your child's name. If the name has more than 6-7 letters, the size of the board will be increased.* The base of the board is 0.35 inches thin (9 mm) and each letter is 0.24 inches thin (6 mm) and  2.44 inches tall (62 mm).IF IN YOUR PUZZLE YOU HAVE LETTER ”I” - BE ATTENTIVE. THIS SHAPES CAN BE DANGEROUS FOR KIDS 0-3. DON’T LEAVE YOUR CHILD ALONE,  Instead - play with your kid and collect memories 😊",
    "reviews": [
      "Was a great gift to give!",
      "great product, I love it.",
      "Loved the puzzle and it was perfect.",
      "Exactly what I wanted. Quality is great and came quickly!"
    ]
  },
  {
    "productId": "HRdUDfBxRg",
    "url": "https://www.etsy.com/listing/785738711/leather-duffle-bag-men-personalized?click_key=8875fdb2c5c2cce8b3b9ee8e3dae301a9b9b50f6%3A785738711&click_sum=20f72a86&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-15&pro=1&bes=1&sts=1",
    "title": "Leather Duffle Bag Men Personalized, Groomsmen Gift Bag, Personalized Gift for Men, Monogrammed Duffel Bag, Gift for Him, Boyfriend Gift",
    "description": "Best Seller!  Leather Personalized Travel Bag!This is a highly durable bag that is made to last!This Leather Travel Bag is the perfect personalized gift for a carry on, gym bag, groomsmen gifts or for any loved one you want to give that special personalized gift to!Bag Measures:23\" x 12 x 10\"Includes a shoulder strapThe Canvas Bags come in Black, Pink, Purple, and Gray Bag:21\"X10\"X11.5\"Includes a shoulder strapThis Olive,Color Travel Bag with Canvas is a quality classy bag that makes for the perfect gift for your loved one! These bags are gifts that can be kept for years and are often used for Groomsmen Gifts!Measures:16\"L X 9\"W X 9.5\"HWe embroider up to 3 characters on the bag!",
    "reviews": [
      "It’s a High quality bag.",
      "Purchasing one for each member of our family",
      "Amazing gift for my boyfriend. He loves it so much!!"
    ]
  },
  {
    "productId": "EaNDGGsRzk",
    "url": "https://www.etsy.com/listing/1187804755/personalized-etched-set-of-5-groomsmen?click_key=fa85d61ad408f5c8b146f3184ef3dcb6e4250de5%3A1187804755&click_sum=1043db53&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457745-5-16&pro=1&frs=1&sts=1",
    "title": "Personalized Etched Set of 5 Groomsmen Gift Tuxedo Whiskey Glasses Engraved Proposal Gifts Best Man Whiskey Glass Bachelor Party Gifts",
    "description": "Custom etched personalized Set of 5 rocks glasses are the perfect gift for bridal party! Let them drink their favorite glass of beer! Perfect for Bestman Groomsmen, Father of the Bride, Father of the Groom, Ushers or any one in the bridal party. Each rocks glass measures 3 1/2\" tall, with a 10-ounce capacity. These are laser engraved and dishwasher safe!Personalized Custom Etched Set of 5 Groomsmen Gift Tuxedo Bowtie Whiskey Glasses Engraved Proposal Gifts Best Man Whiskey Glass Bachelor Party GiftsWe also have up to sets of 15 Whiskey glasses for your Bachelor Party GiftsSet of 5Set of 6Set of 7Set of 8Set of 9Set of 10Set of 11Set of 12Set of 13Set of 14Set of 15",
    "reviews": [
      "Great product. Helpful seller. Helped work on custom glasses",
      "I got 8 glasses for my groomsmen, officiant and best man. They turned out great!",
      "great glasses for wedding party",
      "Looks great! Had a minor issue with the order but the seller responded promptly and corrected the issue!"
    ]
  },
  {
    "productId": "jTJWBiNyLr",
    "url": "https://www.etsy.com/listing/1575891064/duo-baguette-birthstone-ring-adjustable?click_key=30b18db60d76cf0fc601147f32c7a4852c9af404%3A1575891064&click_sum=329e62b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-25&pro=1&frs=1&etp=1",
    "title": "Duo Baguette Birthstone Ring , Adjustable Gemstone Ring , Best Friend Gift , Anniversary Gift , Personalized Ring , Christmas Gift for her",
    "description": "If you need an elegant birthstone ring for your mother's, sister's or lover's birthday, these elegant Rings are for you. Choose the birthstone you think best represents your loved one, so they know you are always thinking of them.E M E R A L D  C U T  R I N G• Material: High Quality Solid 925 Sterling Silver• Finish: 14K Gold , 14K Rose ,• Featuring a ~1.2 mm Band with a ~6x8mm Emerald Cut CZ GemstonesH O W ∙ T O ∙ O R D E R• Simply select your RING SIZE and GEMSTONE in the drop down menu and then finalize your order.January - GarnetFebruary - AmethystMarch - AquamarineApril - Clear CrystalMay - EmeraldJune - Light AmethystJuly - Pink RubyAugust - Dark PeridotSeptember - SapphireOctober - Light TourmalineNovember - Yellow TopazDecember - Blue ZirconO T H E R ∙ I N F O R M A T I O N• All items are nicely packaged ready to gift in elegant jewelry boxes.• Have any questions? Feel free to contact us. We are fast to reply.T U R N ∙ A R O U N D ∙ T I M E• This design is ready to ship in 1 - 5 business days.. Our turnaround time is about 6 - 9 business days for custom made designs. This can change during peak seasons. Please check our home page for the most current times.Thank you so much for visiting and hope you enjoy shopping with us ♡Grace ♡----------------------------------------------• All images are copyrighted by YourNamesJewelry All rights reserved",
    "reviews": [
      "My ring was absolutely beautiful! I paired the birthstone ring of my husband and our son with my engagement ring. The shipping was very quick and I had no issues at all! 10/10 I will definitely order from this shop again!",
      "It is very beautiful! Although, I’m normally a size 8 & the ring is adjustable I feel like it squeezes my finger fat together and it’s not the most comfortable. Working on losing more weight so hopefully I get to wear it more often!",
      "very nice material and gems"
    ]
  },
  {
    "productId": "p0EkIsXycI",
    "url": "https://www.etsy.com/listing/1225468240/personalized-photo-cube-infinity-cube?click_key=1239a792ac3e51fdf339da95ecd01cee8d879e71%3A1225468240&click_sum=11363eab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-26&pro=1&etp=1&sts=1",
    "title": "Personalized Photo Cube, Infinity Cube Custom Photo Anniversary Gift, Birthday Gift For Her Him, Wedding Gift Best Friend Gift, Pet Memorial",
    "description": "♥ How to personalize your cube• Please send 11 high quality photos to us via Etsy Messages after purchasing it.♥ Product details• Dimensions: 3.15\" x 3.15\" x 3.15\"• Material: Plastic with built-in magnets• Personalized photo magic cubes are ideal for special gifts, anniversary gifts, wedding gifts, birthday gifts, best friend gifts, pet memorial, etc.♥ Recommendations for the photos:• Please send ORIGINAL full-size images to us.• If there are any issues with your photos, we will contact you directly via Etsy Messages. If you prefer to be contacted by email, please let us know your email address.♥ SHOP POLICIES• By purchasing any listing from PersonalizedWizardUS, all buyers acknowledge that they have read and understand the Item Details described in all listings and shop policies. Thank you.• All items are made to order.• Shop cannot be responsible for incorrect information provided.• Due to variation between every monitor, smart phone and tablet display, the colors shown may appear different in person.• Personalized gifts do not qualify for returns. If there is a mistake, please contact us.• Please understand all personalization cannot be produce perfectly identical.• Customer satisfaction and happiness is our number one priority!",
    "reviews": [
      "This was an amazing gift for my fiance!! He loved it!!  I definitely would recommend.   Super fast shipment!!",
      "I bought this as a valentines gift for my husband and it turned out beautifully. All the pictures (even 15 year old ones) turned out great. My husband loves it, I catch him moving the photos around quickly. Definitely worth the price and a unique gift.",
      "Sent this to my daughter as a birthday gift and she loved it! Fast, great quality, excellent communication!\nThank you!",
      "Very cute product.  Great communication with the seller."
    ]
  },
  {
    "productId": "GJlskanqhS",
    "url": "https://www.etsy.com/listing/1540644159/custom-name-bracelet-with-curb-chain?click_key=b95bf2c88d36c2ecf39d5ac6788cb34e2f1f796a%3A1540644159&click_sum=d2f6a24d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-27&pro=1&etp=1",
    "title": "Custom Name Bracelet with Curb Chain - Personalized Name Bracelet - Letter Name Bracelet - Mother's Day Gift *NABI BRACELET*",
    "description": "NABI BRACELETThe perfect way to show your appreciation, the Custom Name Bracelet with Curb Chain is a heartfelt piece of jewelry that is sure to bring a touch of sentimentality. This bracelet features a beautiful curb chain with personalized nameplate, creating the perfect gift for any special occasion. The personalization options allow you the freedom to customize your bracelet with the names of your loved ones.From anniversaries to birthdays, graduations to holidays, and everything in between, this high-quality Custom Name Bracelet with Curb Chain is sure to bring a smile to whoever receives it. Show your love with this one-of-a-kind piece of jewelry that is designed to last.You can customize this bracelet with any name or word of your choice. Basic symbol such as heart, star, &, # is available to add in, just put your request in note box at check out.— If you would like all Pavé letters, you can find our Nancy Pavé Bracelet belowhttps://etsy.me/3rzhD0u*MATERIAL:— 100% Recycled Sterling Silver - This solid, precious metal is a classic that lasts forever. While it may darken over time, with continuous care and an occasional, it’s as good as new.— 18K Gold Vermeil - For those with an eye for striking gold, our gold jewelry uses sterling silver as a base and is plated with a durable and thick layer of 18-karat gold vermeil.— 18K Rose Gold Vermeil - Our rose gold jewelry uses a sterling silver base with 18-karat rose gold overtop to give our jewelry a pink-golden hue.— White Sapphires stones - Naturally sourced White SapphiresVermeil is nickel-free and perfect for people with metal allergies.*DIMENSION:Each letter is approx. 4.5mm in height.*PERSONALIZATION:Enter the letters/numbers or symbol you want on your bracelet in the Personalization Box.— Uppercase letters only.— You can have a heart, star, ampersand or infinity symbol, as pictured.— Maximum 12 characters.*LENGTH:— Select the length you want for your bracelet from the drop down menu.— This bracelet is adjustable in length. Length 5-5.75 inches can be worn at 5 inches or 5.75 inches.CUSTOM LENGTH:— If your size is different from our available length options, and you want a perfect fit, we can make a custom length for you. Just put the length you want to have in the Personalization Box.TIPS: measuring your wrist using a string or ribbon, wrap it a little loose around your wrist unless you want a snug fit. Mark where the end meets and use a ruler to measure the length.*PRODUCTION TIMEPlease see Shipping & Policies for our most updated production time.*RUSH ORDERPlease select 'Rush Order + Express Shipping' at checkout and include the desired delivery date in the Notes section. Our team will reach out to you to confirm if your request has been accepted.*GIFTINGYou’ll have the ability to add a personalized message to your order. Please lease your messaging in the Note box upon checkout. Once we receive it, our team will print out the message on a notecard and include it with your order.While we currently don’t have gift wrapping, each and every piece is perfectly packaged in true Grace Personalized fashion.***Thank you for supporting our small but growing business! From us to you, we're so grateful to have you here. What started as a passion for making intentional pieces grew into a business full of heart. Every groove and engraving that’s gone into making your one-of-a-kind piece was handmade by local artisans in Vietnam with care, intention, and, most importantly, love. With your artistic vision and our craft, together, we’ve created something truly unique.Here’s to celebrating the beauty in this moment!Your artisans,Grace PersonalizedFollow along @gracepersonalized and share with us your #gracepersonalized story.",
    "reviews": [
      "Beautiful! 😍 So happy with the purchase!",
      "The item is good and so is the quality.",
      "Had it as a gift for someone and they really love it!",
      "Nice quality, delicate, and beautiful overall. It is slightly difficult to put on myself. It’s a little larger than I’d like as well but still works."
    ]
  },
  {
    "productId": "jjXYSaovxG",
    "url": "https://www.etsy.com/listing/1179188627/shower-steamers-set-of-6-gift-set?click_key=f0edd1fb3d5aecd582c0724dca00c527b57d56d4%3A1179188627&click_sum=e3c7e0ca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-28&etp=1",
    "title": "Shower Steamers - Set of 6 Gift Set Aromatherapy All Natural colour Essential Oils",
    "description": "Transform your shower into a spa with our natural aromatherapy steamers. Simply Place the steamer at the bank of your shower away from the direct flow of water. As the steamer dissolved the therapeutic oils will be released.You will receive a pack of 6 steamers, each steamer weighs approximately 30-35g and as long as you don’t place it in the direct flow of water, should last for approximately 10 minutes. You can control how fast the steamer dissolves by moving it closer to or further away from the direct flow of water. For longer showers you may need to use two steamers. The steamers perform best in a hot shower with lots of steam.Set of 6 - 2 x Good everything rose with Rose petals , 2 x Citrus Sunrise with calendula petals , 2 x Summery Evenings with japanese matchaBaking Soda, Citric Acid, Japanese matcha, Beetroot, Rose petals, Calendula ,Essential Oils♡♡Head over to our shop’s Etsy homepagehttps://www.etsy.com/uk/shop/ScarlettByLovefromukTo see more Unique, handmade items with the addition of personalisation on the outer packaging!If you have any questions please just ask, I am always happy to help.We believe in offering quality products at affordable prices that represent exceptional value for money. More than anything else, we promise that the investment our customers make in our products will always be worth it.",
    "reviews": [
      "Amazing product, would defiantly buy again!",
      "Lovely presentation and divine smell",
      "Lovely present, came on time recommend this product an company",
      "Really lovely steamers that were pretty and well packaged."
    ]
  },
  {
    "productId": "DVIhJOvVCz",
    "url": "https://www.etsy.com/listing/1032421289/wedding-present-wedding-date-vase-vase?click_key=2a6e32b8e47f68eecfc8f65bb31aec18f77cfc1a%3A1032421289&click_sum=1a7a55b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-29&frs=1&etp=1&sts=1",
    "title": "wedding present / wedding date vase / Vase date carving / Personalized gift / wedding gift / anniversary present",
    "description": "Ships FREE in U.S.Measuring at 7.25 inches tall, this is a white colored cylinder vase with a width of 3.25 inches, with the date of your choice hand carved on the vase, in a stylized font.I send a picture of the completed vase before it ships to ensure you are happy with the end result.Once purchased, this vase will take approximately 4 days to complete, with the vase being shipped out on the 5th day, as long as the post office is open.About my art:I use a hand formed cement and stucco mixture which creates a rock solid surface, which I adhere to the glassware. I then either paint the vases or cups - in some cases with multiple layers of color for the perfect effect or dye the mixture prior to adherence.... They are very durable and intended for use.Care of the Vase: The inside can be hand washed with warm soapy water. If the outside needs cleaning, a damp cloth will do. I do not recommend submerging the vase in water, as that may compromise the finish.(Contents not included)If you have any questions, please feel free to contact me.Thank you for looking, and take care!-Kristin",
    "reviews": [
      "Gorgeous finish on the product. I was so pleased, as was the person I gave it to as a wedding gift!",
      "Love the vase and the communication was awesome!",
      "Beautiful. I know the bride and groom are going to love it.",
      "I purchased this beautiful vase for my best friend’s 4th anniversary. Not only was the seller warm, kind, and responsive, but the item is absolutely stunning. My friend loved it so much! Thank you for a heartfelt, personal gift that will last a lifetime!"
    ]
  },
  {
    "productId": "KjqoPqKCbi",
    "url": "https://www.etsy.com/listing/1393236774/adventure-book-scrapbook-couples-gift?click_key=4827313b20884800f266ba31976602dc0417e144%3A1393236774&click_sum=7f0baf33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-30&pro=1&frs=1&etp=1&sts=1",
    "title": "Adventure Book Scrapbook Couples Gift for Boyfriend, Anniversary Gifts Couples, Personalized Gift, Valentines Day Gift for Him",
    "description": "Our Adventure Book is the perfect keepsake gift for a boyfriend, an anniversary gift for couples, gift for him, valentines day gift for him, personalized gift, christmas gifts, personalized gifts! Designs are laser engraved with YOUR unique details, every book is one-of-a-kind!I N C L U D E S• Vegan Leather Fabric Binding Book (6\"x9\"  OR  8.5\"x11\")• Cherry or Maple wood covers• Your choice of 30, 45, or 60 sheets of acid-free paper- 28lb Standard Paper option includes BLANK white sheets- 65lb Cardstock Paper option includes BLANK black, cream, or white sheets (recommended for use with photos)*Wood color and grain will vary naturally from the example photo. Wooden covers are coated with a lacquer finish to prevent scratches and to provide a water-resistant coating.H O W  ∙  T O  ∙  O R D E RFrom the drop-down menu:• Select a book size and type of wood• Choose sheet quantity, & paper typeIn the \"Add your personalization\" box:1) Screw Color: Gold, Black, Silver, or Copper.2) Binding Color: See listing photos for all options.3) TEXT to be engraved:*Any other details, such as special design requests and timing deadlines4. Request proof of cover:Check out our shop page for more designs!www.RedBerryGuestBooks.etsy.comT U R N  ∙  A R O U N D  ∙  T I M EIn order to provide a quick turnaround on orders, we do not send proofs of the design unless requested in the notes at checkout.Once the order is received, your book will be sent to production and ready to ship out within about 2 business days. From there, transit time will depend on the shipping method that you select at checkout.………………………………….………………….………………………………Please message us with any questions or for custom requests.We look forward to working with you!© RedBerryGuestBooks*PLEASE NOTE: Wood is a natural product. Knots, dark spots, and grain of the wood will vary naturally. While we do our best to select the best wood pieces for your books, we can not guarantee that the book will be free of these natural occurring variations.",
    "reviews": [
      "Bought as a gift, and they loved it! Would definitely purchase again!!",
      "Great prod u c t",
      "Got this for my cousin and her fiancé! Omg what a beautiful book! I loved how you can custom it as well.",
      "We love it, and I appreciate the quick communication and flexibility for adjustments!"
    ]
  },
  {
    "productId": "tZCDrYtWaF",
    "url": "https://www.etsy.com/listing/676838583/friendship-gift-box-best-friend-gift-spa?click_key=cf75be3ec45ef2a8a4fed103c796289d047bc150%3A676838583&click_sum=bc5aba82&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-31&pro=1&etp=1&sts=1",
    "title": "Friendship gift box / Best Friend Gift / Spa Gift Set / Send a Gift / Gift for Her / Gift For Him / Boyfriend Gift / Friend Birthday Gift",
    "description": "Our heartfelt personalized friendship gift boxes make the perfect gift for your best friend, a friends birthday, long distance friend, going away gift, Christmas gift, gift for a co-worker, female friend, male friend or anyone else who makes  you smile a lot more!! Each of the items in our box are handmade by us!! This means nothing you receive will be made somewhere else and repackaged. You can be assured your recipient is receiving a high quality, handmade item.The candles on this listing read - Because of you I laugh a little harder, cry a little less, and smile a lot more!The scrubs read - 1 Universe 9 planets 204 countries 809 islands 7 seas and I had the privilege of meeting youLarge Gift Set includes -1. 16 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 8 oz sugar scrub & spoon (scent of choice, if you would like a different scent than the candle, please leave me a note in the NOTES TO SELLER section at checkout)3. Peppermint lip balm4. 4 oz Lavender & Lemongrass pure goats milk soap5. 8 x 4.75 x 5.25 Kraft Gable Box with personalized label and cream ribbon.Small Gift Set includes-1. 8 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 4 oz sugar scrub (scent of choice, if you would like a different scent than the candle, please leave me a note in the NOTES TO SELLER section at checkout)3. Peppermint lipbalm4. 4 oz Lavender & Lemongrass pure goats milk soap5. 6 x 4 x 4 Kraft Gable Box with personalized label and cream ribbon.Lg Candle Scrub box includes -1. 16 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 8 oz sugar scrub & spoon (scent of choice)3. 8 x 4.75 x 5.25 Gable Box with personalized label and cream ribbon.Sm Candle scrub box includes -1. 8 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 4 oz sugar scrub (scent of choice, if you would like a different scent than the candle, please leave me a note in the NOTES TO SELLER section at checkout)3. 6 x 4 x 4 Kraft Gable Box with personalized label and cream ribbon.Lg Candle & Box1. 16 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 6 x 4 x 4 Kraft Gable Box with personalized label and cream ribbon.Sm Candle & Box1. 8 oz mason jar candle (scent of choice, the scent choices are in the materials drop down box)2. 6 x 4 x 4 Kraft Gable Box with personalized label and cream ribbon.HOW TO ORDER:1. Choose your desired gift box set from the drop down box.2. Choose your desired scent for the candle & sugar scrub in the drop down box. If you would like 1 scent for the candle and 1 for the sugar scrub, please just leave a note in the notes section at checkout. Also, if you need help choosing the perfect scent, please don't hesitate to message me and I will send you a detailed scent description list, and offer any help I can give. Choosing the right scents is important!!3. Leave your personalization instructions for the box label in the personalization box located underneath the scent/materials drop down.Would you like help choosing a scent? Here's my scent description list, or feel free to message me! :-):https://www.etsy.com/listing/622329608/scent-description-list-not-intended-for?ref=shop_home_active_1&frs=1**FOR THE SAKE OF EASE I CHOSE MY BEST SELLING SCENTS FOR THE LIP BALM AND SOAP, IF YOU WOULD LIKE OTHER OPTIONS, PLEASE MESSAGE ME**If only ordering 1 set your order will be shipped inside the gable box with label and ribbon attached, if ordering more than 1 set the gable boxes will be shipped flat with sticker and ribbon NOT attached, this will need to be done by you :-) They are very quick and easy to assemble.Each 16 oz candle burns up to 100 hours and 8 oz candle burns up to 50 hrs. They are made with 100% pure soy wax, grown in the USA (for quality assurance) and gmo free, & 100% pure  cotton wicks so you can get maximum enjoyment out of this scent without polluting your home or air. We do not add any chemicals or additives to the wax to make it \"throw\" a stronger scent, nor is any paraffin used. Not only is this a natural burning product it's highly scented (using the maximum amount of scent that the soy wax will allow) it also burns evenly and cleanly so that you get the most for your money. There is barely a trace of wax when your done with your candle. I use only cosmetic grade fragrance oils or pure essential oils. I've been making candles for the past 10 yrs. and have tried 100's of scents and picked only the best smelling ones (I kind of have a fragrance addiction!!!). The sugar scrub is made with only the finest ingredients including olive oil, avocado oil, sugar and essential oils or phthalate free oils.Our Goat’s Milk Soap is chock full of Vitamin A and Vitamin D which helps soften skin. This creates a magnificently creamy, soothing lather which helps make your skin soft and moisturized. I've been using it for months and completely adore it!!Ingredients: Purified Water, Glycerin, Sodium Stearate, Sorbitol, Goat's Milk, Propylene Glycol, Sodium Laureth Sulphate (SLES), Stearic Acid, Lauric Acid, Sodium ChlorideChap Stick - Creamy and smooth and completely addicting! Glides on beautifully smooth with no waxy feel. Made with skin softening oils such as Avocado and Jojoba, Coconut Oil for nourishing, and a hint of Castor for a gorgeous shine and pure peppermint essential oils to help sooth those lips on these dry winter days.Ingredients: Shea Oil, Coconut Oil, Beeswax, Jojoba Oil, Castor Oil.Burning Instructions:The first time you light the candle, allow it to burn until the liquid wax covers the entire top of the candle. This breaking in process insures that it will perform better and more evenly throughout the life of the candle. This will insure a clean and efficient burning cycle for the life of the candle.Never leave a burning candle unattended. Keep wicks trimmed to 1/4 inch. If you notice a large flame during burning, blow out the candle & trim the wick before re-lighting. Place burning candle on heat resistant surface. Never move a candle while hot or burning. Blow out the candle if jar becomes excessively hot. Keep out of drafts. Keep out of reach of children.To prevent candles from boring a hole down the middle, burn candles at a minimum of at least one hour for each inch in diameter. For example burn a 3 inch diameter candle for a minimum of at least 3 hours each time. Burn long enough to achieve a melt pool that can be seen all the way around the glass.I do customize orders for your personal needs/wants. Just convo me with any changes and I'll do my best to meet your needs. Please also feel free to ask any questions you may have or feel free to call me at 509/688-5409. My office hours are 7-5 Pacific Standard Time.Thank you!!",
    "reviews": [
      "Gave as a gift and she loved it!!",
      "I purchased this as a gift for my friend and she loved it! Monika was so attentive to my needs and instructions. I would buy from her again in the future.",
      "I haven't seen the items but the person I sent it to loves it!  Would definitely purchase again."
    ]
  },
  {
    "productId": "yVUsykSpHA",
    "url": "https://www.etsy.com/listing/1096915052/personalized-magnet-personalized-gift?click_key=294f3116c6a21edfdc58f8de357f69bd5b8ffcb9%3A1096915052&click_sum=9c08a4cc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-32&pro=1&etp=1",
    "title": "Personalized Magnet - personalized gift , national park, camping, outdoor, camp gift, adventure, Wilde Nomad, beer, magnet, national forest",
    "description": "Any & all wording works! We can have these say whatever you'd like!This custom National Forest/NP magnet is perfect for anyone! You just let us know who or what you want it to say and we will do the rest!Made from scratch on Alderwood this magnet is super lightweight and a keepsake for many years to come!***The ADVENTURING TOGETHER part is a standard saying so if you would like it to not say that just leave us a note. PLEASE MAKE SURE TO DOUBLE AND TRIPLE CHECK YOUR SPELLING AND DATES AS WE ARE NOT RESPONSIBLE FOR TYPOS.If we make the typo we will always make it right",
    "reviews": [
      "I bought this for my son and daughter-in-laws 5th wedding anniversary (wood) I love it can be  custom designed. They will love it and I  got the perfect gift.  This is the second time ordering and both items were awesome!",
      "Great product and hopefully buy more in the future.",
      "Came out great, love it. 👍",
      "Exactly as described. Adorable addition to our camper."
    ]
  },
  {
    "productId": "PrMaYFWJxq",
    "url": "https://www.etsy.com/listing/1179498171/personalised-musical-carousel-wooden?click_key=9cd5f68ee66d0977bfed77d1005989a623effe16%3A1179498171&click_sum=664d30de&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-33&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalised Musical Carousel Wooden - Custom Heirloom Music Box - Engraved Keepsake Gift - Baby Shower - New Mom - Baby Girl - Baby Boy",
    "description": "Our beautiful musical carousels are the perfect keepsake for your little love. Made from beech wood and featuring a sweet tune when turned, our carousels are the perfect piece to treasure for years to come. Each carousel is 11cm wide x 18cm high, and can be lovingly engraved on the front in our timeless script and serif fonts. Choose from ballerinas or horse etched design.Ballerina Carousel plays You are my Sunshine.Horse Carousel plays City of the Sky.*Please note the songs cannot be changed.*Perfectly packaged in a gift box, our Carousels will make the perfect gift for the new arrival in your life and is sure to be treasured for years to come.Please leave the requested name in the 'Personalisation' box on listing. We recommend up to 2 names, as the more names, the smaller the wording will be. The maximum width of the name will be 4-5cm. Please ensure all spelling and capitalisation is correct as no drafts are provided before production. If you select 'No' to personalisation and leave a name, you will receive a non-personalised plaque. Please ensure the correct option is purchased prior to completing your order.A full list of the script font is available to view if you swipe through the listing pictures. Please ensure all spelling and capitalisation is correct, as no drafts are provided before production.",
    "reviews": [
      "So cute well made very happy",
      "My friend loves it for her daughter. It’s beautiful!",
      "The music box came in on time and it met all my expectations.  It’s a beautiful little keepsake"
    ]
  },
  {
    "productId": "cFoIQELtLY",
    "url": "https://www.etsy.com/listing/939065716/personalized-gift-for-her-bridesmaid?click_key=2abd56c83c29890692fd4da737a1b7b5721a8f8b%3A939065716&click_sum=36f4c2e9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-34&pro=1&etp=1&sts=1",
    "title": "Personalized Gift for her Bridesmaid Proposal Gift Will you be my Bridesmaid Gift Personalized Baby Bag Flower Girl Gift Bridal Shower Gift",
    "description": "Gifts Bridesmaid Proposal Bridal Party Bachelorette Gifts✭Need it SOONER 🚀 than the Estimated Arrival? It's POSSIBLE, please contact us!✭🌸THE VIENNE DUFFLE BAGThis cute and rounded duffle comes with accents in Genuine Leather. From the soft and smooth leather button clasp closure to hold onto, to the heat embossed personalized leather label, it's a perfect gift for you and your girls whether it's going away for a weekend, or spending a week on the road.Features and details :- Crafted from natural cotton canvas with genuine leather accents and piping.- Gold zip and accessories.- Gold, Silver, Rose Gold or Natural personalization offered for your Weekender.We can fit everything from Names to Initial(s) or even your wedding initials and date!- Detachable shoulder strap- Size : 9.4\" X 9.4\" X 15.5\" (W x H x L)Handle Height is 9\"Extended Strap Length is 55\"- Available in 8 colors : Navy, Baby Pink, Tiffany, White, Black, Champagne, Lilac and Deep MauvePerfectly fits in the overhead bin and is designed to travel with you!**When selecting \"No Personalization\" or \"Plain\" for Personalization, the bag comes without a leather label** Otherwise, personalized labels will be placed on the outside of the bags as depicted in the listing photos*CARE INSTRUCTIONSWe recommend these to be professionally cleaned to protect the integrity of the items.Our all-natural Cotton Canvas may have some slight color variation built into the fabric. Such natural occurrences may look like tiny spots left on the fabric, however this is simply a part of the natural nature of the handmade canvas:https://i.etsystatic.com/icm/c10851/537799726/icm_fullxfull.537799726_q4cq1531r9wo4kkkss4g.jpg?version=0https://i.etsystatic.com/icm/86f0bd/537799762/icm_fullxfull.537799762_a6tu18qoq8wggo0co04w.jpg?version=0",
    "reviews": [
      "I love these bags already. Got them for my bridesmaids!!",
      "SO adorable and the perfect size for my bridesmaids. Thank you so much!!",
      "Incredible quality and the perfect size for a bridesmaid gift!",
      "Incredible quality and the perfect size for a bridesmaid gift!"
    ]
  },
  {
    "productId": "YpppD4WXnY",
    "url": "https://www.etsy.com/listing/1321131745/bridesmaid-gift-personalized-gift-gift?click_key=b307b64c8447f618a8306bf9df7a767602eb7c11%3A1321131745&click_sum=45d35d2b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-35&etp=1&sts=1",
    "title": "Bridesmaid Gift, Personalized Gift, Gift For Her, Canvas Tote Bag, Beach Bag, Bridesmaid Gift Bag, Wedding, Monogram Bag, XL Boat Tote Bag",
    "description": "Bridesmaid Gift, Personalized Gift, Gift For Her, Canvas Tote Bag, Beach Bag, Bridesmaid Gift Bag, Wedding, Monogram Bag, XL Boat Tote BagHand-painted monogramed canvas XL boat tote bag.Paint color: dusty blueXL size 24\" wide, 15\" tall, 8\" straps.Heavyweight 18oz cotton canvas.Durable 100% canvasZipper closure",
    "reviews": [
      "Just as pictured - very nice!",
      "Just as pictured - very nice!",
      "Amazing quality bags and quick delivery."
    ]
  },
  {
    "productId": "MyTacEUaRp",
    "url": "https://www.etsy.com/listing/1349105194/husband-anniversary-gift-personalized?click_key=373621b6a64db113fa3efa645e2e9716550a9367%3A1349105194&click_sum=94e9274d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-36&pro=1&etp=1&sts=1",
    "title": "Husband Anniversary Gift, Personalized Wood Engraved Docking Station, Custom Valentines Day Gift for Dad, Personalized gift for Men",
    "description": "Whether you are looking for an anniversary gift for him or a father's day gift for the men in your life, this personalized docking station makes them feelspecial. Personalized wood engraved with your name or initials makes it a thoughtful keepsake gift idea.Handcrafted from high-quality plywood, poplar wood, the docking station offers a place to store your wallet, keys, watches, jewelry, and stationery. You can also charge your phone while it is on the dock.Features● Our personalized docking station is one-of-a-kind desk organizer for managing all your daily accessories like Wallets, keys, watches, etc. Even your smartphone phone's personal docking spot.● Our docking station dimensions of the base 8.9” x 6.9” x 0.3”, and for the Board, 8.9” x 6.9” x 0.1”. See if it fits your desk!● Custom wood docking station is handcrafted with high-quality plywood made under excellent craftsmanship that acts as a perfect office desk organizer, Bedside nightstand.● Our wood engrave feature allows you to personalize the docking station with name or initials. Makes it a perfect gift for a husband or yourself. You can surprise co-workers by giving them a Christmas gift or birthday gift.About shippingThe \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.● SHIP BY DATE: When your package leaves our studio.● DELIVERY DATE: When your package arrives to you.Note for international shipping● Please leave full name and contact number.● The customer is responsible for all duties and taxes.● Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.● All of our products are personalized. We will not issue a refund to return-to-sender goods due to unpaid custom duty fee.",
    "reviews": [
      "Great product! Love the personalization.",
      "Fantastic anniversary gift for our 5th anniversary!",
      "I purchased two of these and the recipients really liked it.",
      "This is a lovely gift for sure."
    ]
  },
  {
    "productId": "OoZKVbBxnF",
    "url": "https://www.etsy.com/listing/1417919512/personalized-couple-print-custom-frog?click_key=0914ddaefc1bc08156660b92a16dd409701c5867%3A1417919512&click_sum=84138a5e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-37&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Couple Print, Custom Frog Illustration, Anniversary Engagement Valentines Gift Idea, Cute Wall decor, Retro Aesthetic, UNFRAMED",
    "description": "This illustration features 2 retro frogs drinking coffee together enjoying each other’s company. This print has a cute positive and humorous quote on it that reads  ‘Together until we croak’. This vintage style print is perfect for displaying in your living room, bedroom, office space, or anywhere you want to add a little bit of color and love. Makes a perfect gift for your friend's housewarming, Wedding, Birthday, Christmas or other special events.These illustrations were hand-drawn by me and due to this, they are completely unique and cannot be found anywhere else.- - CHOOSE FROM MULTIPLE PRINT SIZES - -- 5x7 inches- 8x10 inches- 11x14 inches- 16x20 inches- 18x24 inches- 24x32 inches- 24x36 inches- A2- A3- A4- A5- -PERSONALISATION - -This print can be personalized with 2 names and a date - Please fill in the personalization section with the details. *** After placing the order you will receive an email with a link where you can complete your customization and view a mock-up of the finished product. Please complete this step as it will greatly speed up the production time for your order. Our designers will then fine-tune the alignment and font size of your personalizations. **- - ABOUT YOUR PRINT - -- All prints are sold UNFRAMED- Printed locally and sustainably- Printed on thick and long-lasting (uncoated) matte Museum-quality paper- Paper weight: 200 gsm- Shipped within 48 hrs in sturdy board-backed envelopes or postage tubes- Colors may vary slightly depending on the monitor.- This purchase is for PERSONAL USE ONLY- - DISCOUNTS - -Why not create a set? KinderPlanetCompany is offering 15% OFF when you purchase more than one item from the store. To view other similar prints please visit -https://www.etsy.com/uk/shop/KinderPlanetCompany?ref=seller-platform-mcnav&section_id=37610076- -ADD A FRAME - -If you would like to upgrade your print to include a frame please follow this link and add this to your cart along with the print of your choice. Only available for 5x7, A4 and 16x20 prints -https://www.etsy.com/uk/KinderPlanetCompany/listing/1275592777/add-a-frame-to-any-print-in-our-store?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1658945246938- - OTHER PURCHASE OPTIONS - -This print is also available as a digital download. To view the listing please visit my storeTo browse all items in my store including hoodies, t-shirts, mugs and original paintings, please visit -https://www.etsy.com/uk/shop/KinderPlanetCompanyKinderPlanetCompany pledges 1% of their total annual income to creating free resources and workshops for other small artists to help them pursue a career in art. When you make a purchase from my store, you are not only supporting my small business but dozens of other hidden artists as well.Personalized Couple Print, Custom Frog Illustration, Anniversary Engagement Christmas Gift Idea, Cute Wall decor, Retro Aesthetic, UNFRAMED- - ETHICAL MANUFACTURING- -Our contract manufacturers and suppliers are Ethically Made / Sweatshop Free, assuring they meet our high standards for working conditions for your peace of mind, and ours as well.- - TIP THE ARTIST - -If you feel like sending a tip, that is always very welcome and does help a lot! You can easily and safely do so via my Ko-fi here - www.ko-fi.com/kinderplanetcompany- - TAG US ON SOCIAL MEDIA - -Follow us and tag us on social media for exclusive offers and discounts!Instagram - @kinderplanetcompanytiktok - @kinderplanetcompany- - COPYRIGHT STATEMENT - -This design is copyright of ©KINDER PLANET COMPANY LTD, 2022. All Rights Reserved. Protected by protectmywork.comAll copyrights and ownership of images and designs remains with KinderPlanetCompany at all times. Failure to comply with the above mentioned terms & conditions of use is punishable by US and International Copyright Laws.",
    "reviews": [
      "Perfect! Exactly as described. Thank you!",
      "I would recommend this product",
      "Came on time, corner was a little crinkled.",
      "Its so cute and i love it a lot"
    ]
  },
  {
    "productId": "kqsx6aabiJ",
    "url": "https://www.etsy.com/listing/1332269750/minimalist-handmade-birthstone?click_key=d55c0d0917f550620997fe02bff83a53ac0ffacc%3A1332269750&click_sum=410c6a0d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-38&pro=1&frs=1&etp=1&sts=1",
    "title": "Minimalist Handmade Birthstone, Personalized Necklace with Name and Birthstone, Mother's Day Gifts for Her, Birthstone Jewelry for Woman",
    "description": "Minimalist Handmade Birthstone, Personalized Necklace with Name and Birthstone, Mother's Day Gifts for Her, Birthstone Jewelry for Woman,❤When we receive a beautiful gift, we experience joy and surprise together, and we never forget that moment. It is just as happy to give a gift to a loved one as much as to receive a gift that comes on important days or unexpected moments. Now is the time to pamper your loved ones and yourself with these special necklaces.❤The personalized handmade birth stone with sideways name necklaces are prepared with a lot of love for your loved ones as a special gift for Christmas,  New Year, Valentine Day, Mother’s Day, Women’s Day, Thanksgiving, Halloween, New Year, Hanukah and many other days. You can choose name, nickname, the birthstone, colored birth stone, and initials as surprise for your mother, wife, daughter, friend, or beloved ones. You can rest ensure that we will do our everything to deliver to you the best present for your special occasions such as birthdays, wedding days or even when you just want to please yourself.️❤ Why to order from to me?Because I prepare each of orders with care, love and at the same time making sure that all your requirements are taken in consideration. I do my best to prepare and ship the orders in time so you will have your personalized gifts.❤ How to order?👉Please select the Birth Stone from my Birth Stone list then leave the name👉Please choose the material and color.👍Please select your preferred chain length.🎁 Please use the Personalization Box to let us know the “Name, Letters and Numbers” that you would like.👉For birth stone orders, make sure to also choose the month from month option.❤ D E T A I L S✍🏻This piece is made by Hand.✍🏻Birthstone Dimensions: Height 0.39 inches, Width 0.35 inches.✍🏻Come with Individual Gift Box. READY TO GIFT.✍🏻All items are handmade with love and dainty.✍🏻925k Sterling Silver /14k Gold Plated/14k Rose Gold Plated.✍🏻It is 18 inch chain for the model wearing✍🏻We can also make other Stones, If you have a specified Stones, Just feel free to contact us.♥ T A K E ♥ G O O D ♥ C A R E ♥✍🏻Keep it in a dry place. Please take it off before bathing, exercising, swimming.✍🏻Don’t wear it in the pools, the ocean or in hot tubs.✍🏻Keep perfume, sunscreen, lotions, hairspray and other chemicals off your jewelry.✍🏻Store it in air-tight container when you don’t wear it.👉 RETURNS AND EXCHANGES TERMS👈♥ SHOP WITH CONFIDENCE ♥I gladly accept returns and exchanges without any reasons within 14 days of delivery.Enjoy your shopping :)If you have any questions, please click \"CONTACT SELLER\" button, I will reply you ASAP.Enjoy your shopping :)👉HAVE A QUESTION?Make sure to contact to me for every question that you may have or every problem you may be facing during or after order.Each order is made to your specifications, so please make sure to select the right chain length, name, birthstone, as I do not offer a free replacement.❤TERMS AND CONDITIONS1. If there is an issue with your chain or necklace, I want to replace it. However, if the issue is your chain length, wrong spelling, wrong date, or birth stone from the customer, I do not obligated to replace it.2. The orders are handmade and processed immediately, I am unable to accept cancellations after 3 hours from the time you place your order.❤PROCESSING TIME🚚Processing time for our handmade items is 3-5 business days.♥ If you have any questions, please feel free to contact me.❤Thank you for supporting women with small businesses!We hope you like the jewelry we creating.Ester♥",
    "reviews": [
      "I like it. Not as pleased with the name as it is hard to read. I like the one I bought before better.",
      "My girls absolutely loved these necklaces. Thank you for getting them to me so quickly.",
      "My girls absolutely loved these necklaces. Thank you for getting them to me so quickly.",
      "I sent it away. I didn’t see it."
    ]
  },
  {
    "productId": "gScOzKXWon",
    "url": "https://www.etsy.com/listing/1056370809/personalized-marble-gold-cheese-board?click_key=65e2b9ca4eb5ef2a08189138de190b1c4986580a%3A1056370809&click_sum=1f188e96&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-39&frs=1&etp=1&sts=1",
    "title": "Personalized Marble & Gold Cheese Board - Custom Cutting Board - Charcuterie Board - Serving Tray - Wedding Gift- GOLD EDGE",
    "description": "This marble board is the go-to gift choice for friends who love to entertain, so look no farther for a gift for your favorite host or hostess and know that this custom engraved cheese board will be enjoyed at parties for years to come.Enhance your kitchen with our exquisite personalized cutting board! Handcrafted with care, this beautiful board features your choice of custom engraving, adding a personal touch to your culinary adventures. Versatile and practical, it can also be used as a charcuterie and cheese board or a stylish serving tray platter. Perfect for housewarming gifts or for treating yourself to a unique and functional addition to your home. Elevate your entertaining experience and make a statement with this stunning and personalized cutting board.Charcuterie Board Info:- Marble with gold edge measures 15\"x9\"- ENGRAVED- Hand wash- GOLD EDGECoasters Info:- Marble with gold edge measures 4\"- ENGRAVED- Hand wash- GOLD EDGE- White coasters are Hexagon- Charcoal coasters are Round--- Add WRAP---- Gift wrapped in kraft paper with a seasonal bow and handmade wood tag.Marble is a  porous stone and has many character traits can include variations in textures, markings and colors. Since marble is a natural product, it has imperfections and is not flawless. No two boards will be identical. It is typical for marble to have both shiny, and dull spots. This board is a natural product that does not get the same polish/finish as high end countertops.",
    "reviews": [
      "Beautiful beautiful… quality is 5 stars!!",
      "The marble cheeseboard is beautiful! Will likely order it again as a gift",
      "Absolutely gorgeous! Was packaged so well and arrived pretty quickly too!",
      "Such a beautiful piece of marble. The writing adds a personal touch to it. Looks amazing. I absolutely love it. Shipping was quick. If anyone is looking for a unique gift, look into this business. You won’t regret it!"
    ]
  },
  {
    "productId": "SyTVCkGteP",
    "url": "https://www.etsy.com/listing/1090884937/plant-propagation-gift-gift-box-grow?click_key=982d0db691646dca97a1b8c1de152d5552707bde%3A1090884937&click_sum=1fa16487&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-40&pro=1&frs=1&etp=1&sts=1",
    "title": "Plant Propagation Gift + Gift Box | Grow Your Plants Starter Station | Gifts For Her | Indoor Plant Cuttings | + Free Plant App Membership",
    "description": "PRODUCT OVERVIEW----------------------------------🚚 Free 2 Day UK Delivery🚚 Express 1 Day UK Delivery - just £2.95🚚 We dispatch orders within 24 hours🚚 Free 5-7 Day International Delivery🚚 Express 3-5 Day International - just £2.95🚚 All orders sent Fully Tracked🎁 All orders come gift-box ready🎀 Wrapped in 100% sustainable packaging✏️ Add a free hand-written gift message🎁 Add extra eco-gift wrapping for just £2🌱 Perfect for growing plant cuttings🛠️ Comes fully assembledPRODUCT DESCRIPTION----------------------------------Every plant-lovers must-have for growing at home, every order hand gift-wrapped with 100% planet-friendly packaging. Perfect for propagating cuttings or adding soil to turn it into an indoor feature plant pot. It comes with glass vases, bamboo plant labels, a propagation guide, and a 6-month free membership to Greg plant care app (worth £15), where you can track the health of your plants, get plant care tips, and set watering reminders. The glass vases are around 3.5cm opening in width and 10cm in height, and no glue or tools are required for assembly.WHAT'S IN THE BOX----------------------------------🎁 The Propagation Station + glass vase(s)🎁 Bamboo Plant Label(s)🎁 A Propagation Guide🎁 6-month membership to Greg Plant Care App (worth £15)🎁 A Gift Card (optional)GIFT CARD INFORMATION----------------------------------➤ If you have selected a 'Luxury Gift Card', then please type in the personalization box which of the 5 luxury gift cards you would like.➤ If you would like a gift message written on your 'Free Kraft Gift Card' or 'Luxury Gift Card', you can add this at the checkout stage by clicking ''Add a Gift Message''.➤ If you select the ''Free Kraft Gift Card'' or ''Luxury Gift Card'' but you do not add a gift message at the checkout stage, we will send the gift card blank so you write on it yourself.+ ADD A BOX OF BAMBOO PLANT LABELS---------------------------------------------👁️https://www.etsy.com/nz/listing/922023910/- OR SEE OUR OTHER PLANT PROPAGATORS---------------------------------------------👁️https://www.etsy.com/uk/shop/EcoPurpleTurtleCo100% PLANET-FRIENDLY PACKAGING-----------------------------------------🌱 All packed plastic-free using...🌱 Flexi-wrap hive paper🌱 Recycled padded paper shipping bag🌱 100% eco-friendly gift box🌱 Recycled paper filler🌱 Cotton string & recycled twine🌱 Paper stickersDELIVERY TIME & PROCESSING----------------------------------🚚 Free 2 Day UK Delivery🚚 Express 1 Day UK Delivery - just £2.95🚚 We dispatch orders within 24 hours🚚 Free 5-7 Day International Delivery🚚 Express 3-5 Day International - just £2.95🚚 All orders sent Fully Tracked🚚 If you are ordering multiple items, we will still gift pack each item separately so you can gift them to different people3 AVAILABLE SIZES----------------------📏 Single: 12cm (H) x 10cm (W) x 6cm (D)📏 Double: 12cm (H) x 17.5cm (W) x 6cm (D)📏 Triple: 12cm (H) x 25cm (W) x 6cm (D)📏 Ultimate Set of 3 (Includes 1 single, 1 double and triple)FAST RE-STOCKING----------------------------📦 Due to high demand, out-of-stock items will usually be back within 1-3 days, click restock request, or message us to reserve an item.WHY BUY FROM US?-----------------------------All our profits from our Etsy shop go towards funding our sustainability projects over at Purple Turtle Co...➤ Zero-plastic and 100% fully recyclable and biodegradable packaging.➤ 99%+ 5 Star Reviews➤ If you would like your order sent out on a specific date, send us a message and we can delay it being dispatched➤ Get a 30% OFF coupon for your next order➤ We reinvest profits into funding ocean plastic clean-up, tree plants and carbon offsetting. Check out www.purpleturtleco.com for our live impact reports➤ Full refund if you are unhappy with your order",
    "reviews": [
      "looks great and it’s very useful",
      "Great service and product. Very happy customer",
      "A great gift for my sister! Thank you"
    ]
  },
  {
    "productId": "aZVVAevxFn",
    "url": "https://www.etsy.com/listing/1436333342/personalised-6th-anniversary-raw-finish?click_key=1bcf219025b8f1d7b67af191164167d67852de0f%3A1436333342&click_sum=61f80bf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-41&frs=1&etp=1&sts=1",
    "title": "Personalised 6th Anniversary Raw Finish Iron Gift - Hand Forged Metal Engraved Bookmark with Real Leather Tassel Bookmark Gift for Husband",
    "description": "A 6th Wedding Anniversary Gift Made of Iron! With a raw metal finishThis iron bookmark is hand forged using hammer & anvil to make a truly unique, one-off keepsake.Once forged into shape it is roughly polished using wax to create a protective and attractive patina of dark 'raw' metal.✒️Personalize your Bookmark with up to 50 Characters - We have a blank bookmark ready for you to put your design on.Got something you'd like to say? They're ready to be personalized with something on the front and/or back with your own text or quote - We use individual letter & number punches to hand-stamp the bookmark to make the perfect gift for friends, teachers, partners...To deep and meaningful or down right cheeky - the choice of what you have stamped is yours!Need some ideas?   ***Check out our gallery photos for some examples from our customers!***⌛ In a Rush?Here's a ready made Raw Bookmark with our most popular designs:https://www.etsy.com/uk/listing/1577485985/-OR- 👁️👁️ Take a look in our Express 6th Anniversary Shop Section for more quick gift ideas!🔨🔥Made on- site and forged from iron then polished with wax.A touch of class with real leather tassel, so the page will always be found.📐Dimensions✮ Length 5.75” (150mm)✮ Width 1'' (25mm)✮ Weight ~2oz (67g)✮ Forged from metal thickness 1/8th (2.5mm)>>We attached a real leather tassel, of which the colour may vary.🎁 Sent in a card sleeve ready for gifting.➢Gift Wrapping service available at the checkoutSimple care Instructions included⌛ or - ARE YOU IN A RUSH?We have ready-made bookmarks with our most popular designsClick here! ->https://www.etsy.com/listing/888977469/✒️Personalised with up to 50 individually hand stamped characters.This bookmark makes a fantastic gift whatever the occasion so get composing that message or inspirational quote and together we can immortalize it in IRON!!!✒️HOW TO ORDER :1.  To personalize your bookmark; compose your message and count the number of letters, numbers and symbols to get your total characters.2. Next, select the correct total number of charterers at checkout from the drop-down menu i.e. if your message has 15 characters select the 11-20 character option.3. Type your personalisation in the 'Personalisation Tab' on the product page.NB: We stamp with artists discretion unless otherwise instructed.>>If you require more characters please request a custom order and I'll get right back to you!_____📦 SHIPPING & MAKING TIMES 🚚✈️Processed within 24 hrs Monday-Friday!♚ Shipped within the UK 1st class  TRACKED🌍 Shipped World-Wide using Royal Mail International Tracked, 5 - 12 Days.For shipping to other international destinations please contact us for a price.Options of tracked & express shipping available at the checkout.⚠️ If you choose expedited shipping please provide your 📞 Mobile number for the manifest or to receive text updates.❌ Estimated shipping times are not guarantees____This listing is for one bookmark",
    "reviews": [
      "Quicker than anticipated. Looks great!",
      "Excellent! Good to hear the post is working hard. We started making scroll versions of these raw finish bookmarks now.",
      "Item As described and pictured. Fast shipping.",
      "Thank you for your review, Lexie, it means a lot to us.",
      "It’s the perfect gift for our 6th Wedding Anniversary! It shipped out so fast too!!",
      "No worries, Leticia. We will always try our best to make every order as fast as possible, all personalized items will take at least a day, but if we can get them out sooner than expected we will. :) Please you noticed out efforts.",
      "great product, good material, and quick shipping considering it came from across the pond",
      "Awesome! Thanks for letting us know, Robert."
    ]
  },
  {
    "productId": "AwGrVfTbUQ",
    "url": "https://www.etsy.com/listing/1149722029/personalized-family-sign-custom-standing?click_key=26372b8fded715dae822f760101c35015228b7ba%3A1149722029&click_sum=e119a051&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-42&pro=1&etp=1",
    "title": "Personalized family sign, Custom standing house centerpiece, farmhouse decor, great housewarming or new family gift, christmas gift",
    "description": "Once the package leaves our hands and is dropped off into USPS possession we are not responsible for delays or issues on their end.Colors available now are as pictured (white, black, gray and brown stain).The custom color option is a slight upcharge and can message with colors to make sure it is possible before ordering.If you would like it without the letter initial on top of the plaid just leave that option blank or we can do a heart. we can fit up to 8 names on the name style house.This piece is made with 1/4 in birch and the 3d elements on top are made with mdf.The houses will come separate from the base for easy and safer shipping. you just slide them into the slots.This sign would be a great addition to any home. The base is about 15 inches and the tallest house is around 5 inches.This listing is for the 3d sign only. Photo props, book stacks or anything else in the picture is not included in purchase.Every sign or item in our shop is handmade by us personally. There is no vinyl on the finished product.The 3d elements are made with mdf so this sign is recommended for indoor use only.Please view turnaround time on etsy at checkout and keep in mind everything is handmade. Our turnaround time is typically 1 to 2 weeks and may be longer during the holiday season.Due to all products being made to order there are NO REFUNDS, If there are any issues with your product when received please send us a message and we will see what we can do to fix any issues.If you are looking for something custom made send us a message and we can customize for you! There will be an $8 up charge if you want completely custom colors.Keep in mind actual colors may slightly vary due to the screen color calibrations.  Product will have burn marks on the back that arent visible from the front due to the laser process of cutting.",
    "reviews": [
      "Great quality product. Happy with purchase.",
      "This personalized sign is precious! It is so well made and will make a perfect gift! Thank you so much!",
      "Great product, my daughter will love it."
    ]
  },
  {
    "productId": "SsQpQb9PUA",
    "url": "https://www.etsy.com/listing/1541179780/custom-engraved-mini-bar-bracelet-with?click_key=d7e99f6dcd8e7543fa7a0b8b00b720755d0679a2%3A1541179780&click_sum=1db630b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-43&pro=1&etp=1",
    "title": "Custom Engraved Mini Bar Bracelet with Curb Chain - Personalized Name Bracelet - Dainty Stackable Bracelet *DARCY BRACELET*",
    "description": "DARCY BRACELETThe perfect way to show your appreciation, this engraving name bracelet, is a heartfelt piece of jewelry that is sure to bring a touch of sentimentality. This bracelet features a beautiful engraving with personalized mini bar nameplate, creating the perfect gift for any special occasion. The personalization options allow you the freedom to customize your bracelet with the names of your loved ones.From anniversaries to birthdays, graduations to holidays, and everything in between, this high-quality bracelet is sure to bring a smile to whoever receives it. Show your love with this one-of-a-kind piece of jewelry that is designed to last.*MATERIAL:— 100% Recycled Sterling Silver - This solid, precious metal is a classic that lasts forever. While it may darken over time, with continuous care and an occasional, it’s as good as new.— 18K Gold Vermeil - For those with an eye for striking gold, our gold jewelry uses sterling silver as a base and is plated with a durable and thick layer of 18-karat gold vermeil.— 18K Rose Gold Vermeil - Our rose gold jewelry uses a sterling silver base with 18-karat rose gold overtop to give our jewelry a pink-golden hue.Vermeil is nickel-free and perfect for people with metal allergies.*DIMENSION:Bar diameter: is 2.5x20mm. in height.*ENGRAVING:Enter the letters/numbers you want on your bracelet in the Personalization box.— Choose a font from the Engraving font chart options.— Uppercase letters only.— You can choose to engrave on one side or both sides of the plate by selecting one of the options in the dropdown, specify engraving in the personalization box:Front side \"SAM\" & back side \"I LOVE YOU\"— Maximum 9 characters.*ONESIDEDPersonalization will be engraved in front of the bracelet.*DOUBLESIDEDPersonalization will be engraved in front and back of the bracelet.*LENGTH:Select the length you want for your bracelet from the drop down menu. Our bracelets are adjustable. A 5-5.75\" bracelet can be worn at 5\" or 5.75\" length.CUSTOM LENGTH:If your size is different from our available length options, and you want a perfect fit, we can make a custom length for you. Just put the length you want to have in the Personalization Box.TIPS: measuring your wrist using a string or ribbon, wrap it a little loose around your wrist unless you want a snug fit. Mark where the end meets and use a ruler to measure the length.*PRODUCTION TIMEPlease see Shipping & Policies for our most updated production time.*RUSH ORDERPlease select 'Rush Order + Express Shipping' at checkout and include the desired delivery date in the Notes section. Our team will reach out to you to confirm if your request has been accepted.*GIFTINGYou’ll have the ability to add a personalized message to your order. Please lease your messaging in the Note box upon checkout. Once we receive it, our team will print out the message on a notecard and include it with your order.While we currently don’t have gift wrapping, each and every piece is perfectly packaged in true Grace Personalized fashion.***Thank you for supporting our small but growing business! From us to you, we're so grateful to have you here. What started as a passion for making intentional pieces grew into a business full of heart. Every groove and engraving that’s gone into making your one-of-a-kind piece was handmade by local artisans in Vietnam with care, intention, and, most importantly, love. With your artistic vision and our craft, together, we’ve created something truly unique.Here’s to celebrating the beauty in this moment!Your artisans,Grace PersonalizedFollow along @gracepersonalized and share with us your #gracepersonalized story.",
    "reviews": [
      "Got it for my boyfriend and he loved it.",
      "Great customer service. Very helpful. Bracelet is dainty and I love it",
      "Prefect bracelet! Made well and shipped quick"
    ]
  },
  {
    "productId": "TVgEukvJfk",
    "url": "https://www.etsy.com/listing/1363332956/personalized-pacifier-clipcustom-newborn?click_key=362d9976f83fcd4f3b655450d4242917359d0b34%3A1363332956&click_sum=9f87d378&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-44&pro=1&etp=1&sts=1",
    "title": "Personalized Pacifier Clip,Custom Newborn Pacifier Clip|last minute Baby shower Gift|Boho Baby Gift|Custom Pacifier Holder|Easter Gift",
    "description": "What sets us apart :♥ Our Stainless steel Clips will attach tightly to your baby's clothing so they can't take it off without parent's help and will not leave a mark on clothes unlike other clips in the market.♥ The Wooden letters are all natural and untreated beechwood.♥ Our pacifier clips are made with BPA free, Non-toxic, 100% Food Grade Silicone.♥Ready-To-Gift Personalized Clips : Comes with a high quality drawstring cotton bag. (Which gives a valuable impression to gift receivers)♥ If you're sending it as a gift,We can hand write a gift message on a cute card.♥Fast Shipping and cute packaging.♥Our minimalistic gender neutral colors make it the perfect baby shower gift,Easter Gift and a great keepsake too.Care & Saftey Instructions:♥ To clean, wipe with damp cloth and use a mild soap.♥ Pacifier clip is NOT dishwasher safe. Please do NOT submerge wooden parts in soapy water.♥ Never leave baby or child unattended. Do not use during sleeping times. Discard if there is any sign of damage.**IMPORTANT NOTES**-To comply with safety standards and hygiene , pacifiers and pacifier clips must be changed every 2-3 months of consistent use.Always check your pacifier before use and discard at first signs of damage or wear.-Maximum 9 letters.-First Name or initials only, No Full Names.-We will be glad to send you a layout preview of the beads upon request. Just send us a message.****************************-Have any question?I'm super fast to reply messages.",
    "reviews": [
      "This item came faster than expected and looks exactly like the picture! I definitely recommend and will be ordering more items from this shop!! Looks exactly like the picture",
      "As cute as I thought it would be! Love!",
      "Arrived fast, item looks great! Thank you"
    ]
  },
  {
    "productId": "yvyAghrO7B",
    "url": "https://www.etsy.com/listing/1465089583/decision-maker-coin-decision-flip-coin?click_key=7ad08c56d7174bb614f01a07639a49f9b3503ccf%3A1465089583&click_sum=14b8d1ee&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-45&etp=1",
    "title": "Decision Maker Coin - Decision Flip Coin Personalised |Couples Decision Making | Wooden coin with names | Dual sided Decision Coin",
    "description": "Decision Maker Coin - Personalised Flip to decide coinCan't decide who's going to cook? Who's turn is it to take the bin out? Who's picking the takeout?Take the stress out of the situation with this beautiful wooden Coin. Made from your choice of wood and engraved with your names, this will make a perfect gift for a couple or a way to solve those everyday indecision.Makes excellent gifts for weddings  or new homesChoice of woodsWalnutCherryMapleOakAshBeech**Personalisation**Be sure to double check spelling before submitting, enter the 2 names you would like adding ( 1 name per side )All items are made to order so please contact me if you need any spil requirementsAll orders are made and dispatched from the UK. Standard shipping does not include tracking, this is only available with tracked delivery at checkout.",
    "reviews": [
      "This item was very pretty.",
      "High quality, quick to arrive, a great gift!",
      "Great quality, can’t wait to use it!",
      "Great quality and great present for my wife!"
    ]
  },
  {
    "productId": "XOyyJitmOG",
    "url": "https://www.etsy.com/listing/1020128570/laurel-wreath-personalized-galvanized?click_key=a9ab1487a14a74d0a0a81876f28a6f4b8b7dc6f7%3A1020128570&click_sum=204872e7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-46&pro=1&frs=1&etp=1",
    "title": "Laurel Wreath Personalized Galvanized Beverage Tub, Personalized Wedding Decor, Personalized Party Tub, Personalized Wedding Gift",
    "description": "Keep drinks cold and refreshing any time you have guests over with the Laurel Wreath Personalized Galvanized Beverage Tub. This tub is perfect for indoor or outdoor parties and makes a great gift for a housewarming party or wedding.𝙉𝙤𝙩𝙖𝙩𝙚:Galvanized material has a pattern in the finish. This pattern will be visible and is inherent to the product𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- For indoor or outdoor use- Two handles for easy carrying- Constructed of galvanized iron- Measures 21\" W x 12\" D x 8.5\" H- Not water-tight, liner recommended for use",
    "reviews": [
      "Absolutely love this! Great Product and Worth Every Penny!! Thanks",
      "Item came very quickly! exactly as pictured and will work perfect for our wedding!",
      "This is a bridal shower gift at the end of this month and I am excited to bring it.  I am sure the bride will love it as much as I do.",
      "Great product! Excited to gift it to my in laws"
    ]
  },
  {
    "productId": "KXwuetclS9",
    "url": "https://www.etsy.com/listing/1374847577/custom-embroidered-roman-numeral-hoodie?click_key=e7863823b460961606e8efd5ba80d65c8b893115%3A1374847577&click_sum=1325237e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-47&pro=1&etp=1&sts=1",
    "title": "Custom Embroidered Roman Numeral Hoodie, Custom Date and Initial Hoodie, Anniversary Engagement Gifts, Valentine's Day Gifts for Couples Him",
    "description": "Valentine's Day Gifts for Couples, Valentine's Day Gift for Her HimCustom Embroidered Roman Numeral HoodieEmbroidered Custom Hoodie + Personalized  SleevePerfect gift those who love it cozy! Personalized with the most colorful threads! You can match your thread color to your significant other's hoodie color and visa versa.These hoodies make the perfect engagement gift, anniversary gift and valentines day gift.---IMPORTANT!This listing is only for 1 hoodie.Here is how to order 2 hoodies separately:1) Enter all the information of the 1st hoodie as described and then CLICK - ADD TO CART2) Come back to the listing (or you will already be in the lsiting page) and then chaneg the information for the new item.Once you are ready click -- ADD TO CART3) Now you can either go to checkout or continue shopping! Both of your items will be in the cart :)---Matching couples sweatshirt make the most cozy and meaningful gifts for couplesThis item is fully customizable!- You an choose the color of your thread- You can customize the sleeve with your loved ones initial, name or your favorite quote!- You can personalize the pocket area with your roman numeral date or any text!The perfect gift for your significant other, or your newly engaged or married friends or family ❤️Note: You can also find custom sweatshirts in our shop that are personalized with vinyl. This listing is for EMBROIDERED sweatshirts.-Unisex Size(Please see the size chart for more details that can be found in the photos section)We recommend comparing your favorite sweatshirt to our size chart to find the best size for you!Hoodies:-50% cotton 50% polyester-Super soft-Pre-shrunk-UnisexFor Crewnecks please Visit:https://www.etsy.com/listing/1114425487/custom-embroidered-roman-numeral-hoodie?ref=listings_manager_gridCouples Gifts, Personalized Gifts for Couples, Embroidered Crewneck, Embroidered Matching Hoodies",
    "reviews": [
      "Material is nice and is up to what I expected",
      "Thin material but still great quality! Overall happy with my purchase.",
      "Thin material but still great quality! Overall happy with it.",
      "Quality is fantastic. Very soft and embroidery is perfect."
    ]
  },
  {
    "productId": "kOBAMQWqNA",
    "url": "https://www.etsy.com/listing/1275026920/personalized-wooden-guitar-picks-with?click_key=3d23311a956f83d3a2ad45e8c85c628354b29559%3A1275026920&click_sum=d0d739ff&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-457746-5-48&pro=1&etp=1&sts=1",
    "title": "Personalized Wooden Guitar Picks with Case, Custom Guitar Pick Holder, Plectrum Box Guitar Player Gift, Father's Day, Gifts for Christmas",
    "description": "Free Ship on US$ 35 (Tips: If not get free ship, just buy 2 any pieces in my store)------------- Automatically minus cost in the cart -------------Personalized guitar logo and name pick Case, made of natural walnut wood, close to the natural, and provides natural inspiration for your music creation.The perfect gift for birthdays, Father's Day, Valentine's Day, Christmas, Christian/church celebrations, graduations, and anniversaries;D E T A I L-----------------------Case (Walnut): 1.57'' x 1.57'' x 1.1'' (40 * 40 * 28 mm)Pick: 1.06'' x 0.98'' x 0.1'' (27 * 25* 2.5.mm),The pick 4 colors: W2 (Guibourtia), W3 (olive wood), W5 (Red wood), and W6 (black wood). Just remark color number, Example: Pick1, W2, Your text.E N G R A V E------------------------ Case: Choose the design, and leave the Engraving text.(If you do not leave a message for the design, the case will be engraved according to design 22 by default.)- Pick: Available in 33 kind of designs, leave the design and text.Please leave Engrave Text like this:Case, Design22, Font10, JackPick1, W2 wood, design P16 , A,Ace.Pick2,Pick3,Capo,HOW TO ORDER-----------------------► Please select from the drop-down options► Add any personalization/customization info to the personalization section or notes to seller section at checkout-it will appear after you add your item to cart and go to the checkout. be sure to double-check your info for accuracy!►If you have specific crop requests please let us know in the notes!►If you have any questions, please Message us or email:  myguitartips [!at] gmail.com",
    "reviews": [
      "Service was excellent. Fast shipping and great product.",
      "Customer service was excellent. They reached out to me to confirm my design and everything before getting the order ready. Also recommended a font that would look better with our design. Arrived in perfect condition.",
      "Beautiful as described met my expectations",
      "Excellent quality, perfect gift, fast shipping"
    ]
  },
  {
    "productId": "sgjmPDUtEp",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=7e1c9a9d69550de25a97112940fab47d29adf0f2%3A1115114382&click_sum=633bf219&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "OneeeHkgVE",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=0761810bc625c9fc65967cfba0a4417cddfd276f%3A654638870&click_sum=a463cd23&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "DbKPuXrEbU",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=8cbbe00f48d04a83637829ef61e8062180ae01ad%3A1355783916&click_sum=21f468ed&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "XEqPcEzDGf",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=d7821d89a4f049b0bc06ad429917e38949b831bd%3A1411614241&click_sum=3729a896&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "zftjPmAISv",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=c7bea2f4e9859e20e6db0dded50ff08416753419%3A999136086&click_sum=9a5e070b&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "yQCDiHFdjI",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=8b23e49435dbad8879aa914c6749f66fa4f69369%3A1440285597&click_sum=a2664fd8&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!"
    ]
  }
]
