[
  {
    "productId": "mJWJKxvwsE",
    "url": "https://www.etsy.com/listing/1182013267/koi-trellis-rusted-yard-art-garden-gifts?click_key=6521135a18ab55bac3e912bcf92f8cd59b28ef48%3A1182013267&click_sum=d3b6c7b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-1&pro=1&frs=1",
    "title": "Koi Trellis | Rusted Yard Art | Garden Gifts | TR327",
    "description": "Brighten up your garden and home with this beautiful Koi Trellis!Makes a great birthday gardening gift for mom and grandma. Perfect as a Thank You gift and for Mother’s Day to add life to any space. An elegant addition to any yard or garden!Naturally occurring oxidation gives this piece of garden art a rustic and charming life about it, complementing the luscious greenery around it.🛠️  SO EASY TO INSTALL & DISPLAYOur metal garden art inserts easily into soft ground when using two hands for support. Be mindful of rocks and roots that may catch the metal stake, and adjust the depth as needed.✔️  THE PERFECT SIZEDimensions: 81\" Tall x 30\" Wide📦  PROMPTLY SHIPPEDCarefully picked and packaged to ensure safe arrival, your products should arrive within 1-2 weeks.🌱  INSPIRED BY NATUREWe've been setting the scene with playful silhouettes since 2011.As a husband and wife team from the Pacific Northwest, we've always combined superior craftsmanship with iconic design to help our customers bring the beauty of nature home.🔍  DISCOVER MOREVisit our shop home page to discover more ways to add charming inspiration and rustic accents to your yard, garden and home.👋  LET’S CONNECTIf you're inspired by what you see, click the ‘Favorite Shop’ button above and then join the conversation on our social platforms (copy & paste into web-browser)Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/",
    "reviews": [
      "Beautiful addition to my sister’s yard!  She was thrilled!",
      "Beautiful high quality yard art. Looking forward to develiping my space aroynd these 2 panels.Prompt shipping. Definitely would buy from this seller again.",
      "Love this! I have ordered from Rusty Bird before and always satisfied with their products."
    ]
  },
  {
    "productId": "vTSsBrRwwC",
    "url": "https://www.etsy.com/listing/1444829900/personalized-wedding-gift-outdoor-wood?click_key=a31b3dbae47c9861105f248deea1f369b96e31d4%3A1444829900&click_sum=890fdab0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-2&pro=1&frs=1&etp=1",
    "title": "Personalized Wedding Gift, Outdoor Wood Cooler, Patio Furniture, Gifts for Couples, Custom Cooler, Backyard Decor",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @friocoolersFollow us on Instagram @friocoolersFollow us on Youtube @friocoolersThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Ordered this as a team gift for my boss' wedding - it came out perfectly and the seller was super helpful with multiple changes to the mockup. Delivered on time and we were able to enjoy using this for a backyard get together! Would definitely recommend :)",
      "Great wedding gift!!  Beautiful and classy!",
      "Great quality, sturdy! \nBeautifully done…"
    ]
  },
  {
    "productId": "ZZognfrrBR",
    "url": "https://www.etsy.com/listing/1604932355/exquisite-handmade-moroccan-mosaic?click_key=36aa6bc9282c7c6eb65402ff0cef88d89737d1dd%3A1604932355&click_sum=0c059af4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-3&pro=1&frs=1",
    "title": "Exquisite Handmade Moroccan Mosaic Coffee Table - A Work of Art for Your Patio or Bistrol,patio table, coffee table, interior decor",
    "description": "Elevate your home decor with our stunning, handcrafted Moroccan mosaic coffee table. This unique piece is designed to be a focal point in any setting, whether it's your cozy patio or a charming bistro. Crafted with meticulous attention to detail, this mosaic table is a true work of art, showcasing vibrant colors and an intricate geometric design inspired by classic Moroccan decor.Our mosaic coffee table is more than just furniture; it's a statement piece that adds a touch of luxury to your interior decor. The premium materials used and the unmatched craftsmanship ensure that this table is not only beautiful but also durable and built to last.The checkered pattern of the mosaic top is a testament to the dedication of our skilled artisans in Morocco who have honed their craft for generations. Each piece of tile is hand-cut and placed with precision, creating a visually striking mosaic that seamlessly blends traditional Moroccan design with contemporary elegance.Our table is not just a piece of furniture; it's an expression of art and culture. It serves as both a functional coffee table and a captivating home accent, transforming your living space into a masterpiece of design and style. Whether you're sipping your morning coffee or enjoying an evening cocktail, this table will enhance your experience.Here are some key features of our Moroccan mosaic coffee table:Vibrant Colors: The use of rich, vibrant colors in the mosaic adds a lively and inviting touch to any space.Geometric Design: The intricate geometric pattern is a visual delight, providing a unique focal point for your decor.Moroccan Decor: Inspired by the beauty of Moroccan design, our table brings the essence of Moroccan culture to your home.Premium Materials: We use high-quality materials to ensure the longevity of your investment.Craftsmanship: Our skilled artisans pour their heart and soul into each piece, creating a masterpiece of craftsmanship.Whether you're redecorating your patio, adding character to your bistro, or simply looking for a remarkable coffee table that tells a story, our Moroccan mosaic coffee table is the perfect choice. It combines art, functionality, and culture in one exquisite piece.Make a statement with your home decor and experience the beauty of Moroccan craftsmanship by bringing this remarkable table into your home.Our Moroccan checkered mosaic table is more than just a functional piece; it is a statement of refined taste and appreciation for fine craftsmanship. Made with premium materials and built to withstand the test of time, this table is a testament to exceptional quality and durability.Versatility is at the heart of our Moroccan mosaic table, making it a perfect addition to any space. Whether as a captivating centerpiece in your living room, an elegant coffee table in your patio, or a striking accent in your interior decor, it will infuse your surroundings with a touch of Moroccan charm and allure.By choosing our table, you support not only the preservation of Moroccan artistry but also the empowerment of talented artisans, particularly the women of the Berber cooperative who play a vital role in its creation. Your purchase contributes to their livelihoods and helps sustain the rich cultural heritage of Morocco.Immerse yourself in the allure of our Moroccan checkered mosaic table. Let its intricate patterns and vibrant colors transport you to the enchanting streets of Morocco. Elevate your space with this timeless artisanal marvel, destined to be the focal point of admiration and conversation among your guests.✅ Infos :-Place Origin : Morocco ( FEZ )-Materials    : Organic CLAY-Color          : Every Table has unique petterns (mosaic tiles ), colors and sizes✅ Take care of your Moroccan Mosaic Table :- Wipe your ceramic table only with a soft cloth or sponge,- Clean your table by hand gently✅ Need Help We are here for you Contact Us :-Please do not hesitate to contact us via etsy. we will get back to all messages with in 24 hours✅ Packaging and Shipping- The Mosaic tables Packed in bubble wrap with other packing materials, placed in a wooden box and shipped withe care.- All of our products are shipped with FedEx.- We ship All the week except for Saturday, Sunday and holidays.- After you have placed your order, you will receive a confirmation message requesting a phone number. We need it for the tracking documents.- We will provide a tracking number once your item is shipped- We take a lot of pride in our items and will always make sure they are very well packed and protected for shipping.- Please be aware of delays on shipping that are out of our control such as Customs holds, Holidays, weather delays or other disruptions.✅ MONEY BACK GUARANTEEYou are covered by the Returns & exchanges policy of our Shop policies.We want all our customers to be completely satisfied!Thank you for visiting",
    "reviews": [
      "Top transaction. Very nice carpet.",
      "The pillow I purchased was even more beautiful in person, and of exceptional quality. Heavy wool with saturated colors. Shipping was super fast and communication was a breeze. I highly recommend this shop.",
      "Beautiful quality, packaged very well and I’ll definitely be ordering from this shop again in the future. Thankyou so much!",
      "Rug is beautiful. Seller was incredibly helpful, responsive and communicative and the item arrived at quickly and well-packaged. couldn’t have asked for a better experience."
    ]
  },
  {
    "productId": "omzYHOVnRA",
    "url": "https://www.etsy.com/listing/815326401/outdoor-patio-throw-pillows-colorful?click_key=6d165dcabd33d8b1490f151fc5861b6b0e8eb86c%3A815326401&click_sum=2a521754&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-4&pro=1&frs=1",
    "title": "Outdoor Patio Throw Pillows Colorful Paintings Intuitive Floral Art Pillows Abstract Artist Watercolor Outside Cushions Artwork Garden Decor",
    "description": "FREE SHIPPING!\"Take a walk\" is one of my original abstract artworks transformed into unique outdoor throw pillows and other home decor accessories. The outdoor pillows have UV protection, and are waterproof / mildew resistant.Cut and sewn to order in the USA.All the art and design you see in my store is unique and sold exclusively through my Sincerely Joy brand ✌️THANK YOU SO MUCH FOR YOUR SUPPORT OF MY ART!➤ C.Cambrea Art printed on both sides.➤ The pillow is filled and sewn shut.➤ Durable 100% spun Polyester Poplin fabric.➤ Tumble dry low, do not bleachAVAILABLE SIZES:➤ 16\" x 16\"➤ 18\" x 18\"➤ 20\" x 20\"🌸SHIPPING: These pillows are made to order so kindly allow 3-5 business days for printing and shipping prep.WANT THE INDOOR VERSION??https://www.etsy.com/listing/544897552/abstract-art-throw-pillow-flower-face➤ Fav my shop if you like this. Etsy will notify you when i post new work ✌️🌸 AS A THANK YOU FOR THE SUPPORT OF MY ART all customers receive a 10% off coupon upon checkout. Good for your next purchase with me! Every purchase enables me to continue to do what I love and your support is so appreciated! ❤︎☀︎ Read more about the products and brand: http://www.sincerelyjoy.com/☀︎ Instagram:@ccambrea☀︎ Patreon:https://www.patreon.com/ccambrea☀︎ Pinterest:https://www.pinterest.com/SJstore/© C.Cambrea Art🌸 Sincerely Joy",
    "reviews": [
      "Very happy with my purchase!",
      "Love it so much! Awesome",
      "Omg I absolutely love it!!!! It’s unique, beautiful, and great quality. It’s totally transformed my bathroom!! Thanks so much. She also went out of her way for me. Which I appreciate so much."
    ]
  },
  {
    "productId": "OdmqTOvuCS",
    "url": "https://www.etsy.com/listing/530691912/love-doves-wreath-rustic-wedding-decor?click_key=d93db14a77fff065e8c242afb5848fecac6110b4%3A530691912&click_sum=4bb7b1ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-1&pro=1&etp=1&content_source=e6333b9d1e49cc9a82b9d01b975015ce440052a2%253A530691912",
    "title": "Love Doves Wreath | Rustic Wedding Decor | Wild Bird Art | Metal Bird Art | Bird Gift for Mom | Bird Gift for Men | Metal Wall Art | R208",
    "description": "Love Doves Wreath | Rustic Wedding Decor | Wild Bird Art | Metal Bird Art | Bird Gift for Mom | Bird Gift for Men | Metal Wall Art | R208SKU# R208Dimensions: 16.5 x 14.5 x 1 in.Please favorite our Etsy shop and follow us on Social Media:Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "Excellent for upcoming wedding at our home. Very well done!",
      "If possible, it’s even cuter in person.",
      "Great gift! Receiver loved it!",
      "I can’t say enough about this metal, dove mobile. Honestly, it’s really beautiful!!! The workmanship is amazing. I am so happy with my purchase that I picked another piece from this shop and sent it to my husband with a text that read…..”your wife would be so happy if you gave her this for her birthday.” (My birthday is in June.)"
    ]
  },
  {
    "productId": "gSWEQASBau",
    "url": "https://www.etsy.com/listing/1472995633/tree-stump-stool-natural-edge-side-table?click_key=a45ce633f1eb7b376dcb6cab429c0e6c28345405%3A1472995633&click_sum=5e56bf06&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-2&pro=1&frs=1&content_source=392ccb261bcf9814de954068e9d79cb1cf119d33%253A1472995633",
    "title": "Tree Stump Stool, Natural Edge Side Table End Table, Wood Plant Stand, Nightstand, Wood Accent Stool",
    "description": "Tree Stump Stool and Natural Edge Side Table End Table it is made of solid pine wood and is 100% handmade. Nightstand perfect for any bedroom furniture, dining room furniture, living room furniture. Wood Plant Stand it is strong but lightweight, the installation of the products is easy and intuitive..⭐ Oshoom - Tree Stump Stool ⭐💝 The photos are the real images of the products. You will have the same product that you see in the picture.⭐ The installation guide of the Tree Stump Stool is enough to install the product. All you need is a screwdriver. The installation of the Wood Plant Stand is very easy and intuitive. you can easily install it within 2-3 minutes.⭐🌲 Material: Solid Pine Wood🎨 Color: Walnut, Teak, Venge, Green, Rustic Oak, Natural📐 Dimensions:Small:Lenght: 11,8\"  (30cm)Height: 7,8\" (20cm)Depth :  11,8\" (30cm)Medium:Lenght: 11,8\"  (30cm)Height: 11,8\"  (30cm)Depth : 11,8\"  (30cm)Large:Lenght: 11,8\"  (30cm)Height: 15,7 (40cm)Depth :  11,8\" 30cm)🎀Surprise gifts in every order :)🚚 FREE & EXPRESS SHIPPING!PRODUCT DETAILS: This  Tree Stump Stool is a great addition to any living space. These Natural Edge Side Table End Table sit on special design legs and are designed to hold recordings both on the inner square area and on the outside. You can use our product as a Natural Edge Side Table End Table or Wood Plant Stand Since there is felt on the lower legs, it will not scratch the floor you put on.UNIQUE DESIGN: Natural Edge Side Table End Table that is modern and unique. This beautiful Tree Stump Stool can only be purchased here and the pieces are limited.IMPORTANT NOTE: Please consider the product descriptions to visualize and plan. Since it is a natural product, there may be very slight differences in coloring.Thanks for visiting Oshoom, we are committed to providing high-quality unique design Nightstand products, and best customer service for you.💝👉 Please visit our page for our other handmade premium, Wood Accent Stool furniture.;https://www.etsy.com/shop/Oshoom",
    "reviews": [
      "Took a while to get here and not gonna lie. It’s a little wobbly, but really cute.",
      "These plant stands are lovely.",
      "Well finished product but could buy at Winners for much cheaper without the extra $44 custom fee.",
      "Very nice and simple, perfect for my record player."
    ]
  },
  {
    "productId": "sPmvPjWKLU",
    "url": "https://www.etsy.com/listing/972640092/bird-house-and-birds-rain-chain-patio?click_key=2024867e0899d753764f158a799c788d30678e94%3A972640092&click_sum=7ee48e47&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-3&pro=1&sts=1&content_source=a836c2cee0d10a00e53edc3c0e634a4ab82b58bd%253A972640092",
    "title": "Bird House and Birds Rain Chain | Patio Decor | Home Decor | Garden Decor | Yard Art | Metal Art | Gifts for Mom | Wind Chimes | Gardening",
    "description": "Bird House and Birds Rain ChainCelebrate some of your garden’s most sought-after visitors with this Bird House and Birds Rain Chain! This rain chain can cheerfully replace an unsightly downspout on rainy days while serving as a charming wind chime when the sun’s out! Rain or shine, this handcrafted Happy Gardens best seller will bring brightness and whimsy to your home’s exterior. Like every rain chain we feature, this piece has been made by hand for garden lovers like you.Steel construction with flamed finishDimensions: 4.5” Diameter x 104” HWeight 3.0 lbsALWAYS HANDCRAFTED - Our rain chains are expertly crafted by hand, and it really shows. You’ll notice intricate details on your rain chain you just don’t encounter everyday.EASY TO INSTALL AND CARE FOR - Your rain chain will come with simple, easy-to-understand assembly instructions. We want you to enjoy your purchase the very same day it arrives! Plus, caring for your rain chain is a breeze and will ensure it lasts for years to come.UNIQUE AND COMPELLING - Like all our products, this rain chain was expertly selected by our Happy Gardens team. Why? Because it’s beautiful, functional and special!BUILT TO LAST - As always, we’ve diligently ensured that this beautiful rain chain is more than just easy on the eyes! The artisans who crafted this piece have chosen top-quality, durable materials so this rain chain can weather storm after storm.BACKED BY A NO-STRESS WARRANTY - We offer a one-year, limited replacement warranty on our rain chains. If you are unhappy with your purchase for any reason, simply call or chat with us and we will help make it right.",
    "reviews": [
      "Completed satisfied.  Order additional ones.",
      "The measure of good customer service is when something goes wrong.   In this case it did and the seller handled it brilliantly.",
      "My friend thought this was really neat when she opened it."
    ]
  },
  {
    "productId": "wSxniRNwtv",
    "url": "https://www.etsy.com/listing/1080286491/suncatcher-crow-moon-and-flowers-stained?click_key=12b37f46d6925a3413d867429090b232113c6ec4%3A1080286491&click_sum=cedec5b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-4&pro=1&frs=1&etp=1&content_source=0565bf570abe6e9fc738ed7d649dba7627850e18%253A1080286491",
    "title": "Suncatcher crow moon and flowers Stained glass crow Moon decor Wall decor for room Hand made gift Halloween gift idea Decor from ukraine",
    "description": "Hello dear buyer! Welcome to my authorship stained glass decors store! I'm Mariana! My dream is to give people joy and good mood with my creativity. If what I do makes other people smile, it’s the best reason for me to keep creating and sharing my nominations. Because the feeling that someone likes what I am doing is priceless.Suncetcher crow moon and flowers - the original design will appeal to connoisseurs of beauty.I can also create individual works. If you have an idea that you really want to implement, then I will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live color may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!Take care of yourself!",
    "reviews": [
      "Came out really nice just takes awhile to arrive",
      "It’s absolutely beautiful, and arrived faster than I thought it would.",
      "My package arrived rather beat up, I was worried the postal service had broken it. Thankfully the seller had done an excellent job in packing their wares and my item  was intact and beautiful!"
    ]
  },
  {
    "productId": "sseGVnJlsV",
    "url": "https://www.etsy.com/listing/1626613677/wicker-rocking-chair-organic-rattan?click_key=7c1d32ac595019938120741e26bfcf42c72cece1%3A1626613677&click_sum=5bb2122c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-5&pro=1&sca=1&content_source=4b74bfe860d8778f56a2d20582df2fa471f71d62%253A1626613677",
    "title": "Wicker Rocking Chair, Organic rattan rocking chair, Willow rocking chair, Lounge chair, Housewarming gift first home, Outdoor patio chair",
    "description": "Specifications:Armrest Width: 26.4in/67cmSeat Width: 21.7in/55cmHeight: 47.2in/120cmLength: 47.2in/120cmBackrest Height: 33.5in/85cmExperience elevated comfort with our meticulously handcrafted wooden frame furniture, expertly crafted from premium beech wood. Precision and quality define our elegant and durable frames, available in a range of vibrant colors to suit your style!Designed to support up to 350 lbs for an unparalleled seating experience!Complete the look with our plush cushion-mattress.Transform your space with the perfect blend of American craftsmanship and coziness. Explore our wooden furniture collection today!FAST WORLDWIDE SHIPPINGALL ITEMS ARE HANDCRAFTED BY UAQ U E S T I O N SLet us know if you have any questions!More wicker products in our store:https://www.etsy.com/shop/AestheticHarmonyHome",
    "reviews": [
      "Aesthetically pleasing. Craftsmanship is excellent. Be mindful, Shipping is costly and takes a while.",
      "It's beautiful.  I was having trouble finding a hamper with a lid this size that had style and beauty.  This is it!  They were wonderful to work with.  Great experience all around.",
      "This is a really high quality hamper. I can tell it a lot of thought went into the design, and the red accents are beautiful. The seller Dmytro was great to buy from - very responsive and accommodating when I asked to make a change to my order."
    ]
  },
  {
    "productId": "dva1IJosKf",
    "url": "https://www.etsy.com/listing/1489517363/metal-hummingbird-set-garden-art?click_key=fa5b60ca61af6bc0968a77885429f7c97be43056%3A1489517363&click_sum=6828ff79&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-6&pro=1&frs=1&etp=1&sts=1&content_source=5d1f959296f0701541da035d6e28910c66a06c9a%253A1489517363",
    "title": "Metal Hummingbird Set - Garden Art",
    "description": "Set of Metal Hummingbirds- Garden ArtAvailable in sets of 3, 6 or 9.Set of metal Hummingbirds. Each hummingbird is approximately 5\"x6\" with an 18\" bendable stem. The hummingbird wings are also bendable. Sets are also available with stem extenders that add an additional 18\" for a total of a 36\" long stem.Technicals:- 5\"x6\" hummingbirds- 18\" bendable stems- 18\" Stem Extenders (add-on)- Stems and stem extenders are gently coiled for shipping. This allows for the use of less packaging material and a lower shipping cost, which keeps my prices as low as possible for you.Other Garden Decor items:Metal Flower Set:https://www.etsy.com/listing/1459106844Metal Butterfly Set:https://www.etsy.com/listing/1459111490Metal Dragonfly Set:https://www.etsy.com/listing/1459114464Metal Hummingbird Set:https://www.etsy.com/listing/1465974998Metal Fairy Set:https://www.etsy.com/listing/1465979816Metal Dragons:https://www.etsy.com/listing/1478188389All of our metal garden art is made of raw mild steel that will arrive to you with a light amount of rust. Once placed outside your garden items will continue to patina to a beautiful rust colored finish. A simple spray-on or dip application of household vinegar will speed up this process even more.Contact me if you have any questions.Made in New York, USAbyNaked Metal Studio LLC",
    "reviews": [
      "Please write at least 5 words",
      "I Love these birds.  Good quality",
      "Great in my garden",
      "Beautiful craftsmanship! Will look forward to more great creations!"
    ]
  },
  {
    "productId": "FgbiqrfMrH",
    "url": "https://www.etsy.com/listing/1400900961/realtor-closing-gift-personalized?click_key=640deff6f6abe5031b16df8926a1de8345e27e17%3A1400900961&click_sum=859b3102&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-7&pro=1&frs=1&content_source=f44349e552badcdf8649be6e917cea6c844b0d69%253A1400900961",
    "title": "Realtor Closing Gift, Personalized Housewarming Gift, Personalized Cooler, Backyard Cooler, Backyard Decor, Closing Gift, Personalized Gift",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @friocoolersFollow us on Instagram @friocoolersFollow us on Youtube @friocoolersThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Absolutely beautiful! Fast shipping, great product. I would absolutely buy this cooler again."
    ]
  },
  {
    "productId": "jHRdpnrBZi",
    "url": "https://www.etsy.com/listing/1613850110/handmade-ceramic-wind-chime-statue?click_key=2eeaee3bafbf87dc59a39ae3120ec1098c29ba6e%3A1613850110&click_sum=ae012522&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-8&pro=1&sts=1&content_source=65097118d3d886bcf638ab7f8df9d802c7149792%253A1613850110",
    "title": "Handmade ceramic wind chime, statue colorful wind chime, furniture decoration, housewarming gift, garden decoration",
    "description": "Handmade ceramic bird statue wind chime, bird decorations, colorful wind chime, home decoration, housewarming gift, birthday giftContains:1x 35 cm resin and metal bird chime (color available)Outstanding customer service 😊Free shipping worldwide 🌍Enjoy the gentle song of my ceramic bird bells. Each statue comes in 6 warm shades, all carrying stories of craftsmanship and care. Let its gentle notes fill your space with whimsy and wonder. A touch of nature, handcrafted just for you.",
    "reviews": [
      "Absolutely in love with this charm and super cute and great quality .",
      "I love this wind chime - very colorful and well crafted!",
      "Beautiful and nice decorative piece for my bag."
    ]
  },
  {
    "productId": "IQuLLcissf",
    "url": "https://www.etsy.com/listing/1557712334/unique-mosaic-table-custom-made-tealish?click_key=858fb2900535905ccfe739cf77c6f75f5234f89d%3A1557712334&click_sum=cd716f35&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-5&pro=1&frs=1&sts=1",
    "title": "UNIQUE MOSAIC TABLE, Custom Made Tealish Blue Round Table, Artistic Moroccan Mosaic Coffee Table, Luxurious Indoor/Outdoor Patio Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric design in different colors. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades, creating a warm and inviting look.The mosaic pattern on the table consists of a variety of colors, including vibrant Tealish blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.GET YOUR IRON CHAIRS TO GO WITH THIS BEAUTIFUL TABLE  :https://www.etsy.com/listing/1502709918/set-of-moroccan-iron-chairs-handmade",
    "reviews": [
      "The customer service really helpful. Very pleased with the response. Definitely will recommend this company to purchase item. Beautiful tables.😘",
      "Great chair, looks nice outdoors",
      "Very nice and helpful seller!Beautiful side table, perfectly made to measure and in customized colours, well packed and fast shipped. 👍👍👍👍"
    ]
  },
  {
    "productId": "mqMRGHyCYW",
    "url": "https://www.etsy.com/listing/1639147771/3-potted-white-holder-plant-stand-bamboo?click_key=9b82a5c80a935cd8b59140a57f3752714cdbf61e%3A1639147771&click_sum=8e22ccb8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-6&pro=1&frs=1",
    "title": "3 Potted White Holder Plant Stand Bamboo Plant Rack Corner Flower Stands Living Room Balcony Bedroom Plant Shelf Potted Plant Display Rack",
    "description": "Dimension: 10.8\" W x 28.7\" HThe flower stand comes with installation instructions and installation tools, and you can easily assemble the entire flower stand according to the instructions in the manual. Assembling products can improve your hands-on ability and let you experience the fun of assembly. Please note: Please do not tighten the screws at one time during installation, adjust all the screws and make the plant stand stable before tightening the screws.The stand is made of 100% bamboo, and the flower plate is made of iron with baking paint,It is natural and friendly, polished smooth, and burr-free, easy to organize and clean. The flower stand has 3 layers of space, which is large and stable and can hold up to 3 pots of plants. Can bring life to your home.Inspired by the stable principle of triangles. Utilize triangles to make bamboo plant supports more stable. bolded material and butt screws solidify this plant stand. All in order to provide a more durable structure.Can hold up to 120 lbs.This indoor and outdoor plant stand is beautiful and practical, perfect for your home decor, you can place it anywhere in your home, such as in the hallway, garden, entrance, living room, bedroom, balcony, patio, etc.",
    "reviews": [
      "Shipped super quickly and easy to assemble!",
      "Love this plant stand! It’s super cute and easy to put together",
      "This is a great item! We put it together quickly, & it’s perfect to get your small plants up & off the ground! Thank you",
      "Great customer service.  Liked my stand, wish it was taller.  But good quality and great price."
    ]
  },
  {
    "productId": "HuUy8WjyON",
    "url": "https://www.etsy.com/listing/1319239390/mid-century-modern-patio-table-custom?click_key=be28fff93cb8f996c93cb9641a3f5e2b0d014b40%3A1319239390&click_sum=983f2e92&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-7&pro=1&frs=1&etp=1",
    "title": "Mid Century Modern Patio Table - Custom Made Zellige Table - Round Outdoor Table - Set Outdoor Garden Furniture  GIFT - Fully Handcrafted",
    "description": "Contact me for custom ORDERSthis amazing traditional Moroccan table was handcrafted by A professional worker, it represents the cultural diversity of Moroccan handcrafts and that is because of its design, material and the colors used at the surface of the table. by obtaining such objects you would be helping a dying craft to flourish again so that contact between the past and the present would never die not mentioning the happiness it would bring to poor workers on fields like this .\" Clay\" this material that is found only in Fes City. In a specific place called \" Ben Jellik\". To get started to bring the clay to this place, and we leave it for 20 days in order for it to dry. When it is dry we use a large hummer to break it into small pieces then we leave it to dry again for whole day before we put it in water for two days. Then there are people who work on cleaning the clay from unwanted rocks and any other material to give to another person. This type of activity is only found in Fes city because it has a close relation go the sun.Other workers are in charge for shaping the clay dough into flower vases, jars, plates .... all of these products are handmade. It is an inherited craft work.After we place the handmade products into the oven for 8 hours with 2000°C. The next step is painting the products with colours of the fortunes, dinning tables and the walls.We paint the products with natural based colours that are taken from natural resources. The paint brushes used are made from horses hair. They use different colours such as blue, red, black...When they finish they coat them with a material that makes the products shiny so they can put it back into the oven fir 8 hours to bake on burned woods then the products can be used for our daily use. You can use cold or hot water in them, the paint is long lasting.Moving to Zellige, when it bakes for the first time, and the second time with the paint it is given to Nekkach that decides what kind of pattern will be used on it depends on where Zellige will be put. He spreads them flipped in a geometrical pattern based on ancient references such as Karaouiyn, and the king's palaces...Then we use a material called \" La resin \" or \" cola sima\" and we let them dry. After that we flip them to the front to see the design of the Zellige. That is the workmanship of Clay in the City of Fes.Thank youVisit here for more beautiful MOSAIC goods :https://www.etsy.com/shop/CUSTOmosaicKeywords : coffee table interior design home decor furniture coffee coffee time table interior side table design mosaic working coffee shop coffee lover living room dining table coffee holic furniture design decor coffee lovers living room decor coffee addict mosaic coffee art home coffee house coffee table decorpatio furniture outdoor furniture outdoor living patio decor patio patio design garden furniture furniture outdoor decor outdoor design home decor interior design outdoor living space design garden outdoor patio life furniture design backyard design patio style exterior design outdoor dining backyard summer patio living outdoors garden design modern furniture interiorpatios patio dining home decor ideas outdoor chair architecture teak furniture backyard oasis teak home rattan porch decor bahbel patio time luxury furniture porch life landscape design backyard life backyard party outdoor space back porch backyard bliss rattan furniture decor patio garden my backyard decor patio goals backyard goalsoutdoor furniture outdoor living furniture interior design garden furniture design outdoor design furniture design outdoor outdoor decor patio furniture home decor garden patio architecture interior exterior design outdoors luxury furniture patio decor garden design outdoor dining outdoor living space home design decor modern furniture custom furniture",
    "reviews": [
      "Item is absolutely beautiful and exceeded our expectations. We liked it so well that we immediately bought a second one. Can't wait to get it installed.",
      "The sink is beautiful!  The seller even sent a picture before sending to assure the final product was what I wanted. It will be beautiful in my new wet bar!",
      "Beautiful sink. Can’t wait to use it in my bathroom remodel as a small sink in my makeup area",
      "It is beautiful. Service was excellent."
    ]
  },
  {
    "productId": "qIZcOYyHQd",
    "url": "https://www.etsy.com/listing/1674185118/reproduction-3-piece-set-chairs-pair?click_key=f3576759abdad73caea3d8c975ea1cbd47719eaf%3A1674185118&click_sum=b01e5a4a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-8&pro=1&frs=1",
    "title": "REPRODUCTION 3 Piece Set Chairs Pair Side Table Turquoise Powdercoated Patio Retro Style Shellback",
    "description": "Looking to add a splash of color and retro charm to your outdoor space? Look no further than this 3-piece REPRODUCTION set of powder-coated chairs and side table. The turquoise color and shellback design evoke a fun, retro vibe that's sure to impress your guests. Perfect for relaxing in the sun or enjoying a cold drink, this set is a must-have for any patio or deck. Don't miss out on this stylish and functional addition to your outdoor decor! Fast, Free Shipping! Easy To Assemble!",
    "reviews": [
      "Such a beautiful set! I get lots of compliments on it. Exactly what I hoped for.",
      "Perfect replacement brackets. Packaging was great and shipping was fast.",
      "The item was just the right size.",
      "Excellent product and service. Thanks"
    ]
  },
  {
    "productId": "WAwdWvAETM",
    "url": "https://www.etsy.com/listing/528801220/triple-bird-ring-mobile-wild-bird-art?click_key=8acf2f0809a995db3e9f1c3aae918b92437da0d6%3A528801220&click_sum=95e960e6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-9&pro=1&frs=1&content_source=3d0100a0b8f6318a32b6fb60cdfe312ded7fcf43%253A528801220",
    "title": "Triple Bird Ring Mobile | Wild Bird Art | Metal Mobile Hanging | Bird Lovers Gift | Porch Hanger | Garden Gift | Metal Bird Decor | M302",
    "description": "The Triple Ring Mobile is a simplistic and nature-inspired mobile design that features three of our most iconic bird silhouettes. It has been curated to bring some of our favorite pieces to your backyard combined into one beautiful mobile!The first ring of the mobile features an adorable baby robin with frail legs and an innocently perky stance! The second mobile includes our classic chickadee silhouette, a bird known for itsand natural look. This mobile would be a classic and elegant accent hung from your front porch to greet guests that visit your home!The Triple Ring Mobile is made of recycled steel and pre-treated to create our signature rusted distinctive “chick-a-dee” song. The third ring completes the mobile with our simplistic yellow warbler silhouette.This gorgeous piece of metal garden art is so easy to display. It includes a chain so that you can easily hang it wherever you’d like as soon as it arrives!Dimensions: 8 in. wide x 8 in. deep x 24 in. high.",
    "reviews": [
      "This was a very last minute gift ordered just two days before christmas - but it arrived the 26th! Thank you so much for the speedy processing. I couldn't've asked for more. My sibling loves it, says it's great quality. Very happy",
      "This is a beautiful gift! Well made and quite heavy as well.",
      "Always happy with my purchase from this shop.",
      "This is very well made and so beautiful! It looks great on our porch and withstands our strong winds. I am very pleased"
    ]
  },
  {
    "productId": "kkmaXLPMTg",
    "url": "https://www.etsy.com/listing/597947272/metal-flowers-metal-garden-art-sculpture?click_key=e319f31d3125656c5661de28d57ca88628c97dbb%3A597947272&click_sum=55bc1133&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-10&pro=1&frs=1&etp=1&sts=1&content_source=d1cb792a68d7ec60778934164171f0e43c1de2b8%253A597947272",
    "title": "Metal Flowers, Metal Garden Art Sculpture, Set Of 9 Garden Stakes, Dandelion, Flower Pods, Garden Set",
    "description": "Metal Garden Art GroupingThis Art Piece Consists Of 9 Individual Stakes That Can Be Bent & Twisted Into A Desired Grouping. Even The The Stakes Are Able To Be Bent.Perfect To Fill Out An Area Thats Hard To Grow Or Add A Delightful Contrast.Create Your Own Personal Presence In A Simple And Stylish Way.Stakes Measure 18 inches long and ball grouping on top measures about 4x4 inches.****Long stakes are 28 to 36\" and are available only at limited times",
    "reviews": [
      "The metal flowers have a unique look that adds a lot of interest to my planters.",
      "I bought this item for a friend and she loved them.",
      "They’re so cute and will look great in the garden. The shipping was so quick too!"
    ]
  },
  {
    "productId": "WINtdJfbKV",
    "url": "https://www.etsy.com/listing/1441759843/stained-glass-yard-art-real-stained?click_key=faaab9540a2baf895886dce4db71f5bbc6e2629e%3A1441759843&click_sum=f579582a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-11&pro=1&frs=1&content_source=aea78c2903cd02a2cb1b515e8d70ff1c57a244cc%253A1441759843",
    "title": "Stained glass Yard art. Real stained glass & copper garden stakes Pastel colors mix.  Free shipping",
    "description": "This is a stock Color there can be no changes in colors.I have a listing for custom colors please go there to order a custom colors.Attention colors may not match exactly. Stained glass sheets will vary in color.Here are 2 sizesLarge 9 x 34 inchesMed.  6 x 32 inchesThis is real stained glass like the glass that has been used in stained glass windows for 100’s of years.Each circle is wrapped in real lead came and the frame is real 1/2 copper tubing and soldered together.Large frame is 9in x 34inSmall frame is 6in x 32inFree Shipping on any of them.We will also do custom colors in any colors you like.My unique mounting system of 2-  steel stakes that you pound into the ground and slide the copper frame.   over them it will insures they will withstand it wind. outdoorsThey have a copper frame to protect the glass and give it a look of elegance.",
    "reviews": [
      "Great quality and with the exact colors I requested !",
      "It joins two more pieces in front of tall planters",
      "Beautiful, looks great in my garden!"
    ]
  },
  {
    "productId": "lMTpgCXDDV",
    "url": "https://www.etsy.com/listing/1492976398/outdoor-turtle-garden-statue-decor-10?click_key=d7db20dc425d3a49541a6b59dc201981aa867b8b%3A1492976398&click_sum=d37047d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-12&pro=1&frs=1&sca=1&sts=1&content_source=40ae953e963f8f4950b92ca2c178dc800dd5c9d5%253A1492976398",
    "title": "Outdoor Turtle Garden Statue Decor 10” Concrete Tortoise Stone Lawn Ornament Cement Yard Art Sculpture Statuary Gift Idea Figurine",
    "description": "Add a whimsical touch to your garden with this charming 10\" Concrete Turtle Statue.Crafted from natural cement, this 8-pound turtle will bring the outdoor space to life with its rustic charm.A perfect addition to your yard, patio, or garden!Length: 10.25 inches front to back.Width: 6 inches side to side.Height: 5.5 inches tall.The weight of this garden statues approximate 8 pounds.Handmade USA here for you.Over two decades of experience in the garden sculpture industry.Professionally packaged. Safe arrival assured.Free shipping.Ships out within 5 business days.Customer Satisfaction Guaranteed.Ok thank you!",
    "reviews": [
      "The Turtle came wrapped extremely well. It was heavy, so I was worried about the shipping. It was perfectly cushioned in all the packaging and even had a bow tied around it. It looks lovely in my garden.",
      "Fabulous statue! We will definitely be ordering more from this shop. I was worried about breakage, but Robert packed it so incredibly well. Very very pleased.",
      "Thank you for your fabulous review! We're delighted you love the Angel Statue and appreciated my careful packaging. Your satisfaction and plans to return to our shop mean everything to us. We can't wait to provide more treasures for you in the future. Warm wishes and thank you!",
      "Great communication! We love the fountain top. It is exactly what we wanted!!",
      "Thank you so much for your feedback! We are thrilled to hear that you love the fountain top and that it's exactly what you wanted. The photo you shared of the fountain operating looks fantastic! We truly appreciate your support and hope it brings joy to your space. Please feel free to reach out if you need anything else. Happy fountain gazing!",
      "It was just as I expected. It was a gift, and he loved it❤️",
      "Thank you for your kind words! I'm thrilled to hear that the fireman garden statue was just as expected and that it was a perfect gift. I'm so glad he loved it! ❤️ If you have any questions or need assistance in the future, don't hesitate to reach out."
    ]
  },
  {
    "productId": "TROsgOBvPZ",
    "url": "https://www.etsy.com/listing/1224240516/funny-stone-stone-face-figurine-meme?click_key=84d7ed654b64bfeeb4f7fd07b5e0ae7329c48e22%3A1224240516&click_sum=6c84e7ef&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-13&pro=1&etp=1&content_source=9a76d1f6329abd39aeab173fb5740236e5b511ad%253A1224240516",
    "title": "Funny Stone , Stone Face Figurine, Meme funny stone, Stone Carving Face, Funny Face, Stone Carving, Garden Decor, Home Decor, Birthday Gift",
    "description": "Funny Stone , Stone Face Figurine, Meme funny stone, Stone Carving Face, Funny Face, Stone Carving, Garden Decor, Home Decor, Birthday GiftNOTE● There is made from Natural Stone, some size will be a bit different & different stone grains & colorITEM SPECIFICATION● Material : Light Stone ( Batu Paras / Balinese Stone )● Color : Natural Gray Stone● Quantity Listed : 1 pcs or Set● Dimension :● Make by : Hand Carving● Suitable for : Outside/Garden- Small 4 inch,- Medium 6 Inch,- Large 7-8 InchPROCESSING TIME● Usually take 1-3 business day.SHIPPING● EXPRES DHL : 5 - 10 business days.● Phone number require for courier delivery.NOTE● There is made from Natural Stone, some size will be a bit different & different stone grains & colorPACKAGING● Pack with bubble wrap & cardboard box.CUSTOMS & IMPORT TAXES● For international buyers, especially those from Europe, UK and Canada, customs and import taxes may be charged. Buyers are responsible for any customs and import taxes that may apply. Please, familiarize yourself with the imported policies in your country.● Here is a link to give you the approximate costs https://bit.ly/2IwA0fN● An additional charge is needed if your place is in a remote area. Buyers are responsible for any customs and import taxes that may apply. We're not responsible for delays due to customs.",
    "reviews": [
      "This funny little sculpture is exactly what I had hoped for! It's to be a gift for my husband, who I know will love it as much as I do.",
      "Smaller then expected, nice quality though, didn't feel fair for pricing, but they are shipping from Indonesia, so I understand. Got here in a timely fashion, just in time for christmas.",
      "They look great. Just like the picture/description",
      "I just love these things."
    ]
  },
  {
    "productId": "TkklJYCWGr",
    "url": "https://www.etsy.com/listing/924255067/vertical-zen-chimes-garden-decor-wind?click_key=b469154a3b9a0218b67ccbee070673972c80770a%3A924255067&click_sum=7da81300&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-14&pro=1&frs=1&sca=1&sts=1&content_source=45af7de88d835dabb507c1d7c1fe679d9f1878b7%253A924255067",
    "title": "Vertical Zen Chimes - Garden Decor - Wind Chimes - Metal Decor",
    "description": "These 5 vertical Zen chimes bring out the meditative feeling in your garden.  Being positioned vertically, it looks a little like rain drops that would wash away your stress.Material: MetalApprox. 37”L x 2.5”W",
    "reviews": [
      "Great sound! Will definitely be buying from this shop again",
      "Fast shipping. Item arrived well wrapped and makes a lovely addition to the porch. Thank you!",
      "This was a gift. I have only seen it in pictures. I have been told they are stunning. Good quality & beautiful sound."
    ]
  },
  {
    "productId": "dunDiQDWlN",
    "url": "https://www.etsy.com/listing/1187439370/owl-solar-wind-chime-garden-decor-porch?click_key=f03ab2629bd4c3b3e85ebb5590b61cf0b2434ba8%3A1187439370&click_sum=02a09799&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-15&pro=1&content_source=2e54dbdb9ae084afef01e0385f768946bb9087c6%253A1187439370",
    "title": "Owl Solar Wind Chime, Garden Decor, Porch Decor, Patio Decor, Solar Lights Outdoor, Yard Light, Yard Decor, Wind Spinner",
    "description": "This owl solar wind chime wind spinner is perfect for garden decor, porch decor, patio decor, solar lights outdoor, yard lights, yard decor, party lights, party supplies, party decor and more! Hang from fences, pergolas, porch, and patio.Waterproof.LED Warm White light.1.2V/40mA amorphous silicon solar panel.Includes rechargeable 1.2V600mAh Ni-MH battery.Product size 11\"X19.2\"",
    "reviews": [
      "Beautiful Owl! My Sister will love it!!",
      "The owl solar light is absolutely beautiful.  When I see it light up it just makes me smile.",
      "Came quickly and works great."
    ]
  },
  {
    "productId": "zbzutgufZN",
    "url": "https://www.etsy.com/listing/1308962496/rusty-metal-garden-sculpture-i-outdoor?click_key=e385d493c740311779e083faa53f993d3d76384d%3A1308962496&click_sum=da4e233f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-16&pro=1&frs=1&content_source=3fab40c7c55549b15b509d95fa9eddf074c1c3d9%253A1308962496",
    "title": "Rusty Metal Garden Sculpture I Outdoor Sculpture Art for Garden I Garden Decor",
    "description": "Handmade garden art. Simple metal sculpture to decorate your garden.Rusty Metal Ring Sculpture - Metal Outdoor Art Rusted Metal Plant Stake - Home and Garden Decor Ornament - Metal Garden Art Furniture - Garden Decor GiftIt's a set of TWO separate circles that can be placed as you wish. Metal art can be a great statement piece in your garden. Beautiful way to highlight your favorite plants or a contrast to soft, airy grass. Arrange the rusty metal rings in any formation to create your very own unique piece of affordable garden decor.Two rings may also be a great wedding or anniversary gift.SIZE and DETAILSThe rings are made from 6mm thickness, 40mm wide mild steel which WILL rust for a unique patina. The rings have the same diameter. Complete with two detachable stakes each, to enable them to be push securely into the ground.Rust will appear with time, giving the sculpture a unique, natural finish. It won't require any maintenance, and can spend the whole year outdoors.  I can also accelerate the rusting process (please check the product options)....................................................Handcrafted in EU with professional premium materials for quality craftsmanship.Your order is packed very carefully in a multilayered package to ensure it's safety on the way.We are welding legs for your industrial table to order, and it takes couple days to make them.Shipping time:- 2-5 days for EU- DPD with tracking- 3-6 days for the USA, United Kingdom, Australia and Canada- FedEx with trackingUsually it's 2 weeks since order to delivery for standard sizes and 3 for custom sets....................................................WHY US?We make metal table legs and art. That's what we love. That's what we do.Thank you for visiting our shop!...................................................Have a look at other metal furniture legs in our workshop:============================================================https://www.etsy.com/shop/StaloveStudio?ref=hdr============================================================All work and images © Stalove.com. All rights reserved.============================================================",
    "reviews": [
      "Great quality.  Perfect addition to our landscape art",
      "I’m in love with my garden sculpture.   Thank you!",
      "Exactly as described, easy to assemble, great quality. I love it."
    ]
  },
  {
    "productId": "hyxRgR9g5b",
    "url": "https://www.etsy.com/listing/1583842588/custom-portable-beach-table-handpainted?click_key=861a86c1efa0dbfb4a1caad06477693a31850576%3A1583842588&click_sum=3b4fe386&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-9&pro=1&frs=1&sts=1",
    "title": "Custom Portable Beach Table handpainted- Blue Crab",
    "description": "Leg 2 ft tall, 18 in table topTwo cup holdersCan be broke down, strap for leg for easy carry.Can be personalized or sports teamPainted or stained",
    "reviews": [
      "Love the sign. It was a gift to someone who is a really big LSU fan. She was thrilled with the product.",
      "My cousin loved this as a gift",
      "Item came quickly and looked great!"
    ]
  },
  {
    "productId": "fkTWcmZsDi",
    "url": "https://www.etsy.com/listing/1059817755/squiggle-planter-for-succulent?click_key=1f3e2fd70faa470500870c4d1ef6f936c5a5a709%3A1059817755&click_sum=b0baa018&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Squiggle Planter for Succulent Arrangement - Red + Pink Colorway - Made Different By Queers in Texas",
    "description": "This planter is perfect for the gardener who doesn't walk the straight path, as it winds around a backwards S curve, perfect for a half dozen small succulents. The S Planter was my first wiggly/wavy design and I'm still smitten with it's combination of vertical and horizontal curves. These are a lot of fun to plant in while thinking creatively about how to layout your path.The planter measures 9\" x 8.5\" with 12 total inches of curving path to plant in.-------------------------------------------------We are a completely queer owned and operated 3D Print Shop and Design studio, focused on achieving sustainable, equitable pay and the most earth-friendly material sourcing we can manage. We collaborate to build our own printers and design our own models and grow together as a group of creative friends. These are 3D Printed from our home printer farm, we give as much attention as we can to the quality of these prints, striving for smooth surfaces, nice matte finishes, well placed seams, lack of stringing etc. While there may be very small imperfections on some prints, we really try not to ship anything with significant printing flaws. If you do have issues with your print, we are more than happy to work out a return and refund. :)All our prints are made with biodegradable, recyclable corn-based PLA plastic, which will eventually compost many decades from now.",
    "reviews": [
      "I love the design! Looking forward to ordering more!",
      "My third, and counting squiggle... so much fun!!\nThanks",
      "My second squiggle planter. Great for my cactus.",
      "Love this planter! What a clever idea."
    ]
  },
  {
    "productId": "NQjyCOMyME",
    "url": "https://www.etsy.com/listing/1397830576/folding-space-saving-table-for-deck?click_key=38a7bb4445bbf7b29914f150319ce45af86bf2e0%3A1397830576&click_sum=0e545d42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-11&pro=1&frs=1&sts=1",
    "title": "Folding Space Saving Table for Deck, Veranda, and Porch Railings, Balcony Bar Table Hanging over Railing, Outdoor Foldable Railing Bar Table",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.FREE & EXPRESS SHIPPINGFREE shipping (USA) & EXPRESS Shipping worldwide.FAST DELIVERYI am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Any questions please message me.",
    "reviews": [
      "I love my barstools and I loved working with Omer and his team. They are awesome. The product is so easy to open and close. I am in love with the green color too!",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find barstool table awesome. Your satisfaction means the world to us.",
      "Ömer was so easy and lovely to deal with. The bar arrived within a few days and it’s so easy to install and use. Adds a whole other element to my balcony. Thank you for this beautiful piece",
      "Thank you so much for your lovely feedback! We're thrilled to hear that you find balcony bar table quite beautiful. Your satisfaction means the world to us. Enjoy your new spacesaver table!",
      "The craftsman provides a lovely product and excellent communication. His video installation instructions are straight forward.\nThank you Ömer for a lovely addition to my outdoor sitting area!\nI will send photos this summer. \nCheers, Kendall"
    ]
  },
  {
    "productId": "tIZBcfEwnS",
    "url": "https://www.etsy.com/listing/1097004958/new-item-outdoor-rustic-directional?click_key=451c0e05330ad20ee593a218e788c37a334c5094%3A1097004958&click_sum=07f7d648&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-12&pro=1&frs=1",
    "title": "NEW ITEM! Outdoor Rustic Directional Arrow Mile Marker Tiki Sign, Beach Sign, Coastal Decor, Key West Beach Decor",
    "description": "CHOOSE your sign set amount below! (post not included)We take great pride in being the ONLY Tiki Sign Company that can get your order created, personalized, and shipped in just 2 days! That’s only 48 Hours between you hitting “Add to Cart” and then tracking your custom order on its way to you!✅To Order:Please the quantity your like to receive, the more you buy, the sweeter the deal! Please keep in mind that the Post to attach signs on to is not included. We do offer a few luxury Signs post that cannot be bought anywhere else if you’re looking for that true tiki vibe! Choose your Sign set, then enter what you’d like on each sign in the box labeled “Personalization”🌴About the Signs:Each sign varies in length from 16''-30'' depending on the length of the destination that is to be painted on each. Each sign will be unique. All our products are hand painted on 100% Reclaimed Lumber. Each order comes with a mix of all the different colors and fonts for a unique end result that you can’t find anywhere else! All Signs can be customized if you have any specific colors you prefer. We use reclaimed and natural wood and make no attempt to cover the natural wood markings, nicks, knots, etc. We feel this adds to the character and beauty of our Recycled Signs. All our signs are hand painted by a local artist on our awesome team. We use NO stencils, printing, or vinyl stickers. Colors are random as shown in the listing picture. I mix up a variety of colors and you will have a beautiful and unique finished product. As always, We Accept Custom Orders for this product!☀️Outdoor Durability:We strictly use Exterior Grade Paints and Exterior Grade Pressure Treated Lumber for all of our Signs, So they are absolutely made to withstand the elements! All signs are sealed with several coats of a clear water-resistant coating to further protect them in the outdoors. I do recommend the signs be taken in for any extreme Weather conditions for example a harsh freeze or large hurricane.❤️About Us:We are a Small Business Located in Titusville, FL. We have an excellent Team of talented artists, designers, and carpenters that work around the clock to ensure your order is perfect and shipped out as fast as we possibly can! We strive to use 100% recycled materials in all our products! We believe the earth needs our help and were doing our part by keeping as much from the landfill as possible!!⚠️ Note:WE OFFER A 100% SATISFACTION GUARANTEE!If your signs arrive miss spelled, broken, or damaged, we will replace free of charge.* Please Include during purchase the personalization you would like on each of your custom signs.* Post to attach signs are not included.* Business hours for 2 day processing guarantee are Monday through Friday 8am-5pmAll Signs Sold Separately. Please choose the correct sign set for your order. We cannot charge your account for extra signs so please choose accordingly.",
    "reviews": [
      "This is my second time ordering these signs - perfect for our Florida tiki hut. Thank you!!!",
      "Love it, thank you so much for the customization!",
      "Love them so much I bought more! They look fantastic."
    ]
  },
  {
    "productId": "xIQmdXieBh",
    "url": "https://www.etsy.com/listing/1596191150/sneaky-metal-fox-garden-decoration-with?click_key=4e14fe50283ebf50eb869ae066dd4bf54c787fdd%3A1596191150&click_sum=6e59d599&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-17&pro=1&frs=1&content_source=581150c225ea8edfaf21e57f7df39c9e42c436de%253A1596191150",
    "title": "Sneaky Metal Fox Garden Decoration with Stakes- Woodland Animals Yard Art- Backyard Decor-Gift for Her- Birthday Gift- Art Sculpture",
    "description": "* Note: Our fox and other artwork is being copied by other sellers. Our artwork is hand drawn original artwork by myself made on the computer and then cut with CNC plasma machine. If you see artwork that looks just like ours, they are infringing on our copyrights.•Made from heavy-duty 16 gauge hot rolled steel and cut with CNC plasma•Foxes can be sold individually or as a set.THREE OPTIONS TO CHOOSE FROM:•Bigger Fox-   13” x 31”•Smaller Fox- 8.5” x 21”•Set of 2 Foxes ( one big, one small)*Available in Multiple Powder Coat Finishes*-Stone Satin Black-Soft Satin White-Porsche Silver-Grey/Black Vein-Alvord Beige-Oil Rubbed Bronze-US Penny Vein-Black Copper Vein-Burnt Copper-Ironstone Copper-Canyon Copper II-Gold Bar Gold•All of our powder coat finishes can withstand the toughest conditions and are UV resistant.*Also available in Bare Metal*-The item will arrive bare metal with no sealant or finish. This will allow the metal to slowly rust into a beautiful patina over time.Our artwork is built to last and can be used indoor or outdoor.This life like fox has been a fan favorite from our customers!This is the perfect addition to any garden, backyard, landscaping, and the perfect gift for an outdoors lover!Comes with two tab stakes that allow for easy installation in the ground.Made with quality steel and built to last!We are a local business out of Sparta, TN. We appreciate you for supporting small businesses like us!",
    "reviews": [
      "Absolutely wonderful! A beautiful and fun addition to my cabin front yard.",
      "loved them very well packaged and high quality",
      "I got a set of foxes and I am so glad that I did. I will enjoy seeing them sneaking into my arbor!  The foxes are rustic and look adorable!",
      "The butterfly is lovely and so well executed and painted. It will be easy to set up in any location. It will be a garden high-light."
    ]
  },
  {
    "productId": "DvVw7hDEsB",
    "url": "https://www.etsy.com/listing/529340284/great-blue-heron-garden-stake-wild-bird?click_key=ab549a428400cdb76704d4b595b643c71637330c%3A529340284&click_sum=2e277512&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-18&pro=1&frs=1&etp=1&content_source=83db6018935e4d0becfaffec23c067e392f6ec18%253A529340284",
    "title": "Great Blue Heron Garden Stake | Wild Bird Art | Heron Art | Metal Bird Gift for Men | Metal Wildlife Art | Bird of Prey Art | Rusty | OS652",
    "description": "Great Blue Heron Garden Stake | Wild Bird Art | Heron Art | Metal Bird Gift for Men | Metal Wildlife Art | Bird of Prey Art | Rusty | OS652SKU# OS652 Dimensions: 21.5 x 24 x .1 in.  The separate stake extends 15.5\" from the bottom of the heron once it's inserted into the backPlease favorite our Etsy shop and follow us on Social Media:Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "I am very pleased with my purchase. It was a gift and my sister was thrilled to receive it. thanks - lisa",
      "Perfect. Arrived safely and quickly and was exactly as described.",
      "Beautiful piece, it will make a nice gift.",
      "Beautiful in front of our canal"
    ]
  },
  {
    "productId": "uTafbJdnDS",
    "url": "https://www.etsy.com/listing/1200948436/set-of-3-raw-metal-dandelion-flower?click_key=090306d17bd95261b3d80d72b671cc8606caca82%3A1200948436&click_sum=89badd30&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-19&pro=1&frs=1&content_source=aa23e7e3b9770621c17a69f63228eaec96491fd3%253A1200948436",
    "title": "Set of 3 Raw Metal Dandelion Flower Stems, Home decor, garden art",
    "description": "Set of 3 Raw Metal Dandelion Flower Stems , Choice of 4 inch, 6 inch and 8 inch and 18 inches long. Indoor/outdoor use. Each piece will vary slightly in color and characteristics and will rust naturally.Handcrafted in Brodhead, Wisconsin by 608 The Factory.2-3 day order fulfillmentFree USPS Priority 2-3 Day ShippingFollow us on Facebook & Instagram @608thefactory",
    "reviews": [
      "My 3rd order of same item in a larger size.  Love them!\nThanks.",
      "Great . So happy I got them",
      "These are so pretty! Ilove them! Thank you!"
    ]
  },
  {
    "productId": "jAUyGIznxZ",
    "url": "https://www.etsy.com/listing/1673165583/anemone-planter-maximalist-colorful?click_key=09f38fc1afe5a3938b20966cb023ffd506e59cec%3A1673165583&click_sum=a1d80236&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-20&pro=1&frs=1&sts=1&content_source=30cbe66a8a851cf732e64d7dab5e6a301ab0216b%253A1673165583",
    "title": "Anemone Planter - Maximalist Colorful Dopamine Decor Fun Eclectic Unique Home Decor - Bold Unique Funky Cute - Drainage Trays",
    "description": "The Anemone Planter is designed to be filled with movement, like a planter coming to life! Beautiful & undulating on the outside, flat and sloped inside for easy drainage and simple trans-planting!Pair them with the fanciful drainage trays for extra pops of colorI've 3D printed over 20,000 pieces, these planters with well hidden layer lines and seams are some of the strongest, loveliest prints I've ever created.",
    "reviews": [
      "Love the colors, perfect with the other pieces",
      "Gave this as a gift and they loved it."
    ]
  },
  {
    "productId": "WgUGtZMbWE",
    "url": "https://www.etsy.com/listing/1140588103/happy-daze-triple-ring-mobile-rusted?click_key=ca3d222eec9de47efe3e6255e4ece4ffdb5bf631%3A1140588103&click_sum=f49c68f9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-21&pro=1&frs=1&etp=1&content_source=577736a4caf2e1024a4caad5bdea4e688c228d21%253A1140588103",
    "title": "Happy Daze Triple Ring Mobile | Rusted Metal Yard Art | Garden Gifts | Metal Garden Art | Garden Bed Decor|",
    "description": "Our Happy Daze Triple Ring is an impressively detailed design featuring several iconic nature symbols. This bold metal garden art features three iconic summertime themes, to bring a slice of summer to outdoor space any time of year.! The third ring features a stunningly detailed dragonfly silhouette constructed by intricateThe first ring on this mobile includes a detailed honey bee, with cutouts highlighting its stripes and wings. The second ring depicts a sun silhouette, with a detailed face to look out over your front or backyard. The Dragonfly in the third ring has cut out pieces to highlight the design on its wings as well as its thin body.The Happy Daze Triple Ring is made of recycled steel and pre-treated to create our signature rusted texture and natural look. This mobile would be a gorgeous and eye-catching accent hung from your front porch to greet guests that visit your home!Dimensions: 8 in. wide x 8 in. deep x 24 in. high.",
    "reviews": [
      "Beautiful piece of craftsmanship that I hung on my front porch!",
      "Excellent craftsmanship, quick delivery, well wrapped and boxed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed."
    ]
  },
  {
    "productId": "eLWZDfbVof",
    "url": "https://www.etsy.com/listing/1000519273/circle-tinker-bell-garden-stake-rain?click_key=286ef65936e53b8d6ea18b5d2b02482aa1cdd2fe%3A1000519273&click_sum=9c095e6c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-22&pro=1&sts=1&content_source=d3dd9bd9747b9078edd15dc9efe2a03c4dcb9e4c%253A1000519273",
    "title": "Circle Tinker Bell Garden Stake | Rain Gauge | Garden Decor | Yard Art | Metal Art | Patio Art | Outdoor Art | Home Decor | Gardening | Yard",
    "description": "Circle Tinker Bell Garden StakeDainty with a cool, vintage feel, this Circle Tinker Bell Garden Stake is a perfect addition to any sized garden. The flame-finished stake’s circular design and bell add a delicate touch to every style of outdoor space, and is the perfect gift for new and seasoned gardeners alike. Like our entire garden stakes collection, this item is uniquely handcrafted and created with sturdy, beautiful materials chosen to last.Flamed metal finishDimensions: 5” W x 30” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Love this seller! Items are so cute and well made!!!!",
      "Very nice!  Well made and such a fun design.  Love the bell.",
      "Looks great amongst my ferns."
    ]
  },
  {
    "productId": "xIFbzYBXzc",
    "url": "https://www.etsy.com/listing/1158713895/22x44-inc-wooden-folding-picnic-tablecar?click_key=2e4cbfdcab739782976325d2ac15ea0fc586f4bc%3A1158713895&click_sum=a3eec32f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-23&pro=1&frs=1&sts=1&content_source=12445c93b6f1c8956be88301c92f53c778a63286%253A1158713895",
    "title": "22x44 Inc wooden folding picnic table,Car Table,foldable low Table,Balcony Furniture,Custom Foldable Table,Baby Shower,Camp Table,Boho Table",
    "description": "picnic table,handmade furniture,boho picnic table,folding table,picnic table low,low picnic table,boho table,wooden picnic table,tableThanksgiving  table#WoodenTable #Boho Table #Picnic Table #Foldable Picnic TableOutdoor Wooden Picnic Table for PatioNatural Wood Table, Camp Table, Birthday Party Table, Wooden Party Table, Beach Table, Picnic TableFather’s Day ,wooden table,(44 ınc - 22 ınc)car picnic table, folding, boho picnic ,wooden gift,portable table,Boho table, mothers Days giftFather’s Day  giftmy dear customerI met etsy 1 year ago and worked for months on a custom design for me and I am proud to serve you as the first manufacturer to design and sell this type of picnic and camping tables.This table is specially produced for nature lovers and completely natural materials are used. It is a handmade product, not a fabricated production. each table is produced with hours of work.This table made of natural pine wood has been completely dried and sanded. Its legs are made of durable hornbeam wood. In case the center of the table collapses over time, the middle leg has been added.All cargoes are made by express and are delivered to all over the world within a maximum of 7 days. In order not to be damaged in the cargo, packaging is made with special production materials all over the table.I can do custom production. All you have to do is contact me. I can produce any size you want.As bigwoodworkers, you can rest assured that as the first manufacturer and seller of these tables, I will do my best to provide you with quality service.***If you want to print brand or name, please message your name or brand.**** 110-55cm table (44 ınc - 22 ınc)*This product is completely handmade and very durable.*Each package is carefully wrapped to ensure safe delivery,*Boho picnic table,boho beach picnic table***If you want to make special production, please contact**** Europe: 3-5 days;* USA & Canada: 3-6 days;* Australia & everywhere else: 3-9 days***Damaged products are covered by our warranty***",
    "reviews": [
      "Great product, received very quickly",
      "Amazing table! And came in so quickly! Loved the option to add the engraving!!",
      "Great product, super fast delivery."
    ]
  },
  {
    "productId": "ISQbc4lsOo",
    "url": "https://www.etsy.com/listing/816778265/terra-cotta-toad-house-with-little-toad?click_key=acd609e7874f03b326114e451ad1d4683f944b75%3A816778265&click_sum=63b91947&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-24&pro=1&etp=1&sts=1&content_source=58e859eda28fbb5282a11a54be473c677db9a4e8%253A816778265",
    "title": "Terra Cotta Toad House with Little Toad Statue, Frog House, Home for Frogs, Garden Decor, Yard Art, Outdoor Decor, Patio Art, Gardening Gift",
    "description": "Terra Cotta Toad HouseIt’s not all about birds here at Happy Gardens! We love a good bird house, trust us, but we wanted to show toads a little bit of TLC, too. We’re proud to feature this lovely Terra Cotta Toad House, which includes a cute little bath for drinking and splashing, too. Neutral and subtle, this piece will look great in every style of garden.Plus, it comes with an adorable little toad statue that’s made from real river stones and forged metal. Like every garden accessory we sell at Happy Gardens, this item has been individually handcrafted.Dimensions: 5.5” x 9”Bath: 4.5” DiameterHAPPILY HANDCRAFTED - Our toad houses are made by hand by inspiring, dedicated artisans who love what they do.SIMPLE ASSEMBLY AND CARE - We promise, you won’t spend all day getting your new toad house to work. Plus, cleaning and caring for your toad house will be simple and painless, too.ADDS THAT “WOW” FACTOR - If you’re looking to impress the neighbors or give a fantastic gift, look no further. After all, we handpick unique products that truly stand out.QUALITY YOU CAN TRUST - At Happy Gardens, we insist on products that are made using only the finest materials. Our toad houses are no exception, and you should expect to enjoy them for years to come.A WARRANTY YOU CAN RELY ON - We proudly extend a one-year, limited replacement warranty to all of our toad houses. Simply reach out to our customer service team if you have any trouble and we will help you right away!You may also be interested in our other birdhouses:New Orleans Bird HouseChicken Coop Bird HouseHoliday Birdhouse w/LightsSolid Copper Bird Bath with Twig BaseHanging Spice Bird BathHanging Teal Bird Bath",
    "reviews": [
      "I have a road in the house now! I love it!",
      "What a delight to have a proper shelter for our garden toad! And with a small pool dish too! :) Beautiful craftsmanship and material! Shipping was quick and packaging was designed to keep the toad house in perfect condition. I definitely plan to purchase more should a little clan of toads set up camp in my garden - though, these toad homes would make great gifts for the gardener in your life!",
      "Happy toads for sure. Thanks a lot for sharing this and for your purchase, Mary.",
      "nice quality; love the consideration of a small toad bath with the toad house."
    ]
  },
  {
    "productId": "JvfFpHSs8q",
    "url": "https://www.etsy.com/listing/1039359604/wine-barrel-2-chair-half-barrel-full?click_key=dced6e540245ba029c310abd46fe6aebd11f99b3%3A1039359604&click_sum=4863ec06&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-13&pro=1&frs=1&sts=1",
    "title": "Wine Barrel 2-Chair Half-Barrel Full Table Set (Wine Barrel Table - Barrel Chair - Whiskey Barrel Table - Barrel Table - Wine Barrel Chair)",
    "description": "2-Chair Half-Barrel Table Set.Includes 2 Barrel Chairs and 1 Half-Barrel Table With Wood-Glass Top.Finished With Spar Varnish And Modern Reinforcement.Wine Barrel Chairs:Comfortable Memory Foam Upholstery.Removable Seat Storage And Underlying Wheels.L: 28.2in x W 27.8in x H 36.9in (+/- 5%)Wine Barrel Half-Barrel Table:Handmade From Solid Oak Bordeaux-Type Wine Barrel (Oak Shade May Vary).Finished With Spar Varnish For Protection And Fir Wood-Glass Top Wire Brushed To Show Natural Wood Grain.Removable Top And Full-Depth Inside Display.L: 35.4in x W 35.4in x H 20.3in (+/- 5%)Palletized & Shipped With TForce/UPS Freight, Please Provide Phone Number With Order To Expedite Shipping.",
    "reviews": [
      "Great product. Great communication and would definitely recommend someone buying this.",
      "Wonderful quality wine racks. If you’re on the fence go ahead and make the purchase you will not regret it. Very nice!  We are very pleased with our purchase.",
      "Just what I was looking for. I used it to top a 20 gallon crock to make a table out of it."
    ]
  },
  {
    "productId": "YoBhEfGRRM",
    "url": "https://www.etsy.com/listing/1257332701/garden-metal-peeping-cow-farm-outdoor?click_key=602afb5cac952de4c6eabdd17cf4b2c299692e96%3A1257332701&click_sum=f7cc3938&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-14&pro=1&frs=1",
    "title": "Garden Metal Peeping Cow Farm Outdoor Ornament Waterproof Yard Home Art Decor WALL DECOR Farm Decor Ranch Decor",
    "description": "Garden Metal Peeping Cow Farm Outdoor Ornament Waterproof Yard Home Art Decor.Beautiful Modern Farm Decor Style1-Hand-carved resin, exquisite workmanship, waterproof, can be used in bad weather.Size：11 inch x 11.5 inch（Size: 28cm X 29cm）Product Details:Theme: Animal🎁Package included:1x  Garden Farm Peeping cow Metal Art Outdoor  DecorationYou might Like other Items 👀",
    "reviews": [
      "Super cute! Love it! Thank you.",
      "Loved it..using it for themed event and everyone raved about them",
      "was a gift and they loved it"
    ]
  },
  {
    "productId": "MGFTGPuNGs",
    "url": "https://www.etsy.com/listing/1226865332/unique-bohemian-fringe-hammock-for-tree?click_key=72841bb6f8eb601f7fe8bd75f14858115e86b5b5%3A1226865332&click_sum=a504ffef&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-15&pro=1&frs=1&cns=1&sts=1",
    "title": "Unique Bohemian Fringe Hammock For Tree Or Stand | Relaxing Zen Backyard Patio Porch Furniture | Summer Housewarming Gift",
    "description": "Embark on a blissful staycation and rejuvenate in the comfort of our bohemian tribal hammocks. Created by our skilled Ecuadorian artisans, these artisan hammocks boast a vibrant ethnic print that adds a delightful touch of color to your relaxation haven.70% Acrylic & 30% CottonDimensions:Length 92 In (128 In including rope)Width: 50 In (60 In including tassels)Benefits Of Fancy Alpaca Hammocks♥ Versatility Of Our Hammocks: our hammocks are designed to accommodate various setups, whether you choose a hammock stand or opt for the natural charm of suspending them between trees with ropes. Enjoy the freedom of portability, making them an ideal companion for your backyard retreat, a serene campsite, or a blissful day by the beach.♥ Durability: experience long-lasting comfort with our resilient hammocks that are designed to accompany you on countless adventures and moments of tranquil bliss.OUR MISSION♥ At the heart of our mission lies a deep commitment to empowering local artisans in Ecuador by providing them with fair prices for their exceptional products, so they can support their families. Our unique hammocks are made by a lovely young couple with two small children that continue to carry on artisan traditions that have been in their family for generations.Satisfaction Guarantee♥ We want you to love your new Fancy Alpaca product as much as we do and if you do not we accept returns on our products. Your satisfaction is our priority, and we're here to ensure a delightful shopping experience for you.♥ Check out our shop for our collection of boho hammocks at:www.etsy.com/ca/shop/FancyAlpacaBoutiquePillows and stand are not included.",
    "reviews": [
      "Absolutely gorgeous. Rich, soft, warm, lustrous, vibrant color, and the way the black threads sort of ombre their way out at the ends is stunning. You can see and feel the quality.",
      "The material is very soft and the design is absolutely beautiful",
      "This is such a soft shawl I bring it everywhere!"
    ]
  },
  {
    "productId": "WfJeFHSeaG",
    "url": "https://www.etsy.com/listing/1578378829/mosaic-fountain-handmade-for-outdoor?click_key=2937c21fd02496b9788a65f7ff541a1e25a0f7c4%3A1578378829&click_sum=f64a9aa9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699302-6-16&pro=1&frs=1&sts=1",
    "title": "Mosaic Fountain Handmade for Outdoor Patio,Handmade Furniture,Handcrafted Mosaic Fountain,Mosaic Fountain ,Unique Design Wall Mosaic Decor",
    "description": "Personalized Mosaic Tile Fountain || Moorish Tile Fountain Artwork || Brass plated Fountain || Fountain for Outdoor Indoor || Moroccan Decor GardenMoroccan mosaic fountains are beautiful and intricately designed water features that are commonly found in Moroccan architecture and design. These fountains are often handcrafted using traditional techniques and materials, and can be used both indoors and outdoors as a decorative and functional piece.The fountains are typically made with a concrete or stone base and are decorated with zellige tiles in a range of colors and patterns. The zellige tiles are carefully cut and arranged to create intricate geometric or floral designs that are unique to Moroccan design. The patterns and colors of the zellige tiles can vary widely, from vibrant and bold to subtle and understated.Moroccan mosaic fountains can come in a variety of sizes, ranging from small tabletop fountains to large, outdoor features. They can be used in gardens, patios, and courtyards, as well as in living rooms and other indoor spaces.In addition to their aesthetic appeal, Moroccan mosaic fountains also provide a relaxing and calming sound of flowing water, which can create a peaceful atmosphere and help to reduce stress. They are a beautiful and functional addition to any home or outdoor space, and represent the rich culture and artistry of Morocco.🔆 Dimensions:>Height : 80 cm / width : 55 cm / Depth : 30 cm = 32 inches / 22 inches / 12 inches>Height : 100 cm / width : 66 cm / Depth : 35 cm = 40 inches / 26 inches / 14 inches>Height: 130 cm / Width: 75 cm / Depth: 40 cm = 52 inches / 30 inches / 16 inches>Height : 150 cm / width : 85 cm / Depth : 45 cm = 60 inches / 33 inches / 18 inchesThe Fountain is made by Resin not cement so as not to come heavy.PLEASE MAKE SURE TO COVER IT FROM HEAVY SNOW AND FROST ( The Fountain is not frost-proof.)🔆Customized size available🔆 Super Moroccan mosaic tile fountain hand-chiselled tile fountain, a piece of architecture history. These tile fountains are still used in palaces, hotels, and riads in old Moroccan cities. Our fountains are all handmade in Morocco by our skilled artisans who use the same techniques as the Moorish did in Andalusia, Spain. From terracotta bricks to all glazed ceramic tile with ornate borders or patterns, our products are authentic and unique. The geometrical patterns bring architectural beauty and give a 12th century Andalusian feel to any space. Variations in color and texture are common and are what give handmade Moroccan tile its renowned Great Moorish design tile fountain. An outstanding Moroccan mosaic tile fountain with amazing work.🔆 Morocco’s pottery and ceramics are the most representative handicraft of the local culture. It is a skill passed from generation to generation. Moroccan pottery reached the level of worldwide notoriety by perfecting itself every day. rich in various colors and designs, traditional and modern, it is among the real treasures of the Kingdom, especially the cities of Fez, Safi and Meknes, influenced by Berber and Islamic culture.🔆 Durable Material: This outdoor slate fountain is composed of high-quality natural slateClay  for long-term beauty, strength, and stability. With its graceful presence, the classic design gives style to any environment.🔆 Relaxing Sounds: Water flows out the top and gently glides down each layer, producing a beautiful cascading waterfall centerpiece. On the deck, garden, or landscape, enjoy the comfort and tranquility of this enormous outdoor waterfall fountain.Thanks for Visiting Our Shop :)",
    "reviews": [
      "I purchased 12 sconce lights and they are gorgeous! I’ve been looking for the perfect lights and I finally found them in Morocco (I’m in the US).  Communication was professional and the craftsmanship exceptional.  The lights came pre-wired for 120v and were very easy for my husband to put up.  I would highly recommend this company and will buy from them again in the future.  Great lights and great buying experience.",
      "Utterly beautiful item.  Totally blows away the cheap imitation (steel with a tiny bit of brass coating) that is virtually all you can get in the junkified West.  Worth the price & a fair deal at that.  Great customer service.",
      "Thankyou we love the lanterns beautiful"
    ]
  },
  {
    "productId": "FiAbABjMWO",
    "url": "https://www.etsy.com/listing/932397420/steel-fire-pit-grate-wood-burning?click_key=6531632fa37c9be7cb5bbe7e5c47aa83dca56a9a%3A932397420&click_sum=45c2f60b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-25&pro=1&frs=1&etp=1&sts=1&content_source=0562afc9693043970a7e00238ce3e1fb2a01d564%253A932397420",
    "title": "Steel Fire Pit Grate - Wood Burning - Elevated Fire Grate - Modern Outdoor Firepit - Handmade in The USA - 24\" x 12\" - Free Shipping",
    "description": "This Fire Pit grate is the next addition to your backyard hangout space! This steel wood-burning Fire Grate allows for maximum airflow to keep your fire burning. The shallow sides of the fire pit invites easy roasting, cooking, and s'mores-ing!-Dimensions-24\" x 12\" x 7 gauge steel- The Fire Grate is painted with heat-resistant black paint to help prevent rusting over time.If you choose Raw Steel Finish then we recommend seasoning your Fire Grate with vegetable oil in an oven or over a fire to help prevent rusting.Safety Tips​:Place your fire pit 10 feet from any structure or neighboring yard.Do not place your fire pit under a covered porch, trees, or on a wood deck.Flammable materials must be more than 5 feet away before starting your fire.Do not use your fire pit if it is too windy or too dry.Never leave your fire pit unattended as wind can quickly kick out sparks.Always use a poker when trying to move logs in the fire pit.Fire Pit Care:Always cover your fire pit when not in use.Dump ashes into a metal barrel as ashes can remain warm for many days.Clean your fire pit regularly to prolong the life & look of your fire pit.Store your fire pit indoors during inclement weather & winter months",
    "reviews": [
      "Solid product, will fit nicely in my Workhorse 1975 offset bbq pit.",
      "Thrilled —perfect look for our contemporary home fireplace - outstanding craftsmanship, packaged so well!",
      "Thank you it's going to be perfect"
    ]
  },
  {
    "productId": "oA28SjSFbL",
    "url": "https://www.etsy.com/listing/1040439761/suncatcher-stained-glass-goldfinch?click_key=ce52393522ea0912d4706d709593a73647988559%3A1040439761&click_sum=942715ba&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-26&pro=1&etp=1&content_source=22a5720403c8b6008998d830bbd3d37b78147987%253A1040439761",
    "title": "Suncatcher stained glass Goldfinch Window hanging stained glass flower Garden decor",
    "description": "We are glad to present you our magnificent product - the singing bird - the goldfinch. Looking at him, the soul sings. And the melodic sounds of nature appear in the imagination. Singing birds makes you stop, enjoy the moment and feel happiness as it is.It looks so natural that it can be confused with a live bird that has just arrived on a branch.This product will fit into any interior and create an atmosphere of natural beauty in your home.This is a wonderful gift for any occasion. Delight your loved ones with such an exquisite and graceful gift.DIMENSIONS:Height 7.5 inchWidth 4.3 inchGlass, berries and leaves could be a little different.Price include gift&safe packaging and window fixture.All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me in private messages for details.Any item can be customized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Beautiful!  Great gift idea, you will want to keep for yourself ☺️",
      "Even more beautiful in person! I will certainly buy from this shop again!",
      "This piece is beautiful, and not something you can find everywhere - truly special.  Love it - thank you!!"
    ]
  },
  {
    "productId": "R3SnSWrYwG",
    "url": "https://www.etsy.com/listing/1282659624/classic-truck?click_key=8555ccdf6ac001ce7ce61d51098e8406e707bf72%3A1282659624&click_sum=6c3abcb1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-27&pro=1&etp=1&content_source=8c4dcb965b5f4c2b82e7f2744e99785ad94fc5ce%253A1282659624",
    "title": "Classic Truck",
    "description": "Add an iconic old-fashioned holiday design with our Classic Truck Pop-Up metal artwork! This design features a classic antique truck including beautifully intricate metal cutouts and details to add a realistic look to the body, grill, and wheels. Of course, we’ve added a beautiful Christmas tree to the back of the truck - a signature image during Christmas time!The Classic Truck Pop-Up is made of recycled steel and pre-treated to create our signature rusted texture and natural look. It's then hand-painted by our artists to make it perfect on a coffee table or side table in your home or displayed as a centerpiece for your dining room table. It makes an especially fitting accent during the holiday months!To display your pop-up pedestal, gently fold the stand portion attached to the bottom to make the silhouette stand up. Then, display it on any flat surface indoors or outdoors!The Classic Truck measures 13.0\" wide x 6.5\" tall",
    "reviews": [
      "Wonderful craftsmanship and fast shipping",
      "Love my little red truck!",
      "My aunt LOVES this holiday truck. Thank you very much!!"
    ]
  },
  {
    "productId": "a8wOadXIXU",
    "url": "https://www.etsy.com/listing/1653015689/handmade-northern-cardinal-home-decor-or?click_key=be801c374f2d788b64a574db6c69859b4be4d7a0%3A1653015689&click_sum=074527fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-28&pro=1&frs=1&sts=1&content_source=4006c2685447f3df15d770ad64d1c1e6e6ba405c%253A1653015689",
    "title": "Handmade Northern Cardinal | Home Decor or Yard Art Made in the USA by Wood Chainsaw Artist in Texas",
    "description": "Handmade Northern Cardinal | Home Decor or Yard Art Made in the USA by Wood Chainsaw Artist in TexasDiscover the beauty of nature captured in this extraordinary creation – our Handmade Wooden Cardinal, skillfully handcarved with a chainsaw by talented artist Chad Kilpatrick from Wills Point, Texas. Crafted with precision and love, each cardinal boasts unique detailing, making it a stunning addition to your home or garden decor. Embrace the rustic charm and genuine craftsmanship of this unique, wooden masterpiece, showcasing the perfect blend of art and nature.> This gorgeous handmade Chainsaw Cardinal can be artfully displayed inside as home decor or outside as yard or garden art, porch or patio decor.> This artwork weighs approximately 6 lbs; and 15.5\" tall x 7\" wide x 7\" deep> This red Northern Cardinal garden art is a handmade and hand painted original. Chad coats every product of his in Cabot's Australian Timber Oil which protects this Northern Cardinal against extreme weather exposure, in addition to being water-repellent and UV-resistant. :)> Its Handmade Condition means it may contain slight imperfections> Its Handmade Condition means subtle color variations might occur as well> This Cardinal decor ships safely and securely from CA 94521 using Fedex Home Delivery> Ideal as a perfect gift for Birders or Birdwatchers.> Also, Cardinal's are a thoughtful gift idea for someone suffering from personal loss, especially a spouse or child.  In modern America, many people believe when a cardinal lands in your yard, an angel is near. The belief is that when God sends you a beautiful cardinal, it's a coveted visitor from heaven. Cardinals appear when missing loved ones are near, so when you keep seeing a Cardinal, take comfort, it is usually a heaven-sent messenger of love for you.  Cardinals can happily remind you of departed loved ones and are known among birds to be the most notable of spiritual messengers.> Cardinals also represent devotion, loving relationships, courtship, and monogamy above everything else in Native American lore.See other wooden Chainsaw art herehttps://www.etsy.com/shop/LUV2BRD?section_id=29156384DO JOIN our Rewards Club at LUV2BRD.com to pile up points you can redeem for product while shopping with us. :)",
    "reviews": [
      "It's beautiful! I want to pick my favorite plant to put in it.",
      "Great seller!! Would buy from again!",
      "Beautiful planter!! Larger than expected.  I have a large back yard, and this will stand out wherever I put it!! Thank you!!"
    ]
  },
  {
    "productId": "cFliARcgEt",
    "url": "https://www.etsy.com/listing/816703989/copper-sun-bouncy-garden-decor-wind?click_key=09dc8226afa713d2aa8711b9eeffc98b1ce493cb%3A816703989&click_sum=a5df5ebc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-29&pro=1&frs=1&sca=1&sts=1&content_source=40f5008ea529f8d4a07bc363973ef098ba9c1ad7%253A816703989",
    "title": "Copper Sun Bouncy - Garden Decor - Wind Chimes - Garden Bouncy - Zen Sun",
    "description": "This is a Celtic style sun in an antique copper finish which we also added some distressing to give off that wonderful antique vibe.  The sun wraps around a blue marble and hangs off a 9-inch spring.With a slight breeze, this miniature sun would bouncy and create a lot of motion in your yard.Metal, MarbleApprox. 9.25”L x 5.25”W x 2”H (Spring: 9”)",
    "reviews": [
      "Beautiful! Well-made. Delivered on time!",
      "Item was just what I expected. Packaging could of been a bit better, it was a little bent.",
      "This is kinda small but I still like it a lot.  The sparkly ball in the center is pretty and the whole thing is nice and bouncy.",
      "Great, quality item.  Fast shipping and well-packaged."
    ]
  },
  {
    "productId": "FOARxQcDLC",
    "url": "https://www.etsy.com/listing/1402885254/blue-stained-glass-flower-heads-plant?click_key=a1326fa2df829b7bfb23f85275a409f266f03182%3A1402885254&click_sum=c7493eab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-30&pro=1&frs=1&etp=1&content_source=f49031a24345273fa9f3738707bd1390769834bf%253A1402885254",
    "title": "Blue stained glass flower heads plant stake. Fantasy floral pod suncatcher pot stick. Garden outdoor and indoor decor. Nature lover gift",
    "description": "Stained glass plant stake for a window sill plant pot in a cute flower seed pod shape will be a unique aesthetic gift for nature lovers. The blue floral plant stake will be a lovely suncatcher on your indoor window sill or outdoor garden.The price in the listing is for ONE flower pod stick.All of the handmade light catchers are unique and differ slightly from each other in shape - if you want to choose the specific one, PM us.🟢DETAILS:• High of the stick: 25 cm / 9.84\"• Size of the flower: 3х6 cm - 1.18 х 2.36 in• All photos are real.🟢More stained glass suncatchers here -https://etsy.me/3q9UwbC***TECHNOLOGY: flower pods are made using a stained glass technique.• Care instructions: clean them with a soft wet fabric.• All items are packed carefully to make their trip to your home safe.***Please, note that due to lighting effects, monitor's brightness, contrast, and other settings, there might be some slight differences in the color tone/shade of the web site's photo and the actual item.",
    "reviews": [
      "This is absolutely beautiful. It looks exactly like photo and is made of high quality materials.\nI love it",
      "😁 We're grinning from ear to ear! Your 5-star review and photo are pure perfection. Thanks for being amazing! 😄👍",
      "These are lovely pieces of art to grace your garden.  I can’t wait for spring.",
      "🌟 Thanks for choosing our services and for the 5-star review! You're our star!",
      "Shipped well. Great for gifting!",
      "🌟 We're absolutely delighted by your rating! Thanks for trusting us with your stellar experience."
    ]
  },
  {
    "productId": "TmKmvkYfOC",
    "url": "https://www.etsy.com/listing/1181848263/large-decorative-metal-bird-and-flower?click_key=222ed1c1c750231ec55c759f21341c7d43ebbda7%3A1181848263&click_sum=6d7ba066&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-31&pro=1&frs=1&etp=1&content_source=157751b61875bc3a945801705cabd8e37b26b9b3%253A1181848263",
    "title": "Large, Decorative Metal Bird and Flower Garden Trellis | Rusted Metal Yard Art | Garden Gifts | Metal Garden Art | Garden Bed Decor |",
    "description": "Brighten up your garden and home with this beautiful Bird and Flower Trellis!Makes a great birthday gardening gift for mom and grandma. Perfect as a Thank You gift and for Mother’s Day to add life to any space. An elegant addition to any yard or garden!Naturally occurring oxidation gives this piece of garden art a rustic and charming life about it, complementing the luscious greenery around it.🛠️  SO EASY TO INSTALL & DISPLAYOur metal garden art inserts easily into soft ground when using two hands for support. Be mindful of rocks and roots that may catch the metal stake, and adjust the depth as needed.✔️  THE PERFECT SIZEDimensions: 88\" Tall x 24\" Wide and 1 inch deep.📦  PROMPTLY SHIPPEDCarefully picked and packaged to ensure safe arrival, your products should arrive within 1-2 weeks.🌱  INSPIRED BY NATUREWe've been setting the scene with playful silhouettes since 2011.As a husband and wife team from the Pacific Northwest, we've always combined superior craftsmanship with iconic design to help our customers bring the beauty of nature home.🔍  DISCOVER MOREVisit our shop home page to discover more ways to add charming inspiration and rustic accents to your yard, garden and home.👋  LET’S CONNECTIf you're inspired by what you see, click the ‘Favorite Shop’ button above and then join the conversation on our social platforms (copy & paste into web-browser)Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/",
    "reviews": [
      "Beautiful!! Love It!!!",
      "I love this trellis so much. Got it for a climbing cup plant, and many neighbors have commented on it.",
      "Love it it’s a beautiful addition to my garden",
      "This trellis is amazing.  Unique and a showpiece in the garden.  I'm grateful for the seller having a sale so I could afford to add it to my pollinator's garden.  Also awesome shipping, FedEx, arrived so fast I was amazed.  Super job of packing.  Very pleased and recommend seller and store."
    ]
  },
  {
    "productId": "pkgpadWHEa",
    "url": "https://www.etsy.com/listing/719944547/garden-sun-catcher-in-light-blue-crystal?click_key=05819609eeebb6cc99ad5bae7e92b318375c63ce%3A719944547&click_sum=5f45292f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-32&pro=1&frs=1&sts=1&content_source=8188c33cfda7de742c77bd3047e1154c70b4099f%253A719944547",
    "title": "Garden sun catcher in light blue & crystal clear rhinestones, outdoor hanging garden art, mirror strings, garden zen, gift for gardeners,",
    "description": "Boho Blue .... blue with crystal clear rhinestones make a gorgeous bohemian combination!Fancy Tree Jewelry adds whimsy and fun to any outdoor space year round! Everyone loves the tiny reflections and the bursts of sparkle that scatter and dance when the wind catches and the sun or moon is shining. Tough enough to withstand summer heat and the winter freeze, these unique dangling sun catchers are magical and dazzling.Strings adorned with mirrors, acrylic rhinestones or glass beads, some with crosses or snowflakes, strung from branches, hanging from your deck or porch will add whimsy to your outdoor space. These catch the breeze as it wafts by and the mirrors scatters the sunlight to create a magical ambiance. Add a bit of whimsy by hanging several strings.Hang your Fancy Tree Jewelry from tree branches, garden hooks, off your deck, anywhere you need a little bling! Leave out rain and shine, summer and winter!All weather! That's right, you never have to take these inside. These are tough little buggers, and easily handle the extreme cold to the extreme heat!  These are made with #15 fishing line, acrylic rhinestones, glass beads ...  materials that are made to withstand any type of outdoor condition, from the minus 20 degrees of the upper mid-west to the extreme heat of the Arizona summers.Fancy Tree Jewelry would be the perfect accessory to dress up your garden year round, and they would also make the perfect gift!!🩵 LENGTH / SIZE: These  are made in 12\", 24\" 36\" 48\" and 60\" lengths.   Need longer?  Send me a message, I am happy to customize the perfect length for you!🩵 NUMBER OF STRINGS IN THIS ORDER:  Any quantity you want!🩵 FREE hook with each string of Tree Jewelry purchased.🩵 MIRRORS: The mirrors are hand-cut, and so this means the edges are very sharp! Please be extra careful when touches, especially those little hands. Each is approximately 1/2\" in size.🩵 HOW TO HANG: Each string has a loop at one end. Loop it over a small branch using the hook so that the string can dangle freely.🩵 CARE & MAINTENANCE: You can leave these out year round, through summer heat and winter cold. Every once in a while, you can wipe clean the mirror to make sure they sparkle & reflect!🩵 PROCESSING TIME: Your Fancy Tree Jewelry will ship 5-7 business days after you place your order.   Each string is hand-made and will be packaged for safe shipping.🩵 SHIPPING TIME: 2-3 business days within the USA with USPS Flat Rate Shipping. You will receive a tracking number to track your package!🩵 GIFTS: We can ship our Fancy Tree Jewelry directly to your gift recipient. We are happy to include a complimentary gift note and even gift wrapping for the occasion!  Please send us the text you'd like to use in the notes to the seller field",
    "reviews": [
      "I purchased twelve 12\" strings of mirrors and acrylic “gems”.  These are glued together with the ‘fishing line’ in between.  Most of the square ‘mirror’ pieces are not exactly aligned, but it’s not that noticeable.  A few ‘gems’ fell off so I’ll just glue them back on.  Yes, this could be a DIY project, but it would take time to get the items needed and put them together. I have enough of my own crafty projects I’m working on and didn’t want to add another.  Plus the idea of tree jewelry!!  My plan was to hang them from the base of our fireplace mantle to add some sparkle to the plain old-fashioned brick fireplace front.  I finally finished the project and like how it looks.  I have a few extra strings and just need to figure out what needs extra sparkle.\nShipping was fast!  Packaging was well done!",
      "Thank you Deb!",
      "So beautiful.  Better than ever.  Tree jewelry is just wonderful year round.",
      "Gorgeous, looks beautiful in my secret garden",
      "Bought these for my sister, after she saw mine, she absolutely needed some, got the blue to match her house. Highly reccomend this sellar, worth every penny!!!!!"
    ]
  },
  {
    "productId": "yMjizPQnXz",
    "url": "https://www.etsy.com/listing/538103337/medium-colorful-pebble-shape-indoor?click_key=2661d203b414c32739e42a689ddcc9a7e7f4c28e%3A538103337&click_sum=e5c84d4d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-33&pro=1&frs=1&etp=1&sts=1&content_source=78d6436412b27bce2f6e405463a0cb8e9bde6e78%253A538103337",
    "title": "Medium Colorful Pebble Shape Indoor Planter with Drainage hole",
    "description": "This pebble shape planter is colorful, unique, and cheerful and is very good for succulents and cacti. The indoor planter will add light and color to every corner of your home!The pot has a drainage hole, with a plastic plug that might be used, according to your needs.This pot plant has a colorful tile-like pattern achieved using a handmade technique called Millefiori out of polymer clay. The color is attained without the use of paint at all!INFOPolymer clay coatingSIZEPot:Upper diameter: 2.75”*3.34” (7*8.5 cm)Middele diaeter: 5.51”*5.90 (14*15 cm)Base diameter: 3.34”*3.14” (8.5*8 cm)Height: 2.36”*2.75” (6-7 cm)Care Instructions:Given the handmade artisanal nature of my pieces, please hand wash your items with a soft cloth and mild dish soap. This piece is NOT DISHWASHER SAFE.Please note each piece is handmade and slight variations may appear as a result - which is what makes each item so special!In addition, because every computer displays colors a bit differently, the colors may vary oh so slightly.Every piece is made to order, and the estimated shipping time is 7-21 business days. Each piece is wrapped safely for airmail.I’d be happy to answer any questions! Please don’t hesitate to reach out via convo or email :)You may also like my large pebble shaped pot:https://www.etsy.com/il-en/listing/1209403592/round-planter-colorful-big-planter-plantFor more colorful plant pots:http://etsy.me/2rUxGm4To learn more about the creation process:http://etsy.me/2sBLkuWBack to my shop:http://etsy.me/2r2Gfdr",
    "reviews": [
      "These are working wonderfully!\nThank you.",
      "I really like this colorful and well-made pot with a matching drip tray.  Make sure you know the dimensions because an x-large pot may not be what you consider to be a super-sized pot.  But works for me and I recommend it.",
      "I can’t quite put into words how beautiful this planter is. The colors pop, the surface has consistent inconsistencies that you look for in handmade items. The planter radiated with warmth and love, I’m certain it came from a home full of it. Aside from that, it is sturdy and arrived across the ocean well-packaged and in perfect condition. I kept this on my wishlist for sometime and I am so happy I committed to this purchase! I hope to buy more in the future!"
    ]
  },
  {
    "productId": "vRVWRLLbL2",
    "url": "https://www.etsy.com/listing/1678448443/plant-stand-bamboo-wood-tray-3-layers?click_key=3fc96b9305a1235f2225c0bab7d526ed78cf32f2%3A1678448443&click_sum=94e1d486&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-34&pro=1&content_source=05d02daeb73cb91b50dcfdd6add0a7c1ae69ea70%253A1678448443",
    "title": "Plant Stand Bamboo Wood Tray 3-Layers Flowerpot Holder - Flower Pot, Plant Pot Stand, indoor plants- plant gift- flower organiser",
    "description": "Bamboo Wood Tray 3-Layers Flowerpot Holder - Plants Stand Home DecorElevate your home decor with our Bamboo Wood Tray 3-Layers Flowerpot Holder. This versatile plants stand is perfect for organizing your succulents, bonsai, or other indoor plants. Made from eco-friendly bamboo wood, it adds a natural touch to any room.Material: bambooColor: woodShape: 3 layersSize: 9*16cm; 9.5*19.2cm;You will receive1x Bamboo Flowerpot Tray",
    "reviews": [
      "good quality, would recommend this seller",
      "Thanks so much jack!",
      "Excellent quality. Looks perfect in our kitchen and holds the eggs well. Would highly recommend!",
      "Thanks so much Dale, glad you love it",
      "Item was exactly as described",
      "Thanks so much Lesley!"
    ]
  },
  {
    "productId": "AHvmvBWsmY",
    "url": "https://www.etsy.com/listing/1656655128/family-gift-personalized-cooler-birthday?click_key=847ff3f83bfd07c90f9b2c2e0b9d3099f339ec7e%3A1656655128&click_sum=855a44fd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-35&pro=1&frs=1&content_source=1aea98c66650372fa8b87b213cae0682c02be3a9%253A1656655128",
    "title": "Family Gift, Personalized cooler, Birthday Gift for Him, Mens Personalized cooler, Backyard Cooler, Cedar Wood Cooler, Anniversary Gift",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This Cedar Ice Chest is built by hand in El Campo, Texas.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*Custom OrdersIf you are wanting a custom logo or design please let us know in the notes of the order, or reach out through Etsy messenger.Thank you for your interest in our product.  We appreciate every opportunity to earn your business!  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Just as promised!  My grandson will start saving money right away!!",
      "Excellent quality.  Quick shipping.",
      "Product is perfect we love it.",
      "Great workmanship, just what was needed."
    ]
  },
  {
    "productId": "iNhEkcXtmr",
    "url": "https://www.etsy.com/listing/1648846164/outdoor-statues-gnome-figurine-yellow?click_key=c4148a643ebafb90f58adb4728f68282917dd933%3A1648846164&click_sum=674475e4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-36&pro=1&frs=1&content_source=51101719778e83a5210259a26d1ce717228732a8%253A1648846164",
    "title": "Outdoor Statues Gnome Figurine Yellow Labrador Retriever Statue Patio Lawn Indoor Outdoor Garden Gnome Sculpture",
    "description": "Elevate your outdoor space with our Gnome and Yellow Lab Statue – a heartwarming fusion of nature and whimsy.Crafted from durable resin, this charming garden sculpture features a playful Yellow Labrador Retriever alongside a cheerful gnome, adding a touch of enchantment to your patio, yard, or lawn. Ideal for Mother's Day, birthdays, or Christmas, this painted statue is a delightful gift.Easy to showcase with its statue mounting type, this outdoor gem captures the essence of the great outdoors in a garden-style finish. Bring joy to your surroundings with this Gnome and Yellow Lab Statue – a perfect blend of charm and canine companionship.",
    "reviews": [
      "Item shipped fast very happy",
      "Love these octopus legs. I was so excited to put them in my plant.",
      "Beautiful piece, great sturdy metal spikes for poking plant and came so fast!!!"
    ]
  },
  {
    "productId": "2zTgVlJMiM",
    "url": "https://www.etsy.com/listing/529316616/rusted-metal-art-metal-birds-on-a-tree?click_key=f4bcc25aa49ec34b946585adc8dbb296fab6f6ac%3A529316616&click_sum=6493b697&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-37&pro=1&content_source=0eecd245f3b5dd6f1abcee8b4828db8ab60c2526%253A529316616",
    "title": "Rusted Metal Art Metal Birds on a Tree | Metal Bird Wall Art | Metal Bird Art Outdoor Metal Bird Yard Decor Rustic Yard Art Rusty Birds M413",
    "description": "Rusted Metal Art Metal Birds on a Tree | Metal Bird Wall Art | Metal Bird Art | Outdoor Metal Bird | Yard Decor Rustic Yard Art Rusty Birds.SKU# M413 Dimensions: 10 x 17.25 x .5 in.Please favorite our Etsy shop and follow us on Social Media:Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "Adding this to our front porch post, very nicely made",
      "everything about blue bird in a tree as advertised with fast safe delivery, it looks great",
      "Lovely product. Pretty, sturdy, and quick ship"
    ]
  },
  {
    "productId": "mqBNRIWAhb",
    "url": "https://www.etsy.com/listing/924694868/terra-cotta-multi-colored-leaf-mobile?click_key=d00f13e5a8f2c9e6416948f4aa1f4bffe1b4bc28%3A924694868&click_sum=f5bbad94&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-38&pro=1&sts=1&content_source=dc3bd30068e35be725c59817d20ed8094d9f93bf%253A924694868",
    "title": "Terra Cotta Multi Colored Leaf Mobile, Tree Decoration, Garden Decor, Yard Art, Gardener Gift, Outdoor Decoration, Garden Art, Wind Chimes",
    "description": "Terra Cotta Multi Colored Leaf MobileThis Terra Cotta Multi Colored Leaf Mobile is the type of item we at Happy Gardens search high and low for. It’s unique, colorful and gorgeous. With four branches that turn from blue to violet to green, you’ll love how natural this mobile feels hanging from your favorite tree. These cool tones look especially brilliant in your greenest, most verdant outdoor spaces. Like all Happy Gardens mobiles, this one is handcrafted, and brings lasting beauty to your landscape.Dimensions: 23” W x 30.5” HEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and wind chimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed to for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and wind chimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "Beautiful mobile. Prettier in person.",
      "Better than picture. Very happy to have it hanging in our yard!",
      "This is lovely, David. Thank you so much and take care!",
      "Makes me smile when I see it.",
      "This is so sweet. Smiling while reading your feedback too. Thank you!"
    ]
  },
  {
    "productId": "NZKOZWAPVd",
    "url": "https://www.etsy.com/listing/1037854326/patio-decor-pool-decor-or-patio?click_key=d4467ede58e609260ffb4b1ddfd478ab8121bab9%3A1037854326&click_sum=a447e0d6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-39&pro=1&frs=1&etp=1&content_source=00b5f37f07ecfa65ea770049b09d1ebe97590912%253A1037854326",
    "title": "Patio decor, pool decor, or patio furniture personalized cooler",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Loved the product and so did the couple I gave it to",
      "LOVE this custom cooler! So well made!",
      "Quality superb. So lightweight but so sturdy. Love that there’s no assembly! Sent ASSPCIATES upon request. I am ordering another."
    ]
  },
  {
    "productId": "OkObnLztPf",
    "url": "https://www.etsy.com/listing/1090986102/scallop-cup-rain-chain-happy-gardens?click_key=469d4e5612d8991b2e90ae972133357e950159f4%3A1090986102&click_sum=61c4f881&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-40&pro=1&sts=1&content_source=56e6dabbc1c0b7af4d9e8d145380a0988acd1a64%253A1090986102",
    "title": "Scallop Cup Rain Chain - Happy Gardens | Garden Decor | Metal Art | Wind Chimes | Gifts for Mom | Patio Art | Home Decor | Outdoor Decor",
    "description": "Scallop Cup Rain ChainOne of our most popular designs, and an absolute classic! Our Scallop Cup Rain Chain catches droplets as they trickle down, eventually creating a stunning cascade. Perfect for pairing with a matching receptacle, this water feature is a fanciful alternative to a plain downspout. It features a flamed finish, which provides a soft, iridescent gleam in every kind of weather. Like other Happy Gardens rain chains, this one has been individually handcrafted, and will bring lasting beauty to your home’s exterior.Steel construction with flamed finishDimensions: 3” diameter x 96” HWeight: 3.0 lbsALWAYS HANDCRAFTED - Our rain chains are expertly crafted by hand, and it really shows. You’ll notice intricate details on your rain chain you just don’t encounter everyday.EASY TO INSTALL AND CARE FOR - Your rain chain will come with simple, easy-to-understand assembly instructions. We want you to enjoy your purchase the very same day it arrives! Plus, caring for your rain chain is a breeze and will ensure it lasts for years to come.UNIQUE AND COMPELLING - Like all our products, this rain chain was expertly selected by our Happy Gardens team. Why? Because it’s beautiful, functional and special!BUILT TO LAST - As always, we’ve diligently ensured that this beautiful rain chain is more than just easy on the eyes! The artisans who crafted this piece have chosen top-quality, durable materials so this rain chain can weather storm after storm.BACKED BY A NO-STRESS WARRANTY - We offer a one-year, limited replacement warranty on our rain chains. If you are unhappy with your purchase for any reason, simply call or chat with us and we will help make it right.",
    "reviews": [
      "This was a gift so I cannot comment on item quality. The transaction was super easy and the shipping was fast. I’m sure the recipient will love it!!",
      "My rain chain got here really fast, it looks exactly as pictured and it works great!",
      "Beautiful. Fast mailing. Packed very well. I've ordered 2 so far!"
    ]
  },
  {
    "productId": "fuewDyR2HP",
    "url": "https://www.etsy.com/listing/860606004/bell-spiral-garden-stake-outdoor-stake?click_key=3093d652a96dcf320085ba495eac292d04d91787%3A860606004&click_sum=5f27a08c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-41&pro=1&sts=1&content_source=9a9836c6061d6fb6124a745b095f78795359e360%253A860606004",
    "title": "Bell Spiral Garden Stake, Outdoor Stake, Garden Decor, Yard Art, Yard Stake, Patio Stake, Yard Decoration, Landscape Decor, Garden Decor",
    "description": "Bell Spiral Garden StakeInvite new sights and sounds into your outdoor space with this breathtaking garden stake. Perched at over four feet tall, this piece will instantly elevate any garden with its unexpected curves and 15 handcrafted, beautiful bells. Try placing it in a grassy yard, or make a statement by clustering it with your favorite tree. Wherever you stake it, rest assured that this carefully detailed garden stake will bring style and song to your home for years to come.Dimensions: 8\" w x 2\" d x 48\" hHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Beautiful and unique! It looks so special in our front hard",
      "Beautiful, great quality, arrived right on time",
      "I am happy to know you are happy with the service and the product, Terri. You deserve the best. Thank you for your business 💚",
      "Wonderful magical sound and love it",
      "Nice piece. Have ordered several pieces from this vendor. Enjoy them."
    ]
  },
  {
    "productId": "JZlFinUxyV",
    "url": "https://www.etsy.com/listing/1007025634/handstamped-garden-marker-sold?click_key=2ad38609cac593549e45ee9993ed50e20700db65%3A1007025634&click_sum=da7af0fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-42&pro=1&etp=1&sts=1&content_source=dcf9cc883b2a3a8e1d4dcb8186c1fc26dd0eb5d4%253A1007025634",
    "title": "Handstamped garden marker Sold individually Herb marker Vintage upcycled Unpolished vintage spoons and forks Garden decor Spring gift basket",
    "description": "Herb your enthusiasm with these beautiful vintage garden and herb markers! I have individually handstamped various herb names onto silverplated vintage forks and spoons that have been flattened. These are sold as unpolished/tarnished, just as pictured. Handles will vary per inventory though!Each piece is between 5 and 9 inches in lengthSold individually. Please select quantity desired and put your requested herbs/veggies in the personalization field.Thanks for stopping by! Happy gardening!Find me on social media (Instagram, FB, TikTok) as Thewoodsyway for a fun, behind the scenes look at my process and upcoming items! Thank you for your continued support! I just Permanent ink used to darken letters. Use at your discretion",
    "reviews": [
      "I appreciated the opportunity to individually choose the names on each fork. They were a birthday gift for my sister and she thought they were super cute!",
      "These garden markers were better than expected.  Love, love, love them!!!",
      "Cute and different way to label the plants"
    ]
  },
  {
    "productId": "EbqLaCIOgo",
    "url": "https://www.etsy.com/listing/988438735/bear-sculpture-garden-decor-tree-huggers?click_key=f436541e522ae44a2e9bd7823e6003f59d615822%3A988438735&click_sum=653fb847&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-43&pro=1&frs=1&content_source=b4ebb69abc91f1a72fd3fd43ba0045891ae94ec2%253A988438735",
    "title": "Bear Sculpture Garden Decor Tree Huggers - Bear Tree Peeker Garden Ornament Outdoor Decor Yard Art",
    "description": "1.Hand-cast & Hand-painted:our bear tree hugger have realistic shape and fine workmanship,With natural colors and texture to create a stereoscopic piece come to Enrich your garden color and make your garden full of fun.2.Perfect garden decor：Hang this realistic bear statue on the tree trunk (the size should not be too large) to make your courtyard garden full of creativity and life.3.Material: this bear outdoor decor use highly detailed sculpted resin, very durable, Can resist outdoor factors.4.Size for our bear tree peeker -Face: 6nch (L) X4.5inch (W) X 7.2inch (H) ,Left foot: 3.7nch (L) X1.5inch (W) X6.6inch (H) ,Right foot: 3.4nch (L) X1.6inch (W) X 4.5inch (H).5.If you have any questions about the products you purchased,please feel free to contact us,we will serve you wholeheartedly.",
    "reviews": [
      "Love it",
      "Very cute, but wish it were bigger.",
      "It's much smaller than it appears and it arrived chipped."
    ]
  },
  {
    "productId": "KFOOxZcDSf",
    "url": "https://www.etsy.com/listing/1691816205/hippopotamus-garden-sculpture-hippo-gift?click_key=abd71d6e9903c2ca13f97cbd43a1524a865d5a33%3A1691816205&click_sum=58f77a5a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-44&pro=1&frs=1&content_source=6347b2940e01d0b5e58417ffff222da012c70b0e%253A1691816205",
    "title": "Hippopotamus Garden Sculpture, Hippo Gift, Gardening Gifts for Elderly, Lawn Decoration, Metal Yard Art, Safari Animals Ornaments, Grieving",
    "description": "Go on safari in your own garden! With this handmade resin hippopotamus garden sculpture. This hippo will look amazing as lawn decoration or amazing resin/ metal yard art for your patio throughout spring, summer, autumn and winter! They also make amazing gardening gifts for the elderly especially seen as these are fairly light weight, or also for any other green fingered person in your life. They're also great birthday gift ideas, or for any other special occasion you can think of. Or why not treat yourself and order your own hippo garden sculpture today!I sculpted the original of this hippo garden sculpture. You will receive a resin casting of my work in the finish you choose as pictured above.You can choose from different finishes from the drop down menu above, including real stone or metal finishes. Each finish has either stone, bronze or iron mixed in to the resin to achieve the desired finish.Each type of finish requires a different amount of labour and also the cost of each type of powder varies, hence why the prices are different for each type. I also offer a cheaper painted option for people on a lower budget.Please choose carefully which finish you would like as you will receive the finish that comes through on your order. ✓Approx Measurements & Weight: ⇢• L 42cm x W 17.5cm x H 6.5cm - 1.5kgOther Item Details: ⇢• Cast with either real stone, bronze or iron powder mixed with resin to produce your desired finish.• Very hard and sturdy but also hollow cast to reduce weight for moving them around your garden.• Suitable to display outdoors in your garden all year round.• I also sell other sizes and styles of hippos for indoors or outdoors in my Etsy shop. If this sculpture hasn’t been quite what you were looking for, please visit:www.etsy.com/uk/shop/MartsArtSculpturesto see my full range of sculptures.Other Order Details: ⇢• 📞 Please add your phone number as a note at checkout so I can add it when ordering your postage label, as my couriers require me to do so. I will never sell or share your personal info with anyone apart from the courier. Please read my full list of policies including my privacy policy below.• When you place an order you are agreeing to my Etsy shop's policies terms and conditions. ✓• 🎁 Add a FREE gift message at checkout, and I’ll print it out and add it to the parcel for you.• Add gift wrap option at checkout for just £5 extra. Gift wrap will be unisex.🎁• If you want your gift to be delivered directly to the recipient, please use their address at checkout.Social Media:Please share this listing with your friends and family to show them what wonderful things you’ve found! Also please favourite this listing and my shop so you can easily find me again!Thanks for stopping by!Copyright © 2011 Martin Pool, Mart's Art Sculptures - All rights reserved.",
    "reviews": [
      "They are perfect thank you",
      "That’s fantastic! Glad you’re happy with your hippo sculptures! Thanks for your feedback 😁",
      "Bought for my step dad for his birthday.  He loves his hippo",
      "Excellent! I’m so pleased your step dad loves his hippos! Thanks for sharing your feedback! 😁",
      "Absolutely perfect. It is our 8th wedding anniversary gift (bronze) which will be placed in our garden.xx",
      "That’s fantastic! Happy anniversary! I’m pleased my work helped make it that bit more special for you! Thanks so much again for your order and for your feedback! 😁"
    ]
  },
  {
    "productId": "PmWjMsNHZY",
    "url": "https://www.etsy.com/listing/1475225696/blue-wavy-plant-stand-maximalist-small-8?click_key=e5177c33d67f45fe062de183fb6e2d219bb807a2%3A1475225696&click_sum=8da09cc6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-45&pro=1&frs=1&etp=1&sts=1&content_source=cc9806ad5747e733324b18241aea86e94a2b9d1a%253A1475225696",
    "title": "Blue Wavy Plant Stand - Maximalist Small 8\" Stand Perfect for Displaying Plants, Cakes, and More - 3D Printed Aesthetic Apartment Décor",
    "description": "The Wavy Plant Stand may be light and delightful, but it's also very strong and sturdy! These stands weigh just 6.5 ounces and measure 7.75 inches tall and wide, but they hold more than 50 pounds without issue!Give your plants and other decor a colorful lift full of personality!",
    "reviews": [
      "Super cute and great colors",
      "I love the design and color!",
      "Exceeded my expectations. Great stuff!",
      "Love my little plant stand! It’s so cute and fun and can’t wait to put a plant on top. Highly recommend this shop."
    ]
  },
  {
    "productId": "pQrGmXdukU",
    "url": "https://www.etsy.com/listing/1091831836/grey-crowned-crane-stained-glass?click_key=9ff07f5fdab016cb2169bb02dcaa11685a0c0e11%3A1091831836&click_sum=ceb02c1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-46&pro=1&frs=1&etp=1&content_source=7c96f5e4040cdcdd9771373097d71051c0e130e5%253A1091831836",
    "title": "Grey crowned crane stained glass suncatcher plant stake Decorative plant stake Bird ornaments home decor Mother's Day gift",
    "description": "We are glad to present you one of its most extraordinary representatives - the grey crowned crane. This suncatcher accurately conveys the beauty of this exotic bird. The harmonious combination of colours, iridescent shades of grey, beige, brown and white glass will complement the interior of your home or office in a special way. The bird's head is adorned with a huge crown and it proudly displays itself in all its glory.The crane is a symbol of longevity, happiness and love. Therefore, such a sun catcher will be a universal gift for a woman or man, beloved or just a loved one. It can be placed in a pot on a windowsill or in a garden and will reflect the sun's rays, delighting you for years.DIMENSIONS:Height 14.5 inchWidth 2.4 inchGlass, berries and leaves could be a little different.Price include gift&safe packaging and window fixture.All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me in private messages for details.Any item can be personalized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Great customer service and beautiful pieces of art.",
      "Stunning stained glass.  Bought as a bday present for my mom (she loves it!). Highly recommend.",
      "Love Love Love it - Packaged very well",
      "Beautifully done and as shown. Looks great in my planter!"
    ]
  },
  {
    "productId": "nOFwnjfubv",
    "url": "https://www.etsy.com/listing/1348063425/100-solid-wood-wine-table-folding-bed?click_key=20ff0f79963b9203eff0576b92dcc6acaa0f40f1%3A1348063425&click_sum=a664ceb5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-47&pro=1&frs=1&content_source=3b505b2da9b0dbca72eb0f669c6b5c047661ad54%253A1348063425",
    "title": "100% Solid Wood Wine table, Folding bed serving tray, Round Portable Table, Outdoor Picnic Tray, Sommelier Wine Bottle Board 43cm",
    "description": "Picnic in Style with the Ultimate Cirlce Shape design table to hold Wine Bottle and room for 4 Glasses.Nicely Foldable compact away with sturdy stand, ready for every occasionHand Crafted from Rain Tree Wood/ Acacia Wood. This wood is Eco-Friendly, 100% solid wood with a distinctive natural colour wood grain textureMultipurpose Board/ Table: Can be used to prepare all varieties of foods such as breads, cheeses, meats, vegetables, fruits and many more. Or even as a fashionable serving boardUser friendly and safe as we treated each individual board with natural coconut oil to keep cutting board smooth and deeply moisturizedEasy Care: Easy to clean with just soap and waterPerfect Gift Idea for all occasions such as Christmas, Thanksgiving, New Year, Housewarming, Birthday, etcUniquely and clever design as your everyday serving board, easy to cart around. Perfect in size, but compact to put away when not in useHandy for every occasion, especially a day out for picnic or entertaining your families and friends.Size: 43 cm in Diameter",
    "reviews": [
      "Impressive gift. They loved it!",
      "Great product and super quick delivery",
      "Beautiful picnic table - seller answered all my questions really fast and shipping was quick as well! Thank you so much for a beautiful item and a good experience!",
      "Bought for a Xmas present. Arrived really quickly. Looks great and really sturdy"
    ]
  },
  {
    "productId": "pLZbbSyfdI",
    "url": "https://www.etsy.com/listing/1256537723/handcrafted-multicolour-round-bell-wind?click_key=199fb2f416865914a624ef88c67f58304e007a12%3A1256537723&click_sum=8f0e3392&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-699303-6-48&pro=1&content_source=0854e4e5371f8ba0407b25f65494e334c5e53d9d%253A1256537723",
    "title": "Handcrafted Multicolour Round Bell Wind chime for indoor & outdoor, Wall Hanging Decor for Patio/Garden, Suncatcher, House Warming Gift",
    "description": "✔️Wind Chime – A beautiful combination of handmade & hand-painted round bells design wooden wind chime. Makes a peace full sound that feels pleasant and positive to the ears and helps to relax.✔️ HANDMADE: The product is made by skilled artists. It’s a great Indian handmade handicraft home decor. It’s one of the finest Indian hanging decoration items.✔️UTILITY - Perfect for home decoration, wall decor, can be hanged anywhere like a window, balcony, terrace, rooftop gardens, living room, main gate entrance etc.✔️ MATERIAL: Paper MECH/Wood✔️ GIFTS - It’s perfect for both gifting and decoration.✔️100% SATISFACTION GUARANTEE –Indicrafts Global sells the best quality products at the best price and we guarantee it.•\tProduct Dimensions: 20*5 inches•\tItem Weight: 300 grams•\tUnits: 1",
    "reviews": [
      "Thank you, just as pictured",
      "Beautiful wind chime though the brass bells could’ve been a little weightier. Would recommend!",
      "I have a similar mobile which my friend admired-so, a super sneaky Christmas gift! 💝",
      "Just as I imagined in every way. That does not always happen you know. Whimsical in beauty and sound. Thank you for creating. A lot of time and effort was put into this piece of art now displaying in my window for all passers by to enjoy as well."
    ]
  },
  {
    "productId": "FaKXEjyCad",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=a1bd291bb0a811954e9c101f9acdb3bdb017149b%3A1567221560&click_sum=56ab54c5&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!",
      "Super quick delivery, item looks impeccable. Highly recommend. I bought it as a gift and multiple people said \"That is the nicest charcuterie board I have ever seen\""
    ]
  },
  {
    "productId": "nxrrvGwIQg",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=031ca5459157edac288bd67a2970d6779069ead9%3A1544035118&click_sum=2da9b606&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Great product, and service would highly recommend it to anyone.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "VQzgYFFjsw",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=210bc39c4c092f8e489728558f15235bc9926f5c%3A747068567&click_sum=4a684557&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!",
      "Would recommend this is a great gift"
    ]
  },
  {
    "productId": "gQOvnkVpGK",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=ac6c60e47df78e624743ab5c06b5798b4725ef63%3A654638870&click_sum=e637bf04&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "FYzgQfyb2s",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=7a4b2fa1e5e6992bc56d20c3ea742a4cf6575373%3A1355783916&click_sum=39cb47e8&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist"
    ]
  },
  {
    "productId": "SAtbfIalhs",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=fcb7a60a30c453f9b8b80c111e2c93b3c6a965f9%3A1411614241&click_sum=eb3e7c7e&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!"
    ]
  }
]
