[
  {
    "productId": "hgDlmfnosc",
    "url": "https://www.etsy.com/listing/1131818146/custom-portrait-from-photo-sweatshirt?click_key=0851f86ca8b38422e33d395a201dd750354f163e%3A1131818146&click_sum=0fe702af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-1&pro=1&bes=1&sts=1",
    "title": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait",
    "description": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait***Please send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )ORDER INSTRUCTIONS** Check and Review all Photos.**Select Your sweatshirt Size and sweatshirt Color from drop down menus.** Choose Your Quantity you want.**Click ADD TO CART. And, you can go back to add more product color for your family members or You can complete the checkout process.**Please Click “Proceed to Check Out”**Finally, Your order will be ready to ship 3-5 Business Day.**** send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )Due to the nature of the fabric as well as your monitor or mobile screen colors may differ slightly.We do accept cancellations in first 12 hours. Refunds and Exchanges are not accepted.All information is provided in the Item description as well as the photos attached to each listing.The price is for individual sweatshirt, not a setWe do vinyl heatpress printing, not screenprint o embroideryFABRIC8 oz.(US) 13.3 oz.(CA), 50/50 preshrunk cotton/polyesterHeather Sport colors: 60/40 polyester/cottonAir jet yarn = softer feel and reduced pillingDouble needle stitching at shoulder, armhole, neck, waistband and cuffs1 x 1 rib with spandexQuarter-turned to eliminate center creaseSafety Green: Compliant with ANSI / ISEA 107Tearaway labelCARE INSTRUCTIONS• DO NOT iron directly on Heat Transfer Graphic. Iron on low heat with shirt inside-outNever iron directly over design• DO NOT dry clean• Machine wash COLD with mild detergent• Turn inside out when washing• Dry on low setting or hang to dry• No chlorine bleach• Wait 24 hours before first wash*Do not use bleach",
    "reviews": [
      "My boyfriends loves it and won’t stop wearing it.",
      "Great! Thanks for the quick turn around also!",
      "Perfection! Will be making future purchases🫶🏽"
    ]
  },
  {
    "productId": "kojFWHsuD8",
    "url": "https://www.etsy.com/listing/264013568/personalized-engraved-working-compass?click_key=2d2d2504126e26185ceed93c9d1b212c38f9418a%3A264013568&click_sum=26359ebd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-2&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Engraved Working Compass with Custom Handwriting, Gift for Men Anniversary, Gifts for Dad Birthday",
    "description": "Personalized Engraved Working Compass with Custom Handwriting, Gift for Men Anniversary, Gifts for Dad Birthday.This custom engraved compass made from top quality solid brass, and durable for outdoor use.If you want to find other \"engraved compasses\" please click this link!https://www.etsy.com/shop/SFdizayn?ref=seller-platform-mcnav§ion_id=16459965Diameter: 1.96 inchMaterial: BrassChain: Comes with the same chain as in the listing picturesCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.Engraving: We can engrave whatever you want and we can use every font that you want.This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband gift, boyfriend gift, valentines day gift, fathers day gift, birthday gift, groomsmen gift, and anniversary gift. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.*IMPORTANT MESSAGE ABOUT DELIVERY and TURNAROUND TIMEIf you add your phone number to your order notes; delivery would be faster than usual.Turnaround time is 1 business day and I ship your order in 1 day after your purchase. You can choose the Express delivery method at checkout.* HOW TO SEND YOUR ENGRAVING INSTRUCTIONSPlease put all your engraving instructions for each side in the '' add your personalization '' box on the product page. For example:Front side: abc...Inside: xyz...Leather pouch: klm...If you want me to engrave an image or images; please attach the image to the ETSY message box ( conversation box ) after your purchase.For handwriting engraving; please use white unlined ( blank ) paper with a black pen and take a picture of the paper. After your purchase please attach the image of your handwriting via the conversation box. Just send us a message.We can engrave one of the same mountain, lake, river, wave, waterfall, sun, and stars design as in our listing pictures or we can engrave your own design.",
    "reviews": [
      "Perfect! Just as I imagined.\nMy son loved it",
      "I ordered it for my partner’s birthday and he loves it! The seller was really friendly, responded within an hour and helped me pick a design! I ordered it on Friday and it came on Tuesday. Definitely recommend!",
      "The quality is amazing and the shipping was fast! My dad absolutely LOVES it! 🥰",
      "Better in person,\nGreat communication ."
    ]
  },
  {
    "productId": "HaaRfyaTUa",
    "url": "https://www.etsy.com/listing/1617910897/personalized-night-light-customized?click_key=cca32fb09925f676cbc49bb71cbbb9837b974d2a%3A1617910897&click_sum=89b1c5d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-3&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Night Light, Customized Birthday Gift, Gift for Nursery, Girl, Daughter, Boy, Him, Baby Shower, Dad, Mom, Her, Boyfriend",
    "description": "Christmas Gift, Birthday Gift from Daughter, Personalized Night Lamp, Custom Night Light, Anniversary gift for Him, Her. Gift for kids, boy, girl, son, daughter.Are you looking for a night light to brighten up your child's bedroom? Or a decorative, elegant, and personalizable gift for a loved one? You have come to the right place!Our homemade lights are the perfect gift for your loved ones. Whether it’s for Christmas, Valentine’s Day, Father’s Day, Mother’s Day, Birthdays, Weddings, or any other event, our lights are fit for the occasion!🌸–Light Information–🌸Dimensions of the lights:- Cloud Light = 8\" wide 6\" height- Rectangular and Oval Lights = 6\" wide 8\" height- Heart Light = 6.7\" wide 6.7\" heightThe acrylic is made out of 100% Virgin MMA.The wood is made out of Basswood, more commonly known as Lindenwood.The product comes with:- The acrylic- Wood stand- 3 ft. USB cable with on/off button*Power adapters are not provided with the order*The LED in the light lasts up to 50,000 hours.Made in Canada.There are no harmful ingredients in the lamps.🌻–Personalization Information–🌻We can engrave your personalizations to both the acrylic and the wood to add a personal touch to your orders!- If you only want personalization on the acrylic, please select “No thanks” for the woodpersonalization. Then, write your request in the box provided.- If you want both acrylic and wood personalizations, please select “Yes please” for the woodpersonalization. Then, write your request in the box provided. Please specify whichpersonalization you would like to write on the acrylic and which one you would like on thewood.Personalization Request Example:Acrylic = Michelle & JohnWood = I love you to the moon and back.Acrylic Personalization:We can only engrave with 1 font (examples provided in the pictures).- Cloud Light = Only one name (one word) can be written on the cloud acrylic.- Rectangular and Oval Lights = We can engrave two names, a date, and a sentence on theacrylic. If you would like all 3 on the acrylic, the sentence needs to be a maximum of 6words. If you only want a sentence without names or a date, it can be two lines long.- Heart Light = Maximum two names and one date can be written on the acrylic.Wood:We can only engrave with 1 font (examples provided in the pictures).A maximum of two lines can be written on the wood.Logo Engraving =We can engrave logos on the lights as well. If you would like to engrave a certain logo, please message us through Etsy messages and send the picture you would like.🌷–Shipping Information–🌷We prepare and ship your products in 1 or 2 business days.Normally, Canadian customers receive their orders in 3-10 business days. Whereas, US customers receive their orders in 3-7 business days.*Please note that during the holiday season, there may be delays in shipping. We are not responsible for these delays.*🌹–Light Care–🌹- Before you start using the light, please remove the protective film behind the acrylic part.- In order to keep the light clean, you can use a glass cleaner with a soft cloth to wipe the acrylic part.If you have any questions, please message us through the Etsy messages and we can gladly assist you the best we can!We can make your order in 1-2 days.Canadian customers receive their orders in 3-10 business days.US customer receives their order in 3-6 business days.",
    "reviews": [
      "Had a small problem that was quickly resolved. Love this night light!",
      "Great experience with seller! Would recommend",
      "Great! Just as described and fast shipping",
      "The item matched the description and it’s so cute!"
    ]
  },
  {
    "productId": "EXFmliZbay",
    "url": "https://www.etsy.com/listing/1601633065/personalized-wooden-guitar-picks?click_key=cc428ed82e4cc3df7ccd6479892845f3a8655f92%3A1601633065&click_sum=0e4b610e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Wooden Guitar Picks Box,Custom Engraved Guitar Pick Holder Storage,Guitar Plectrum Case Organizer,Gift for Guitarist Musician",
    "description": "【Product Details】Box Size: 40 x 40 x 29mm / 1.57 x 1.57 x 1.14 inch( L x W x H ),  Material of box: walnut.【Unique Design】The color, texture, and wood grain of any natural wood product will vary from piece to piece, but this is what makes this guitar pick holder unique. Our pick case are crafted from high quality, sturdy wood. The edge treatment of the product is very meticulously smooth, and the box will keep your picks safe and protected.【Convenient Storage and Display】With this pick container, you can keep your guitar picks organized and easily accessible. The case is compact and lightweight, making it portable for gigs, rehearsals, or traveling. Additionally, the lid is held closed by a strong magnet lock, which protects the guitar picks from damage or from falling out.【Free Engraving】There are 18 fonts/patterns to be selected from, you can customize your the guitar box case with someone name, initials, letter combination, special date! It will be a unique Christmas/Birthday/Anniversary Gifts for Friends, lover, Husband, Boyfriends, Musicians and Guitarists to express your encouragement or love for them.【Please Note】Due to wood’s natural texture and color, the item may not be exactly as the pictures show. Some wood is a little bit dark and some wood may have some spots. If you are not satisfied or have any questions, please feel free to contact us to get a satisfied solution. We will be happy to assist you and reply within 24 hours.",
    "reviews": [
      "Very pleased with item and will consider ordering again",
      "❤Hi, thank you for picking our products. We're delighted to know you're satisfied with your purchase, as our primary focus is your happiness.❤",
      "I received the black guitar pick I ordered as a gift for my brother. It looks great! Very well made. I am very pleased with my purchase. It arrived quickly and was packaged very nicely. I would not hesitate to make additional purchases from this seller.",
      "❤Hi, thank you for picking our products. We're delighted to know you're satisfied with your purchase, as our primary focus is your happiness.❤",
      "Thanks for the great item",
      "❤Hi, thank you for picking our products. We're delighted to know you're satisfied with your purchase, as our primary focus is your happiness.❤"
    ]
  },
  {
    "productId": "uYaHCYxJrs",
    "url": "https://www.etsy.com/listing/1476496443/neon-sign-custom-name-custom-neon-sign?click_key=50fa0d2a9420acb96252b73c79b5126ff5b5552d%3A1476496443&click_sum=4762c175&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-2&pro=1&frs=1&etp=1&sts=1",
    "title": "Neon Sign Custom Name, Custom Neon Sign Battery Operated, Neon Sign Custom Wedding, Neon Name Sign, Custom Led Neon Sign For Wedding",
    "description": "Custom Name Neon SignSuper fast production and shipping - 12 Months warranty✈️ FREE Express Shipping Worldwide, by FedEx, DHL, and UPS❤️ Please refer to our prices by choosing Size. This price is only for 1-line designs. FREE mock-ups are available.⚡️ Message us and get a Free mock-ups🤝 Please Note: For 2-stroke fonts or sizes beyond the package standard, we will notify you of an additional surcharge (if applicable).Gorgeous, insanely high quality neon sign made by hand and built to last.【APPLICATION】*Wedding party decor, Valentine’s day, Wall decor, Bedroom decor, Personalized gifts, Anniversary gift, Engagement gifts, Birthday gift, bridesmaid gift, Father’s day gifts, housewarming gifts etc.Sign comes in 10+ sizes between 40 and 150cm in width or height. Available in 12 stunning color options.【MATERIALS/GUARANTEE】Made from long lasting, durable and environmentally friendly LED neon strip, mounted on a clear acrylic back board - the sign comes standard with a 2 meter clear power cord.Light designed to last at least 10 years.【WHAT'S IN THE PACKAGE?】- Neon Sign Custom to Your Specifications- Power Supply and Adaptor- Screws and drill holes for installation- 12-Month International Manufacturer Warranty- 100% Shipping InsuranceSize converted in units:- 20in = 50cm | 24in = 60cm | 26in = 65cm- 30in = 75cm | 33in = 83cm | 36in = 90 cm- 40in = 100cm | 45in= 115cm- 47in = 120cm | 59in = 150cmSize chart:- 40cm: max 6 letters- 50cm: max 7 letters- 60cm: max 8 letters- 70cm: max 10 letters- 80cm: max 11 letters- 90cm: max 13 letters- 100cm: max 14 letters- 120cm: max 17 letters- 140cm, Max 26 Letters- 150cm, Max 29 Letters❤️ A space or a Heart is considered a character. Add your favorite  symbol after the Name or Text (optional). Personalized with your own symbol is also available.",
    "reviews": [
      "My new sign is amazing!! Thank you so much for such a high quality sign- it looks incredible on my shop wall 😊 \nReally easy to install too! I highly recommend.",
      "So beautiful!! Perfect addition to my backdrop!",
      "Highly recommend this shop and the neon sign. The seller sent me a preview of the sign a day after I placed the order. Then it was made, shipped and delivered 6 days later. It was so fast I couldn’t believe it. I love that it comes with a wall mounting kit and a ceiling hanging kit, a dimmer and power adapter. It looks so great on my wall!"
    ]
  },
  {
    "productId": "LiuOiQcWpm",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=879d8848a910d5ce8c086f1d1b1e2846e68196a3%3A1115114382&click_sum=3af4b11f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-3&pro=1&frs=1&etp=1&sts=1&search_preloaded_img=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!",
      "They are going to love them"
    ]
  },
  {
    "productId": "mGlxFmIjAZ",
    "url": "https://www.etsy.com/listing/1587034342/birth-month-flower-ring-dish-with-name?click_key=1fab290c2c95afa8ba11e38ea1c2b86edad1fc1b%3A1587034342&click_sum=beddabfc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-4&etp=1&sts=1",
    "title": "Birth Month Flower Ring Dish With Name • Perfect Bridesmaid, Mom or Best Friend Gift • Custom Name Gift for Her Birthday",
    "description": "Personalized birth flower ring dishes are the perfect bridesmaid , Mom or best friend gift. Our handmade jewelry dishes are super high quality and will become an instant heirloom. Personalize your dish with name and text color. Each dish is kiln fired in our Pennsylvania studio.F E A T U R E S• Material: High Quality Kiln Fired Ceramic• Dimension: 4in. diameter• Text Color: Terracotta ∙ Indigo - Sage or Black• All our jewelry dishes are custom made by hand in our studio ♡• WE DON'T USE: Paint pens, stamps, vinyl transfers, polymer clayO T H E R ∙ I N F O R M A T I O N• All items are nicely packaged ready to gift.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 3 - 6 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)M O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/littlewormstudioI N S I D E ∙ S C O O P• IG: @littlewormstudioThank you so much for visiting and hope you enjoy shopping with us ♡Kathleen ♡",
    "reviews": [
      "This was just what I was looking for. Thank you!",
      "My mother loved this very much",
      "My SIL loved it 💕",
      "Very nice little dish.  The only thing I was disappointed is I thought the dish would be a little higher with a higher edge.  It is basically a small plate, and Im not sure that rings will stay in it or slide right out."
    ]
  },
  {
    "productId": "QJNU6BRgTP",
    "url": "https://www.etsy.com/listing/1498317833/custom-engraved-marble-wood-coaster-set?click_key=7b81399409a611de7e4869ff945ef618a0ac1551%3A1498317833&click_sum=38e4fa9d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-5&pro=1&frs=1&etp=1",
    "title": "Custom Engraved Marble Wood Coaster Set, Personalized Gift for Housewarming, Wedding, Anniversary",
    "description": "★ EXPRESS ENGRAVING IN USA ★These personalized marble and wood coasters are made from natural marble and high quality acacia wood. This inviting combination creates a more welcoming, warm and unique atmosphere.Custom engraving adds a personal touch and makes a great personalized gift for any occasion.★ FEATURES ★• Materials: Natural White Marble & Premium Acacia Wood• Shapes: Round, Square and Hexagon• 3 Foam Feet on the Bottom for Protection and Anti-Slip• High Precision Laser Engraved into Wood• Size: L: 3.9 inch W: 3.9 inch H: 0.4 inch (Round and Square Coaster)L: 3.9 inch W: 3.3 inch H: 0.4 inch (Hexagon Coaster)★ WHY CHOOSE US ★***OUR MARBLE WOOD COASTERS***High Quality - Crafted from natural white marble and premium acacia wood. An excellent option for those who want a unique coaster design.Multipurpose - This coaster fits all cup sizes and is ideal for tea, coffee, beer, wine or other cocktails. Great for kitchen, living room, bar, restaurant or even home decor improvements.Bottom Design - Foam feet on the bottom to prevent scratching of surfaces and keep the coaster from slipping or sliding on the tabletop.Many Options - Available in three shapes: round, square and hexagon. Up to 12 engraving design options for customizing.Exclusive Life Style - Each piece is unique due to the natural material. We use the same type of wood and stone for every coaster but the colors may have slight variations from what you see pictured. That is the beauty of using natural products.Perfect Gift Idea - Custom engraving can transform even the most simple gift into an incredibly thoughtful one. Perfect for housewarming, wedding, engagement, anniversary, birthday, Christmas, Valentine’s Day, or any occasion.***OUR LASER ENGRAVING***• The natural grain of the wood is a handsome canvas for engraving.• The high precision laser engraving is available on the wood and is the expression of art.***PRODUCTION AND SHIPPING TIME***✓ Production time is 2 - 4 business days.✓ All products are custom, handmade, made to order.✓ Free Domestic Shipping.✓ Shipping takes 3 - 6 business days for U.S. all other countries 5-10 business days for delivery.★ PERSONALIZATION INSTRUCTIONS ★Please specify personalization options1. Design Option2. Enter Text (Name, Initials, Date, etc.)Example:1. Design 22. The Smiths, BRUCE & SOPHIA, 2022 Sep 22★ DISCLAIMER ★Please note, Due to the natural variances in the acacia wood and genuine marble the set may vary from what is pictured. We use the same type of wood and marble for every coaster but the colors may have slight variations. Each set will be unique in itself and these natural characteristics should be embraced. Please look through my pictures to see how much each coaster may vary. This is the beauty of using natural products.★ RETURNS & EXCHANGES ★Customized products are your unique creative expressions. Returns on customized item for reasons other than our error will not be accepted. Please kindly contact us with the reason of returns within 30 days of receiving your ring. Returns without prior communication with us will not be accepted.",
    "reviews": [
      "This was beautifully crafted, great gift.",
      "Love these they are great for gifts",
      "Love these they are great!",
      "I am so happy with the coasters I received! I was a little nervous since I didn’t get a proof to approve before the item was shipped, but they are perfect! I’m excited to give these as a wedding gift!"
    ]
  },
  {
    "productId": "DIWMkQqXOt",
    "url": "https://www.etsy.com/listing/974257639/birth-flower-necklace-customizable-with?click_key=357bcb1cbbeb235e40cbec51b2f5991d23a2ef65%3A974257639&click_sum=dd0c1883&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-6&etp=1&sts=1",
    "title": "Birth flower necklace customizable with birthstone, necklace made of stainless steel in silver or 18K gold plated, Christmas gift",
    "description": "Personalize your necklace with a birth flower and the names of your loved ones, your children, grandchildren, siblings or a special date and the matching birthstone.Give the best gift with this necklace.As a symbol of an important date (a birth, a baptism, an encounter, an unforgettable moment...)D E T A I L S• Material: Stainless Steel/Stainless Steel• Colors: Silver, 18K gold plated, 18K rose gold plated• Pendant dimensions: 15 mm• Birthstone dimensions: 6 mm• Necklace dimensions: 45 cm plus 5 cm extension• Our jewelry is made of high-quality stainless steel.Our long-lasting gold plating over stainless steel is very colorfast and robust.Stainless steel is also very easy to care for and very skin-friendly.• All pieces of jewelry are lovingly packaged by us and shipped to you.Thanks to this gift packaging, designed with great attention to detail, our jewelry is also ideal for giving as a gift.B E S T E L L PROCEDURE• STEP 1:In the first drop-down menu you will find the Number of Pendants & Birthstones option.There you can select the desired number of pendants and birthstones for your piece of jewelry.• STEP 2:In the second drop-down menu you will find the Color option.Here you can select your desired color (silver, gold or rose gold).• STEP 3:Leave us a note in the personalization box with...The name, letter or dateThe month for the birth flower and the one birthstoneThe font. You can find our font selection in the photos above.For example:Name: CharlotteBirth flower/birthstone: SeptemberFont: 8H E R S T E L L U N G• Our jewelry with its high-quality, detailed engraving is perfect for everyday wear.We only use high-quality materials and work with attention to detail and great care.A special piece of jewelry that you will treasure.MORE ∙ FROM ∙ U N S• And now have fun discovering even more unique personalized jewelry in our shop:https://www.etsy.com/de/shop/EveundLynWe look forward to seeing you! ♡Evelyn and your team at EveundLyn ♡",
    "reviews": [
      "Very quick shipping! Got it super fast!",
      "Great packaging, great product. My best friend loved it",
      "Very nice chain! Shipping faster!",
      "Wow, that was a nice gift! I'm really looking forward to giving it as a gift!"
    ]
  },
  {
    "productId": "MjKIKLRSMS",
    "url": "https://www.etsy.com/listing/1280642733/custom-engraved-watch-box-gift-for-dad?click_key=3e9e4419ee5320c3b3f451a31e3642a2efe8b8ff%3A1280642733&click_sum=81581448&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Engraved Watch Box | Gift for Dad | Birthday Gift for Men | Personalized Watch Storage Case| Valentines Gift | Anniversary Gift",
    "description": "Our personalized engraved watch storage case gives a luxurious look that will make him feel like royalty and will keep all his watches safe and easy to findwhen needed. This exquisite keepsake features suede pillows that hold up watches, beautiful craftsmanship and a genuine beautifully engraved glass top.  Crafted by artisans who take pride in their workmanship, these boxes are elegant enough for display even when empty. With the laser engraving feature, one can easily personalize the watch box with initials or short words so it feels truly special!Product features:- Our personalized watch case is a top-quality product with beautiful craftsmanship and genuine glass.- Available in 5 slots and 10 slots with suede pillows inside.- Our watch box allows a personalized engraving of names or initials of importance to every individual's favorite timepiece by adding personalized engravings during checkout.- Perfect Gifts for occasions and days like father’s day, anniversary gifts, engagement gift ideas, and groomsmen gift ideas.Product size:5 Slots box: 11.8\"(Length) x 4.7\" (Width) x 3.3\" (Height)10 Slots box: 11.8\" (Length) x 8.6\" (Width) x 3.3\" (Height)Each slot: 3.8\" (Length) x 2\" (Width) x 2.1\" (Height)Pillow: 3.1\" (Length) x 2.6\" (Width) x 1.7\" (Height) Approx.About shippingDOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.Note for international shipping-Please leave full name and contact number.-The customer is responsible for all duties and taxes.Customs policies vary widely in countries, and some countries don't charge Import Fees for shipments that fall below a minimum value. You may contact the customs office of the destination country for more information.For product value over this limit, there will be import taxes, fees, and customs duties (hereafter, \"Import Fees\"), levied by the customs office of your shipping destination, it could be around 10-25% in total, depending on regulations of local authority.As all of our products are personalized, we will not issue a refund to return-to-sender goods due to unpaid custom duty fee.--------------------------------------------------------------------watch case, wood watch box, birthday gift, groom gift, watch box for men, wedding gift, groomsmen proposal, personalized gift, anniversary gift, custom gift, groomsmen gifts, fathers day gift, boyfriend gift, watch storage, watch organizer, gift for him, gift for husband",
    "reviews": [
      "Love it ! Such amazing quality",
      "Bought it as a VDay gift for my Husband and he absolutely loved! Worth the wait! It’s so gorgeous, thank you so much!",
      "Beautiful just like the picture! Shipping was very quick",
      "My husband loves it so much!"
    ]
  },
  {
    "productId": "pjWQIfeqIP",
    "url": "https://www.etsy.com/listing/779017527/custom-birthstone-bracelet-initial?click_key=136aff3e4930254e61f07da69624d1a0a3f175ac%3A779017527&click_sum=c9dd8084&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-5&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Birthstone Bracelet, Initial Bracelet, Unbiological Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet for Women",
    "description": "Custom Birthstone Bracelet, Initial Bracelet, Unbiological Sister Bracelets Birthstone Jewelry Birthday Gift Friendship Bracelet for WomenKeep your special dates in a unique, elegant and minimalist disc bracelet, embrace your siblings love with this perfect gift. It comes with a high quality plated diamond cut chain, which will shine from all angels.H O W . T O . O R D E R• Please look at the images above in the listing. We've have showed where to choose your desired initial for your necklace.• If you do not see the information you're looking for, or have any questions. Feel free to message us, we are lightning fast with our responses :)C H A R A C T E R ∙ S P E C I F I C A T I O N S★ Please leave us your desired initial and the number of birthstone at the checkout note.I T E M ∙ S P E C I F I C A T I O N SDisc: approx. 0.47\"(12mm)Birthstone: 0.88\" x 0.21\"(22.5mm X 5.5 mm)Chain: adjustable up to 7.5\"(19.5cm). Please let us know if you need shorter or longer chain at checkoutP R O D U C T ∙ M A T E R I A L- Charm Finish: Gold Plated / Silver Plated / Rose Gold Plated- Chain Finish: Gold Plated / Silver Plated / Rose Gold PlatedC A R E ∙ I S T R U C T I O N SAlthough our jewelry are high quality with extra layers of coat for long lasting, yet plated jewelry should be cleaned periodically. To extend the life of your jewelry, it’s very important that you keep it dry (never bathe or spray perfume on your jewelry, chemical reactions with chlorine and other elements such as perspiration can lead to tarnishing). Remove jewelry when sleeping, exercising, or doing physical activities, as prolonged contact with sweat will cause the plating to wear away faster. Never use abrasives chemicals or products to clean your jewelry. After each wear, gently wipe each piece of jewelry clean of make up and skin oils with a soft, lint-free cloth in order to avoid scratching. Since rose gold pieces are more sensitive because of copper usage (in order to turn the color from gold to rose gold), please care as instructed above.T U R N ∙ A R O U N D ∙ T I M E- All items are custom made to order. Our turn around time is 1 business day.S H I P P I N G- Domestic: 3 - 5 business days- International: 7 - 14 business daysPlease note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.",
    "reviews": [
      "Received the order quickly like in a week. Have ordered from this seller before was very pleased. Would definitely order again.",
      "My sister loved this gift! Thank you.",
      "Gift was a success! Highly recommended.",
      "Person who received gift loved it"
    ]
  },
  {
    "productId": "EFElVybpqq",
    "url": "https://www.etsy.com/listing/1348609274/charcuterie-board-personalized-serving?click_key=7591fd45123522d5b6354a044045ec1537e751bf%3A1348609274&click_sum=ef729668&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-6&pro=1&frs=1&etp=1&sts=1",
    "title": "Charcuterie Board Personalized Serving Board with Handle Monogrammed Personalized Cheese Board Engagement Gift Bridal Shower Gift Newlywed",
    "description": "Beautiful Personalized Laser Engraved Walnut or Red Oak Cutting Boards!These make the perfect personalized gifts for your loved ones!Details:Multiple Size Options!Wood Options:WalnutRed OakMaple",
    "reviews": [
      "Great gift, perfectly customized, good quality",
      "Super thick and sturdy! Lot better quality than I expected. So affordable",
      "It was a gift and it was perfect"
    ]
  },
  {
    "productId": "nGUdsREIXd",
    "url": "https://www.etsy.com/listing/870847843/letter-necklace-by-caitlyn-minimalist?click_key=6d2ae95f7c5b0a61e8b284d573807efd258cc020%3A870847843&click_sum=82afce71&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-7&pro=1&frs=1&pop=1&sts=1",
    "title": "Letter Necklace by Caitlyn Minimalist • Name Necklace • Perfect for Your Minimalist Look • Gifts for Mom • NM54F77",
    "description": "L E T T E R ∙ N A M E ∙ N E C K L A C E• Material: High Quality Solid 925 Sterling Silver• Dimension: 7mm letter height• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• All our jewelry is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Simply use the 'PERSONALIZATION BOX' to let us know the NAME / LETTERS / SYMBOLS that you would like (Up to 10 Characters).♡ YOUR PERSONALIZATION ♡• Design will come in all capital letters unless specified otherwise.O T H E R ∙ I N F O R M A T I O N• The length option is the TOTAL chain length (including the charm). If you order an 18\" chain, the piece will come as CHAIN + CHARM = 18\". All pieces will come with a 1\" extension chain so you can FINE TUNE the fit.• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 6 - 10 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)O U R ∙ P O L I C I E Shttp://etsy.me/2cuqINvA B O U T ∙ C A I T L Y N M I N I M A L I S Thttp://etsy.me/2cYBUSpM O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/CaitlynMinimalistI N S I D E ∙ S C O O P• IG: @CaitlynMinimalist• FB: https://www.facebook.com/CaitlynMinimalistThank you so much for visiting and hope you enjoy shopping with us ♡Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "A pretty dainty piece with thoughtful packaging details!",
      "The necklace was exactly what was pictured and it turned out great! This would be a great wedding/bridal gift as well!",
      "This was very nice. My daughter loves it",
      "Such a sweet personalized gift!"
    ]
  },
  {
    "productId": "ffVurMUlUd",
    "url": "https://www.etsy.com/listing/1428259685/14k-rose-gold-ear-jacket-rhombus?click_key=8e070b846826449017edabc0267b8b63ebe9b4c8%3A1428259685&click_sum=3d7a7684&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-8&pro=1&frs=1&etp=1&sts=1",
    "title": "14K Rose Gold Ear Jacket Rhombus Earrings, Geometric Earring, Dainty Pair Earrings, Special Design Earrings by NeckaceDreamWorld",
    "description": "Handmade 14K Rose Gold Filled Ear Jacket Rhombus Earrings, Geometric Earring, Dainty Pair Earrings, Special Design Earrings by NeckaceDreamWorld in Silver, Gold and Rose Gold - Perfect gifts for Bridesmaids and Mothers, Birthday gifts ∙ Exclusive jewelry for you and your loved one ♥******* QUICK ∙ NOTE *******• Materials: High Quality Solid 925 Sterling Silver• FINISH: Silver - Gold - Rose• %100 Lead & Nickel FREE, ANTITARNISH, WATERPROOF, HYPOALLERGENIC• It's dainty and it can be worn daily.• It does not harm your skin.• It comes with sterling silver push backings.• All earrings are custom made by hand.• It is ready to ship in next business day after the order date and It comes as pair with small gift box in gift wrapped.H O W ∙ T O ∙ O R D E R• Please choose the colors in FINISH drop-down list.T U R N ∙ A R O U N D ∙ T I M E• This design is ready for shipment in 1 business day. If you have a custom made pieces in your cart, your order will be shipped separately. The delivery after order date for custom orders is taking about 5-7 business days. Please check the home page of my store for the most current times.►►►► Please do not hesitate to contact me if you have any questions or concerns. I reply your messages quickly.",
    "reviews": [
      "Very cute and dainty earrings!",
      "Thank you for your review. All of our items are %100 Lead and Nickel FREE, ANTI TARNISH, WATERPROOF, HYPOALLERGENIC and appropriate for daily wear :) Hope to serve you again. All the best",
      "Very nice! Thank you !",
      "Thank you for your review. All of our items are %100 Lead and Nickel FREE, ANTI TARNISH, WATERPROOF, HYPOALLERGENIC and appropriate for daily wear :) Hope to serve you again. All the best",
      "Gave them to my grandsons girlfriend who loved them.",
      "Thank you for your review. All of our items are %100 Lead and Nickel FREE, ANTI TARNISH, WATERPROOF, HYPOALLERGENIC and appropriate for daily wear :) Hope to serve you again. All the best"
    ]
  },
  {
    "productId": "hjIjDfpWZR",
    "url": "https://www.etsy.com/listing/994101967/birth-flower-necklace-silver-birthstone?click_key=396db69e5bf014a8311a3e68845558e1be0f771d%3A994101967&click_sum=f61d3ae0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-11&pro=1&frs=1&etp=1",
    "title": "Birth Flower Necklace • Silver Birthstone Necklace •  Custom Necklace • Custom Flower Necklace • Personalized Flower Necklace • Dainty",
    "description": "Birth Flower Necklace • Silver Birthstone Necklace •  Custom Necklace • Custom Flower Necklace • Personalized Flower Necklace • Dainty❝ Best unique gift alternative, Birth Flower Necklace  ♡The easiest way to show your ‘LOVE’ to yourself and your loved ones ❞⋆ Do you like this item?You can get more information about it below but if you have any questions, just click the \"Message Dilara\" button and I will be very happy to hear from you ☺♡ DETAILS ♡• All our jewelry are hand made with Love ♡• Material: 925 Sterling Silver• Color alternatives: Gold, Rose Gold, Silver• Length: Optional (37cm to 77cm )• Height : 2 cm• Width : 1 cm• Sizing can varies flower to flower✩ Just for YOU!If you have any advices or changes on your order just let us know, we are happy to hear from you.✩ All our jewleries can be worn every day, just be careful to follow our care insturctions.♡ EASY TO ORDER ♡• Choose the necklace legth• Choose the primary color• Don’t forget to add your ‘Personalization’ (birth flower and birthstone)✩ To make your order more personalized with a charm (a birthstone or a symbol) just purchase it additionaly from the link below:https://www.etsy.com/listing/881870338♡ PACKAGING, SHIPPING AND MORE ♡• All items are packageing ready to gift, in special GlorriaSense boxes.• Our turn around time is about 1 - 4 business days and shipping time is varies country to country.• Free Expedite shipping to Europe, UK and Canada and free Standard shipping to US, from our atelier in Istanbul.✩ For more information about the shipping please check out our shop or just ask to us, we are happy to hear from you.✩ For more jewels from us, check out our shophttps://www.etsy.com/shop/GlorriaSense✩ For more Sterling Silver Necklaces from us, check out the link belowhttps://www.etsy.com/shop/GlorriaSense?section_id=25078918✩ For more about us and our polices:https://www.etsy.com/shop/GlorriaSense♡ THANK YOU ♡📸 Don’t forget to share a photo with your Jewelry on your Social Media accounts. We are loving to be a part of your happiness ☺✩Find us on Social Mediahttp://www.pinterest.com/glorria_sehttp://www.instagram.com/glorria_se✩ Thank you so much for visiting and choosing us, hope that you enjoy shopping with us.✩ Last but not least, don’t forget to hit \"Favorite Shop\" to get updates from us on Etsy.Best,Dilara ♡✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩✩All images are copyrighted by GlorriaSense and all rights reserved.OBS!Buyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs. For more information check out our shop Policies.",
    "reviews": [
      "Bought this as a gift. She loved it.",
      "I absolutely loved the design and the quality of the work. It’s so beautiful. It’s exactly what I wanted.",
      "Beautiful necklace! My mom wears it everyday ♡",
      "My daughter loved it and it met my expectations"
    ]
  },
  {
    "productId": "qKzVReWPLR",
    "url": "https://www.etsy.com/listing/881195976/happy-birthday-gift-box-for-her?click_key=f5868f654c34c67deb6138fe108404c438c44385%3A881195976&click_sum=03d26278&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-12&pro=1&etp=1&sts=1",
    "title": "Happy Birthday Gift Box For Her, Personalized Birthday Box With Spa Gift Set For Women, Custom Birthday Gifts For Mom, BFF Best Friend (HB1)",
    "description": "BE UNIQUE: Skip the generic boxes and say 'Happy Birthday’ with a personalized birthday gift made just for her. Each gift set is uniquely customized with a monogrammed compact, and her name on the box and tumbler. The perfect custom gift for mom, a friend, or that special someone in your life. There's a theme for every style and personality.BE PRACTICAL: Hefty and high quality compact with polyurethane dome to protect the monogram from wear. Double-walled stainless steel tumbler with lid. Glazed, single-fired ceramic ring dish with foil accents. These keepsakes will last.BE AMAZING: Upgrade her to some much-needed self-care by adding the citrus glitter bath bomb and small-batch artisan soy wax candle. Perfect for a relaxing night in.BE YOU: Leave your personal gift message at checkout and we'll put it on a matching themed-card inside the box. Send it directly to her by using her address at checkout.Please reach out to me with any questions or help with your order.---------------ORDERING INSTRUCTIONS---------------WHEN SHIPPING TO YOURSELF...1. Select box theme and message choice2. Select spa item choices (if desired)3. Write recipient first name in personalization box4. Add to cart5. CheckoutWHEN SHIPPING directly to recipient...1. Select box theme and message choice2. Select spa item choices (if desired)3. Write recipient first name in personalization box4. Add to cart5. Add to cart and mark as ‘gift’ to leave a message to her.Be sure to include your name so she knows who it’s from!6. Checkout---------------POSTCARD MESSAGE CHOICES:---------------(Please indicate interior postcard message of your choice in the personalization section of your order. Other card choices available in our other listings. )1. Happy Birthday!2. Make a Wish3. Cheers to You on Your Birthday4. Happy Birthday to You5. Age is Just a Number. Though in Your Case, it's a Big One.6. Wait, You're How Old?7. HBD, I was Going to Drink Anyways8. Forever Young, HBDGIFT SET DETAILS BY THEME:---------------🌸BLUSH BOX ITEMS🌸---------------1. Personalized Gift Box: Blush Print, 9 x 6 x 3\"2. Compact Mirror: Rose Gold Monogram Compact with First initial (2.75” round)3. Lip Balm: \"You're the Balm\" Vanilla Lip Balm4. Floral Item: Small Blush Foam Rose5. Metallic Heart Ring Dish: Rose Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7.  Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz Blackberry Sage Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle+++ Luxe Includes 3 MORE Additional Upgrades of Candle, Bath Bomb,\"No Bad Hair Days\" Scrunchie Set, and House Made Bath Salt----------- Luxe upgrades box size to 10 x 10 x 3 and tumbler to 15 oz--------------🌹DARK ROSE BOX ITEMS🌹--------------1. Personalized Gift Box: Black Orchid Print, 9 x 6 x 3\"2. Compact Mirror: Rose Gold Monogram Compact with First initial (2.75” round)3. Lip Balm: \"You're the Balm\" Vanilla Lip Balm4. Floral Item: Small Blush Foam Rose5. Metallic Heart Ring Dish: Rose Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7. Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz Blackberry Sage Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle+++ Luxe Includes 3 MORE Additional Upgrades of Candle, Bath Bomb,\"No Bad Hair Days\" Scrunchie Set, and House Made Bath Salt----------- Luxe upgrades box size to 10 x 10 x 3 and tumbler to 15 oz---------------💐 FLORAL BOX ITEMS💐---------------1. Personalized Gift Box: Navy Floral Print, 9 x 6 x 3\"2. Compact Mirror: Antique Gold Monogram Compact with First initial (2.75” round)3. Lip Balm: \"You're the Balm\" Vanilla Lip Balm4. Floral Item: Small Ivory Foam Rose5. Metallic Heart Ring Dish: Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7.  Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz White Tea Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle+++ Luxe Includes 3 MORE Additional Upgrades of Candle, Bath Bomb,\"No Bad Hair Days\" Scrunchie Set, and House Made Bath Salt----------- Luxe upgrades box size to 10 x 10 x 3 and tumbler to 15 oz---------------🌴TROPICAL BOX ITEMS🌴---------------1. Personalized Gift Box: Pineapple Print, 9 x 6 x 3\"2. Compact Mirror: Gold Palm Leaf Monogram Compact (2.75” round)3. Lip Balm: \"Piñas for my Niñas\" Pineapple Lip Balm4. Floral Item: Small Ivory Foam Hibiscus5. Metallic Heart Ring Dish: Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7.  Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz White Tea Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle+++ Luxe Includes 3 MORE Additional Upgrades of Candle, Bath Bomb,\"No Bad Hair Days\" Scrunchie Set, and House Made Bath Salt----------- Luxe upgrades box size to 10 x 10 x 3 and tumbler to 15 oz---------------⛰ RUSTIC BOX ITEMS⛰---------------1. Personalized Gift Box: Mountains/Outdoor Print, 9 x 6 x 3\"2. Compact Mirror: Antique Gold Monogram Compact (2.75” round)3. Lip Balm: \"You're the Balm\" Vanilla Lip Balm4. Floral Item: Small Ivory Foam Rose5. Metallic Heart Ring Dish: Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7.  Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz White Tea Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle+++ Luxe Includes 3 MORE Additional Upgrades of Candle, Bath Bomb,\"No Bad Hair Days\" Scrunchie Set, and House Made Bath Salt----------- Luxe upgrades box size to 10 x 10 x 3 and tumbler to 15 oz---------------🌵CACTUS BOX ITEMS🌵---------------1. Personalized Gift Box: Cactus / Succulent Print, 9 x 6 x 3\"2. Compact Mirror: Antique Gold Monogram Compact (2.75” round)3. Lip Balm: \"Totally on Point\" Cherry Lip Balm4. Floral Item: Small Faux Succulent5. Metallic Heart Ring Dish: Gold Trim Ring Dish with Metallic Heart (3”wide x 2.75” long)6. Personalized Stainless Steel 6 oz Champagne Flute Tumbler (hand wash only — personalized with professional grade vinyl with 6 year durability rating -- not dishwasher safe!)7.  Your Choice to Add any of the following Spa Items+ 4.5 Oz Glitter Citrus Bath Bomb+ 4 Oz White Tea Artisan Soy Candle hand poured by Curtis and Rose Wax Co+ Both Bath Bomb and Candle",
    "reviews": [
      "Very nice and good size",
      "Gift was perfect!!! Excellent quality and beautifully wrapped!! Would definitely purchase again!!! Excellent customer service.  I asked for the delivery date to be later and this was done without any problems!!!",
      "My sister loved her gift! Everything was beautiful and she really enjoyed it! She was really surprised. Super high quality."
    ]
  },
  {
    "productId": "xrClivdGTv",
    "url": "https://www.etsy.com/listing/1615328995/sunflower-necklace-for-women-box-chain?click_key=4e943c4380fd82b9c045cee06f37e8cbb0b51e60%3A1615328995&click_sum=5d001159&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Sunflower Necklace for Women, Box Chain Name Necklace, Anniversary Gift, Dainty Necklace, Gifts For Her, Gifts For Her, Christmas Gift",
    "description": "❤️ Sunflower Name Necklace, a delicate and charming piece that effortlessly captures the beauty of nature and personalization. This stunning necklace features a dainty sunflower pendant at the top, symbolizing warmth, positivity, and joy.❤️ Customization takes center stage with this unique design as your chosen name elegantly graces the pendant in a vertical arrangement beneath the sunflower. The result is a timeless and personal accessory that reflects your individual style and sentiment.❤️ Crafted with precision and attention to detail, our Sunflower Name Necklace is the perfect blend of simplicity and sophistication. The fine craftsmanship ensures a piece that is not only visually appealing but also durable, allowing you to wear it with pride for years to come.❤️ This necklace is more than just a piece of jewelry; it's a heartfelt gesture that makes for an ideal Christmas gift. Whether you're shopping for a special someone, a child, a beloved mom, or a cherished wife, this necklace is a symbol of love and thoughtfulness. Its delicate design makes it suitable for any age, and the personal touch of a name adds a uniquely sentimental touch.❤️ Embrace the spirit of the season and make this Christmas or birthday truly special with a gift that radiates warmth and personal connection. Our Sunflower Name Necklace is not just an accessory; it's a beautiful expression of love and individuality. Order yours today and let the sunflower bloom in the hearts of your loved ones.Chain Types:Cable ChainBox ChainCurb Chain (Thin)Please check the photos for chain types before your purchase📦 Your purchase will arrive in a lovely gift box👉🏻Product details are as follow;Material: High-Quality Solid 925 Sterling Silver & 14K Solid GoldFinish: Sterling Silver ∙ Rose Gold - Yellow Gold⭐ Drawed and made in our workshops⭐ All our necklaces come with 2'' extender👉🏻PROCESSING & SHIPPINGAll items purchased will be shipped within 2-5 business days.You can upgrade your shipping to Express during check out if you want it faster👉🏻ASSURANCE⭐Nickel Free⭐Tarnish Resistant⭐High-Quality MaterialsIf you have any question feel free to write",
    "reviews": [
      "The product looks just like the pictures, I’m excited to give this as a gift! It even came in a cute box",
      "Beautiful necklace! I will be ordering more for family members. Thank you so much!",
      "She loved it so much"
    ]
  },
  {
    "productId": "hvYBGGqXvh",
    "url": "https://www.etsy.com/listing/1570730748/custom-mens-toiletry-bagpersonalized?click_key=a665212b9351f4d0b9db1e355d8f9e3d6d765939%3A1570730748&click_sum=d7eee9a1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-14&pro=1&etp=1",
    "title": "Custom Mens Toiletry Bag,Personalized Canvas Travel Bag,Travel Toiletry Bag,Men's Dopp Kit,Engraved Dopp Bag,Christmas Gifts for him",
    "description": "This is a vintage styled canvas toiletry bag with a personalized leather piece design! This vintage style toiletry bag combines the charm of yesteryear with modern functionality. This bag is made from a durable canvas material to ensure its durability and reliable performance.Size: 9.5in long, 3.5in wide, 5.3in highThe most striking feature is the compact leather piece design on the front, which can be customized for different gift-giving and usage occasions. Whether it's a birthday, anniversary or any special event such as Christmas, you can add a unique flavor to the gift by imprinting your initials, name or meaningful message on the leather flap.In the spacious main compartment, you'll find plenty of room to organize your toiletries and keep them neat and organized whether you're traveling or for everyday use. A sturdy zipper closure ensures secure storage and prevents accidental spills or leaks. In addition, the leather top carry handle makes it easy to carry and transport.With its vintage styling and durable canvas construction that can be personalized, this toiletry bag strikes the perfect balance between style and functionality, making it a great gift for any occasion.",
    "reviews": [
      "Thank you very much for this",
      "It took a long time to get here which is weird because it came from New Jersey which is were I live. My husband liked it.",
      "Great gifts for the entire family",
      "My husband enjoyed this gift for Christmas."
    ]
  },
  {
    "productId": "zLxufeLKuA",
    "url": "https://www.etsy.com/listing/1097017861/personalized-name-necklace-gift-for-her?click_key=54e46fe3bfa563e9f7b692ac4b7fb3ea49811abd%3A1097017861&click_sum=94a3a2c6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-7&pro=1&frs=1&pop=1&sts=1",
    "title": "Personalized Name Necklace,  Gift for Her,  Personalized Gift, One of a kind Jewelry, Gold Name Necklace, handmade gift, Gifts for mom",
    "description": "Mothers Day gift NecklaceThis necklace brings you a chance to carry your name in style.We will design your name in a stylish unique logo.It is a passion for immaculate design and an innate understanding of the woman and her journey that drives Roberto Gold.Roberto Gold has always challenged traditional notions that endorse the view that jewelry was meant to display one's status and be worn sparingly.This Name Logo necklace is designed to make your daily wear meaningful, with artistic pieces that reflect your individuality, resonate with personal meaning, are crafted to be wearable, and celebrate your every day.Roberto Gold launched three years ago and what an amazing journey it has been. The pinch-me highlight would be coming to understand the magnitude of the community of wonderful clients around the world we created and who are the real heart of the brand.This piece of jewelry is designed especially for our 3rd anniversary.Features:⏺ MATERIAL: 925K Sterling Silver⏺ COLOR: Silver, 14k Gold, 14kRose GoldChain Lengths- 14 inches- 16 inches- 18 inches- 20 inchesPlease visit our name bracelet and earring listinghttps://www.etsy.com/listing/1576367253Letter Necklace, Initial necklace, name necklace, gifts for her, gold necklace, gift necklace, initial jewelry",
    "reviews": [
      "Beautifully made. I enjoy wearing it.",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️"
    ]
  },
  {
    "productId": "BNTyrjeMr0",
    "url": "https://www.etsy.com/listing/1497161511/garden-and-floral-led-photo-frame-lamp?click_key=22c2f8cadfbdf22bcb130201450f464f946f3128%3A1497161511&click_sum=e6611068&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-8&pro=1&bes=1&sts=1",
    "title": "Garden and floral LED Photo Frame Lamp | Personalized Light-Up Name Sign | Perfect for Daughter,Girl's Room | Unique Baby Shower Gift",
    "description": "They are two types of gifts, the ones you ask, \"who gives me this?\" and the ones that make you remember that special person.It's time to add a special touch to your room, with these beautiful wooden custom night lights.Our lamps are engraved in the USA and will be a perfect gift for any event.❤ Nursery rooms.❤ Office.❤ Graduation.❤Weddings.❤ Birthdays.❤ Christmas❤ Baby shower❤ Home warming party.❤ Baptism.❤ or any other occasion❤ Lamp details6.70\" wide by 9\" tall.Cast 3mm acrylic for better results.Laser engraved in our studio in Florida.Super-Fast ShippingOn/off switch.Warm Light❤Other details.The buyer is responsible for any customs fees (Which don't apply to the USA)We don't take returns, but if we make a mistake, we will send a new lamp the next day.Acrylic slides into the frame to add a lovely touch to any room.We also love to do custom work.We can also add a gift note in the box without extra charge.Our custom-led light sign is perfect for any space (bar, desk, garage, nursery, Mancave, shop, coffee area) and on all occasions (Christmas, Baby shower, gender reveal, birthday, graduation, mother day, father day)",
    "reviews": [
      "Absolutely beautiful couldn’t be happier",
      "A gift for a friends baby girl. It came out beautiful and I am sure she is going to love it!",
      "The item met my expectations! I was very pleased with the quality and matched the description exactly",
      "My daughter and her friend loved it!"
    ]
  },
  {
    "productId": "PhkVorBKOe",
    "url": "https://www.etsy.com/listing/1216801051/personalized-wind-chimes-gift-mimi-gift?click_key=3230f2fa7b819a0b0046663a5405e8ea70d3f9f1%3A1216801051&click_sum=6dba91ce&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-9&pro=1&sts=1",
    "title": "Personalized Wind Chimes Gift | Mimi Gift Chime | Mother's Day Gift | Personalized Gift | Grandparent's Day Gift | Gift for Mimi",
    "description": "A personalized Wind Chime for Gigi -- the name is customizable and we can print up to 3 names on both sides. (Up to 6 total)We print the personalized design with the grandkid's name on both side of the Wind Chimes.We can have the text make anything with similar amount of letters as the sample in the picture. By default we will just change the names on the design listed with the personalization provided in the personalization box.",
    "reviews": [
      "Super fast shipment! Item exactly as described. And Mimi loved her gift!",
      "This product came out great!",
      "This product came out great!",
      "Very cute and shipped fast!"
    ]
  },
  {
    "productId": "oPQ7TMUWuC",
    "url": "https://www.etsy.com/listing/1464493078/birth-month-flower-personalized-canvas?click_key=330bbd56fe3f7b64d64ffe8b818aea648e094fbc%3A1464493078&click_sum=6d4f4968&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-15&pro=1&etp=1&sts=1",
    "title": "Birth Month Flower Personalized Canvas Tote Bag Mother gifts, Bachelorette Party, Bridesmaid gifts, Wedding gifts, Birthday Gift for her",
    "description": "Personalized tote bags are perfect for yourself, or as a gift! These are also the perfect bride's gift or proposal gift.♦ AT A GLANCEDimension: 14\"x16\"Made from Heavy duty cotton canvas fabricUV printing for the best color qualityThis item allows you to personalize the NAME printed on the pouch♦ ORDER INSTRUCTIONSCREATE PERSONALIZED INFORMATION:♦ ORDER INSTRUCTIONSCREATE PERSONALIZED INFORMATION:STEP 1:Please decide if you want to print on the item at \"Customization\" drop down menu.- No Printing: The item will come without any image/ name/ text ( a blank item)- 1 side printing: Item will come with image and/or name printing on 1 side as shown in our 1 listing image.- 2 side printing: Item will come with the same image and / or name printing on both sides as shown in our 1st listing imageSTEP 2Please tell us your personalize message at \"Personalization box\" before adding an item into cart or at \"Note from buyer to seller\" during checkout as follows:- Name♦ HOW TO CARESPOT CLEAN WITH WARM WATER AND MILD DETERGENT (DO NOT MACHINE WASH)Reusable and Eco-friendlyPLEASE NOTE :Colors may vary slightly from what is displayed on your monitor and displayed settings. Proofs and sample images are graphic representations, not actual photos of printed items.If you have any questions, don’t hesitate to contact us at customercare [!at] crafinity.org♦ Disclaimer: Any Copyrights or trademarks pertaining to the images/ characters/ quotes used are not being sold. The price we charge is for our crafting time, materials, design and personalization services. We do not claim ownership of any licensed characters/ images/ quotes nor are sponsored or endorsed in any way.",
    "reviews": [
      "Perfect gifts for my bridesmaids!",
      "Perfect gifts for my bridesmaids!",
      "Perfect gifts for my bridesmaids!",
      "Perfect gifts for my bridesmaids!"
    ]
  },
  {
    "productId": "4WLEvzuYVL",
    "url": "https://www.etsy.com/listing/1117454985/personalized-brass-compass-anniversary?click_key=348159769721186fc91112859ebceb7b27b91cdb%3A1117454985&click_sum=80318e1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-16&pro=1&etp=1",
    "title": "Personalized Brass Compass Anniversary Gifts For Men Brass Compass Birthday Gift For Dad Groomsmen Gift For Him Christmas Gifts For Him",
    "description": "Personalized Custom CompassPersonalized Compass for Christmas Gift, Baptism Gift, Groomsmens Gift, Gift for Him, Birthday Gift, Gift for Boyfriend,SIZE:2\" inches roundMATERIAL:BrassHOW TO ORDER:1- Select your Engraving place you want on Compass ( I can engrave front side, back side and inside of the lid of the compass)2- Select your case options ( We give the free leather case. If you want to add initials on this case select add initials on the case option part)3- Please write your personalization note with font style you want to the personalization boxPERSONALIZATION:My default font is Font1. If you would like to use another font style please write your font style here with your personalization note.We can engrave your handwriting. For this please write it down on a blank white paper with dark-colored pen.Take a good and quality picture of it and send us via Etsy message",
    "reviews": [
      "Extremely beautiful piece I purchased for a birthday gift and he loved it!",
      "I just  received the compass I ordered and I absolutely love it. \nIt was a gift for my husband, and he completely fell in love with it.\nIt is very well made and the design turned out perfect!\nThank yo so much \nI highly recommend this shop",
      "Beautiful craftsmanship - would recommend! Its a very unique and thoughtful gift and my fiancee loved it"
    ]
  },
  {
    "productId": "seTYomKZ9R",
    "url": "https://www.etsy.com/listing/1528394211/baby-blanket-gift-embroidered-name?click_key=2263ddf2e933068351706da790ac9256a82b91b1%3A1528394211&click_sum=ce1d669c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-17&pro=1&etp=1",
    "title": "Baby Blanket gift, Embroidered Name, Stroller Blanket, Newborn Baby Gift, Soft Breathable Cotton Knit, newborn gift, custom baby blanket.",
    "description": "Turnaround time is 10-12 Days\t100% Knit Cotton\t40x30 Inch(100*80cm)Name is embroidered on the bottom right of the blanket.Thread Colors may vary from pictures (lighting) and screens.Personalized blankets are made to order.On Personalization Box Please include:1.  Name(s) (1 name= Emily,2 names= Emily Rose)2. Font Number (check font chart)3. Thread Color (Check color chart)•\tIt is made for full coverage over your baby knitted baby blankets, you’re getting the safest, most natural super soft, breathable blanket for your little ones.•\tBaby cotton blankets multi-functions: stroller nursery sleeping cover, burp cloth, baby shower gift or a security blanket, car seat pad, toddler bed.CARE INSTRUCTION\tHand Wash or machine wash on the gentles cycle possible, preferably in cold or warm water and either air dry, or dry on low.\tDo NOT bleach.\tDo NOT Iron.\tDo NOT tumble dry.",
    "reviews": [
      "Thank you so much again",
      "Bought this as a gift.  So soft and cute",
      "Beautiful and very soft. My friend loved it"
    ]
  },
  {
    "productId": "ddyjPUZuXl",
    "url": "https://www.etsy.com/listing/644061158/personalized-dish-towel-family-name?click_key=202a7350584a1f03e556eadc3940341820385e34%3A644061158&click_sum=f7a2c905&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-18&pro=1&etp=1&sts=1",
    "title": "Personalized Dish Towel - Family Name Kitchen Towel - Established Year - Custom Tea Towel - Kitchen Decor - New Couple Gift - Wedding Gift",
    "description": "This design with the family name and established year is printed in the color of your choice on a soft, white waffle weave towel that measures 16\" x 24\". It's a favorite wedding gift, housewarming gift, hostess gift, and Christmas gift for new couples.We use high quality 380 GSM towels for printing, and the design is dye-printed into the material. This means that the design won't fade away or crack.**Please leave the name, initial, and year in the message box at checkout.We have many color options for the lettering. Scroll right for the color chart.Please see the Dish Towel section of our shop for a larger selection of designs. Still don't see exactly what you're looking for?We also do custom orders. Just ask!**Due to different computer settings, colors may vary slightly.",
    "reviews": [
      "It was a great housewarming gift",
      "Super soft and great quality!",
      "Super soft and great quality!",
      "My nephew and his wife loved them"
    ]
  },
  {
    "productId": "zmIY4J4CNB",
    "url": "https://www.etsy.com/listing/1230802130/personalized-wedding-gift-for-couple?click_key=204fc22cafff4302b02fa25ca57e9c554e241a60%3A1230802130&click_sum=dd8500dc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-19&etp=1&sts=1",
    "title": "Personalized Wedding Gift for Couple • Custom Engagement Gift for Bridal Shower • Gift for Bride • Personalized Ceramic Planter • New Home",
    "description": "These personalized planters make the perfect wedding gift, engagement gift, bridal shower gift, anniversary gift, and more. These are each made of ceramic and are high quality, durable planters - making the perfect gift/keepsake for many years to come!  These can be personalized with first name initials and wedding date, a quote/saying, a family last name, etc. A great Christmas gift for the couple or wife!Perfect for succulents, cacti, bonsai, flowers, herbs, and small woody stem plants. Your beautiful plant will totally vibe in its new home!❀ Plants not included and only shown as examples ❀» DETAILS• This item includes (1) personalized planter - personalization is professional grade permanent vinyl• Planter Measurements: 4.5\" // 6\" // 7\"• Drainage Hole: only in pots that include a saucer• Indoor/Outdoor Use• Ceramic• Plant is not includedIF YOU NEED YOUR ORDER RUSHEDPlease follow this link and add this to your cart when purchasing and your order will be bumped to the top of the line:https://www.etsy.com/FloralVibesLLC/listing/1289230757/rush-my-order?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1661979090365IF YOU WOULD LIKE A PROOF PHOTO OF YOUR CUSTOM POTPlease follow this link and add this to your cart when purchasing and we will provide a proof with up to 2 revisions if needed:https://www.etsy.com/FloralVibesLLC/listing/1292373239/proof-photo-2-revisions?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1661979137603Nothing will ever be sent to you that we would not want to receive ourselves. We want you to absolutely love your new planter, which is also why we package each order carefully to ensure you receive it in perfect condition.If you have any questions, start a conversation with us by finding the contact button on our shop page!For more items visitfloralvibesllc.etsy.comThanks for shopping with us! ☀",
    "reviews": [
      "Friendly and easy to work with",
      "Arrived well packaged. The design is beautiful.",
      "bought this as a wedding present and bride loved it, thank you so much!",
      "This was the perfect little wedding gift! It was shipped fast and great quality! Exactly like the photo"
    ]
  },
  {
    "productId": "UrrRBbFf7q",
    "url": "https://www.etsy.com/listing/971835897/marble-charcuterie-board-personalized?click_key=6eedccb4dadd3eb7a08e60b5e029fa623db661f0%3A971835897&click_sum=97c67935&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-20&frs=1&etp=1&sts=1",
    "title": "Marble Charcuterie Board Personalized Wedding Gift, Cheese Board, Custom Cutting Board, Housewarming Gift, Bridal Shower or Engagement Gift",
    "description": "Our Personalized Marble and Mango Wood Charcuterie Board and Spreader Set is an ideal housewarming gift or hostess gift that will leave a lasting impression! This isn't just any cutting board, cheese board or charcuterie board - it's crafted from exotic materials including authentic white marble and carefully-harvested mango wood that we laser engrave and customize to your specifications. Like all of our custom cutting boards our Marble and Mango wood personalized charcuterie board serving tray boasts a unique custom design as well as impressive durability. The custom shape and design as well as available font and layout options will be sure to impress whomever receives this tasteful, timeless, and long-lasting gift. If you're looking to surprise a couple with the perfect wedding gift, engagement gifts, bridal shower gift or seriously impress your partner on your anniversary then this is the Anniversary gift for you. Our custom charcuterie boards are also perfect for a housewarming gift or realtor closing gift, holiday and birthday gifts, family Christmas gift, corporate gifts and to simply surprise a deserving friend or couple. Our personalized charcuterie board, cheese board can also be used as a serving tray and makes a fantastic gift for friends or a great gift for yourself!SIZE:Approximately 17.5”L x 8”W x .5” ThickFEATURES:Custom shape made from premium Mango Wood & White MarbleIncludes Matching SpreaderLaser Engraved for a personalized touch8 Custom Fonts to choose from and the ability to add a Custom Design/ LogoRubber feet for slip resistantLeather strapWOOD CHARACTERISTICS:Wood grain color will vary, no two pieces will look the same. Mango wood varies in color and may have streaks of yellows, browns, pinks and or greys.CARE INSTRUCTIONS:Hand wash (both sides) immediately after use with mild dish soap; towel dry - never put in dishwasherTo remove stubborn stains, create a thick paste with baking soda and a small amount of water. Smooth over stains, cover with plastic wrap and let sit overnight. Remove plastic wrap and wipe with a damp cloth.For disinfecting, sprinkle with baking soda and clean with a lemon half (squeeze juice over baking soda and use lemon half as a sponge) rinse well, dry thoroughlyIn order to prolong the life of your board, apply cutting board oil after the first few uses and then as needed to prevent the wood from drying out; light sanding optionalDISCLAIMER:Please double check the spelling and date before ordering. We understand it is easy to make a mistake when ordering, and we want to make sure you get the board as intended. We will copy all information into our designs. We are not responsible for errors caused by misspellings or mistyped information in the personalization box. If you find there is an error after ordering, MESSAGE US IMMEDIATELY and we will work to resolve the issue before your board is made. Once the board is made, we cannot make any changes. When adding \"THE\" with the last name, just add an \"S\" after the last name (Do not add an apostrophe). When a last name ends in s, x, ch, sh, or z, you add an ESOPTIONS:4 Round Coasters4 Hexagon CoastersCharcuterie BoardCharcuterie Board with Round Marble and Mango Wood Coasters (4)Charcuterie Board with Hexagonal Marble and Mango Wood Coasters (4)Charcuterie Board with Coasters (4) and (2) Wine Glasses  (You can write in the personalization section if you'd like round or hexagon coasters)Charcuterie Board with (2) Wine GlassesCharcuterie Board with (4) Coasters and (4) Wine Glasses (You can write in the personalization section if you'd like round or hexagon coasters)Charcuterie Board with (3) Marble Bowls - Set of 3- 1 white, 1 black, 1 neutral colored stacking bowls with wood lid. Can be used as a salt cellar and/or appetizer/dip bowls to use with your charcuterie board.**Message for a custom design/order or for expedited shipping optionsif this needed for a wedding gift, bridal shower gift, or as anniversary gifts or engagement gifts please specify need by date.",
    "reviews": [
      "The board is beautiful and our parents loved it. The packaging alone is impressive, it arrived safely because of so much care taken. Definitely recommend!",
      "Very nice item that was ordered as a wedding gift for friends.",
      "Gorgeous. And super fast shipping!",
      "Beautiful! Arrived really fast and exactly as pictured"
    ]
  },
  {
    "productId": "ZJCSKorwBn",
    "url": "https://www.etsy.com/listing/865745504/personalized-family-name-metal-sign-last?click_key=1b41e7e5c67f4200c42f49037b794f5521a56396%3A865745504&click_sum=f49b1074&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-10&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, Anniversary",
    "description": "01.07.24 Update! Thanks to our amazing clients we had an increase for December of over 50% vs last year! It caused a few delays in shipping with us and UPS but as of 01.10.24 we'll be back to our 24hr shipping as usual!!Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, AnniversaryUSMC Veteran owned/ran shop, cutting and hand finishing steel made right here in the USA from a 200 year old family owned steel mill!Our full line of monograms:https://www.etsy.com/shop/Crosswoodworks?ref=seller-platform-mcnav§ion_id=26441026Monograms are NOT created the same, please, please look at the lines in the design for character, smooth flowing lines, depth of wider areas back to thinner areas. I customize EACH and every one, even tho they look like the others, they are not. When you look at the details, you will see the difference, even in the computer generated version which I'm using first to get these listed for my clients as fast as possible! Multiple fonts coming in block, script, serifs, modern. Hundreds of new designs over all in 2023 for monograms, address plaques, name plaques, ornaments, bottle openers, verses, phrases, all in multiple fonts for each phrase in multiple finishes, all cut and shipped via UPS (the most dependable, fastest, damage free carrier we have ever used) within 24 hours or the following business day when ordered by noon!!NO MORE WAITING FOR WEEKS!! CUTS AND SHIPS SAME OR NEXT DAY WHEN ORDERED BEFORE NOON!! WE ARE CHANGING 95% OF THE FOCUS OF PRODUCTION AT THE SHOP TO STRAIGHT FORWARD METAL PIECES WITH THREE MAJOR DETAILS:1. Extremely fast cut and ship that no one else offers2. 10\" - 96\" sizes that no one else offers3. Focus on excellent quality that our clients have come to expect in every hand finished piece that we touch. We do ourabsolute best to earn your respect, and your business.For Monograms, please ensure that you fill in all of the appropriate info for each style design.Finish note: All finishes except for Rust are sealed with a 20 year uv/weatherproof industrial powder coat for interior/exterior/seaside/desert/ use in any environment you can imagine. Rust is true rust, not sealed.Dark steel patina and rust vary in color on every piece.We cut EVERY single piece out of 14 gauge cold roll carbon steel, from family owned steel mills right here in the U.S.A",
    "reviews": [
      "Amazing product.  Heavy duty.",
      "It is really nice we like it Thank You.",
      "Beautiful love it very much",
      "Wonderful design and quality craftsmanship. I got it for my husband to celebrate our 8th anniversary and he thought it was so awesome and he truly loves it. He said he hasn't seen nothing like it."
    ]
  },
  {
    "productId": "tlNAsmlfvS",
    "url": "https://www.etsy.com/listing/1033825492/custom-photo-on-wood-engraved-photo-on?click_key=eef28d15c84bb31280cdc744512aeac25f863f33%3A1033825492&click_sum=9e3e93f4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-11&pro=1&frs=1&bes=1&sts=1",
    "title": "Custom Photo on Wood, Engraved Photo on Wood with Watercolor Style, Custom Wall Art, Personalized Portrait from Photo as Long Distance Gift.",
    "description": "🧡 HAPPY VALENTINES DAY 🧡🎉 SPECIAL CUSTOM GIFTS FOR YOUR LOVER 🎉Capture memories with a Custom Watercolor Wood photo, the perfect personalized gift for any occasion. Ideal for anniversaries, birthdays, and Valentine's Day.Before You Buy;Customizations are permanently burned on solid wood that has a thickness of 0.5''.t measures 8.50''x12''Has a wall hanger.It is sent with metal legs for tabletop display.The Custom Watercolor Woodfoto is a distinctive keepsake that beautifully blends the rustic charm of natural wood with the soft, artistic touch of a watercolor effect. This unique piece of art is not just a gift, but a timeless treasure that encapsulates precious moments in an elegant and personalized manner. Each Woodfoto is crafted with meticulous attention to detail, ensuring that your chosen photo is transformed into a stunning watercolor masterpiece printed directly onto a high-quality wooden canvas.Ideal for both men and women, this personalized picture gift is versatile enough to suit adults and teens alike, making it an excellent choice for a partner, friend, or family member. Whether it's to commemorate a 45th birthday, celebrate an anniversary, or as a heartfelt present for Valentine's Day or New Year's Eve, the Custom Watercolor Woodfoto stands out as a thoughtful and original gift.The process of personalization is simple yet profound. You select a cherished photo, and our skilled artisans will convert it into a watercolor-style image before printing it onto wood. The final product is not just a picture but a piece of art that tells a story and evokes emotion. The natural wood grain adds a unique texture to each piece, ensuring no two Woodfotos are exactly alike.The Custom Watercolor Woodfoto also serves as a versatile decor piece that can effortlessly adorn a mantle, bookshelf, or wall, adding warmth and personality to any space. It's an exceptional choice for those who value the combination of natural materials and personalized elements in their home decor.Given its personalized nature, this Woodfoto is a meaningful keepsake that can be cherished for years to come. It's an ideal gift for various occasions, such as birthdays, anniversaries, Valentine's Day, or even as a thoughtful gesture to show someone you care any day of the year.In summary, the Custom Watercolor Woodfoto is more than just a gift; it's a celebration of love, friendship, and the special moments that make life worth cherishing. It's a way to hold onto those fleeting memories and display them in a format that is as unique as the moments themselves. When you give a Custom Watercolor Woodfoto, you're not just giving a gift; you're giving a piece of your heart.",
    "reviews": [
      "Great product. Thank you very much.",
      "It’s an amazing quality and it’s absolutely beautiful",
      "It’s gift wrapped so I won’t actually see it until my partner opens it in a week. The seller was friendly and communicated well during the entire process. I trust this seller for good quality products."
    ]
  },
  {
    "productId": "PWCWKayacz",
    "url": "https://www.etsy.com/listing/1589315828/personalized-charcuterie-board-cutting?click_key=97f99407e64167f0a6b448ed087d1a7dbe0ebe62%3A1589315828&click_sum=302e4428&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-12&pro=1&frs=1&bes=1",
    "title": "Personalized  Charcuterie  Board, Cutting Board, Hostess Gift for Couple, Home Gift, Wedding Gift, Housewarming Gift, Unique Christmas Gift",
    "description": "🔹 Product Highlights 🔹Explore our Exquisite Marble Charcuterie Board Set – the Ultimate 11-Piece Addition to Elevate Your Entertaining Experience! This opulent set includes everything you need to create a stunning presentation of meats, cheeses, and appetizers.🔹 Key Features 🔹Meticulously crafted from premium marble and acacia wood, our serving board boasts a unique and sophisticated design. Measuring 15.5 inches in length, 11.75 inches in width, and 0.5 inches in thickness, it offers both durability and elegance. The set also comprises three ceramic bowls for dips and accompaniments, complemented by three wooden spoons and a four-piece cheese knife set, all made from top-quality materials.🔹 Personalized Laser Engraving 🔹Make it uniquely yours with our laser engraving option! Choose from a variety of designs and customize the red areas with a name, date, or special message. Our laser engraving ensures a lasting and personalized touch.🔹 Natural Wood Beauty 🔹Embrace the natural charm of acacia wood, featuring varying colors, markings, knots, and rustic details, making each board truly one-of-a-kind.🔹 Care and Maintenance 🔹To maintain the marble and acacia wood's beauty, hand wash the serving board and apply mineral oil for a polished finish. With proper care, this Marble Charcuterie Board Set will be a timeless addition to your entertaining repertoire.Why wait? Elevate your hosting game and leave a lasting impression on your guests. Add this exquisite set to your collection today!",
    "reviews": [
      "I ended up missing a few pieces of the item and the seller promptly had them delivered. Beautiful wedding gift for our friends",
      "The couple we sent it to absolutely loved it. It shipped quickly too!! Highly recommend!",
      "Looks perfect - just as ordered",
      "Looks beautiful! Super quick shipping and great heavy quality"
    ]
  },
  {
    "productId": "rXZZnzGqEz",
    "url": "https://www.etsy.com/listing/1215591913/personalized-garden-stone-mothers-day?click_key=6d4a953cc17dc15335aa991b642cf7a2e7bf8923%3A1215591913&click_sum=df02d909&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-21&pro=1&etp=1&sts=1",
    "title": "Personalized Garden Stone | Mother's Day Gift | Personalized Birth Flower Gift | Personalized Gift For Her | Gifts For Her | Grandma Gift",
    "description": "Personalized Garden StoneOur beautiful personalized garden stones are custom made to order. Pick any name for Grandma -- for example Grandma, Nana, Nanny, etc. and include up to 10 first names (message me if you need more names) and dates for the flowers - all other text included as shown. The flowers will be matched to the birth month. If no dates are provided we will match them with random flowers. If no name for Grandma is given, we use Grandma's Garden.Garden Stone 8\" sizeGarden Stone 6\" sizePlease note your personalization in the message box during checkout. Our garden stones ship quick from our studio in Southern California. We put lots love love and care into every item we create.Approximately 8\"  (18-20cm) and 6\" (14-15cm)Our stones are created from slate and by nature are weather proof. The coating that is applied to the stone is also weather proof and will not be affected by rain, cold or snow. Over time the sun could fade the writing and we suggest using an outdoor furniture spray or UV protectant just as you would for outdoor furnishings. The stones include a stand for indoor display if desired.At this time we are not able to offer proofs before creating, please ensure all order information is correct before finalizing orders. If a mistake is noticed. Please notify us via convo within 12 hours.",
    "reviews": [
      "Loved this product and so did the recipient. Definitely recommend!",
      "Makes an awesome Mother’s Day gift!",
      "Very beautiful and just what I was looking for!",
      "Beautiful and is very good quality."
    ]
  },
  {
    "productId": "NnODFrKsUE",
    "url": "https://www.etsy.com/listing/799605341/personalized-leather-toiletry-bag?click_key=80b3dd9bcde44c678c761d08fa2381d03a30548b%3A799605341&click_sum=d452f02c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-22&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather Toiletry Bag, Christmas Gift for him, Men's Travel Dopp Kit, Personalized Groomsmen gift, Husband, Father,gifts for dad",
    "description": "Best Gift Personalized Toiletry Bag, Anniversary Gift for Him,  Engraved Dopp Bag, Leather Dopp Kit, Boyfriend Gift for Men, Gift for Dad, Gift for HimHave a travel case to store your bathroom essentials with the Leather Dopp kit. Your toothbrush, deodorant, aftershave, comb, etc. It helps you stay organized by keeping everything in one place.The large Dopp kit is enough to store all your cosmetics and toiletry essentials.Give your loved ones an unforgettable gift experience with a special leather wallet that they can always carry with them!You can give all the personalized leather bags for Father's Day, Mother's Day, birthday, anniversary, Valentine's Day, Graduation, Wedding, Thanksgiving, and Christmas gifts.🔷Product Features:Large: 10\" x 4\" x 5\"Medium: 7\" x 3\" x 4\"A hand handle that makes it easy to carry.Industrial strength zipper.Hand-sewed with strong thread.Hand stitches achieve aesthetics and durability that you can use for many years.Our products are produced by hand in our atelier using completely natural materials. There may be slight differences in handmade products, depending on the nature of the material or the taste of the craftsman's hand. Since the products are not fabricated, they may differ slightly from the images on the site.We always check our products before we pack them. But if you find an error/deformation caused by production/delivery, please contact us directly.🔷Personalization:We can engrave text/name/initial/logo on the engraving area specified on the leathers. Check out our customization examples!For Initial:Please select your initial style from the picture and enter your text. We offer some classy fonts for initials or names. We engrave the initials/names in the front side right corner by default.Example: F-3 MIf you forgot to choose any personalization option when giving an order, you may purchase from the link below.Please let us know your order number for that personalization request.Personalize it!https://www.etsy.com/listing/777398602/personalization-add-on?click_key=2c0d3ce9f9f829f6b648a1df74ba6691ad41f08b%3A777398602&click_sum=ea7ea536&ref=shop_home_active_1&frs=1&sts=1For our stylish wallets and bags, you can make changes to your personalization request within 12 hours after your purchase. If you still want a change after 12 hours, you should order a new one. Since our products are customized according to your wishes, they cannot be resold.If you have purchased the customization option but do not send us your request within one week, we will ship the item unengraved after one week and refund the engraving price.🔷Color Options:BrownBlackCinnamonGrayOliveOur products are durable for many years of use.🔷How to Care:When necessary, clean the leather only with a soft, dry cloth.Do not use detergent or any cleaner.Scratches and bumps that occur as you use it will give the leather a vintage look. However, the leather polish can be used for unwanted scratches.Always rub in circular motions when wiping or polishing leather.If the leather gets wet, do not heat treat, wipe off moisture to prevent mildew, turn it over and hang it to dry.🔷Processing Time:Our production time is 1-3 days for all our products. At the end of the production time, your order will ship.If you want to rush your order, you may purchase the link below. And after your purchase, your product will ship the same day.Rush My Order!https://www.etsy.com/listing/1100140287/rush-my-order?click_key=4d83106689648a6f4b6ec399809f39d576f4bde4%3A1100140287&click_sum=902f1623&ref=shop_home_active_2&frs=1&sts=1🔷Shipping Time:We ship your package with the USPS shipping company with the First-Class option by default. If you want fast shipping, you may choose the Priority or Priority Mail Express options. But we are not responsible for the shipping delay.In order to speed up the Production Process and Cargo Process, if you purchase the listing below, we will send it to the cargo within the same day and make the delivery with UPS cargo service.Rush My Order and Fast Shippinghttps://www.etsy.com/listing/1117156957/rush-my-order-and-fast-shipping?click_key=219e2d50717ca424812b00cbc1f59b4c5dc430ae%3A1117156957&click_sum=c0da52b8&ref=shop_home_active_3&frs=1&sts=1🎁Your order is ready to be gifted in a free, eco-friendly box.We only use leathers and hides which are by-products of the food industry.Black Friday SaleBlack Friday Deals",
    "reviews": [
      "Perfect gift for my boyfriend! Great quality",
      "This item was the perfect gift",
      "Amazing- look forward to ordering more"
    ]
  },
  {
    "productId": "DcwBcVimsC",
    "url": "https://www.etsy.com/listing/1332070344/custom-license-plate-initials-with-red?click_key=c9f2d08ad952ac6f60fdde424ed3048abd7c096a%3A1332070344&click_sum=44141376&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-23&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom License Plate Initials with Red Folded Heart | Unique Birthday Gift for Boyfriend or Girlfriend |",
    "description": "Here is the unique Valentine's Day gift for your girlfriend, boyfriend, or spouse that you have been searching for!  This isn't something you'll find anywhere else! Choose random state's license plates that the initials are cut from or choose the state's license plate that each initial is cut from.Say you're Matt from from Texas and she's Jenna from Colorado, we'll cut an M from a Texas license plate and a J from a Colorado license plate and we'll flank our signature folded ❤️ red heart ❤️ with the custom initials.We ship quickly!  We work hard to keep our wood plaques and pieces well stocked and ship within 2-3 business days.We have plates from all 50 states but not all states use letters on standard plates so Rhode Island, New Hampshire, and Delaware are not available.Our signature solid red folded heart measures approximately 3\" x 3\" and adds the perfect amount of color and dimension.  Sign includes two letters with heart in the middle.If you would like more than 2 letters, here is the link for that listing:https://www.etsy.com/listing/620525110/custom-initials-heart-license-plate-sign, no custom state requests for more than 2 letters.+++++PLEASE READ THIS BEFORE ORDERING!!!+++++There are 2 choices when it comes to the pieces for your sign:❤ Random State Pieces – You choose the letters, we choose the state's plate they're cut from.❤ 2 Custom State Pieces* - You choose the letters and the state's license plate each are cut from.  Each letter will have a portion of the state's name on it, or a part of a letter from the state's name depending on the design.*Since we can't possibly have every letter from every state available at all times, we will check our inventory and do our best to get back to you within 24-hours to confirm we have what you have requested.  Please be sure to have a current email address entered so we can quickly contact you.What makes our signs so great?  The answer is found here, under announcement:https://www.etsy.com/shop/JustPlateCrazyBe sure to FAVORITE our shop to stay updated on the new listings we publish!Alabama, Alaska, Arizona, Arkansas, California, Colorado, Connecticut, Delaware, Florida, Georgia, Hawaii, Idaho, Illinois, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Massachusetts, Michigan, Minnesota, Mississippi, Montana, Nebraska, Nevada, New Hampshire, New Jersey, New Mexico, New York, North Carolina, North Dakota, Ohio, Oklahoma, Oregon, Pennsylvania, Rhode Island, South Carolina, South Dakota, Tennessee, Texas, Utah, Vermont, Virginia, Washington, West Virginia, Wisconsin, Wyoming",
    "reviews": [
      "Very cute and personal valentine gift",
      "Was a great gift for my boyfriend.",
      "The plaque is lovely and beautifully made. Great anniversary present!"
    ]
  },
  {
    "productId": "RKHEPWWhms",
    "url": "https://www.etsy.com/listing/1499294580/personalized-embroidery-felt-bookmarks?click_key=154b34d6d60c671c0656965bc9333b9a64dfb98e%3A1499294580&click_sum=674494f0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-24&pro=1&frs=1&etp=1",
    "title": "Personalized Embroidery Felt Bookmarks | Letters Handmade Corner Bookmark | 4 Season Letter & Flower Felt Bookmark  Set",
    "description": "🎇Buy 2 letters and Get a 3th bookmark for free 🎇🎁 when you order 2 or more letters , you ll get automatically a 3th one as gift. You can indicate the letter demanded through the message , otherwise you will receive a random one .▶ Each bookmark is hand-stitched, made of felt cloth and kraft paper, a creative gift for book lovers.▶ The bookmark has 4 designs to choose from, which are spring/summer/autumn/winter▶ These personalized hand embroidery corner bookmarks are not only used as page numbers and book decorations, but also suitable for jewelry making and DIY craft accessories, it is a very meaningful lucky bookmarks.▶ The bookmark is a practical gift for men or women, it can be used as a gift for friends, teachers, and reading lovers, and it will be a unique and creative gift.▶ Because This Handmade Embroidery Felt Bookmark is handmade, so we can not guarantee that every bookmark made, is exactly the same as the picture, please know in advance.▶ Each one Handmade Embroidery Felt Bookmark is unique and fulfilled with full love , I hope you can love it.🔆 Material: Felt fabric + cotton thread + kraft paper🔆 Style: Spring, Summer, Autumn, Winter & One for Each Season(This option contains four.)🔆 Size: 3.7 * 3.7 inches / 9.5 * 9.5 cm, suitable for most books",
    "reviews": [
      "Even more beautiful in person, each one I gave as a gift was well received and cherished!",
      "It’s so cute, great bookmark!",
      "Gifted this to a librarian friend! It was the perfect gift. Great quality and so adorable.",
      "Great! So cute!!! Recommend! Easy to order!"
    ]
  },
  {
    "productId": "LSWEroCrwJ",
    "url": "https://www.etsy.com/listing/936761406/personalized-night-light-with-moon-stars?click_key=34c9467717a1cf4f14fe47e518b11db8a3ca8f69%3A936761406&click_sum=a58410e3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-25&pro=1&etp=1&sts=1",
    "title": "Personalized Night Light with Moon & Stars - Nursery Decor - Custom Name Light Night Gift - Kids Room Decor - Personalized Gifts for Kids",
    "description": "Custom Rainbow Night LightColor your kid's room with this gorgeous plexi glass and wooden custom night light.Our night lights are unique and best for a gift to give your loved ones for events like:🌕  Newborn baby room,🌕  Birthday,🌕  1st Birthday,🌕  Nursery room decoration,🌕  Baby shower party,🌕  Christening,🌕  Baptism,🌕  New house decoration,or for other lovely occasion.It's a very adorable decoration item in your room during the day with cozy look.It sparkles the room in the night with its light, like a touch by a magic wand!Visit our store for more:https://www.etsy.com/your/shops/YourNameYourLightNight night time has never been so warm with this light. A heavenly amazing gift for your precious ones!- Size: 18 cm wide - 20 cm high (including the wood base)- LED's life span - 50.000 hours- Works plugged-in- Wall charger is NOT included. Any usb charger will work just fine.🌕  Manufacturing 🌕For order preparation we need 2 - 4days. But usually we do everything possible to send it faster.Please notice that we prepare and ship only in BUSINESS days from Monday till Friday. NOT including weekends.🌕  Shipping 🌕We use DHL - TNT, UPS or Fedex for shipping. You can expect your package in 7 business days once you have received the notification of shipment.We can not ship to PO Boxes and APO Addresses.🌕  Damage and Lost Parcel 🌕We take full responsibility for our products, shipping, and delivery. In case of damage or loss during delivery we will send out a new product as soon as possible.We want you to be happy!🌕  Customs Fees 🌕We need to inform you that according to the United Kingdom legislation If you receive a package from a country outside the EU, it may incur customs fees.For the United Kingdom: Any package that is subject to a Customs Duty will also be subject to the £8 Extra Duty.Any goods brought into the UK over £ 15 are subject to import VAT.Unfortunately, we have no influence over this as it is your country's laws. So you have to take it into account when making an order.",
    "reviews": [
      "Very pretty and easy to place order",
      "Purchased multiple lights! Great for baby gifts/ new moms. Such a sweet sentiment <3",
      "This item was a gift and the recipient loved it! Thank you.",
      "Very cute. Item is as described, but looks much smaller than I was expecting. Shipping was quick! I wish it had an on and off switch so it doesn’t need to be plugged and unplugged every time. I got it for a discounted price, so it was worth what I paid for it."
    ]
  },
  {
    "productId": "pKmSczQsBG",
    "url": "https://www.etsy.com/listing/1407062840/two-names-necklace-mutiple-name-necklace?click_key=f2dea73913a88d6cd334b231241cfdc538a2ae53%3A1407062840&click_sum=8a3d6c2b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-26&pro=1&etp=1&sts=1",
    "title": "Two Names Necklace, Mutiple Name Necklace, Custom Children Necklace, Personalized Handwriting Necklace for Mom Gift, Christmas Gift",
    "description": "Multiple name necklaces are a must for every fashionable woman, especially for mother. They have a fun and personalized feel to them. In addition, our double name dainty necklaces are versatile enough for everyday wear. Slip them on alone or layer them up for a bolder look.WARM ATTENTION:●\tThis beautiful, classic style offers enough space for inscriptions containing as many as ten characters, so feel free to get creative as you create your own design!●\tOnce you’ve decided how you’d like to style it, our skilled artisans will create the perfect pendant on your behalf.●\tIn addition to getting your own name, other options would be to get the name of a boyfriend, BFF, pet, parent, or even a favorite word that you use for inspiration or motivation when it’s needed most.Personalized Perfect Gift:This multiple name necklace with love can be a lovely gift for your wife, mother, girlfriend, loved one on special days. Such as Birthday, Anniversary, Christmas, Graduation, Mother's Day, Valentine's Day, Wedding, Engagement.How to customize Order?1) Select Color2) Select Chain length3) Click \"Add to Cart\"3) Will need work name or letters write to the text box  ( like: Laura  David )4) Checkout5) Complete orderFeatures• Made to Order• Material Options: High Quality 925 Sterling Silver, 18k gold plated , 18k rose gold platedAssurancesNickel FreeTarnish ResistantHigh Quality MaterialsStandart Deliver in 7-10 Business DaysNecklace and Chain Size Guide• 14\" NECKLACE: Fits most like a choker• 16\" NECKLACE: Falls perfectly around the base of the neck like a collar. On a petite woman it will hit your collarbone while for plus size women it might feel more like a choker.• 18\" NECKLACE: A common choice for women that will fall just below the throat at the collarbone. This length is popular for adding pendants which will hang over a crew neck.• 20\" NECKLACE: Will fall a fewinches below the collarbone and allow a little more breathing room. Perfect for a low, plunging neckline or if you want to wear it over a turtleneck.",
    "reviews": [
      "Yes it did met my expectations",
      "The necklace is beautiful! My only notes are that the clasp is really small and if you have your nails longer at all it’s almost impossible to open the clasp and put on the necklace yourself. Also the heart in the middle could be a little heavier so the necklace stays centered, mine falls to the side cause the names are heavier. Those are my only complaints cause otherwise it’s great!",
      "Love, love, love this precious necklace! The names are lovely but the unifying heart truly ties it together! It exceeded my expectations!!"
    ]
  },
  {
    "productId": "wzOUVkYYVp",
    "url": "https://www.etsy.com/listing/964070589/custom-cutting-board-multiple-options?click_key=9f9f5f4e2f80db0d775477962f48c50cec94e9ac%3A964070589&click_sum=f531fa29&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Cutting Board - Multiple Options, Handmade Home Decor, Gift For Her, Personalized Gift, Housewarming, Wedding Present, Mother's Day",
    "description": "This handmade engraved cutting board is the perfect addition to any kitchen, and makes for a truly special gift. Expertly crafted from high-quality wood, this cutting board is engraved with a unique message or design of your choice, making it a one-of-a-kind piece that will be treasured for years to come. Whether it's a wedding gift or just to add a personal touch to your own kitchen, this personalized cutting board is a beautiful and functional item that will make any space feel more special. Order now to create a truly unique and thoughtful gift that will be cherished for years to come.WHAT'S INCLUDED?★ One laser engraved cutting board in your choice of walnut, cherry or bamboo. Our walnut and cherry boards in this listing are shipped uncoated in their natural wood finish. We recommend applying a food safe mineral oil prior to use to preserve the life of the board.★ Note - Due to the nature of real wood products, the actual shade and color of the engraving may vary slightly.★ORDERING NOTES★❶ Please see all photos for design and product options.❷ Double check all information before submitting order.★ Include any information needed for personalization. Example (Names, Date, etc.) If you would like to omit any portion of the design, please specify the change in the personalization field.Any information not included may be omitted.❸ Double check shipping address (make sure to include apartment number if applicable)★PRODUCTION AND SHIPPING★We pride ourselves in delivering your custom product to you in timely manner. We always do our best to ship orders as quickly as possible.If you need your items sooner, please add our rushed production listing. This listing ensures your order ships within 1-2 business days. We are not able to guarantee exact delivery dates.https://www.etsy.com/shop/FlowertownWeddings?section_id=19062302",
    "reviews": [
      "Very nice. Shipping was fast.",
      "Looked even better than the picture! Was a perfect gift!!",
      "I bought this as a gift for my friend and she loved it!",
      "My nephew and his wife loved their Christmas gift"
    ]
  },
  {
    "productId": "rQYDABMPZa",
    "url": "https://www.etsy.com/listing/941954799/personalized-water-bottles-for-boys?click_key=c34de9b05f6b2a1f13678138c6152e17981ec04b%3A941954799&click_sum=e6264016&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-14&pro=1&bes=1&sts=1",
    "title": "Personalized Water Bottles for Boys Girls | Personalized Gifts for Kids Engraved Kids Tumbler 12 oz Stainless Steel | Toddler Kids Gifts",
    "description": "Gear up for going back to school with custom engraved water bottle for the classroom! Your boys or girls can take a drink with them whenever they're on the move.💦 Material: stainless steel insulated bottle and stainless steel lid with leak proof silicone seal, keep both cold and hot and withstand acidic and carbonated drinks.💦 100% BPA free, phthalates free, toxins free💦 Does not retain nor impart any flavor and dishwasher safe💦 Wide mouth for ice filling and easy cleaning💦 Long-lasting and eye-catching color coating, available in white, pink, sky blue and black💦 Product Dimension: 7.3\" x 3.5\"💦 Capacity: 12oz/350ml💧 How to OrderSelect the tumbler color/ font design and animal icon of your choiceYou can choose as many colors/combinations as you want, add them separately into your cart and check out together to SAVE on SHIPPING**If personalization is purchased, please specify the following info in the “Note to seller” section at checkout:All monogram letters will be printed exactly as provided by the buyerPlease enter font style and name.❤Default is Font#1 if not specified when order.❤Case sensitive❤ 10 character limit❤ Font #1,#4,#5- all capsExample:Font#5- AndrewFont#6- Allison💧 About shipping:DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.------------------------------------------------------------------------tumbler, skinny tumbler, custom tumbler, engraved tumbler, water bottle, reusable hydro flask, custom hydro flask, custom water bottle, kids water bottle, children's tumbler, reusable tumbler, reusable bottle, refillable bottle, kids birthday gift, kids birthday gift idea, kid birthday gift, kid birthday gift idea, 2 yr old birthday, 2 yr old birthday gift, 3yr old birthday gift, 3yr old birthday, 4yr old birthday, kid custom gift, tumbler personalized, personalized gifts, personalized water bottle, birthday gift for him, custom flask, engraved flask, tumbler with straw",
    "reviews": [
      "Lovely design, easy to order, fast turnaround",
      "Beautiful gift for my daughter",
      "Love it for my niece!",
      "love it for my nephew!"
    ]
  },
  {
    "productId": "YiPpCPkhby",
    "url": "https://www.etsy.com/listing/1169117328/puzzle-name-stool-personalized-with?click_key=47970307e669b705f73850a01886b468be066cee%3A1169117328&click_sum=1847ee32&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-15&frs=1&bes=1",
    "title": "Puzzle Name Stool Personalized with Primary/Pastel Colors or Custom Colors",
    "description": "Help your little one reach for the stars and learn to spell his or her name too. Each letter is brightly colored with non-toxic paint and has smooth easy to fit edges.Personalized Name Puzzle Stool stands 9 inches off the ground and measures 9\" x 12\". This stool is large and can fit up to 10 letters. Primary or Pastel colors available, or, we also offer Custom Colors. Legs, Support & Letters are a full 1\" thick.These are also available in different base colors in Lil D's ShopAll of our step stools are coated with a clear Gloss finish.Name Stools stands 9 inches off the groundStep Stool top dimensions are 9 x 14 inches constructed from a one solid piece of Ponderosa Pine wood.FREE SHIPPING in the continental U.S. for all Name StoolsAll Name Stool finishes are water based and non-toxic.Your Childs Stool comes completely assembled, by our skilled craftsmen.Allow approximately 2 weeks for Name Stool delivery, or 1 week if in stock!Name stool is perfect for:Toddlers birthday gift or Baby girl giftBaby shower gift or baby giftPersonalized baby Baptism gift or Christening giftChristmas giftCustom Toddler toys",
    "reviews": [
      "Arrived exactly as pictured - very sturdy, but adorable!",
      "I ordered two stools. Well-made and the letter colors are bold and big. These stools will last for decades!",
      "The stool was perfect! It was a gift for my niece and arrived ahead of time. Love it!",
      "Sturdy and well made. Perfect for my 2 year old."
    ]
  },
  {
    "productId": "YsPheqoWie",
    "url": "https://www.etsy.com/listing/386914990/personalized-gift-hand-forged-wrought?click_key=cacd8d2586783b45ec35c8245c4a42b8f7a9ec5f%3A386914990&click_sum=1fcfb384&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-27&frs=1&etp=1&sts=1",
    "title": "Personalized Gift Hand-Forged Wrought Iron Red Metal Rose",
    "description": "This stunning rose looks like it sprung straight from the pages of a fairytale! Available in a variety of colors, this hand-forged iron rose has all the vibrance of life without ever wilting.This metal sculpture would also make an amazing center piece for a wedding or special event or a gift to a friend or loved one for a birthday or anniversary that will be around to be admired for years to come.For an extra special touch, add a name or a special day using our unique personalization feature.- This sculpture is approximately 8.5\" tall.- All sculptures are made with pure iron , with no flimsy or cheap fillers.- All sculptures are powder coated for an elegant, glossy, and long-lasting finish.- Every sculpture is handcrafted in an authentic blacksmith shop in Quebec, Canada.S H I P P I N GFor US and Canada: please allow 4 to 8 business days (processing + shipping) to receive your order.Faster shipping is available upon request. Please notify us before your order is placed so we can adjust the invoice for the additional cost.We can't guarantee a delivery date - even with expedited shipping - but we will do everything we can to get your item to you on time.For international orders: please allow 2-4 weeks for delivery. All customs and import fees are the responsibility of the buyer.Follow us on Instagram for more updates! https://www.instagram.com/alainsblacksmithshop/",
    "reviews": [
      "THE RED ROSE IS ABSOLUTELY BEAUTIFUL AND AMAZING JUST LIKE THE BLUE ROSE YOU CAN'T GO WRONG WITH EITHER ONE! HIGHLY RECOMMEND!",
      "Great Craftsmanship!!!!!!!  Far exceeded my expectations.",
      "Amazing quality exactly what I asked for, I had some issues with delivery which was my own fault and the manufacturer was very very helpful and managed to help me swiftly it was a great valentines gift and I couldn’t recommend it more the customer service is some of the best I have ever experienced"
    ]
  },
  {
    "productId": "aMDliXOeSW",
    "url": "https://www.etsy.com/listing/1083997666/personalised-embroidered-mens-leather?click_key=d78de3602378d342c72cb0f3512dfd76d6188955%3A1083997666&click_sum=c18857b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-28&etp=1",
    "title": "Personalised Embroidered Mens Leather Wash Bag with Strap Black or Brown - Mens Vegan Leather Toilet Bag Embroidered with Initials",
    "description": "Embroidered leatherette toilet wash bag embroidered with initials.Description:Sizes: ONE SizeMaterial: Full grain leather look NuHide® PU.Fully lined in pinstripe fabric.Wipe clean interior.Vintage style metal fittings.Main zip compartment.Internal pockets.Hidden zip lining for easy decoration access.Tear out label.Capacity 3 litres.13 x 26 x 11 cmDelivery:Free UK postage via Royal Mail or TNT and low cost international postage.Standard delivery both domestic and international doesn't include tracking information.  If you'd like tracked shipping please ensure to select it at the checkout.Disclaimer:We asked our customer to ensure all information left at the checkout is correct as we will not be able to fix any address issues once the order has been dispatched.If orders are retuned to us by royal mail/UPS due to the issues regarding your address we will be in touch and ask you to purchase the link bellow to cover postage cost for resending your order again.https://www.etsy.com/uk/listing/1067207436/postage-listing-for-customers-resends?click_key=ffe2f5fe1ac2acbaafb77fd8770954c78eb7a34e%3A1067207436&click_sum=35163b25&ga_search_query=postage&ref=shop_items_search_1&frs=1Customer service:All messages are dealt with in the morning please do not panic if you do not get a reply instantly, we are busy making your order as everything is made to order and to ensure it goes out in good time.We appreciate your patience and will get back to you asap.",
    "reviews": [
      "Great quality and good value for money my boyfriend loves it feels like luxury fits all his toiletries in .",
      "Excellent quality toiletry bag. Great gift. Quick delivery",
      "Lovely bag, bought for my brother and he loved it great quality"
    ]
  },
  {
    "productId": "FrDZBCdsen",
    "url": "https://www.etsy.com/listing/1169636595/personalized-tequila-flight-board?click_key=74869367bc0e039cd1bc4d6fd7ad0c44e60e19e5%3A1169636595&click_sum=dad992a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-29&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Tequila Flight Board Charcuterie Board for Bridal Shower Gift, Wedding Gift, Engagement Gift, Birthday Gift, Thank You Gift",
    "description": "**This board is packaged in a gift mailer box with mixed blended crinkle paper FREE of charge :).High quality Walnut or Maple wood tequila flight board with the OPTION to use as a cutting/serving/cheese/charcuterie board on the other side. This 2 IN 1 (DUAL PURPOSE) board is custom laser engraved just for you.  Perfect for serving tequila, cheese, bread, fruit, or even making your own charcuterie spread at your family events while displaying a beautiful customized gift. These boards are great for birthdays, Fathers Day, or even Mothers Day gifts!!Not just a statement piece in your kitchen but 100% a usable product. All-natural wood, food-grade board, stain, paint, and chemical-free. Color in wood may vary as this wood is in its most natural state and we do not modify it in any way. The board is seasoned with board oil prior to shipping. Please maintain the board with a monthly application of cutting board oil to extend the life of the board.*Add 4 shot glasses or a display stand to really show off this amazing gift for that special someone!! Tequila not included.Instructions:Under personalization1.  Include the LASTNAME, or2. First 2 names of a couple, or3. FIRST NAME*** FREE GROUND SHIPPING INCLUDED!Dimensions: 14\" X 8\" X 0.75\"•\tDisclaimer: Not one piece of real wood is identical. Please be aware that the wood color, tone, and grains may vary.*The board may have upper right or left side hole to hang.*Shipping Policy: Ships within 1-3 business days. Free ground shipping at checkout. Typically arrives within 3-7 business days after the item is shipped.*Return Policy: No refunds or returns as this is a customized gift. Please double-check for spelling or grammatical errors on the personalization line before you submit the order. Please message us via the ETSY app to report changes within 1hr of purchase. Messages are verified before laser engraving your board.Quotes:Tequila might not solve your problems but its worth a shotTake life with a grain of salt and a shot of tequilaTake a shot we tied the knotTake a shot we're tying the knotSi La Vida Te Da Limones Pide Sal Y TequilaI can shot all I want I'm retired",
    "reviews": [
      "Such good quality and makes such a good gift!",
      "This came in faster than we thought which is prefect. It’s going to make a good wedding gift for our friends.",
      "It looks great and shipping was super fast. I know the bride and groom are going to enjoy it!"
    ]
  },
  {
    "productId": "LtGHaDgLdj",
    "url": "https://www.etsy.com/listing/795445587/personalized-groomsmen-gift-dopp-kit-bag?click_key=90d12e3084b17ada4b36d347cbbba19aa3a9cb9d%3A795445587&click_sum=e4281548&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-30&pro=1&etp=1&sts=1",
    "title": "Personalized Groomsmen Gift Dopp Kit Bag Customized Leather Toiletry Bag Monogram Mens Toiletry Bag Leather Custom Gift for Guys Men Wedding",
    "description": "Personalized Leather Dopp Kit Third Anniversary Gifts For Men Leather Toiletry Bag Birthday Gift For Dad Valentines Day Gift For Him Dopp Kit Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for HimHandmade Item%100 Genuine Leather - Best Quality Oil-Tanned Full Grain Cowhide LeatherSIZES:XL Dopp Kit:Approx. 9.5” x 4.5” x 4.5”Large Dopp Kit:Approx. 8” x 4” x 4”Small Dopp Kit:Approx. 6.75” x 3.5” x 3.25”PERSONALIZATION INSTRUCTIONSPlease tell us your personalization request in the “Add an optional note to seller” box during checkout. ***Add Initials: Max of 5 Characters***Want to order 10 or more items? Contact for bulk pricing!",
    "reviews": [
      "My son loved this, he received as a Christmas gift.  Great quality!",
      "Super quick shipping order processing and shipping. The item was just as described and looks great with the engraved initials.",
      "I loved it so much!",
      "This was my second of these bags to give as a gift, love it!"
    ]
  },
  {
    "productId": "nnFTCdueUc",
    "url": "https://www.etsy.com/listing/1055846134/personalized-jewelry-box-custom-jewelry?click_key=70499b4aa90352a3f933e763fdb92ba84316aac2%3A1055846134&click_sum=0610fc14&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-31&pro=1&pop=1&sts=1",
    "title": "personalized jewelry box Custom Jewelry Boxes Bridesmaid Jewelry Box Travel Jewelry Case, Custom Name Jewelry box",
    "description": "Personalized jewelry box. Custom jewellery box. Travel jewelry boxThis gorgeous Jewellery box makes the perfect proposal or thank you gift for any Bridesmaid, Maid of Honour or Flower girl.Each box is personalised with the name of your loved one and is available in 12 beautiful colours.  Pink, white, black, blue and turquoise. This listing is for one box.Please note the box only ‘no name’ option is available for the faux leather boxes only. The velvet boxes are only available with the personalised name option.If the Gift bag only option is selected this does not include the jewellery box - it is for the gift bag only as shown in the listing photosMeasurements - 10cm x 10cm x 5.5cm.Each box has a zip close with square embellishment and is made from faux pvc leather. The colour of the zip varies on each box, please send a message if you require derails of the zip colour for your box colour choice.The Vinyl writing can be finished in various different colours including Gold, Silver, Rose Gold, Grey, Pink, Red, Light Pink or Dark Pink. Please select your option from the drop down menu.To order please complete the following steps:1) Choose your box and writing colour2) Add to cart3) Please confirm the name you would like in the personalisation box4) Click proceed to checkout to complete your order",
    "reviews": [
      "Great quality product, good service",
      "Great product, fast shipping. No issues!",
      "So wonderful! I ordered 14 of these and they all came just as I had customized them. They look just like the photos. Can't wait for my girls to receive them :)"
    ]
  },
  {
    "productId": "cHkG8Qucxg",
    "url": "https://www.etsy.com/listing/1538010752/locket-necklace-with-photo-engraved-oval?click_key=1522331b2a56448ed8e4b320eb6dbee981365f86%3A1538010752&click_sum=f274d6a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-32&pro=1&frs=1&etp=1&sts=1",
    "title": "Locket Necklace with Photo, Engraved Oval Necklace, Photo Necklace in Gold, Memorial Jewelry, Anniversary Gift, Mom Gift, Mothers Day Gift",
    "description": "S P E C I A L • N A M E • N E C K L A C ELocket Necklace with Photo, Engraved Oval Necklace, Photo Necklace in 18K Gold, Memorial Jewellery, Anniversary Gift, Grandma Gift, Mom Gift♡ Custom Jewelry will be the best gift on the special day for your love one, Personalized locket jewelry is very popular nowadays. This is a stunning and special jewelry. Compared with others, it can bring back memories. More and more people choose it for gifting, This name necklace made from high quality sterling silver, it is perfect gift for her . All jewelery from us are handmade with love ♡• Material:Beads: 925 Sterling Silver ; Brass• Finish Plated:Sterling Silver, 18K GoldH O W • T O • O R D E R- Select Necklace Finish and chain length-Select Necklace material made of-Write your personalized engraved info in the personalized box-Click \"Add to Cart\"-Check out-Complete order-Contact us by message to send the photosP A C K I N G• All jewelry will come with a beautiful gift box for gifting, and if you want write a card to the recipient, please leave a gift message to us♡T U R N • A R O U N D • T I M E• All items are custom made to order. Our turn around time is about 4 - 8 business days. This can change during peak seasons. Delivery days is about 2-4 business days.-------------------------------------------------------------------Enjoy Your Shopping♡• All images are copyrighted by AnyaShopStudio. All rights reserved",
    "reviews": [
      "it came on time and was great!",
      "Good quality and the item arrived earlier than expected",
      "So cute, fast shipping, great quality",
      "Such a beautiful piece of jewellery very beautifully made"
    ]
  },
  {
    "productId": "TUnOw6xfFc",
    "url": "https://www.etsy.com/listing/948156525/small-leather-fanny-pack-with-patterned?click_key=591a75b11494a578deab7ec3f0d5af5e8261a866%3A948156525&click_sum=5361e6f6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730186-2-16&etp=1&sts=1",
    "title": "Small Leather Fanny Pack with patterned shoulder strap, Festival Bag, Small Cross Body Bag, Leather Fanny Pack with patterned bag strap",
    "description": "📏 DimensionsBag S- Width: 22 cm- Height: 13 cm- Depth: 6 cmBag M- Width: 25 cm- Height: 16 cm- Depth: 8 cmBag L- Width: 30 cm- Height: 19 cm- Depth: 9 cmBag XL- Width: 40 cm- Height: 20 cm- Depth: 12 cmBag XXL- Width: 47 cm- Height: 25 cm- Depth: 15 cmLeather belt (= BASIC | always included)- Length: 60-105 cm- width: 2,5 cmadditional shoulder strap (selectable via the numbers)- length: 80-120 cm- width: 5 cm📱 DEVICE SIZE- Suitable for all smartphones🤎 MATERIAL- All our bags are made of high quality, sturdy cowhide leather, which is extremely durable- Finished in a traditional Italian manufactory☑️ FEATURES:- Closure type: zipper- number of compartments: 1 main compartment- Inside pocket: yes- Detachable strap: yes- Adjustable strap: yes- Metal details: silver🤍 TONIFanny pack TONI by lePelou is the perfect accessory for your everyday life. It is made of high quality leather and is manufactured in traditional manufactories in Tuscany, Italy. With its versatile function as a fanny pack, hip bag and crossbody bag, it is a practical companion for any occasion - for example, TONI is also ideal as a festival bag.TONI Crossbody Bag is available in five different sizes and 13 different colors, offering the perfect choice for every taste. The detachable leather shoulder strap (=BASIC option) can be replaced with a patterned bag strap to customize the bag and give it a personal touch.The bag offers enough space for all your everyday essentials and is equipped with several compartments and a practical zipper to keep your stuff safe. Whether you use it as a fanny pack for sports, as a hip bag for outings or as a crossbody bag for strolling around town, the TONI Crossbody Bag is a stylish accessory that perfectly complements your outfit.It is practical and comfortable to wear because it can be worn over the shoulder or across the body. So you have your hands free and can move freely.Overall, the TONI Crossbody Bag from lePelou is a must-have for those who appreciate practical style and comfort. With a wide range of sizes and colors to choose from, as well as the ability to change the strap, this is the bag for you if you're looking for a little more individuality in your everyday life.Fun Fact: Because of their banana-like shape, fanny packs are called \"sac banane\" in France 🍌🇮🇹 MADE IN ITALYThe preservation of traditional craftsmanship and fair working conditions are particularly important to us. That's why our products are handmade in Tuscany in regional manufactories that can look back on many years of experience in their craft.The often small family businesses use vegetable-tanned leather for the production of our bags, which they cut out and carefully hand-sew into high-quality bags.",
    "reviews": [
      "Omg! Such a beautiful bag. Perfect size and the strap design was gorgeous! I also appreciated the plain option they included in case you wanted a simpler look. I will be ordering other colors again!",
      "So many compliments on my purse!",
      "Purchased as a gift. Really impressed by the quality!",
      "The bag is beautiful and of great quality. The only thing is the medium ended up being a bit smaller than I thought it'd be. I didn't really pay attention to the measurements though. I may opt for a larger size. The medium can hold a phone, thin wallet, and maybe a lipstick and glasses."
    ]
  },
  {
    "productId": "QeAJEyXJv0",
    "url": "https://www.etsy.com/listing/1108888668/last-name-sign-custom-wood-sign?click_key=ca7496d9d2f180ae7b3026ccf254a67fb6503a00%3A1108888668&click_sum=ea1a46c6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-33&pro=1&etp=1&sts=1",
    "title": "Last Name Sign | Custom Wood Sign | Established Sign | Personalized Wedding Gift | Wedding Sign | 3D Sign Family Name Sign Anniversary Gift",
    "description": "Personalized family name sign!>>>PERFECT FOR<<<--- Personalized Wedding Gift--- Anniversary Gift--- Family Established Sign--- Couples Gift--- Fathers Day gift for Dad--- Mothers Day gift for Mom--- Christmas PresentThis sign is available in three sizes : 9.25\" x 23\" (as shown), 11.25\" x 28\", or a 11.25\" x 36\".The background wood is stained on all sides and made of 1/2 inch Baltic birch plywood. The letters are 1/4 inch and mounted to the background. The light and dark colored wood letters creates a beautiful three tone look! Each sign includes a sawtooth hanger on the back for quick and easy hanging.-------------------------------------------------------------------------------------------The \"Digital Design ONLY\" option is a digital black & white design image of your sign to show you what the font and layout will look like.Please message us if you have any questions.Thank You!Personalized Wedding Gift Last Name Established Sign Family Name Sign Wooden Sign Custom Wood Sign Anniversary Couple Gift Personalized Sign",
    "reviews": [
      "My daughter & son in law loved it!",
      "This gift was perfect .",
      "This is absolutely beautiful. My daughter and son in law love it.",
      "I ordered this personalized wall plaque as a wedding gift for a friend. It turned out beautifully. Would definitely recommend purchasing this, if you want a really great quality gift for someone special."
    ]
  },
  {
    "productId": "LOLjGkIDs4",
    "url": "https://www.etsy.com/listing/727430066/charcuterie-board-personalized-easter?click_key=e00c684f76c6047a493f66431aee39c9e62e6fca%3A727430066&click_sum=2e7be100&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-34&pro=1&frs=1&etp=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 001",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Looks great, feels great, shipped fast, matched description and met expectations. So far so good!",
      "Very nice, came earlier than expected",
      "loved loved very impressed with workman ship.",
      "gifted to my family members all very pleased."
    ]
  },
  {
    "productId": "CrgoTzmyjJ",
    "url": "https://www.etsy.com/listing/1112573582/personalized-family-garden?click_key=2901e0c3a29d741d409781d873495f8fdcc33815%3A1112573582&click_sum=13099933&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-35&frs=1&etp=1&sts=1",
    "title": "Personalized Family Garden",
    "description": "Send the gift of a personalized garden to the ones you love. A gift that will last through all the seasons and for years to come. Celebrate the important dates in their life by selecting the months flower and build them their very own custom garden.This is a great gift for mothers, fathers, grandparents or aunts & uncles to celebrate their families birth months. Build a garden to mark the milestones in a relationship or simply give a garden full of personal favorite flowers.Garden sizes available in 2, 3, 4, 5 or 6 flower planters.  (6 flower gardens are more tightly placed)Need a larger garden, please check out my Mason Jar Bouquet listingLaser cut and beautifully packaged, the garden planter and flowers are ready to be sent directly to the recipient of the gift or sent to you to share on the special occasion. Keep the package filler and use it as fill for your flowerbed.Each garden has a note about the selected flowers represent and the months they represent. You can also add a personal message to be shared with the recipient.",
    "reviews": [
      "Not only is the work perfect but it was also packaged so well. Every piece was wrapped with care and thought! They even wrapped the shipping box in an adorable flower pattern! My mom absolutely LOVES her gift!",
      "The item was beautiful and a great gift!",
      "This is such a nice gift for someone! It  came faster than expected, and everything came unharmed!",
      "Absolutely beautiful and loved by everyone!"
    ]
  },
  {
    "productId": "NKlfTbYYpW",
    "url": "https://www.etsy.com/listing/861154494/custom-letter-necklace-sideways-initials?click_key=40cde8b6e1aac71a1adb9e6edd3c784b0f612b71%3A861154494&click_sum=660718c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-36&pro=1&frs=1&etp=1",
    "title": "Custom Letter Necklace - Sideways Initials Necklace - Mothers Day Gift - Personalized Jewelry - Bridesmaid Gift - Christmas Gift - Mom Gift",
    "description": "casilverdesign.etsy.comCustom Letter Necklace - Sideways Initials Necklace - Mother's Day Gift - Personalized Jewelry - Christmas Gift - Mama Gift NecklaceC U S T O M - I N I T I A L - N E C K L A C E- Material ; Solid 925 Sterling Silver- Finish ; Sterling Silver - Gold Plated - Rose Gold Plated* All our jewelries are handcrafted at our workshopH O W - T O - O R D E R1- Select color and length from the menu2- Select number of initials from the menu3- Enter your preferred initials in the order you want4- Complete your orderN E C K L A C E - L E N G T H12'' to 22''Any other length upon requestEvery necklace comes with an 1.5'' extender",
    "reviews": [
      "Beautiful quality and came quickly.",
      "It delivered the wrong color but overall is good quality",
      "Great customer service, would recommend to friends, great necklace!",
      "Great customer service, love the necklace!",
      "We sincerely thank you:)"
    ]
  },
  {
    "productId": "ySLBwYJZxj",
    "url": "https://www.etsy.com/listing/1179642829/personalized-couple-portrait-photo-as?click_key=dc40a5b067dc9752c09556ee9f55f2b0a695378f%3A1179642829&click_sum=aedfbd51&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-37&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Couple Portrait Photo as Anniversary Gift. Custom Photo on Wood, Engraved Photo on Wood with Watercolor Style, Custom Wall Art.",
    "description": "🧡 HAPPY VALENTINES DAY 🧡🎉 SPECIAL CUSTOM GIFTS FOR YOUR LOVER 🎉Transform memories into art with our Portrait from Photo service. Personalize your space with Wood Wall Art and Picture Frames. Capture cherished moments with Engraved Photo Wood and Custom Wood Burning. Celebrate Dad, new fathers, and anniversaries with thoughtful Gifts for Him. Explore our collection of unique and handmade personalized gifts.• Personalized photo on wood that is ideal for anniversary gifts, birthday presents, and other special occasions.• Custom engraved wood photo with laser engraving technology to ensure precise details in the finished product.• Wooden photo gifts available in various sizes and shapes, including portrait and landscape options.• Photo on wood can be personalized with custom messages or quotes to create an extra-special gift.• Laser-engraved wooden photo frames are perfect for couples celebrating their anniversaries or other special days.• Wide selection of woods available such as walnut, cherry, maple, alder, mahogany, and more.• Wood surface can be polished to bring out its natural grain pattern, making it even more unique.• The edges of the frame can also be painted to give it a finer finish.• Photos can be printed directly onto the wood surface using high-quality digital printing machines.• Possibility of adding additional elements like LED lights, music boxes, etc. to make it even more special.• Custom sizes and thicknesses are available to fit any space or budget.• Professional package shipping ensures safe delivery of your personalized photo on wood.• A 100% satisfaction guarantee on all products.• Affordable prices without compromising on quality.🎀 We are looking forward to being part of your special day🎀Best Wishes,Austero TeamAUSTERO'S WHY:At Austero, we have a purpose to make you feel and your loved ones feel warmth inside their hearth. We understand that a thoughtful and one-of-a-kind gift can have a significant impact on someone's life. We make it a priority to give our customers personalized gifts that celebrate them up and fill them with love and warmth.Time is of the essence when it comes to gift-giving, so we are driven to provide all of our customers fast shipping options. With our efficient shipping methods, you can be confident that your gift will arrive on time.Eco-friendliness and sustainability are important to us at Austero. We make sure that our gifts not only bring joy but also have a positive effect on the environment by carefully choosing materials and packaging that is both ethical and sustainable. For that, we only use FSC-certified woods for our products and recycled materials for packaging.Every gift leaving our shop is a one-of-a-kind creation that will be loved and cherished for years to come thanks to the care and attention to detail that goes into creating our distinctive designs. Every person, in our opinion, merits a personalized gift that is as special as they are.In conclusion, Austero is your go-to place for carefully made, thoughtfully personalized presents that are made to warm and pleasure the hearts of your loved ones. You can choose Austero with confidence for all of your loved one‟s gifts thanks to our fast shipping options and dedication to sustainability.",
    "reviews": [
      "Crazy fast shipping, nice product.",
      "Great quality and good seller communication",
      "This exceeded my expectations! You can hang on the wall and included was holder for photo to place on a desk bookshelf etc. This photo came in a great box and so cutely wrapped!\nEverything turned out great and my friend and her family loved it!! Thank you for making such a treasure for me!"
    ]
  },
  {
    "productId": "VVBsrtqpvf",
    "url": "https://www.etsy.com/listing/1166644634/custom-photo-gift-acrylic-picture-frame?click_key=819cb83c11a999687bed190050b9a3f700e29464%3A1166644634&click_sum=4664793b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-38&pro=1&etp=1",
    "title": "Custom Photo Gift | Acrylic Picture Frame | Acrylic Photo Block | Gift for Him | Gift for Mom | Personalized Photo | Mother's Day Gifts",
    "description": "If you are looking for the perfect personalized photo gift for Mother's Day, yourself or someone you love, we humbly submit our breathtaking Acrylic Photo Blocks for your approval.◼️ BREATHTAKING IMAGERY ◼️One of the distinguishing features of these acrylic blocks is their beautiful, vibrant display of your photos, which look almost 3D once printed. Take a sec to scroll through the preview images at the top to get a full appreciation for this effect.◼️ PICK YOUR SIZE ◼️Choose between 4\"x4\", 4\"x6\", 5\"x7\", or 6\"x6\" photo blocks. Each block is a thick .8 inch deep, which means they easily stand on their own on any flat surface.◼️ BEAUTIFUL UV PRINTING ◼️Whether your Acrylic Photo Square is a gift or a personal purchase, we know you're going to display a cherished photo on it. We understand that, which is why we use only state-of-the-art UV printing that creates sharp lines and vivid images that will last for years.◼️ Capture Life's Most Precious Moments ◼️If you want to put a smile on the face of a loved one, or brighten up your home with some beautifully displayed memories, our Acrylic Photo Blocks are perfect!◼️ HOW TO ORDER ◼️• Select the size Acrylic Photo Block you would like• 🌟🌟🌟 Send me your medium to high resolution photo in a convo 🌟🌟🌟• I work my magic and create your 100% unique acrylic photo block with lots of love and care!✨NOTE: If you have any specific requests regarding the layout (for example, portrait or landscape orientation), be sure to include that in your convo with your photograph.",
    "reviews": [
      "Item was high quality and what I expected, seller was pleasant and responsive!",
      "Absolutely beautiful product. Love it!!!",
      "Another amazing gift!!! Super high quality photos, really just beautiful. Thank you so much!"
    ]
  },
  {
    "productId": "ullUuerCsa",
    "url": "https://www.etsy.com/listing/1056233131/personalized-wedding-gift-last-name?click_key=3ef4d2cb7c466e7006b094fbb6d3acffcb8e1171%3A1056233131&click_sum=360740f0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-39&pro=1&etp=1&sts=1",
    "title": "Personalized Wedding Gift Last Name Established Sign Family Name Sign Metal Sign Custom Metal Sign Anniversary Couple Gift Personalized Sign",
    "description": "Beautiful Custom Family Name Metal Sign or Door Hanger.We professionally laser cut your sign out of 18 gauge steel to provide precise cuts and design!We powder coat each sign to ensure a smooth finish and long term durability.You can hang our signs easily with door hangers, door hooks, nails, wall magnets, etc. Due to many different hanging options we do not provide hanging equipment.Size Options:From 12\" Height to 30\" Height OptionsColor Options:Black, Silver, Red, Copper, White",
    "reviews": [
      "It made a great wedding gift",
      "I'll be honest. I'm a little disappointed with the shipping. And overall product. The part of the W is looks like there is a mistake. The H I wish was a little bit more defined. The box to open was a pain to open. The sign sticks to the inner cardboard. Also the sign it's self was delivered slightly bent. The metal is a little more flimsy than I'd like.\nThis was for a gift & if it were at say a flea market like the way it was delivered, I wouldn't have purchased it.",
      "Top Quality of the product received and matched the item description.",
      "Perfect gift for my nephew and his bride"
    ]
  },
  {
    "productId": "xRuvFGPKdM",
    "url": "https://www.etsy.com/listing/1321185017/personalized-dog-leash-holder-dog-butt?click_key=158abf5d98aa33cf5fc9162d5af45d0a9a4d6e08%3A1321185017&click_sum=8de52444&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-40&frs=1&etp=1&sts=1",
    "title": "Personalized Dog Leash Holder, Dog Butt Leash Holder for Wall, Gift for Dogs, Engagement Gift Dog, Mudroom Hook, Dog Hanging Sign",
    "description": "Custom Leash Holder, Wall Hanging, Holder for Wall, 200 Dog SilhoutteThis customizable solid wood leash holder makes the perfect gift. It has wonderful color combinations that contrast with the personalized leash holder, silhouettes and the perimeter border. It has hooks to hang keys, dog collar (half inch in diameter) or harness, waste bag dispenser, lanyards, cables and cords, medals, necklaces, face masks or other small items. Great housewarming, birthday or Christmas gift, or show prize/ trophy for down owners, pet & animal lovers.ABOUT THE PRODUCTWe used 1st class solid wood and metal hooks. There are 4 different color options. You can contact us if you need 4 or more customized dog hangers. Some of our customers said we have 2 dogs and 1 cat. We also made customizations consisting of 2 dogs and 1 cat.The list includes 200 dog breeds. If you cannot find the dog breed you are looking for in the list. You can choose the silhouette closest to you.Please feel free to contact us for your special requests.SIZES1 Dog:   8x8 inches       l     20x20 cm2 Dog:  8x16 inches      l     20x40 cm3 Dog:  8x24 inches     l     20x60 cmASSEMBLYEasy to Mount - On the back of the personalized leash holder for the wall are two keyhole hangers (hardware included) for ease of flush mounting.ORDER CREATION:Please add the order details to the \"Add your personalization\" section.•Write down the breed of the dog  ( If the dog breed is a mix, kindly make sure to select the most suitable dog from the provided list. )•Write the name of the dog•Type which font you want.Example:PitbullLuckyFont 3• Add to card and complete payment.•PROOF •We provide evidence on request only.If you want proof, please specify it in the customization box. Our goal is to get your order to you as soon as possible, which is why we have fast turnaround times. However, please note that if you request a proof, it may cause a delay in the turnaround time.We are happy to provide a proof upon request! Evidence will be sent to you via Etsy Messenger within 2 business days. If we do not receive a response within 25 hours after sending the proof, we will proceed with the order.Please note that although we make every effort to accurately photograph our colors and fonts, there may be variations in colors due to different monitor settings. In addition, it is important to understand that each piece of wood is unique and may naturally contain knots and other markings.SHIPPING TIMES vary depending on your location.All our cargos are sent by Fedex Express as standard.Our estimated shipping timesUSA-Canada: 3-6 working daysEurope: 2-5 working daysOther Locations: 3-8 working days.I suggest you read our store policies for extra taxes and customs fees.Do not hesitate to contact us for any assistance you may need. We are happy to assist. Thank you for your interest.",
    "reviews": [
      "It was a beautiful present. My brother loved the gift.",
      "WE LOVE IT & it was a GREAT gift!!!!!",
      "Great quality and looks fantastic!"
    ]
  },
  {
    "productId": "QpTeaFeuZK",
    "url": "https://www.etsy.com/listing/1370274060/best-friend-gifts-personalized-best?click_key=dd9ffcde0f03ccdb29d41e31b2ec344361187715%3A1370274060&click_sum=3f7b4671&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-41&pro=1&frs=1&etp=1&sts=1",
    "title": "Best Friend Gifts Personalized, Best Friend Birthday Gifts For Her, Friendship Gift, One Line Best Friend Gift For Women, Mother’s Day Gift",
    "description": "✨✨NEW ITEM ✨🤍✨ LIMITED TIME SALE✨✨RISK-FREE ∙ PURCHASEIf you realize after our first conversation regarding your personalization wishes that it’s not the right product for you, then I’ll give you full refund (This term doesn’t apply once I’ve started creating the artwork for you.).CREATED ∙ WITH ∙ LOVE ∙ TO ∙ THE ∙ DETAILAre you looking for a handmade, thoughtful gift for your special someone? Or would you like to preserve precious memories captured in an old picture which maybe doesn't have the best quality? Then you are at the right place! I'd love to create a beautiful artwork for you according to your wishes.H O W ∙ TO ∙ ORDER• Please select in the drop-down list the number of people/pets to be illustrated (e.g. 2 people + 1 dog = select \"3\") and the desired background color (any other desired color is also possible). After the purchase lean back and relax. I'll contact you within a few hours via Etsy Messages. So please check your Etsy inbox regularly. Of course you can also message me first.• I'll ask you for a reference picture and if you have any other wishes.DRAFTSI’ll provide you with drafts of the artwork until it corresponds fully to your expectations.FINAL ∙ PRODUCTDIGITAL FILENo physical items will be shipped.The aspect ratio of the illustration will be suitable for 8x10 inch paper. If you’d like it in any another size up to 24 inches, simply let me know.You can easily print it at home, any copy shop or use an online printing shop like Zazzle or Walgreens. I recommend using heavyweight paper (65 lb / 180 gsm or more). A good quality photo paper (matte / semigloss / glossy) is also a great option.Please contact me if you have any further questions.Let’s put on your loved ones’ faces a lovely smile and a twinkle in their eyes! I wish you lots of joy and happiness with your very special & timeless keepsake.MY ∙ SHOPhttps://www.etsy.com/shop/AnsAtelierI N S I D E ∙ S C O O P• IG: @Ans.Atelier• Pinterest: AnsAtelier | Custom Portraits & IllustrationsThank you so much for visiting and happy shopping! ♡",
    "reviews": [
      "Amazing quality! Customer service was delightful! Planning to order again 😆",
      "Beautiful artwork. Bought as a gift and my friend loved it.",
      "Good quality and the design is like the picture. Love it!🥰"
    ]
  },
  {
    "productId": "fGAhtQFKBc",
    "url": "https://www.etsy.com/listing/1118100665/personalized-full-gray-canvas-apron-with?click_key=de6b6b06c88eac2435345279d5a1977516667e97%3A1118100665&click_sum=cd6db036&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-42&pro=1&etp=1&sts=1",
    "title": "Personalized Full gray canvas apron with adjustable  straps for restaurant,bakery,cafe, kitchen",
    "description": "you will get aesthetic feeling and perfect quality. Any quality problems can be replaced free of charge. After many years of use, you still like this gift.** **  **  **1. Apron size: the fabric part is 82 high and 65 wide, which is suitable for people with a height of 163 ~190cm. The shoulder strap can be adjusted in length, leaving a lot of allowance. This suits more people.2. Applicable to: supermarket employees, coffee shop employees, restaurant waiters, family barbecueparties, best man gifts and other gifts. Provide shop batch purchase services.3. Cleaning: after removing the shoulder strap, it can be machine washed, and the denim will fade.4. After sales, in case of logistics problems, please send me a message and I will check the latest trackingfor you. (if it is finally lost, I will give you a replacement or refund)Enjoy your shopping. Please collect my shop. I will continue to make new products to make this shopbeautiful. You can email me with any questions.  yxn0318 [!at] 163.com",
    "reviews": [
      "Words words words words words",
      "Amazing customer service and beautifully crafted product with personalisation. Thank you!",
      "I was very very happy with the item however delivery took over a month and I didn’t get much help from customer service when I was trying to get information on the delivery",
      "Apron was received as expected, good product."
    ]
  },
  {
    "productId": "DC2OOYGadB",
    "url": "https://www.etsy.com/listing/984132194/personalized-can-cooler-with-bottle?click_key=702f36715e2475e52486fc25fb04adac718a078d%3A984132194&click_sum=ec6fc410&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-43&pro=1&etp=1&sts=1",
    "title": "Personalized Can Cooler with Bottle Opener for Groomsmen Gifts Proposal Ideas",
    "description": "Personalized Can Cooler with Bottle Opener for Groomsmen Gifts Proposal Ideas📝   PRODUCT DETAILS 📝This listing is for ONE (1) personalized Can Cooler and Bottle Opener Keychain.- Can Cooler Material: Vegan leather- Bottle Opener Material: Vegan leather and Stainless Steel- Design: Design is engraved into the can cooler.- Customization: This can cooler can be personalized with the name of your choice. Please include your personalization instructions in the \"Add your personalization\" box.-Can Cooler Size:Height: 3.75\"Width: 4\"-Bottle Opener Size:Height: 2.75\"Width: 1.5\"-Available Colors:BlackChestnutDark Brown*** Capital letters will be used for name unless lower case is specifically requested ***➡️   HOW TO ORDER ⬅️1. Select your desired \"Color\" from the drop down menu2. Add personalization details in “Personalization” box3. Click “ADD TO CART”🛠   PRODUCT CARE 🛠For best outcome, please gently hand wash with warm water, dish soap, and a soft cloth/sponge.  Dry off your can cooler immediately after washing.🎁   HAPPY GIFTING! 🎁Excellent choice, if we may say so ourselves!Our Very Best Wishes to You,Joe & the HisCorner Team",
    "reviews": [
      "Great quality & fast shipping",
      "It was perfect! Thank you!",
      "Amazing service. Would order from this company again.",
      "Was able to help me out when I needed to repurchase more last minute."
    ]
  },
  {
    "productId": "sHUXHZarzS",
    "url": "https://www.etsy.com/listing/1536133569/personalized-engraved-whiskey-barrel?click_key=4edc810cfa297d57b746f4e1ca492e10a68513b0%3A1536133569&click_sum=97cece87&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-44&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Engraved Whiskey Barrel Mini Wood Whiskey Barrel | Wedding Gift | Groomsmen Gift |  Birthday Gift | Wood Barrel | Gift for Him",
    "description": "This is a perfect gift for groomsmen, for a wedding party, or for Father's Day, or for many other occasions!This whiskey barrel is fully functional and can be used to store whiskey or whatever drink of your choice! The inside is lined with a plastic bag, fillable through the spigot, to help keep your barrel clean and to last a long while.This is a steel banded Barrel/Cask and it comes with its own stand (optional), removable spigot and removable bung.Dimensions:3L  - 9 1/4\" long by 6 1/4\" wide, 2 pounds1.5L  - 8 1/8\" long by 5 3/8\" wide, 1.6 pounds",
    "reviews": [
      "The barrel came in extremely quickly and is absolutely gorgeous. The quality is amazing and the etching was correct first time go. My to be wife and I will be filling it on our wedding day. I accidently ordered one that was smaller than I anticipated, but it is so pretty that my partner insisted keeping the size as she wants to display it full time after the ceremony and I have to agree. Couldn't be more pleased.",
      "Looks great haven't got to use yet",
      "My husband loves it, can't thank you enough!",
      "Shipping was very quick. Thank you very much!"
    ]
  },
  {
    "productId": "lqdUUKgokl",
    "url": "https://www.etsy.com/listing/1639687880/customized-hot-stamping-leather-passport?click_key=9f858b70524978012d96adc2611c2966f39c5f9a%3A1639687880&click_sum=bc859654&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-45&pro=1&frs=1&etp=1",
    "title": "Customized hot stamping leather passport cover | Wedding Best man Bridesmaid Groomsman Gift Wedding Travel Gift | personalized Gift for her",
    "description": "The gold-embossed passport holder is an exquisite and personalized accessory designed to protect passports. One of its distinctive features is the unique application of gold embossing on the surface. This craftsmanship not only enhances the visual appeal of the passport holder, making it more splendid in appearance but also adds a sense of luxury and unique personality. Such a design brings a unique sense of identity to the owner.The material of the gold-embossed passport holder typically consists of high-quality synthetic leather, ensuring effective passport protection while providing comfort and softness. The design pays attention to details, considering the size and shape of the passport to ensure a perfect fit without compromising normal usage. Additionally, the use of gold embossing creates a unique gloss and pattern on the surface of the passport holder, attracting attention while showcasing the owner's taste and pursuit of life.Apart from its distinctive appearance, the gold-embossed passport holder features a simple interior design with card slots, facilitating the carrying of credit cards, business cards, and other essential cards for added convenience during travel or daily life.In conclusion, the gold-embossed passport holder serves as both a protector for the passport and a statement piece reflecting the owner's taste and lifestyle. With its exquisite craftsmanship and personalized design, it becomes an indispensable fashion accessory, adding a touch of sophistication and luxury to the owner's travel and daily life.Size: 10.7CM*14.3CMNotice: If you are not satisfied with the goods after receiving them, we can replace them for free. However, customized items do not accept a full refund. We apologize for any inconvenience caused.We provide FREE hot stamping service, please leave your customization information : )If you need laser engraving, please refer to the link belowhttps://www.etsy.com/uk/listing/1557141617/personalized-leather-monogrammed-luggage?click_key=b815c2313b864b13af77fc1d2773c804f1cd4ae0%3A1557141617&click_sum=21b9996b&ref=shop_home_feat_3&pro=1&frs=1",
    "reviews": [
      "As required 😌 No problems with quality or delivery, this was a gift.",
      "Excellent product and makes a great gift!",
      "Highly recommend great seller great product"
    ]
  },
  {
    "productId": "uDLBQQEKFb",
    "url": "https://www.etsy.com/listing/1153444246/personalized-aluminum-wire-bookmark-with?click_key=5a84365460621c27ccdc52f997873f3bb59c4d8d%3A1153444246&click_sum=90a4a2f4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-46&etp=1&sts=1",
    "title": "Personalized aluminum wire bookmark with heart",
    "description": "Personalized aluminum wire bookmark with heartPossibility of making the bookmark for a pocket book format, in this case please let me know in the personalization insertChoice of aluminum wire color:- Golden- Silver- Rosy copper- BlackChoice of word:- Mom- dad- granny- Grandpa- loveFor any other word to enter, please choose “other word” in the drop-down menu, and write A WORD or A FIRST NAME in the personalization insert, please send me a message before confirming the order if you would like more than 'A WORDA good gift idea for Mother's Day, Grandma, Birthday,...The bookmark is wrapped in tissue paperCompletion time 1/2 daysMonjoliprenom",
    "reviews": [
      "Very pretty item, consistent with the description.\nRapid dispatch",
      "Incredible speed! Thank you very much, I can't take a photo because it's still packed! But packaged with care and love! Thank you also for the little note, it always has an effect 🫶",
      "Very fast shipping. I recommend",
      "Very fast shipping. I recommend"
    ]
  },
  {
    "productId": "MBBOPzmXJV",
    "url": "https://www.etsy.com/listing/744106847/personalized-bat-mini-baseball-bat-ring?click_key=bd53ca68e17b329ad82925562cfa8a8290a3c677%3A744106847&click_sum=2378f4f7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-47&pro=1&etp=1&sts=1",
    "title": "Personalized Bat, Mini Baseball Bat, Ring Bearer Gift, Coach Gift, Groomsmen Gift, Custom Engraved, Baseball Bats, Gift for Him, Boys Gift",
    "description": "FOR UNITED STATES FREE SHIPPING ORDERS OVER$35 AND 25% OFF STORE WIDE YEAR END SALEThese personalized mini bats make great gifts for ring bearers, groomsmen, baby shower gifts, birth announcements, graduations, announcements, keepsakes or any other special occasion.These also make perfect team gifts for the season closing.The listing is for 1 Personalized, Custom Engraved Mini Bat.Dimensions: Each mini bat measures 18-inches long and 1-1/4-inches diameter (4-inch circumference)Due to the natural characteristics of wood, the grains and color tones may be different than those pictured.This is an \"engraved\" wood mini bat and when engraved into the bat it is permanent.The engraving will last forever and will not come off like a vinyl sticker or paint.There is NO other color option available.► Please double check the names are correct. We can not fix it after the engraving.► ALL PAINTED BATS HAVE STAPLE HOLES ON THE VERY END OF THE BAT HANDLE USED FOR HANGING THE BATS DURING THE PAINTING PROCESS",
    "reviews": [
      "Just what I was looking for to go in a gift basket for my nephew!",
      "My grand nephew will love this!!",
      "Product came in as described."
    ]
  },
  {
    "productId": "iaOmdipMMR",
    "url": "https://www.etsy.com/listing/1501805164/personalised-initial-name-gold-necklace?click_key=a6c23def8fa88564ee9362c2b33a34c7af477007%3A1501805164&click_sum=297f5a92&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-48&pro=1&etp=1&sts=1",
    "title": "Personalised Initial Name Gold Necklace -Silver Custom Letter Choker- Spaced Letter Necklace - Personalized Gift - Name Jewellery",
    "description": "Personalised Initial Name Gold Necklace -Silver Custom Letter Choker- Spaced Letter Necklace - Personalized Gift - Name JewelleryWelcome to PizumiLondon !Our one-stop shop for stunning and unique silver jewelry is crafted with love, care, and high-quality materials. Whether you're looking for a simple everyday piece or a special statement item, we've got something for every taste and style.Material :• High Quality Handmade 925 Sterling Silver- 18K Gold Plated and 18K Rose PlatedProcessing And Shipping :• All of our products are processing time 1-3 business days.• You can contact us for express shipping options.• You can check our homepage for the most up-to-date delivery times of products.• You can reach our shop and other products from the link below;https://www.etsy.com/uk/shop/PizumiLondonOther Informations :• All items will be shipped in a  gift box.• You can message us for custom design orders.• If you contact us for special designs, we can send you a mock up quickly.• You can contact us for multiple orders.• We can design almost anything you want and create a custom listing just for you. Please request any variations you want as a message.• Please do not hesitate to contact me if you have any questions or concerns. I reply your messages quickly.• Can be used daily if you do not have any particular allergies to the materials used. It does not harm your skin.•  All the manufacturing process takes place in this store, all of our products are prepared by master hands in our workshop. We can answer all your questions about the production part.Thank you for visiting us.",
    "reviews": [
      "Pretty and dainty necklace for everyday.",
      "Amazing quality, have bought for many of my friends and they make great gifts.",
      "This neklace is stunning I am very happy with it will definitely order another one! The lengh is exactly what I was looking for the dispatch was super fast and delivery was also fast 10 out of 10 from me",
      "Good for a gift thanks"
    ]
  },
  {
    "productId": "KSQajfIGdP",
    "url": "https://www.etsy.com/listing/1082733872/14k-solid-gold-name-necklace-name?click_key=d2b0e77233d517cff1947de7ae3bdcdf9a64d5a1%3A1082733872&click_sum=62ea35ae&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-49&pro=1&frs=1&etp=1",
    "title": "14k Solid gold name necklace , Name necklace , Gold name necklace, Name necklace, Personalized jewelry, Personalized Gift, Christmas gift",
    "description": "14k Solid gold name necklace , Name necklace , Gold name necklace , Name necklace ,Personalized jewelry ,Personalized Gift ,Mothers day giftDETAILS__________100%  8k , 14k, 18k Solid goldAll raw materials are  Italia sourcedThe necklace can be personalized with NAME, NUMBER, WORDName size - lowercase letters are approximately 4 mm  and uppercase letters are approximately 6 mmPERSONALIZATION________________See font sample at last imageAT CHECK OUT Leave a note at \"Note to seller\" with NAME/WORD that you'd to have on the necklace, please specify the lowercase or uppercase letters. The necklace will say exactly the same as your note.MATERIALS__________________100%  8k , 14k, 18k Solid gold_______________________________________► PROCESSING & SHIPPING♥ All items purchased will be shipped within 3-5 business days.♥ You can upgrade your shipping to UPS Express during check out if you want it quicker♥Standart Shipping Time : 8-20 days♥ Express Shipping Time : 1-3 business days.► CURRENT PRODUCTION TIMESAll items are made to order so please check the top of our policies page/shop announcement for the most up to date production and delivery times. If you need it sooner, please send us a message on Etsy► EXPEDITED SHIPPINGYou will be able to choose faster shipping options in the drop down menu when you check out. Ship times DO NOT include production times (please see above). However, if you select expedited shipping, we will try to get your order done faster.► PLEASE READ OUR POLICIES► ENTER OUR SHOP HEREwww.etsy.com/shop/YourNamesJewelry………………………………….Gold Name Necklace, Name Necklace, Custom Gold Name Necklace, Gothic Name  Necklace, Solid Gold Name Necklace , Mini Name Necklace  - Gift",
    "reviews": [
      "Beautiful necklace, ordering was easy,shipping was fast! I would shop here again.",
      "Arrived quickly. Ordered with ease.",
      "Bought a necklace for my niece's 16th Birthday. It is beautiful & dainty! Thank you!",
      "Beautiful necklace, good quality. I ordered the wrong size chain so i ordered a extender.just what i was looking for."
    ]
  },
  {
    "productId": "VnJVKWukWg",
    "url": "https://www.etsy.com/listing/1505040618/floral-daisy-girls-personalized-name?click_key=03a93f3f4f99148322a8db4f4cd09cac377ff3ae%3A1505040618&click_sum=7d778485&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-730187-2-50&pro=1&frs=1&etp=1&sts=1",
    "title": "Floral Daisy Girls Personalized Name Sunglasses|UV400 Protection|Toddler Gift|Kids Gift |Kids Personalized Sunglasses Flower girl sunglasses",
    "description": "Simply specify your preferences in the customization box, ensuring that the spelling of the names is accurate, as we will directly copy and paste them onto the sunglasses.Each and every one is handmade by me! That's why I take great care with each pair of glasses to ensure their quality when you receive them. Don't worry, I'll meticulously inspect my orders all the time. Usually, I'll ship them out the day after you place your order because the letters on the glasses need one night to dry!We are thrilled to present our exclusive personalized sunglasses collection, designed to make your little ones stand out from the crowd! These custom sunglasses are perfect for baby girls, toddlers, and children aged 3 to 14. We offer a wide array of vibrant colors to choose from, allowing you to find the perfect match for their unique personal style.Add a special touch to the sunglasses by personalizing them with your child's name or a special phrase. During the order placement process, you can easily enter the desired name and color in the customization box. Each pair can accommodate up to 12 letters, providing you with the opportunity to create truly one-of-a-kind accessories for your children.The safety of your children is our top priority. That's why our sunglasses offer UV 400 protection, ensuring that their eyes are shielded from harmful sunlight. Rest assured, our sunglasses have undergone rigorous safety testing and meet the highest industry standards.Featuring a charming heart-shaped design, these sunglasses add delightful flair to any occasion. Whether it's a casual outing, a family vacation, a beach getaway, a birthday celebration, or even special events like being a flower girl, these sunglasses make perfect accessories. They can also serve as exquisite props in spring and summer photography, capturing those precious moments in a stylish way",
    "reviews": [
      "Cute, affordable, and great quality!",
      "Bought as a gift, absolutely adorable. Would definitely recommend",
      "Came when it said, excellent packaging and great quality. Over the moon with my purchase."
    ]
  },
  {
    "productId": "ODBirkz1Si",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=3eaffcb87f915fb74e6dc4f2a82e83b0245a8532%3A654638870&click_sum=da5e157b&ref=search_recently_viewed-1",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "xmEkOIstqn",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=681cfe54ebc40c9a902cba2b70612837ba1ad11a%3A1355783916&click_sum=1ce4f96c&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!",
      "This amazing hand sketch really captures the soul and spirit of the loving couple - thanks to the wonderful work of M Gokhan who was able to  catch every nuance of expression in the original photo  - a beautiful memory to cherish!!"
    ]
  },
  {
    "productId": "hDZmSkktlX",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=88d1dcf9613550ca9ce625a17a304360af7fa384%3A1411614241&click_sum=f10f830c&ref=search_recently_viewed-3&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "yTFiVTqBbb",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=985fd37d044ae430c808112a5107bfafe0d587c4%3A999136086&click_sum=ab39f2e6&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "qHeEVt2aZA",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=af9bf72399a24e0a2836c6ae087a51d1cebe08a3%3A1440285597&click_sum=cc32096a&ref=search_recently_viewed-5&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!"
    ]
  },
  {
    "productId": "xqcUpyqXKC",
    "url": "https://www.etsy.com/listing/1637362272/bauhaus-poster-set-of-350-premium?click_key=ff2c7fc161f7a87116e04ee2d887b4480bf631ed%3A1637362272&click_sum=64987294&ref=search_recently_viewed-6&pro=1",
    "title": "Bauhaus poster set of 350+ premium printable wall art prints mid century modern minimalist abstract geometric bundle, digital print download",
    "description": "🔷 Dive into the iconic world of Bauhaus with our exclusive 350+ Printable Poster Bundle. This comprehensive collection captures the essence of Bauhaus design principles, featuring modernist elegance and striking geometric abstraction. Perfect for enthusiasts and art lovers, this bundle offers a diverse range of prints to elevate your decor. High-quality digital files make printing easy and convenient. Frame not included, allowing you to curate a personalized gallery wall. Transform your space with this extensive Bauhaus collection that brings timeless design to every corner.🔷 FEATURES:Modernist Elegance: Explore Bauhaus design across a diverse range of prints.Geometric Abstraction: Striking visuals that resonate with contemporary aesthetics.Comprehensive Bundle: 350+ posters for a versatile and curated decor experience.High-Quality Digital Files: Easy printing for a seamless transition from digital to physical.Frame Not Included: Customize the framing to curate your own unique gallery.🔷 PRODUCT DETAILS:Digital Artwork Format: High-resolution files for convenient printing.Personalized Printing: Use your preferred printing service or print at home.Easy Display: Suitable for various hanging and display options.Instant Modern Art: Transform your space with the timeless influence of Bauhaus.Immerse your home in the bold and innovative world of Bauhaus with our extensive poster bundle. Curate your own gallery and redefine your space with modernist elegance and geometric abstraction.---------------------------- I N C L U D E D - F I L E S --350+ plus Design + 5 ratio SizeIncluded are 1750+ plus high res JPG files at 300 dpi ready for instant download/print.If you're having trouble with anything, please feel free to message me.- 4:5 ratio file for printing 4\"x5\", 8\"x10\", 16\"x20\", (24\"x30\") 40x50cm.- 3:4 ratio file for printing 6\"x8\", 9\"x12\", 12\"x16\", (18\"x24\").- 2:3 ratio file for printing 4\"x6\", 6\"x9\", 8\"x12\", 10\"x15\", 12\"x18\", 16\"x24\", 20\"x30\", (24\"x36\").- International paper size file for printing 5\"x7\", A5, A4, A3, A2, A1, A0 50x70cm.- file for printing 11\"x14\".Printable art is an easy and affordable way to personalize your home or office. You can print from home, your local print shop, or upload the files to an online printing service and have your prints delivered to your door!-- NOTE --No physical product will be shipped and the frame is not included. Colors may vary slightly due to different color monitors/printers.-- TERMS OF USE –The artwork of DIGINORM Art Prints is for PERSONAL USE ONLY.We strictly prohibit the use of our digital art files for reproduction in commercial use or resale in any form.Alterations to our artwork in order to use for commercial purposes or resale in any form is NOT permitted.© DIGINORMFor more printable art, check out our home page and explore our extensive range atwww.etsy.com/shop/diginorm",
    "reviews": [
      "good selection of prints and good quality for digital download",
      "Thank you for your wonderful feedback! We're thrilled to hear that you appreciated our selection of prints and found the digital download quality to your liking. Your satisfaction is our ultimate goal, and we're grateful for your kind words.\n\nCreating art that resonates with our customers is what drives us, and knowing that you found value in our prints brings us great joy. Your support inspires us to continue offering high-quality products and service.\n\nShould you ever need anything else or have any questions, please don't hesitate to reach out. We're here to ensure your experience remains exceptional!\n\nWarm regards,",
      "beautiful posters, colorful and very accurate. i love it!",
      "Thank you, Thank you, Thank you.",
      "Great range of pictures sent straight away",
      "Thank you.",
      "Excellent selection. Speedy delivery and would recommend.",
      "Wow! Your feedback truly made our day! We're absolutely thrilled that you enjoyed our selection and that our speedy delivery met your expectations. Your recommendation means a great deal to us, and we're honored to have earned your trust.\n\nCreating art that resonates with our customers is what drives us, and knowing that our pieces contribute to your space brings us immense joy. Your support fuels our passion for creativity and excellence.\n\nShould you ever need anything else or have any questions, please don't hesitate to reach out. We're here to ensure your experience continues to be exceptional!\n\nWarm regards,"
    ]
  }
]
