[
  {
    "productId": "pPwdAIDZsO",
    "url": "https://www.etsy.com/listing/1112152919/whiskey-decanter-personalized-decanter?click_key=796f67fef073059d30bddcc2e947a48f74235872%3A1112152919&click_sum=9b0da216&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-1&pro=1&bes=1&sts=1",
    "title": "Whiskey Decanter Personalized, Decanter Anniversary Gift for him , Decanter Set Housewarming, Decanter Wedding Gift, Retirement Dad Gift",
    "description": "Whiskey Decanter Personalized, Decanter Anniversary Gift for him , Decanter Set Housewarming. Our Scotch Whiskey Decanter set is Personalized with our stylish Designs .Whiskey Lovers will adore this unique Personalized Engraved Whiskey Decanter Glass gift. Each 23.75 ounce Decanter features a stylish engraved design. The perfect Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift. Made and engraved in The USA. Option to Add 2 pcs 10 oz Rocks Cocktail Glasses, Each holds 10 oz of your favorite Spirits.ITEM DETAILS:- GLASS ENGRAVED IN USA- Whiskey Decanter Holds 23.75 oz liquid, Option to add 2 pcs 10 oz Whiskey Glasses.- Permanently Etched , Laser Engraved- Makes a Great Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift- Great addition the Barware or even housewarming wine glass gift.To Personalize items please do the following:1. SIMPLY ADD PERSONALIZATION INFO in the personalization box.You can find many More Unique Housewarming and Gifts for the Couples on our store by Clicking the link below:https://www.etsy.com/shop/PersonalityGiftShop?ref=simple-shop-header-name&listing_id=717905139&section_id=25132821*** Shipping ****   FREE SHIPPING APPLIES TO ORDERS VALUE OVER $35.00 NOT INCLUDING SHIPPING COSTS*****This item ships via USPS. We will send you the tracking number once your order has shipped.We ship to the Continental US . Please contact us for shipping quotes to Hawaii and Alaska.",
    "reviews": [
      "placed a decanter order for my father in law’s birthday. arrived quickly as communicated! we were already thrilled at that, and even more thrilled when we opened the package. super great quality, customization was great, can’t wait to gift it!!",
      "Thank you :)",
      "Nice gift and arrived before time.",
      "Quality item, just as advertised",
      "Great product. Boyfriend loved it."
    ]
  },
  {
    "productId": "jSCggle7tw",
    "url": "https://www.etsy.com/listing/1577232404/personalized-gifts-for-men-engraved-gift?click_key=b1488867af68e9afb0a915248c0385dc71a80394%3A1577232404&click_sum=981afdef&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-2&pro=1&bes=1&sts=1",
    "title": "Personalized Gifts for Men, Engraved Gift for Dad, Valentines Gift for Him, Boyfriend Gift, Husband Gift, Birthday Gifts, Beer Can Coolers",
    "description": "Personalized Gifts for Men, Engraved Gift for Dad, Valentines Gift for Him, Boyfriend Gift, Husband Gift, Birthday Gifts, Beer Can Coolers📝   PRODUCT DETAILS 📝This listing is for ONE (1) personalized Can Cooler and Bottle Opener Keychain.- Can Cooler Material: Vegan leather- Bottle Opener Material: Vegan leather and Stainless Steel- Design: Design is engraved into the can cooler.- Customization: This can cooler can be personalized with the name of your choice. Please include your personalization instructions in the \"Add your personalization\" box.-Can Cooler Size:Height: 3.75\"Width: 4\"-Bottle Opener Size:Height: 2.75\"Width: 1.5\"-Available Colors:BlackChestnutDark BrownWhite*** Capital letters will be used for name unless lower case is specifically requested ***➡️   HOW TO ORDER ⬅️1. Select your Can Cooler Color/ Keychain Style2.Select your Design Choice/ Add Gift Box3. Click “ADD TO CART”4. Add personalization details in “Personalization” box🛠   PRODUCT CARE 🛠For best outcome, please gently hand wash with warm water, dish soap, and a soft cloth/sponge.  Dry off your can cooler immediately after washing.🎁   HAPPY GIFTING! 🎁Excellent choice, if we may say so ourselves!Our Very Best Wishes to You,Joe & the HisCorner Team",
    "reviews": [
      "My boyfriend loved this as a valentines gift!",
      "Great quality and amazing customer service!",
      "Perfect perfect perfect perfect perfect"
    ]
  },
  {
    "productId": "fTdfGQbIUr",
    "url": "https://www.etsy.com/listing/1258337056/personalized-gift-for-him-custom-photo?click_key=063da6a95874ae43c26e283bee4bc7ec2d6b1965%3A1258337056&click_sum=e517e916&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-3&pro=1&frs=1&bes=1",
    "title": "personalized gift for him, custom photo wallet, valentines day gift for men, anniversary gift for husband, pet memorial gift, boyfriend gift",
    "description": "Personalized Leather Wallet, Slim Wallet, Father's Day Gift, Minimalist Leather Photo Wallet, Leather Wallet, Custom Card Holder, Gift for Him, Gift for Husband, Christmas Gift, Personalized Wallet, Groomsmen GiftPRODUCT FEATURES- This wallet is made of 100% Genuine Leather.- High-quality materials were used for this case with Original Full-Grain Cow-Hide Genuine Leather.- It has 1 main money slot and 1 ID slot. Moreover, it has 12 card slots and three of them can hold multiple cards.- It is very easy to carry in your front or back pocket.- Every single one of our beautiful wallets is handcrafted to perfection and subject to rigorous quality control standards. The quality, function, and style in our wallet are unavailable from competing products.- It softens naturally with use and ages beautifully with time. It is a high-quality product that can totally be used for a long time.>>If you are thinking of the perfect gift, this has a nice personal touch of custom engraved monogram, name or initials, or your custom logos such as company, team, or military! It will surely make a great gift for your loved ones or even for yourself!COLOR-Dark Brown-Brown-Antic Black-Antic Gray-Navy BlueHOW TO ORDERSTEP 1: Chose the way you view your finished wallet: Your options are: This will help us place the engraving in the correct place for that style.STEP 2: Chose what you want to be engraved. For this step, you have 3 options.The First option is Monogram/Logo: Select the monogram style you want, then write your letter.The Second option is Phrase: If you want to engrave a Phrase please select one of the four font styles, then write your message.The Third is Handwriting: Send a photo of handwriting via Etsy Message or Mailing at  PrincetonLeather [!at] gmail.comNote: Handwriting should be written on plain white paper. Please remember that higher photo quality will give a better result.STEP 3: Place your order.* Example-1: Design-1: ROBERT* Example-2: Font 2, \"I love you to the moon and back\"* Please type ''No Personalization'' if you select No Personalization>>We are only able to engrave exactly what the customer puts. We're not responsible for any typo provided by the customer. Please make sure everything is correct before you submit the order. We'll do our best to answer any change request, but no guarantee for any changes. It is good for Army, Navy, or Team Logo.>> Same-day free shipping by USPS when you order up to 2 PM (ET)>> %100 Money-back guarantee in 30 days!>>Our wallet makes a perfect gift for him or her on his or her Birthday, Anniversary, Graduation, Wedding, Thanksgiving, Christmas, Father’s Day, or Mother’s Day! Also, it is great for a Boyfriend gift, Husband gift, and Groomsmen gift, even just a treat for yourself!Click \"Add to Cart\" right now and order yours today!https://www.etsy.com/shop/PrincetonLeather",
    "reviews": [
      "It’s perfect! Thank you so much. My husband loves it.",
      "So beautiful and my husband loved it",
      "The seller was extremely sweet and made my order exactly how I wanted it! They shipped it so quick, I just got it and it’s beautiful! Would highly recommend them!",
      "Excellent customer service, nd the product itself was very nice quality though some details were a little lost but nothing to serious overall very happy with the product and the seller"
    ]
  },
  {
    "productId": "eRZRmsbenG",
    "url": "https://www.etsy.com/listing/1332261047/charcuterie-board-personalized-wedding?click_key=dbe5e765e143ba83f74d80fdf0b7a9920d19d70c%3A1332261047&click_sum=526968a7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Charcuterie Board Personalized Wedding Gift for Couples Christmas Gifts for Mom Anniversary Gifts Housewarming Gift for the Home Decor",
    "description": "Charcuterie Board Personalized Wedding Gift for Couples Christmas Gifts for Mom Anniversary Gifts Housewarming Gift for the Home DecoreLooking for a neat, practical personalized gift ? Consider our Charcuterie Board. This Cheese Board makes for a unique wedding gift for couples, a lovely option for personalized Christmas gifts for mom, or a thoughtful housewarming gift for new home decor. Its personalized touch and versatile style make it a perfect present for any occasion. Order now and impress your loved ones with this stylish and functional personalized Charcuterie Board.**Highlights:**- Handmade: Each board is meticulously crafted by skilled artisans, ensuring a premium and personalized product.- Gift wrapping available: We offer exquisite gift wrapping options to make your present even more special and ready to be given straight away.- Materials: Made from sustainable bamboo wood, known for its durability, and easy to clean surface, this charcuterie board is built to last.- Size: The 13\" x 13\" x 2\" dimensions offer a generous space for arranging a variety of deli meats, cheeses, and snacks.**Benefits:**- Personalized gift: The custom engraving option allows you to add the names, initials, or a special message of the couple, making this charcuterie board a truly one-of-a-kind gift.- Versatile use: Besides being an excellent cheese board, it can also be used as a serving platter for hors d'oeuvres, charcuterie, bread, and other gourmet accompaniments.- Elegant design: With its sleek and modern design, this cheese board adds a touch of sophistication to any occasion, from casual gatherings to formal events.- Easy to maintain: The bamboo surface is not only resistant to stains and odors but is also simple to clean with just a mild detergent, making it a convenient choice for everyday use.**Usage:**This personalized charcuterie board is perfect for various occasions. Use it to impress guests at weddings, housewarmings, or Christmas parties. Add a touch of elegance to date nights or gatherings with friends by displaying a curated selection of cheeses, fruits, and appetizers. The board's versatility also allows it to be used as a beautiful centerpiece or a decorative piece in the kitchen.**Quality Assurance:**Our Personalized Charcuterie Board is meticulously inspected to ensure the highest standards of craftsmanship and durability. We believe in using only the finest materials to deliver a premium product that meets your expectations.https://www.etsy.com/shop/UsWoodArts",
    "reviews": [
      "This was a very welcomed gift!",
      "Great quality, delievered very fast",
      "Got it as an engagement gift, she loves it!!!",
      "Awesome thanks, beautiful present for my step daughter"
    ]
  },
  {
    "productId": "WthwTnESZl",
    "url": "https://www.etsy.com/listing/1067408930/wooden-name-puzzle-with-pegs?click_key=894f2354610f8f6ba841f9d5051c7e84c4e8d82f%3A1067408930&click_sum=37fe50f7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Wooden Name Puzzle with Pegs Personalized Gift Baby Boy 1st Birthday Gift for Baby Son Montessori Toys for Toddler Gift",
    "description": "USEFUL GIFT AND EDUCATIONAL TOY.This is the perfect gift for your baby. This puzzle can be presented for a birthday, Christmas, Easter, or just bought as a useful and educational toy.Your kid will easily learn how to spell his name. By folding the puzzle, the child develops motor skills and tactile skills.In addition, the baby will be very interested to know the colors in which the letters of his name are painted. We use only bright colors that the child perceives best.ROOM DECOR.The puzzle can be used as a very unusual and interesting decoration for a children's room.With a puzzle, you can decorate a children's bed, a box with toys, or a door to the children's room.INSTEAD OF A THOUSAND WORDS.You can add an engraved message on the back of the puzzle, absolutely free. Add touching words of congratulations for engraving and this toy will become unique and unforgettable for the baby for many years.SAFETY AND QUALITY.Baby safety is the most important thing for us. We use only natural wood and water-based paint that is absolutely safe for children. All edges and parts of the puzzle are polished to the ideal. We give this particular attention.GUARANTEED DELIGHT.If you do not like the puzzle, we will refund your full price.",
    "reviews": [
      "So far this was great, and adorable for the baby to use. Great quality.",
      "It was perfect, my daughter loves this!!",
      "Order came fast and looks great",
      "Amazing quality. Exactly what we ordered, colours are as advertised and because we bought something else from this seller they gave us a nice discount which was appreciated. Will buy from them again for sure!"
    ]
  },
  {
    "productId": "GoYRpCTgfK",
    "url": "https://www.etsy.com/listing/1005096698/curved-skinny-bar-personalised-message?click_key=86ac5af26b2df532cd137fea2688f6cb8bf3b3c4%3A1005096698&click_sum=35a184d6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-2&frs=1&etp=1&sts=1",
    "title": "Curved Skinny Bar Personalised Message Slider Bracelet • Bar Jewellery • Gift For Her • Mother's Day Gift • Bloom Boutique",
    "description": "𝗖𝗨𝗥𝗩𝗘𝗗 𝗦𝗞𝗜𝗡𝗡𝗬 𝗕𝗔𝗥 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗦𝗘𝗗 𝗠𝗘𝗦𝗦𝗔𝗚𝗘 𝗦𝗟𝗜𝗗𝗘𝗥 𝗕𝗥𝗔𝗖𝗘𝗟𝗘𝗧A delicate and gently curved personalised bar bracelet. This skinny personalised bar bracelet is available in silver, gold and rose gold and can be personalised with up to 20 characters.Featuring a versatile slider style bracelet chain for a perfect fit and an ideal personalised gift for her.We can engrave names, dates or a meaningful quote on this elegant personalised bar bracelet; wear alone or as part of a bracelet stack.This bracelet comes presented in a ribbon-tied luxury gift box, making it the perfect gift for a loved one, or a special treat for yourself.Make Valentine's Day unforgettable with a Personalised Jewellery gift for her.• Personalised with a Classic or Contemporary Message• Offered in three  beautiful colour ways  Silver, Gold and Rose Gold• FREE Luxury Ribbon-Tied Gift Packaging𝗪𝗛𝗬 𝗬𝗢𝗨 𝗪𝗜𝗟𝗟 𝗟𝗢𝗩𝗘 𝗜𝗧• A Stunning jewellery gift your loved ones will treasure• Beautifully personalised ready for any special occasion• Made from high-quality materials𝗛𝗢𝗪 𝗧𝗢 𝗢𝗥𝗗𝗘𝗥1. Simply select the colour of your jewellery from the options provided2. Fill in your required personalisation in the box provided, taking note of any details mentioned in the description.3. Add it to your basket and proceed to checkout𝗢𝗧𝗛𝗘𝗥 𝗜𝗡𝗙𝗢𝗥𝗠𝗔𝗧𝗜𝗢𝗡• ﻿﻿All items are beautifully packaged in a luxury gift box ♡﻿﻿• Can’t find the information you need? Feel free to contact us.𝗣𝗢𝗟𝗜𝗖𝗜𝗘𝗦•https://etsy.me/3MNqYWQ𝗔𝗕𝗢𝗨𝗧 𝗕𝗟𝗢𝗢𝗠 𝗕𝗢𝗨𝗧𝗜𝗤𝗨𝗘•https://etsy.me/3Qikcvg𝗦𝗢𝗖𝗜𝗔𝗟𝗦• Instagram - @bloomboutique_uk• Facebook - https://www.facebook.com/bloomboutiquejewellery𝗠𝗢𝗥𝗘 𝗙𝗥𝗢𝗠 𝗨𝗦•https://etsy.me/3HgOJFX",
    "reviews": [
      "This looks lovely in the box...beautiful and delicate. Bought as a birthday gift for a friend who likes delicate jewelry",
      "Beautiful and delicate bracelet. Arrived super fast in a pretty package. Exactly what I was looking for.",
      "Delivered quickly, good packaging, item as described"
    ]
  },
  {
    "productId": "xdeZHbDODS",
    "url": "https://www.etsy.com/listing/1056917900/personalized-marble-wood-cutting-board?click_key=3473d6ba49e6672695cefcc78f9e83e44cd82e39%3A1056917900&click_sum=43518daa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-3&frs=1&etp=1&sts=1",
    "title": "Personalized Marble Wood Cutting Board, Cheese Board, Charcuterie Board, Anniversary Gift, Wedding Gift, Housewarming Gift, Serving Board",
    "description": "Cheese Board, Personalized Marble Wood Cutting Board, Anniversary Gift, Wedding Gift, Housewarming Gift, Serving Board, Charcuterie Board*By placing this order I agree shipping address is correct! Cannot be changed after order is placed, our turnaround time is too fast to keep up with changes.  All orders are moved to production immediately after order is submitted, please check your shipping address.This beautiful wood and marble board makes an elegant cheese board, charcuteries, and appetizers. Handcrafted from polished marble and solid acacia wood. Each cheese board is unique due to the natural variations of the acacia wood and the marble. Engrave a family name on this elegant cheese board for the perfect wedding, engagement, housewarming or entertaining gift.~ Size:  12.5\" x 8.62\" x 0.59\"~ Acacia wood w/ slim marble~ Care Instructions: Hand wash only with mild soap. Do not soak for long period of time.~ Laser Engraved**Cheese Knives are not engraved.Please be aware that every cutting board is made from different wood and is unique. Due to the nature of wood, some boards may engrave slightly lighter or darker than the photo shows. Natural characteristics of wood will include knots, faint lines in the grain, minor cracks and coloring. Each wooden board is unique due to natural wood elements. If there is a definitive blonde stripe in the wood, it is 100% natural - these cutting boards are not glued together by separate pieces of wood.",
    "reviews": [
      "Beautiful! My cousin loved it",
      "Prefect for a Christmas present!",
      "Such a perfect wedding or bridal shower gift! I’ve ordered multiple cutting boards from here and all have turned out amazing!",
      "My friend really loved it!"
    ]
  },
  {
    "productId": "PUhGcEOtIu",
    "url": "https://www.etsy.com/listing/1296582301/custom-line-drawing-couple-portrait?click_key=92c5cd23195e2f951813e5bb08342d06fc6c8634%3A1296582301&click_sum=689e8891&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-4&frs=1&etp=1",
    "title": "Custom Line Drawing, Couple Portrait, Minimalist Illustration, Custom Art, Anniversary Gift, Line Art, Portrait from Photo, Gift for Her",
    "description": "I will turn your memories into a beautiful custom illustration!email me @  paintyourmoments.etsy [!at] gmail.comTHIS IS A DIGITAL FILE ONLY PRODUCT, NOT A PHYSICAL PRODCUCT.DESIGNYou will recieve your custom illustration via email. The design will be sent in A2 size so it can be easily scaled down to any of your desired sizes. The illustration will be sent in PNG and PDF format.This  is a digital product only, you will not recieve a physical print of the drawing.HOW TO ORDER1.PLACE THE ORDER. Select the number of characters (people, pets…) that will be drawn.2.EMAIL ME. Send me the photo you want me to reference, any text you would like to add aswell as the desired line color.3.REVISION. It can take up to 4 days to prepare your beautiful drawing. After you recieve it I will be available to make  2 free revisions. Just message me via email or Etsy messages.4.FINAL PRODUCT. I will send you the final digital file via e-mail, ready for you to print! You can print the files at home, at a local print shot or using na online service. For help with digital downloads, please visit the etsy help article.https://help.etsy.com/hc/pt/articles/115013328108?segment=shoppingHOW TO CHOOSE A PHOTOPlease be mindful of the angles and overall quality of the photo you want illustrated. A photo with higher resulution will result in a better resemblance of the portraid.The artwork you purchase is limited to personal use only, it cant be used comercially or resold without permission.THIS IS A DIGITAL FILE ONLY PRODUCT, NOT A PHYSICAL PRODCUCT.If you have any questions don’t hesitate to message me, I will help you!  paintyourmoments.etsy [!at] gmail.comThank you for trusting me to draw your beautiful memories and for supporting my art.",
    "reviews": [
      "Great artwork and communication - definitely recommend!",
      "Love it so much... The seller was so lovely and she was patient and spent time making any adjustments I asked her to make no matter how small. I cant recommend enough!",
      "I ordered this as a Valentines Gift and it was great! He was very surprised.",
      "It turned out amazing and the seller made adjustments as needed before the final version was sent. I recommend this business!"
    ]
  },
  {
    "productId": "JJqYxqoEDG",
    "url": "https://www.etsy.com/listing/1265065613/leather-rose-with-a-date-or-initials?click_key=e2a2cd34c82fd39017ee899a0ff5c032f79a7cfc%3A1265065613&click_sum=46e13b5c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-5&pro=1&etp=1&sts=1",
    "title": "Leather Rose with a date or initials // Personalized 3rd Anniversary gift for Her",
    "description": "Leather Rose with a date or initials // Personalized 3rd Anniversary or valentines day gift for Her // HandmadeWe offer a variety of colors Including chestnut, natural, tan, red, sangria, and black. A personalized leather rose bouquet engraved with your special date or initials will be a reminder of your love forever - create a rose arrangement that will not wilt or die.Hand formed with the full grain grade A leather.DETAILS:Stem Length: ~12.25 inchesTotal Length: ~14 inchesDiameter of flower and petals: ~5 inchesMade By: Local Laser CompanyMade In: North Carolina, USA** PLEASE READ **- If you run into any issues with your order we are here to help and just an email away. Please reach out to us at  contact [!at] locallaserco.com- Vase not included. The stem length on the rose works great with a  standard ~9 inch tall vase.LOCAL LASER CO. ~ OUR PROCESSAll of our leather goods are handmade in our shop on the East Coast. We use high quality full grain leather sourced in America to create our products, ensuring that they will last.Many of our leather goods and gifts can be engraved with your personalized message - check out our shop or shoot us a message to find products that can be personalized. We love creating custom leather gifts for Anniversaries, Weddings, Birthdays, and more. Many of our goods are perfect for for the style of rustic home decor or rustic wedding decor.We work hard to ensure your order ships out as fast as possible. Feel free to reach out to us with any questions you may have.",
    "reviews": [
      "So beautiful!  Packaging was a special surprise.",
      "Beautiful work and very fast.  Long stems for creative display.",
      "Beautiful rose and fast shipping",
      "Arrived on time, very gorgeous! Definitely recommend them."
    ]
  },
  {
    "productId": "gkIgG3Chki",
    "url": "https://www.etsy.com/listing/1569412573/mini-custom-watercolor-pet-portrait-dog?click_key=0f3f10e967bea83ca8d4bf5f4bb913ab3d4cccfe%3A1569412573&click_sum=0c39f0c9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-6&pro=1&frs=1&etp=1&sts=1",
    "title": "Mini Custom Watercolor Pet Portrait, Dog Portrait from Photos, Pet Painting, Tiny Paintings, Miniature Painting",
    "description": "🐾 Cherish Your Pet's Love Forever! 🖼️This isn't your average print. Our custom pet portraits are hand-painted by talented artists and printed on high-quality paper. You'll see every brushstroke and tiny detail, making it a timeless keepsake.Your Happiness Matters 🤝🔍We won't ship until you're happy. You can request revisions, but most of our portraits are so perfect, they rarely need any changes. Each piece is tailored just for you.How to Order? 🛒📝1. Place Your Order 🛒: Select number of pets and size.2. Send Us a Photo 📸: After placing your order, send us a photo of your pet by messaging the seller.3. Receive a Proof 🎨: Our talented artist will hand paint your pet portrait and create a digital proof of your pet's portrait. We'll send this proof to you for approval.4. Approve the Proof ✔️: Take a look at the proof and let us know if you'd like any adjustments. Once you're thrilled with the design, give us the green light to proceed.5. Shipping 🚚: Your prints will be carefully packaged and shipped to your addressContact Us 📩🙋‍♀️Got questions? Need help? Shoot us a message! We're here to make your custom request a reality and ensure you're thrilled with your purchase.",
    "reviews": [
      "Perfect gift for a friend who lost her fur baby. Thank you!",
      "Gorgeous painting. I sent a couple of photos to the artist and asked her to take my favorite parts from each photo and put them into one and she did a phenomenal job. I am shocked a human being is capable of creating these photos!!",
      "Needed a touch up and it was done quickly and turned out great!",
      "I gave this as a Christmas gift and it was perfect!"
    ]
  },
  {
    "productId": "CizuElPVUO",
    "url": "https://www.etsy.com/listing/1457505311/baby-blanket-sets-personalized-plush?click_key=74ced7b3f9760a031670a43b21394de4848cb54f%3A1457505311&click_sum=6aedd4ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-7&pro=1&etp=1&sts=1",
    "title": "Baby Blanket Sets - Personalized Plush Minky Name Blankets with Hats or Bows",
    "description": "Create your own personalized baby gift set with our ultra-soft plush minky name blankets and coordinating hats and bows. Our plush minky personalized blanket is our plushest, softest, coziest blanket for babies and toddlers. Use our custom printed blanket sets as a baby announcement prop, newborn gift, baby shower present, monthly milestone backdrop, stroller cover, play mat, or for every day snuggling. Stretchy jersey hats and bows are ultra soft and smooth, and their stretchiness provides a comfortable fit for babies. Hats are newborn size but will stretch up to 3-6 months.- Sets and individual items available, make your selection in the drop down menu- Digitally printed fabric designed with white text and a printed color background- Optional bow and hat accessories- Items are easy to launder and maintain their softness after washing- Blanket printed on one side, the opposite side is solid white- Vibrant, permanent colors will not fade- Fabric thickness is 1/16' to 1/8\" or thickerPreview fonts at www.sugarhouseshop.com/products/previewSIZES - Blanket sizes vary, but hats and bows are only sized for newborns. All sets with hats and bows will have accessories that are newborn size. Blankets are available in 30\" x 40\" for babies and toddlers, 50\" x 60\" for all ages, and 60\" x 80\" for an oversized throw.HAT DESIGN - By default hats will be made with the name centered on the band. If you prefer the repeating name design please leave that detail in the personalization box. Thank you!Colors/fonts used in images:Haze and font miss magnolia for Soloman blanketPink Crepe and font Jonitha for Stella blanketSunset and font apricots for Eden blanket----- HOW TO ORDER -----Select your set option and background color from the drop-down menus, then leave us a comment in the personalization box with these details:1 - name2 - font choice3 - optional detail - if you are ordered a hat and prefer the repeating name design, please leave a comment with that requestPlease double-check spelling and enter your name exactly as you'd like it printed.You can preview your baby's name with the different font and color options here:https://www.sugarhouseshop.com/products/preview (type this link into your browser)----- PROOFING POLICY -----We will print your order exactly as entered. Please review spelling carefully.Because each font and name combination varies, please double-check the preview page on our website to make sure you are happy with the font choice before completing your purchase here on Etsy. We do not send proofs unless requested.----- CARE INSTRUCTIONS ------This product is durable and it can be regularly washed without affecting quality. However, following the care instructions will help your baby's blanket feel brand new and silky-soft for as long as possible.To keep the fibers soft and silky over time, it is very important to avoid fabric softeners when washing this blanket. Many laundry pods contain softeners, and we recommend not using laundry pods for this item.- Wash with detergent only, no fabric softeners- Wash in cold water- Gentle cycle- Wash separately to avoid lint transfer from other textiles- Tumble dry low and remove promptly100% polyester blanket95% polyester 5% spandex hats and bowsBlankets designed and finished in the USA with imported materialsHats and bows made in the USA",
    "reviews": [
      "So soft & exactly what I expected!",
      "The quality is thin enough to keep her not too cool but not too warm and it’s very soft!",
      "Wish the blanket was a little thicker",
      "Good quality \nRecipient loved this blanket and expectations met"
    ]
  },
  {
    "productId": "iYBqHrOnfi",
    "url": "https://www.etsy.com/listing/1484759253/customized-name-night-light-for-baby?click_key=4aaccf5f565c27a881a03ab252f47118d6e99b31%3A1484759253&click_sum=2bd46f5d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-8&pro=1&frs=1&etp=1&sts=1",
    "title": "Customized name night light for baby, luminous animal acrylic board creative night light, kids room gift",
    "description": "🏆I design products, patterns and custom text myself. Hope you enjoy them!❣️The product is divided into 2 parts, one is a luminous acrylic board, and the other is a wooden base, and the different sizes are the acrylic boards.📐Small size（acrylic board）：15 x 13.5 x 0.5 cm, weight: 87g📐Medium size（acrylic board）：15 x 17 x 0.5 cm, weight: 110g📐Wooden base size：14.5 x 6 x 3.5 cm, USB powered, weight: 220g💞Welcome to our enchanting world of luminous acrylic board night lights, available exclusively on Etsy! Add a touch of magic and warmth to any room with these unique and personalized creations.💗Our luminous acrylic board night light is a captivating blend of artistry and functionality. The acrylic board is expertly printed with a delightful animal pattern, exclusively designed by myself. When the light is turned on, the animal comes to life, glowing with a soft and comforting radiance.💓Crafted with care, this night light features a disassemblable design, allowing you to easily customize it to your liking. The acrylic board can be effortlessly removed, providing an opportunity to personalize your night light by write on it yourself with a marker. Make it a truly one-of-a-kind piece that holds special meaning for you or your loved ones.💝Combining the beauty of acrylic board with the natural elegance of a wooden base, this night light is a stunning addition to any space. The transparent acrylic board creates a mesmerizing effect as the light shines through, casting a gentle and soothing ambiance that sets the perfect mood for relaxation and comfort.💟Ideal for bedrooms, nurseries, or any space in need of a soft, comforting glow, our luminous acrylic board night light is a wonderful gift for children, friends, or anyone who appreciates the magic of personalized decor. It adds a touch of whimsy and warmth to any environment, creating a serene and inviting atmosphere.🌈Return Policy:Due to the personalized nature of these products, we are unable to accept returns or exchanges. Once your order is placed and the customization process begins, the night light is specifically crafted according to your specifications. This ensures that each item is unique and created exclusively for you.🌈If there are any errors or defects in the craftsmanship of your custom name night light, we will take full responsibility for resolving the issue promptly and effectively. Please reach out to us within 1 days of receiving your order, providing us with detailed information and clear photos illustrating the concern or problem.🌈While returns are not possible for customized items, we are committed to providing excellent service and ensuring your complete satisfaction. Thank you！",
    "reviews": [
      "It was a beautiful gift for my baby niece",
      "cute night light for baby room",
      "So cute honestly the cutest gift !",
      "Very pleased with my purchase"
    ]
  },
  {
    "productId": "LQquJnyNfT",
    "url": "https://www.etsy.com/listing/1620347235/sea-turtle-wood-sign-gift-for-mom-or?click_key=c7d3d60546c86dea9fc65f8bec3cfd574493c8e1%3A1620347235&click_sum=40fe30bd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-5&frs=1",
    "title": "Sea Turtle Wood Sign, gift for Mom or Grandma, Thanks for having our backs",
    "description": "Showcase your family names with our stunning hand-stained sea turtle sign! With four layers for a detailed touch, each name is expertly engraved, making this a truly special keepsake that's bound to impress! It comes with an easel for easy display and is the ideal gift for Moms or Grandmas who adore turtles. Trust us, you won't find anything else like it!Just pick the names you want engraved before the heartfelt \"Thanks for having our backs\" message. It's the perfect gift for Mom or Grandma!*If you choose 10-15 Turtle names the turtles will be slightly smaller so that they all fit on.DETAILS:• Made in Colorado - Laser cut, Engraved, Hand painted, and stained• Size - Approx. 10\" Round• Includes easel for easy display• Perfect gift for friends and family• A unique keepsake that will be treasured for years!Let us create the perfect gift for you. Your satisfaction is our joy!Please reach out with any questions or special requests.",
    "reviews": [
      "Exactly what was mentioned. Absolutely love it!",
      "Was just how I pictured it",
      "This turned out even more beautiful than I anticipated it would! Seller was very communicative and helpful"
    ]
  },
  {
    "productId": "UXzDLZHMIJ",
    "url": "https://www.etsy.com/listing/1529934015/personalized-cutting-board-engraved?click_key=6da9112a55328337a71252e8a5973ac1e8e7bc62%3A1529934015&click_sum=6dc27f9e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-6&pro=1&frs=1&sts=1",
    "title": "Personalized Cutting Board Engraved Engagement Unique Wedding Gift Home Warming Present",
    "description": "FREE SHIPPING**Select \"With Priority Ship\"  for faster ship times!!!Personalized for you, each order is handled from start to finish with care.Our commitment to you is that we will make sure your personalized cutting board experience with us is great! We know how stressful buying a gift someone special can be, and we are here to help. A Personalized cutting board is a great Wedding gift, Home Warming Gift, Engagement Gift, Anniversary Gift and a wonderful \"Thank You\" Gift and a thoughtful way to show someone you care.Thank you for allowing us to be a part of your Happy Occasion.Engraving InfoWe will engrave the exact words you write in the personalization box.We engrave 3 lines as shown in the listing photosEnglish Letters and Numbers OnlyContact us for Custom RequestsSpecificationsSize:    16 x 12 x 1 inchesShape:    Rectangular with Corner HandleWeight:    3.5 PoundsMaterial:    Acacia WoodQuality:    Crafted with organic Acacia WoodTough:   At 1\" thick, this board reliably handles chopping, slicing and carvingLight:   As though as it is, this cutting board is light and easy to handleDesign:   A Convenient Handle and a Deep Juice Groove are necessary in the kitchen.Clean-Up:   Easy Handwash Clean-Up, wipe down and air-dry!.::Note::.Acacia wood has a diverse palette of wood colors, each board is stunning and unique.  These cutting boards are hand wash only, use mineral oil regularly and store in a cool and dry place to keep the board in excellent condition.Engagement Gift, Anniversary Gift, Bridal shower Gift,  Romantic Gift, Wedding Gift, Christmas Gift, Fathers Day Gift, Valentines Day Gift,Mothers Day Gift,",
    "reviews": [
      "Needed a little extra something for a wedding gift.  Not only was this priced perfectly but it arrived within a week!!  Beautiful craftsmanship!! \nWill def order again  !",
      "Would definitely use again in the future",
      "I ordered two for our closest couple friends for Christmas and they turned out beautiful."
    ]
  },
  {
    "productId": "FvefpAEZhX",
    "url": "https://www.etsy.com/listing/745383234/personalized-flask-for-men-leather-flask?click_key=ca7900195c9e5d08ead0bb70b546f6fbc6ef02ef%3A745383234&click_sum=4cf08d24&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-7&pro=1&pop=1&sts=1",
    "title": "Personalized Flask for Men, Leather Flask, Flask Personalized, Flask Leather, Flasks",
    "description": "Personalized Leather Flask!Perfect Groomsmen gift and Groomsmen Proposal!Professionally Laser Engraved to provide precise detail of design for your gift!Multiple Color Options Available with Personalization Engraving!Measures:6 Ounce Flask - Perfect Size to fit in your pocket4\" X 4.5\"",
    "reviews": [
      "These turned out perfect! Love",
      "Loved them! They was perfect",
      "Great for my best man!"
    ]
  },
  {
    "productId": "LhWBSCjkfD",
    "url": "https://www.etsy.com/listing/484674282/groomsmen-gift-proposal-wedding-party?click_key=f59a84a804ccd7aa9b7fab43a787ca6afe806105%3A484674282&click_sum=bcd92014&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-8&pro=1&sts=1",
    "title": "Groomsmen Gift Proposal Wedding Party Gifts Set of 9 Leather Toiletry Bag Travel Shaving Dopp Kit for Men Groom Gift For Him Graduation Gift",
    "description": "Dopp Kit - Pricing includes embroidery.Affordable gifts for the Groom, Fathers, or Groomsmen on your wedding day. Spacious to hold personal toiletries and belongings. Great as gifts and every day use.♥ Shaving Bag Details:· Material: PU Faux Soft Leather· Measurements: 8.5 x 6 x 4· Interior: Polyester Lining· Zipper Closure· Side Loop♥ Embroidery Options: Max 3 letters· 1 Letter, 2 Initials, or 3 Letter Initials (first, middle, last)♥ Add-On Rush Fees:· Ship within 14 days ($25)· Ship within 7 days ($50)♥ Note for 3 Letter Initials for Men· Men Initials should be in first, middle, last and will be embroidered same size across.♥ SHOP POLICIES:· By purchasing any listing from Love Meets Craft, all buyers acknowledge that they have read and understand the \"Item Details\" described in all listings and shop policies. Thank you.· All items are made to order.· Shop cannot be responsible for incorrect initials provided.• Due to variation between every monitor, smart phone and tablet display, the colors shown may appear different in person.· Personalized gifts do not qualify for returns. If there is a mistake, please contact us.· Customer satisfaction and happiness is our number one priority!♥ All images are property of Love Meets Craft",
    "reviews": [
      "I ordered one of these Dopp kits for each of our groomsmen. The quality is lovely and the stitching of the monogram is perfect on each. This vendor is kind, easy to correspond with and pays attention to detail. I highly recommended Annie!\nLori Harrison",
      "10/10! Highly recommended, would order again!",
      "Love these bags!! Great groomsmen gifts",
      "Such a great wedding present!"
    ]
  },
  {
    "productId": "CXGOiGVmaV",
    "url": "https://www.etsy.com/listing/1343876435/bridesmaid-makeup-bags-personalized?click_key=5fd1100511bfef6ec55d6253e9b38c4c847595fd%3A1343876435&click_sum=f365c5f0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-9&pro=1&etp=1&sts=1",
    "title": "Bridesmaid Makeup Bags, Personalized Cosmetic Bags, Bridesmaid Proposal Gifts, Make up Bag (BR036)",
    "description": "Personalized makeup bags make the perfect gift for bridesmaids, best friends, or a special treat for yourself! Add the custom make up bags to any bridesmaid or maid of honor proposal box for the perfect personalized touch. Cosmetic bags are a cotton canvas with gold zipper and soft satin interior lining.✨PREVIEW NAME OR TEXT✨https://app.fontvisual.com/showcases/5a07ffb5-10a1-410c-98e5-76da01f013f7* HEART IS GLITTER UNLESS SPECIFICALLY ASK FOR \"NON-GLITTER\" *♥ HOW TO ORDER ♥1) Select options for any Dropdowns (see photos for options)2) Enter information in the Personalization Box3) Click \"ADD TO CART\"4) Go back to listing and repeat as needed5) Confirm Shipping Address and Complete Checkout!♥ SIZING AND ITEM DETAILS ♥◆ VIDEOS ARE TO SHOW BASIC ITEM DETAILS ONLY / REFER TO EACHLISTING FOR FONT / DESIGN / COLOR OPTIONS ◆▹ Listing photos contain sizing, details, and color options.▹ Cotton Canvas▹ 9\"x6\"▹ Gold Zipper▹ Design is professional vinyl decal▹ WORDING ALL LOWERCASE; NO CAPITALS OR SPECIAL CHARACTERS✧ Glitter Heart Color Options:• Gold Glitter (Pictured)• Silver Glitter• Black Glitter• Champagne Glitter• Rose Gold Glitter• Navy Glitter• Plum Glitter• Pink Glitter• Burgundy Glitter♥ PROCESSING & SHIPPING ♥▹Shipping (re-shipment fee) must be purchased for packages returned due to incorrect address to be mailed again.▹ You will be emailed with shipping confirmation and tracking once your order ships.✧ PROCESSING ✧• Times vary by design style.• Please message us for accurate turnaround on a specific item.✧ SHIPPING ✧• Times are typically between 2-10 business days:• Shipping times are ESTIMATES ONLY; actual delivery time can be faster or may be delayed.• Holidays, natural disasters, and other special circumstances can delay delivery.• We are not responsible for shipping delays, and do not guarantee any specific delivery date.♥ CARE INSTRUCTIONS ♥▹ See package insert for all care instruction.♥ DISCLAIMER ♥▹ Verify all information including spelling and address before ordering.▹ Due to the nature of our items, we are unable to accept returns, exchanges.▹ Cancellations and changes can not be made to orders once purchased due to fast processing times.▹ Colors can vary from screen monitors to physical products.▹ For any Rush Order, we must be messaged for accommodation and purchase Rush Upgrade BEFORE ordering.▹ We are not liable for delays due to missing information, shipping delays, or any deadlines.▹ Read shop \"POLICIES\" for more information.♥♥ Any other question or concern, please message us directly! ♥♥",
    "reviews": [
      "Great product, super budget friendly",
      "Great and cute bags! Bigger than I thought they were going to be",
      "Highly recommended! Super cute. I'm not having bridesmaids but I'm giving my bffs gifts like they are haha"
    ]
  },
  {
    "productId": "kelsIxPdnB",
    "url": "https://www.etsy.com/listing/259853170/crystal-cage-necklace-handmade-gift-for?click_key=4123e2bd85f2ab7f03c1f4c530a8e3737b95ba34%3A259853170&click_sum=c6ace5f8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Crystal Cage Necklace, Handmade Gift for Her, Mom Wife Sister Mother's Day Birthstone, Personalized Grandmother Grandma Gemstones Daughter",
    "description": "The perfect personalized gemstone birthday Gift. Customized for your Mom, Wife, Girlfriend or any other special person who loves handmade jewelry!Short version 1. Pick the cage style you'd like.2. Pick the chain length3. In the \"personalization\" section let me know the months or birthstones you'd like for your cage pendant.This is my best seller and most popular design! Create your own personalized necklace with birthstones to represent your mom and dad, your husband, wife and children, boyfriend or girlfriend, sisters, you and your best friend... there are so many possible combinations. I even once made a cage necklace to represent a litter of puppies!!I love being able to create something special and sentimental for you and your loved ones.I make these lovely little pendants using a variety of raw gemstones from around the world and have given you a choice of eight styles of cages with your choice of up to five birthstones in the larger 18mm silver, gold or gunmetal cage or up to three if you choose the smaller 15mm cage. I always try to find the best stones for each cage. If you have something in mind that you don't see, let me know. I sometimes have alternate gemstones in my collection that can be used.1. SM Golden Bronze Cage 15mm - After much demand I've finally added this pretty light gold cage with matching plated chain. The cage is plated brass. Can fit up to 3 stones. (about the size of a dime)2. LG Golden Bronze Cage 18mm- After much demand I've finally added this pretty, light gold cage with matching plated chain. The cage is plated brass. Can fit up to 5 stones.  (about the size of a quarter)3. LG Silver Plated or Sterling silver cage and chain- Same design but one is plated all silver plated or all sterling silver. Fits up to 5 stones. (about the size of a quarter)4. LG Gunmetal Cage 18mm - Darker metal with polished gold top and matching dark chain -up to 5 stones.5. SM  Gunmetal Cage 15mm - Darker metal with polished gold top and matching chain - up to 3 stones.6. New Design- LG Sterling silver cage and chain with gold top. Same as the ALL sterling cage but with a mixed metal look -up to 5 stones. (about the size of a quarter).7. New Design- SM Sterling Silver Cage and chain with Gold top 15mm. (about the size of a quarter)How To OrderStep 1:Select the style of cage you'd like with the drop down menu at the side.Step 2:Select the chain length you'd like with the drop down menu. The standard length is usually 18\" or 20\" but some customers like longer chains so that is also an option.Step 3:Lastly in the \"personalization\" section please list which stones you'd like to represent your family or friends. The birthstones are illustrated in the second to last picture.................................I do have some alternate stones if you have some other ideas in mind. There are quite a few steps in ordering this necklace so please convo me if you have any questions!***  For more lovely Gemstone Necklaces check out my shop section here ***https://www.etsy.com/ca/shop/whatanovelidea?section_id=16220363&ref=shopsection_leftnav_10",
    "reviews": [
      "really nice gift for my wife.",
      "So happy your wife liked her gift! Stop by any time.",
      "The necklace I ordered was a complete shot in the dark as a Valentine's Day gift as I had never shopped on Etsy, didn't know the merchant, or anything about the likely outcome of this transaction. I just liked the design and the idea. The necklace arrived sooner than I expected and absolutely exceeded my expectations in every way. It's beautiful and very well made. My wife loved it. The person building the necklace even contacted me to ask a question about the choice of birthstone I made to ensure I got what I was expecting. That's great customer service! Obviously I would recommend this company and this product to anyone.",
      "Thanks so much for your comments. I'm so happy your first experience on Etsy was a good one and that your wife liked her Valentine's Day gift. Stop by any time!",
      "I purchased this as a Valentine's Day gift and my wife loved it.   I would shop with this person again.  Great quality and it arrived on time.",
      "Thanks for your feedback. I'm so glad your wife loved her gift!",
      "The necklace came out beautiful, my girlfriend loved it. Thank you so much",
      "I'm so glad you're happy with your purchase!"
    ]
  },
  {
    "productId": "gEWuspelDx",
    "url": "https://www.etsy.com/listing/1455826393/recipe-book-to-write-in-your-own-recipes?click_key=9ffcd174b8c0bdd17571ee62c0badc068112377a%3A1455826393&click_sum=2a43a79d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-11&pro=1&frs=1&etp=1&sts=1",
    "title": "Recipe Book to Write in Your Own Recipes Mothers Day Gift Recipe Scrapbook Blank Recipe Notebook Cookbook Personalized Mom Birthday Gift",
    "description": "Preserve your cherished family recipes with Redberry Guest Books' beautifully handcrafted wooden recipe book. Made in the USA, our recipe books feature customizable maple or cherry wood covers, engraved with your choice of designs to make it truly one-of-a-kind. Our high-quality acid-free paper ensures your recipes are safely stored for generations to come.A wooden recipe book is not only a practical addition to your kitchen but also a delightful heirloom to pass down through the family. Celebrate the joy of cooking and the memories made in the kitchen with this elegant and timeless keepsake.I N C L U D E SThe listing offers a custom engraved recipe book.• The book comes in either 6\" x 9\" or 8.5\" x 11\" size• The text on the book can be personalized based on the sample provided• You can choose from 30, 45, or 60 sheets of acid-free paper, blank or lined, with or without divides.*Due to wood's organic nature, your product may differ from the photo in terms of knots, dark spots, grain, and engraving darkness. These variations make each book unique.H O W ∙ T O ∙ O R D E R• Choose your book size and timber• Select a paper quantity & paper type• In the personalization box leave the following details:1) Screw Color: Gold, Black, Silver, or Copper.2) Vegan Leather Binding Color:3) TEXT to be engraved:Names: (ie: \"Mom's favorite\")Date: (ie: \"recipes\")*Any other details, such as special design requests and timing deadlinesT U R N ∙ A R O U N D ∙ T I M ETo ensure a speedy turnaround time, we do not send proofs of cover designs prior to production. If there are any questions about the requested details, we will reach out via Etsy message for clarification.Once we receive your order, we aim to ship your book within 1-2 business days.The transit time to US addresses is typically 2-3 business days, but this may vary depending on the chosen shipping method at checkout.𝗙𝗔𝗤:https://www.etsy.com/shop/redberryguestbooks#more-section*Please message us with any questions or for custom requests.………………………………….………………….………………………………© 2023 RedBerryGuestBooks",
    "reviews": [
      "My book turned out perfect! So excited to write my recipes and be able to pass down my memories. My only suggestion to the seller would be more “Ingredient” line. Other than that, 10/10! Thank you 💖",
      "Product was excellent and just as advertised. Beautifully produced and executed just as requested. My wife loved it! Well worth the money. \n\nShipping was prompt and arrived without issue. Would definitely recommend and would use this shop again!",
      "Gift for my mother in law, she loved it!"
    ]
  },
  {
    "productId": "ZVSrE1pHxF",
    "url": "https://www.etsy.com/listing/1107739224/personalized-boyfriend-bracelet-custom?click_key=81a5decc2a578a8dccf98dd2d488bf4a386b0d71%3A1107739224&click_sum=ecb4f295&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Boyfriend Bracelet, Custom Boyfriend Anniversary Gift, Engraved Mens Jewelry, Mens Bracelet For Boyfriend, Gifts For Him",
    "description": "► PERSONALIZATIONThis personalized leather bracelet makes a unique gift for your man for any special occasion. Keep it close to his heart with his loved ones' names/ message, making it a unique gift for an anniversary or his birthday.► PRODUCT DETAILS• Materials: 2 stainless steel magnetic clasps & PU leather cord.• Clasps size are approx 15/16'' x 3/8'' and 3/8'' x 3/8''• Clasps' finishing color: silver• Word limits: 5-7 words for long side / 2-3 words for short side► SIZING:• Size S: wrist size (6 1/3 inches;  16cm)• Size M: wrist size (7 inches; 18cm)• Size L: wrist size (8 1/2 inches; 20cm)• Size XL: wrist size (9 1/2 inches; 22cm)► HOW TO ORDER• Fulfill all the options including finishing color, leather band color, size and quantity.• Add the item to cart.• Choose your quantity and add to cart• In the \"Note for seller\" box, please leave the initials/name/message to be engraved on each side of the silver charms• Default font is FONT 3. If you want a different font, please leave me a note in the \"Note for seller\" box► TURNAROUND TIMEAll items are made to order so please check our announcement for the most up to date production and delivery times.If you need it sooner, please send us a message on Etsy to see if we can meet your deadline. You can also expedite your shipping via delivery option upon check out. This does NOT change production times.____________________________More designs from us:https://www.etsy.com/shop/GiftStablePlease read our policies for more purchase information and FAQs",
    "reviews": [
      "My boyfriend loved his present and we were both impressed by the quality.",
      "This is such a manly bracelet and well made. I bought it for my son and he was really pleased with it. I ran into a slight problem and the customer service I received due to my misunderstanding was timely and top notch! I will definitely consider products from this company again!",
      "Excellent quality and amazing gift for Valentine’s Day!"
    ]
  },
  {
    "productId": "yWhny1fUIi",
    "url": "https://www.etsy.com/listing/1305431270/moon-and-flower-custom-name-light?click_key=4aaf57137392508436a757dc47922a61bc70c700%3A1305431270&click_sum=4ccd5206&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-13&pro=1&etp=1&sts=1",
    "title": "Moon and Flower Custom Name Light | Personalized Bedroom LED Cloud Decor Sign | Light up Sign | Daughter gift Sign /Office Decor / Girl Gift",
    "description": "They are two types of gifts, the ones you ask, \"who gives me this?\" and the ones that make you remember that special person.It's time to add a special touch to your room, with these beautiful wooden custom night lights.Our lamps are made in the USA and will be a perfect gift for any event.❤ Nursery rooms.❤ Office.❤ Graduation.❤Weddings.❤ Birthdays.❤ Christmas❤ Baby shower❤ Home warming party.❤ Baptism.❤ or any other occasion❤ Lamp details5\" wide by 8\" tall.Cast 5mm acrylic for better results.Laser engraved in our studio in Florida.Super-Fast ShippingOn/off switch.Warm or cool white❤Other details.The buyer is responsible for any customs fees (Which don't apply to the USA)We don't take returns, but if we make a mistake, we will send a new lamp the next day.Acrylic slides into the base to add a lovely touch to any room.We also love to do custom work.We can also add a gift note in the box without extra charge.Our custom-led light sign is perfect for any space (bar, desk, garage, nursery, Mancave, shop, coffee area) and on all occasions (Christmas, Baby shower, gender reveal, birthday, graduation, mother day, father day)",
    "reviews": [
      "I loved this LED light!",
      "I gave this as a gift to a friend. As soon as she received it, she put it in her baby's nursery. She loved it!",
      "Great quality,  color and style, highly recommend",
      "Great quality,  color and style, highly recommend"
    ]
  },
  {
    "productId": "qveykHPpS8",
    "url": "https://www.etsy.com/listing/1391197911/car-painting-from-photo-car-paintings?click_key=fce8e7e6de84ebc273f616e697c4f70af317b773%3A1391197911&click_sum=5e1e390f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-14&pro=1&frs=1&etp=1&sts=1",
    "title": "Car Painting From Photo, Car Paintings, Car Drawing from Photo, Custom Watercolor Portrait,Personalized Gift for Boyfriend, Gift for Him",
    "description": "ADD-ONS:Combining multiple photos (adding person/pet from separate photos):riverrystudio.etsy.com/listing/1590576994Background add-on ($25):www.etsy.com/listing/956027552Digital file add-on ($10) :www.etsy.com/listing/901256888Rush 2-day processing add-on ($30) :www.etsy.com/listing/918935889To add a gift message, please add this to your order:www.etsy.com/listing/1476123399Our custom watercolor car painting is a perfect way to memorize one's loved ride. It will make a perfect gift for your father, husband, boy friend or any car enthusiast.Unlike digital illustrations or photoshopped images, our watercolor paintings truly reflect the spirit of your house with its soft colors and subtle nuances.Your custom portrait will be hand-painted by real watercolor artist and reproduced at the finest quality. Printed on premium heavyweight 320 gsm cotton-rag textured paper and LUCIA Pigment archival inks to reflect the true watercolor quality. You will see every single brush stroke and smallest intricate details of your house in this print. This print will last for a lifetime, guaranteed.We only ship out after you approve the artwork. You can request revisions until you are totally satisfied. This piece will be 100% custom tailored for you.• 100% hand-painted by talented watercolor artists• Unlimited revisions• Approve before shipping• Current artwork creation time:  5-7 days• Shipping time (US):  3-5 days• Shipping time (international):  14-20 days--------------------------------------",
    "reviews": [
      "My dad LOVED the picture of his old car brought to life!",
      "It was a hit with my Husband.",
      "The painting came out beautiful! It was honestly perfect, and the customer service was excellent!"
    ]
  },
  {
    "productId": "aUPrTcrHEc",
    "url": "https://www.etsy.com/listing/1524552023/dainty-gold-birthstone-necklace-in-cube?click_key=ea6e6b0abd35834b21174ae137bea154a8d5c3d1%3A1524552023&click_sum=49079ba9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-15&pro=1&frs=1&etp=1&sts=1",
    "title": "Dainty Gold Birthstone Necklace in Cube by NeshelyJewelry, Custom Birthday Gift for Her, November Birthstone Jewelry",
    "description": "Discover the beauty and significance of birthstone jewelry with our exquisite Birthstone Necklace. Each necklace features a carefully selected gemstone that represents the birth month of your loved one, making it a meaningful and personalized gift. Choose from an array of birthstone options, each with its unique color and symbolism. Whether it's the deep blue of sapphire for September, the rich red of garnet for January, or the lush green of emerald for May, there's a birthstone that resonates with every individual. The pendant is delicately set in a Sterling Silver setting, adding a touch of elegance and refinement.• BIRTHSTONE SIZE: 5 mm * 5 mm• M A T E R I A L925 Sterling Silver• F I N I S HSilverGoldRose• C H A I N  L E N G T H14 inches (35 cm) -- Suitable for kids 5 years old or under 5 years16 inches (40 cm)18 inches (45 cm) -- More Women's Choices20 inches (50 cm)22 inches (55 cm)24 inches (60 cm)(Please leave a message any other lengths upon request.)These necklaces beautifully catch the light and leave a gleaming impression! Energetic, unique, and wonderfully dynamic. Like you, our Necklace is full of personality! It makes for a glorious gift or a personal treat for yourself. :)• P A C K A G EComes with a stylish gift box• G I F T  N O T EIf you want to include a short gift note while ordering, we will be happy to add a short handwriting gift note within your order. Please let us know your message at checkout.• B E S T  G I F TThis necklace can be a special gift for your lover, boyfriend or girlfriend, best friend or family. Each jewelry will be packaged in a beautiful gift box, suitable for Birthday, Graduation, Anniversary, Christmas, Thanksgiving Day, Party Wedding and Valentine's Day.• H O W   T O   O R D E RChoose the finish: Gold, Silver, RoseChoose necklace length: 14” to 24” availableAdd your personalization: Type the birthstones of your choice in the personalized box. For example: January• Please let us know if you need help with your order.",
    "reviews": [
      "great gift for anyone in your life",
      "Bought as a gift for my niece. She loved it. It was very pretty & well made.",
      "Bought this for my friend and she loved it",
      "Described as dainty and, yes, it's definitely dainty"
    ]
  },
  {
    "productId": "UbQAvBxTsi",
    "url": "https://www.etsy.com/listing/1101992367/personalised-i-love-you-more-the-end-i?click_key=fe547dddfb9b837f9c2ff4e4fcb9a7fec07c01a7%3A1101992367&click_sum=a7c94a5d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-16&frs=1&etp=1&sts=1",
    "title": "Personalised I Love You More The End I Win Metal Wallet Card - Sentimental Romantic Keepsake Gift for Boyfriend, Girlfriend, Valentines Day",
    "description": "KEY FEATURES•\tHigh-quality brushed silver aluminium metal wallet card•\tWallet card dimensions are approx. 5.5cm x 8.5cm•\tComes with its own envelope and organza gift bag. Or choose to upgrade to a premium gift box with ribbon•\tPersonalise with the 'Love _____ xxx' name•\tThe perfect size for keeping in a wallet or purse, so your heartfelt message can be carried by your loved one wherever they goRemind your nearest & dearest how loved they are by presenting them with a metal wallet card.Ideal for a small Christmas, Birthday, Valentine’s or Anniversary gift.This romantic keepsake comes personalised with the ‘Love _____ xxx' name.To make this extra special we include its very own envelope and organza gift bag. Choose from the drop-down menu to advise us which colour gift bag you would like. Or choose to upgrade your gift bag to a premium gift box with ribbon.ABOUT DRIFTING DUCKSAt Drifting Ducks we have established a reputation for providing a great variety of gifts, and are specialists in the field of sublimation printing which fuses images/text to products meaning no fading or cracks.All our items are thoughtfully designed, carefully created, and lovingly packed by partners James & Laura within our Ribble Valley workshop.We sell tens of thousands of gifts per year meaning you can shop with confidence.We offer free standard UK delivery and fast dispatch on all items.Visit our Etsy shop for more great personalised gifts!https://www.etsy.com/uk/shop/DriftingDucks",
    "reviews": [
      "Arrived promptly and exactly as shown in picture",
      "Nice item, well packaged recommended",
      "My bf loved it, and the items quality was amazing!"
    ]
  },
  {
    "productId": "eEVWBQDwPG",
    "url": "https://www.etsy.com/listing/870439619/personalized-leather-mens-wallet-gift?click_key=74c1fd40af1d1b3dee90720a51b2ec7ee31c7aae%3A870439619&click_sum=1f08185a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather Mens Wallet, Gift for Father's Day, Dad, Boyfriend, Him Husband, Handwriting Engraved Custom Wallet, Anniversary Gift",
    "description": "🔹  Personalized Leather RFID Blocking Men's Wallets, Bifold Wallet, Gifts for Father's Day, Him, Husband, Dad, Boyfriend, Anniversary gift, Groomsmen Gift, Wedding Gifts Graduation Gifts, Monogrammed Gifts, Engraving Initials & Quotes l Vegetable Tanned Full-Grain Leather Wallet with RFID Blocking:🟢   Do you need a high-quality, protective wallet that will hold your valuables in a secure and stylish way? You have come to the right place!🔵   Our wallets are made from the finest vegetable-tanned full-grain leather. The perks of having the wallet made from premium quality full-grain leather makes the wallet age backward; the color becomes more vibrant and pretty.🔴   Alongside its durability, our wallets are built-in with RFID blocking to protect your identity so that it doesn’t go into the wrong hands. The high-quality nylon lining inside the wallet protects against bad odor and sweat. It is also easy to clean.⚫️   Add a personal touch to this wonderful wallet by engraving and adding a quote to the side of your choice!🟠    This wallet is a perfect present for Your Loved Ones for their Birthdays, Anniversaries, Weddings, graduations, Father’s Day, and many more! Get this gorgeous gift for that special person or as a present for yourself!🟣   Our wallet has the capacity of 11 card slots and 1 NON-REMOVABLE flip-up transparent compartment for IDs, photos, etc.🟤   Get your own CaglarCreations wallet to melt hearts and impress your loved ones or get it as a special present for you!♦️Dimensions♦️4.3\"*3.5\"0.6\"💕💞💞 ENGRAVE OPTIONS 💗💘💖🖤  FRONT SIDE: INITIALS OR NAME OR DATE OR LOGO🧡  BACKSIDE: INITIALS OR NAME OR DATE💜  INSIDE RIGHT: NAME OR INITIALS OR QUOTE or LOGO or HANDWRITING💛  INSIDE LEFT 1: NAME OR INITIALS OR QUOTE or HANDWRITING🤍  INSIDE LEFT 2: NAME OR INITIALS OR QUOTE or HANDWRITINGNOTE: Inside personalization can be up to 4 lines and 4-6 words per line.We can engrave any Font, Logo, or emojis. Please mention the font and size that you want. If YOU DON'T MENTION YOUR REQUEST, WE USE Times New Roman and medium font. (We do not accept responsibility for customers' typos.)-You can send your images from the message section.💻💻 You can send your image/logo via  caglarcreations [!at] gmail.com*** Front side Small Engraving size: 0.31\" (8mm) {The first picture brown wallet: (JLJ)}*** Front side Medium Engraving size: 0.39\" (10mm) {The 6. picture Dark brown wallet: (MVS)}*** Front side Large Engraving size: 0.47\" (12mm) {The 9. picture black wallet: (AJM)}😘😘😘 Would you like DISTRESSED LEATHER? Here is the link: 👇👇👇https://www.etsy.com/ca/CaglarCreations/listing/926179598/personalized-mens-distressed-full-grain?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1610594978418***SLIM WALLET LINK***https://www.etsy.com/ca/CaglarCreations/listing/1014885981/personalized-mens-full-grain-super-slim?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1621190834706🔹  Personalized Leather Men's Wallets, Gifts for Father's Day, Him, Husband, Dad, Boyfriend, Anniversary gift, Groomsmen Gift, Wedding Gifts Graduation Gifts, Monogrammed Gifts, Engraving Initials & Quotes l Vegetable Tanned Full-Grain Leather Wallet with RFID Blocking",
    "reviews": [
      "Exactly what I was looking for and what was pictured. Quick dispatch and delivery.",
      "Very beautiful. Exactly what I wanted",
      "Great quality, very pleased with our purchase!"
    ]
  },
  {
    "productId": "dibuCDUgzm",
    "url": "https://www.etsy.com/listing/1438733237/custom-leather-belt-custom-engraved-mens?click_key=497ed9b113ea7c77a77c92ca3255e9e507e255e1%3A1438733237&click_sum=2bf38c1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Valentines Gift for Him, Boyfriend Valentines Gift Ideas",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift IdeasThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Custom Leather Belt, Custom Engraved Men's Belt, Anniversary Gift for Husband, Christmas Gift for Him, Boyfriend Christmas Gift Ideas",
    "reviews": [
      "Be mindful of sizing.  I ordered based on jeans waist size and it was too small for the recipient. While we're stuck with that one, the seller offered to make a new one for only $15. Hope seller adds measurement details to their listing.\nGreat belt!",
      "This was an anniversary present that looks amazing.",
      "My boyfriend loves it! It is great quality and durable. The perfect gift!"
    ]
  },
  {
    "productId": "VSOidoePvC",
    "url": "https://www.etsy.com/listing/1433308623/real-estate-closing-gift-housewarming?click_key=5c407f093ff996727221fcf4a6354c7765b3271c%3A1433308623&click_sum=23ae4c7c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-11&pro=1&frs=1&sts=1",
    "title": "Real Estate Closing Gift, Housewarming Gift, New Home Gift, Personalized Cutting Board, Wood Cutting Board, Logo Advertising",
    "description": "Real Estate Closing Gift, Housewarming Gift, New Home Gift, Personalized Cutting Board, Wood Cutting Board, Logo AdvertisingA personalized cutting board makes the perfect gift for your real estate closings!  Give your clients a UNIQUE and personal gift where they will remember your name every time they use it.All cutting boards are 3/4 inches thick unless otherwise noted.Any design is interchangeable on a different board! If you don't see exactly what you're looking for, let us know and we can design something just for you!ORDERING INSTRUCTIONS:1. CUSTOMIZE - Enter LAST NAME and ADDRESS (can also do EST DATE or FIRST NAMES instead) in the \"Note to Seller\" box at checkout - please be sure to double check names/dates that you enter as we cannot accept returns unless the error was made on our end.2. BOARD TYPE - Choose your board size and type from the drop down menu. The following options are available:9 x 12 Maple9 x 12 Walnut9 x 12 Arched Maple*9 x 12 Arched Walnut*9 x 12 w/Handle Maple9 x 12 w/Handle Walnut10.5 x 16 Maple10.5 x 16 Arched Maple*10.5 x 16 Walnut10.5 x 16 Arched Walnut*  (shown in THIS listing)* denotes juice groove is included, board will be engraved on OPPOSITE side of juice groove***If you do NOT want certain words included in your design, please specify this in your note at checkout. For example, if the design shows \"The Smiths\" and the buyer places their order with the name Johnson in their note to seller at checkout, their cutting board will read \"The Johnsons\" unless specifically noted they want it to read only \"Johnson\" without \"The\".***All of our custom cutting boards are made from high-quality American-sourced lumber. Each cutting board is examined carefully prior to beginning the engraving process. Each board is sanded and finished with a high-quality food grade butcher block conditioner made from mineral oil and natural waxes so the cutting board will be immediately available for use upon arrival.Please be aware that every cutting board is made from different wood and is unique! Some boards may engrave slightly lighter or darker than the photo shows.",
    "reviews": [
      "Cannot wait to give this gift.",
      "I loved it. Excellent material!",
      "Loved it! 3rd order from them."
    ]
  },
  {
    "productId": "vogFbIJFwk",
    "url": "https://www.etsy.com/listing/1511022246/personalized-groomsmen-toiletry-bag-gift?click_key=d2985e7c2146de025d1183bfdac52305c5e108ab%3A1511022246&click_sum=45901eca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-12&pro=1&frs=1&bes=1",
    "title": "Personalized Groomsmen Toiletry Bag Gift, Groomsman Gift, Groomsmen Proposal, Groom Gift Idea, Engraved Groomsmen Gift Personalized Dopp kit",
    "description": "Personalized Leather Dopp Kit, Third Anniversary Gifts For Men, Leather Toiletry Bag, Birthday Gift For Dad, Valentines Day Gift For Him, Dopp Kit, Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for HimMaterials: %100 Genuine Full Grain Cowhide Leather, Italian Leather, Distressed Leather, Reliable Smooth Heavy-Duty Zipper**Get it fast! Free Ships out by USPS when you order up to 2PM(ET) from New JerseyITEM SIZEXL Dopp Kit:Approx. 9.5\" x 4.5\" x 4.5\"Large Dopp Kit:Approx. 8.25\" x 4.25\" x 4.25\"Small Dopp Kit:Approx. 7\" x 3.9\" x 3.9\"COLOR OPTIONS-Light Brown-Dark Brown-Blue-Antic BlackPERSONALIZATION INSTRUCTIONSWe will engrave your initials, names or monograms to the bottom right corner of the bag. Also we can engrave your handwriting, messages or pictures such as family photo, pets photo, team logo groomsmen photo ect. to the middle of the bag. Please specify your personalization request at the personalization section.HOW TO ORDER________________________________1. Please Select Your Quantity, Color and Size then Add This Listing to Your Cart.Example: Design 9, Groomsmen, Anthony,Example: Design 11, SFR, 7/2/2023Example: Design 1, Anthony2. At the checkout page, enter the personalization information for the item in the labeled box 'Note to CraftCornerHouse'.👀👉Please don't forget to specify which design you want.👈🏽👀If you don't specify which design you want,I use \"Design 6\" for Initialsand \"Design 3\" for Names as the default design.► We love custom orders, so if you don’t find what you are looking for or if you have a custom idea please contact us.If you are looking for a perfect men's gift, you need to look no further. We use premium-grade leather to produce beautiful handcrafted and extremely durable toiletry bags which are a timeless classic gift for any occasion: Birthdays, Father's Day, Graduations, Weddings, Travels, you name it.***Want to order 9 or more items? Contact for bulk pricing!If you have any questions or need help regarding our products, get in touch with us!Thank you for visiting our shop!",
    "reviews": [
      "Fast turn around and great quality.",
      "Wonderful job, on time and as expected.",
      "Very friendly and easy to communicate with. Very fast shipping and happy with the end result!",
      "I love the quality of the kit! This was a great Valentines gift. They loved their name being engraved/ embossed on the side."
    ]
  },
  {
    "productId": "xOCUiyT5xO",
    "url": "https://www.etsy.com/listing/1220160801/custom-monogram-cocktail-ice-cylinder?click_key=4e7b87759e0d2e75e5b7cde436c851869a4f548a%3A1220160801&click_sum=53a216e0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-17&pro=1&frs=1&etp=1",
    "title": "Custom MONOGRAM Cocktail Ice CYLINDER Tray, Personalized Silicone Cocktail Ice Cube Mold, Fathers Day Gift For Him, Ice Stamp",
    "description": "Unleash your inner mixologist with our custom ice cylinder mold! Thanks to its surface-to-volume ratio, ice cylinders actually dilute your drink less than standard ice cubes. They also look super chic in a round rocks glass. So it turns out circles aren't completely pointless! (You’re welcome, fellow dad joke enthusiasts). Bemold custom ice molds effortlessly transform any beverage into an extraordinary work of art. Cheers!FEATURES:- Makes ice cylinders 2.2 inches in diameter - perfect for a standard rocks glass- Personalize each ice cube with up to three initials in the classic round monogram style- Soft silicone remains flexible when frozen, making removing cubes a breeze- Made-to-order by a small business in Concord, Massachusetts- Designed to last a lifetime- Lids are NOT available for this mold type.MATERIALS:- Food grade silicone- Free of BPA, lead, and phthalates- Dishwasher and oven safe up to 400FMEASUREMENTS:- 2 cylinder ice tray: 4.8” length x 2.5” width x 2.3” height- 4 cylinder ice tray: 6.2” length x 5.6” width x 2.3” height- 7 cylinder ice tray: 7.4” length x 6.7” width x 2.3” height- Ice cylinders: 2.2” diameter x 2.0” height--HOW TO ORDER:Please type the initials from left to right in the EXACT order you want them to appear on ice. For an individual’s monogram, it is traditional to arrange the initials from left to right as first name, last name, middle name. So for Sarah Jessica Parker, you would type SPJ. For a couple’s monogram, it is traditional to arrange the initials from left to right as one person’s first name, the shared last name, and the other person’s first name. So for Victoria and David Beckham, you would order VBD. To see how your initials will appear, please reference the style guide in the product photos.Please note that the beloved round monogram style requires letters to conform to a circle. As a result, some letters may look unusual depending on their placement. For the full monogram alphabet, please reference this link: https://tinyurl.com/mdxmcm5sVisit our shop or to find our listings for ice trays that allow you to include plain text or a custom logo / graphic!--TIPS FOR PHOTOGENIC ICE:1. Use distilled water: Tap water naturally contains impurities which cause white cloudy balls to form in the cubes as they freeze. To minimize cloudiness, we recommend filling your mold with distilled water, which is free from impurities and is readily available at grocery stores for about $1 per gallon.2. Remove air bubbles: The surface of your ice cubes may have pockmarks created by air bubbles that were stuck inside your design or clinging to the walls of the ice tray when frozen. Prevent this by using a chop stick or butter knife to release any visible air bubbles from the mold before freezing.3. Temper the ice: Before putting the ice in your drink, place it on a dinner plate for a few minutes to allow it to warm up slighty. This prevents it from cracking as soon as it hits the room temperature liquor.4. Allow frost to form: As the ice warms up outside of the freezer, moisture in the air will condense on the surface of the ice, creating a nice frost that makes the appearance of your monogram much sharper. That's the secret to our photos!5. Keep it dry: here's our spin on the old adage - ice before liquor, design fades quicker. Liquor before ice, stays looking nice. In other words, carefully add your tempered, frosty ice cube to your drink last to keep the design dry. If you pour room temperature liquor over your frosty design, it will quickly vanish, and you'll be quite disappointed!--BULK ORDER INQUIRIES:Send us a message with your quantity and delivery timeframe and we'd be happy to get back to you with pricing!POLICIES:- Our refund policy is available upon request.- Our return/exchange policy can be located at the bottom of every listing.- Have a question? The best way to contact us is to send us a direct message.*Due to the nature of our production process and order volume, all delivery dates are subject to change.",
    "reviews": [
      "This is a great gift idea! It's very sturdy and well-made.",
      "Great Christmas gift! Exactly as pictured.",
      "Love it!  A great gift idea too!",
      "Product is Great! Eager to use."
    ]
  },
  {
    "productId": "AOiFmbMX5J",
    "url": "https://www.etsy.com/listing/61928874/personalized-wedding-and-anniversary?click_key=738819eb78484196103f04682f4b53ca16aef54d%3A61928874&click_sum=036b2ced&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-18&pro=1&etp=1&sts=1",
    "title": "Personalized Wedding and Anniversary Pottery Gifts",
    "description": "Marriage Crock (Size: 7.5\" x 5”)Zotter The Potter stoneware will be a cherished remembrance and will add a warm touch to any home year round. Our high quality handmade pottery makes the perfect keepsake and will be treasured forever. Just give us the names and date, and we'll take care of the rest.HOW TO ORDERIn \"Note to Seller\" section at checkout - please include the following (you can copy & paste the below paragraph into the Note section).Top Arch (max. 17 characters):Bottom Line (max. 15 characters):Logo SelectionPlease feel free to contact us with any questions you may have. We look forward to working with you!Customer Emails:I just this minute presented the vase I ordered for my son and daughter-in-law\\'s 10th wedding anniversary. It is more beautiful in person...almost as beautiful as their smiles when they received it! A heartfelt thanks to you and all your potters for the rare opportunity to present custom, hand-made meaningful gifts to those we love. Teri S.I look forward to receiving the Marriage Crock.Your special was so timely as a grandson just announced his May marriage.This will be the third generation to have your wonderful Marriage Crock.It is becoming a family tradition!-Barbara C",
    "reviews": [
      "The vase has become a wedding gift tradition in my family and it’s just perfect.",
      "Great product. As described. Seller very responsive to questions",
      "Great item quality. Wife loved it!"
    ]
  },
  {
    "productId": "LrXuXWzQif",
    "url": "https://www.etsy.com/listing/1040998957/engagement-gift-couple-unique?click_key=8ea58c1d8a521ec6262b1b7afddea6ed18523013%3A1040998957&click_sum=350569d5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-19&pro=1&frs=1&etp=1&sts=1",
    "title": "Engagement Gift Couple, Unique Personalized Wedding Present, Personalised Wedding Gift, Engraved Chopping Board, Ocean Resin Cheese Board",
    "description": "Engagement Gift Couple, Unique Personalized Wedding Present, Personalised Wedding Gift, Engraved Chopping Board, Ocean Resin Cheese BoardOur most sustainable and eco-friendly chopping board to date! This gorgeous one-of-a-kind ocean resin art chopping board has been completely handcrafted on the Sunshine Coast, Australia. We pride ourselves on creating beautiful, high-quality and practical gifts that you can mindfully gift to your friends and family.SPECIFICATIONSDimensions : 360x145x26mmMaterials: Epoxy Resin, Camphor Laurel WoodHandmade in AustraliaWANT TO ADD EXTRAS?Coastershttps://www.etsy.com/au/listing/1071678970/resin-coasters-set-laser-cut-coasters?click_key=ab65461ee7386057ec88e510489faaf0413b5b7f%3A1071678970&click_sum=bd78aecb&ref=shop_home_feat_2&frs=1&bes=1&sts=1Bowlshttps://www.etsy.com/au/listing/1086226727/resin-dip-bowl-charcuterie-bowl-serving?click_key=1b90a5d91f1033aca68d23330232214ba91fed5d%3A1086226727&click_sum=45df095f&ref=shop_home_active_11&frs=1&crt=1&sts=1Knifehttps://www.etsy.com/au/listing/1071692756/resin-art-cheese-knife-personalized-gift?click_key=99a3240762d5592a283861b6d3039a113b517b8f%3A1071692756&click_sum=680a983b&ref=shop_home_active_10&crt=1&sts=1KEY FEATURESHigh Quality- Heat resistant and high strength epoxy resin are used.- Our epoxy resin is one of the best on the market and is UV resistant meaning the colours won't fade or yellow- We use thick, high grade, hardwoods to ensure they withstand the test of timePractical- Not only will this stunning resin cheeseboard bring joy every time you look at it, but it is also incredibly versatile and built to last- It can be used as an everyday chopping board, a serving platter or charcuterie boardSustainable- Camphor Laurel is a local wood that is deemed an invasive species, harvesting this wood has a net positive impact on our environment- We source locally produced materials- All of our manufacturing, office and dispatch processes are powered by solar, clean energy!- Our workshop and shipping methods have an emphasis on reducing, reusing and recyclingMeaningful- All of our creations are entirely handmade, everything that leaves our studio has been made with ultimate love and care- Resin is a very organic fluid medium, when we use it to create, this factor naturally makes every creation 100% unique- Our resin cheese boards make the perfect gift. Our creations promote intentionality and mindfulness when gift-giving. A unique, handmade itemHOW LONG WILL IT TAKE TO ARRIVE?We ship from the Sunshine Coast in Australia and dispatch all our orders within 1-2 business daysDomestic (Australia) : Shipment will arrive within 1-2 business days if express post is purchased. Regular post can take anywhere from 2-7 business days.International: Shipment will arrive within 7-9 business days if express post is purchased. Regular post can take anywhere from 13-21 business days.If you need your item quickly, let us know in the order notes!IMPORTANT CUSTOMS NOTE: Please note that it is up to the customer to be aware of any import duties and taxes that will be payable on importing Australian goods into your country.FOOD SAFETY AND RESINWe only advise the resin is used for incidental food contact with foodstuffs e.g nuts, biscuits etc.The resin should not be cut on directly. The resin is just for decorative purposes.The resin is Certified ASTM -D 4236 non-toxic. However, it is still a chemical product and we advise you to adhere to the above safety standards",
    "reviews": [
      "Beautifully made and love the personalization!",
      "Insane fast shipping, top quality item and even the packaging is great. Definitely recommend this seller and their product. Thank you",
      "I bought this as a wedding gift for my good friend and she absolutely loves it.",
      "I bought this as a wedding gift for my bestfriend who recently got married on the beach. Not only was I thoroughly impressed, but so were the bride and groom. The craftmanship and detail is second to none & looks exactly the same as the pictures shown. 10/10 recommend!"
    ]
  },
  {
    "productId": "oYrZXqPPKc",
    "url": "https://www.etsy.com/listing/266089640/personalized-skyline-jewelry-dish-ring?click_key=c4107054ce237f51b88bdeaaac738cdd8891c3c0%3A266089640&click_sum=b9917782&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-20&etp=1&sts=1",
    "title": "Personalized Skyline Jewelry Dish, Ring Dish, Catch all, Personalized Gift, Anniversary Gift, Engagement Gift, Wedding Gift, Custom Gift",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.TO ORDER:Purchase the listing, put the city and any personalization (name, initials...) you would like in the personalization box.  Send over a photo (or a few) of the landscape you are wanting painted on the dish with any specifications you have. If we have questions or need to make any major adjustments, we will contact you first!Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "It’s so cute! Better than I imagined! Will def purchase again for gifts. ;)",
      "The perfect keepsake and gift for newlyweds! Cannot wait to use at our upcoming wedding",
      "Beautiful work, just like i imagined & my friend loved it as her engagement gift!",
      "Beautiful. Came exactly as expected, would recommend and purchase again!!"
    ]
  },
  {
    "productId": "XQFkaPPkQX",
    "url": "https://www.etsy.com/listing/1374175358/family-game-night-score-tracker?click_key=bc36aab163061d459a091bb10889651f0d253333%3A1374175358&click_sum=6c8d19e1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-21&pro=1&frs=1&etp=1&sts=1",
    "title": "Family game night score tracker, personalized game night score card",
    "description": "Are you ready to elevate your family game nights to a whole new level of excitement and competition? Say goodbye to dull, forgettable scorekeeping with our handcrafted Personalized Family Game Night Score Tracker! This is not just any scorecard—it's a cherished keepsake that captures the laughter, the friendly rivalries, and the unforgettable moments of your family's favorite tradition.Crafted with love and attention to detail, our score tracker is made from premium, durable materials designed to withstand the excitement of countless game nights. Each scorecard is sized perfectly for any game table, measuring a convenient 5x7, 8x12 or 11x16, and can easily be customized with your family's name or a special message, making it uniquely yours. The surface is smooth and easy to write on, and the card can be easily wiped clean after each use, ensuring it stays pristine game after game. The dry erase board comes with a dry erase marker.But what sets our score tracker apart is the personal touch.  Whether it's for keeping score during board games, card games, or any other family game night challenge, this score tracker is versatile and user-friendly.Step up your game with this unique, handcrafted score tracker that's as special and unique as your family's game night. It's the perfect gift for yourself or for a loved one who treasures quality time spent with family. Don't settle for less—add a personal and creative touch to your game nights and enjoy watching the leaderboard change in style!",
    "reviews": [
      "Great gift selected the larger size.  Perfect for the card players in your life.",
      "I gave these away as Christmas gifts. The recipients loved them. A great gift for card/board game enthusiasts. Very nice quality and fast shipping.",
      "Bought as a gift for an upcoming wedding and am so excited about it! It’s so cute!"
    ]
  },
  {
    "productId": "lmGKCAtKtx",
    "url": "https://www.etsy.com/listing/978400628/children-personalised-bag-duffle?click_key=63fe2c9f8dbf8af4277c03a8161b96632268a7df%3A978400628&click_sum=df2a3318&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-22&pro=1&frs=1&etp=1&sts=1",
    "title": "Children Personalised Bag /Duffle Bag/Monogrammed Weekender Bags/Baby Bag/Hospital Bag/Personalized Children Gift/ Overnight BEBE Bag /SMALL",
    "description": "Take your little one's sleep over to the next level with our new range of personalised bags.Our new child's duffle bag is made from premium cotton canvas and is the perfect size for all of the mini bèbès in your life.Matching powder coated hardware - Includes premium zipper at top main closure, with additional shoulder strap.Fully lined in cotton with small zipper pocket insert.Length of bag is 41cm.The embroidery colours and font of each name are set as per the images above. These can not be altered and are designed to match back to the bag colour. The sequence of each letter colour will continue for names with more characters than those shown.Our current turnaround time for personalisation is 7-10 business days (this does not include delivery time, allow 2-5 business days for worldwide delivery).Price includes embroidery, simply add your embroidery details as below:HOW TO ADD MONOGRAMMING DETAILS:1. Choose your bag colour from the dropdown menu at the right.2. Add your personalisation requirements;EXAMPLE 1) Bag Colour: Navy | Name: JACOBEXAMPLE 2) Bag Colour: Lilac Stripe | Name: HARPER2. Add this item to cart.3. If you require more than one item, repeat the above steps until all required items have been added.4. You can then proceed to checkoutPlease note: Le Rose will use their discretion on the sizing, position and spacing of the embroidery.",
    "reviews": [
      "Absolutely adore these outfits..can't wait for baby shower",
      "Have ordered many of these bags. Amazing quality, fast turnaround and the seller is very helpful.",
      "I ordered this bag for our daughter before she was born to pack items for the hospital in and the quality has been great. We have used it when packing for her for every trip since then and decided to order a second one for our son now that we are expecting again. Something they can hopefully use for many years to come!"
    ]
  },
  {
    "productId": "pSqjMxXXMP",
    "url": "https://www.etsy.com/listing/1242856900/personalized-velvet-jewelry-box?click_key=e4d327cc2ece92cd0cb8d4ad8502e725e1506ba5%3A1242856900&click_sum=63b072fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-23&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Velvet Jewelry Box | Bridesmaid Gifts Proposal | Custom Travel Jewelry Case | Wedding Gifts | Birthday Gifts for Best Friend",
    "description": "Elegant velvet jewelry box with custom name is a perfect gift for bridesmaid, maid of honor, bride, best friends, Mom, wife, girlfriend and more......Made of high quality velvet and suede, this box can be used to store jewelries, earrings, rings, bracelets or necklaces. The handy size 3.9\" x 3.9\" x 2\" allows it to be carried everywhere and  also a great partner for travel.Product details:Material: Velvet,  suedeSize: 3.9\" Length x  3.9\" Width x  2\" HeightBox color: light pink, dusty pink, mulberry, champagne, emerald, mint, midnight blue, baby blueMonogram color: Gold, silver, blackHow to purchase:1) Choose your box color from the drop down menu2) Choose font sytle and monogram colorYou can choose the font style and font color you wish. We offer \"DIY\" choice as well if you' d like to put on the sticker personally. The jewelry box will not be customized with any text then, instead of it, we will send a \"bride squad\" sticker in black font color to you.3) Add to cart4) Leave your name and placement in the personalization box.5) Click proceed to checkout to complete your orderHow to care:*Dry cleaning, using a soft bristled brush to wipe away any dirt or spots.*If the stain is still there, spot-clean it with a small amount of vinegar and water. Use a damp cloth to gently rub away stains.*Avoid soaking it in water.* About shipping *DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysInternational Shipping Note:*Please leave contact number for international shipping.*All duties and taxes shall be paid by customer.Therefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.--------------------------------------------------vintage jewelry box, bridesmaid proposal, travel jewelry box, maid of honor gift, bridesmaids gifts, jewelry organizer, mothers day gift, jewelry holder, wedding favor, travel jewelry case, gift for mom, gift for her, jewelry box, bride gifts, bridal shower gift, bridal party gift, anniversary gifts, gift for her",
    "reviews": [
      "Great gift, beautiful and quick shipping",
      "So cute! I ordered this for a friend who travels regularly. She adored it.",
      "It was so cute! I wrapped the gift before I could take a picture but the graphics were pretty good and it looks like good quality!",
      "Soooo beautiful! Even better in person. Color is gorgeous. I also requested it be delivered by a certain date and they made that happen. Definitely recommend!"
    ]
  },
  {
    "productId": "EHtMTMImOr",
    "url": "https://www.etsy.com/listing/1455703670/copper-heart-for-7th?click_key=17af91999f5496425e860370208616992e831d42%3A1455703670&click_sum=3ff62412&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-24&frs=1&etp=1&sts=1",
    "title": "Copper Heart for 7th Anniversary,Personalized 7th Anniversary Gift,Copper Anniversary Gift for Her,Wedding Anniversary Gift,Gift for Wife",
    "description": "Celebrate your 7th wedding anniversary in style with a truly unique and special gift - a stunning sculpture of two hearts, handcrafted with care and personalized with your names and wedding date. Made of high-quality steel and finished with a beautiful copper patina, this sculpture is forged by skilled artisans.Presented in a stylish gift box, this sculpture makes the perfect gift for your beloved partner, a lasting symbol of your love and commitment. Whether displayed proudly in your home or office, this sculpture is a constant reminder of the bond you share.With its charm and personalized touch, this sculpture is sure to become a cherished keepsake that you and your partner will treasure for years to come. The personalization is engraved by hand, making this gift truly unique and special.So why wait? Order your custom-made sculpture today and make your 7th wedding anniversary a truly unforgettable occasion. With its stunning design and personalized touch, this sculpture is the perfect way to show your partner just how much they mean to you.Overall dimensions (cm)13.5 cm х 10.5 cm х 9 cmAll our products are made to order with special attention in our workshop. These are absolutely unique handmade products.",
    "reviews": [
      "Lovely gift for daughter's 7th wedding anniversary, really pleased.",
      "Beautiful , perfect anniversary gift",
      "The item was quite pricey as I had to pay extra on delivery.",
      "This was the best for my daughter's anniversary"
    ]
  },
  {
    "productId": "CDMnYXvhus",
    "url": "https://www.etsy.com/listing/1664104246/14k-solid-gold-handwritten-name-necklace?click_key=853a8d3da94186e8c41e68db276803b4c9dc519e%3A1664104246&click_sum=20bf4c45&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-14&pro=1&frs=1&sts=1",
    "title": "14K Solid Gold Handwritten Name Necklace, Custom Name Necklace, Personalized Gifts, Mothers Day Gift for Mother, Anniversary Gift",
    "description": "💎 Material Excellence: Luxuriously crafted from your choice of the finest metals—14K gold, timeless rose gold, or sleek white gold—our Custom Name Necklace is synonymous with elegance and durability.🌟 Personalized Touch: Tailor-made just for you, the necklace showcases your or a loved one's name in a beautiful script, making it a one-of-a-kind piece that holds personal significance.🎁 Perfect Handmade Gift: Conceived and created with passion and precision, this necklace stands out as a thoughtful and unique gift, befitting occasions like Mother's Day, anniversaries, or birthdays.👩 Cherished by Women: Designed to be cherished by women of all ages, this 14k name necklace exudes sophistication, making it an ideal accessory for moms, sisters, or that special someone in your life.✨ Memorable for Mothers: Celebrate motherhood with this gold name necklace—a gift that will remind every mom of the love and appreciation you hold for her, today and every day.🛍️ Personalized Gifts Elevated: Our necklaces are not just jewelry; they are personalized gifts that carry emotion, making them perfect for commemorating special moments and relationships.🎉 Versatile Celebrations: Whether it's an anniversary surprise, a gift for your sister on her birthday, or just a treat for yourself, this necklace is designed to delight on any joyous occasion.💖 Customizable Charm: The artistry involved in the crafting of this Letter Name Necklace allows for each piece to be customized ensuring that your necklace is as unique as your personal story.🌐 Accessible Luxury: With the fusion of fine materials and personalization, this gold necklace celebrates the intersection of luxury and accessibility, perfect for adorning necklines everywhere.👌 Quality Promise: Rest assured that our commitment to quality is uncompromising, delivering not only a beautiful necklace but also a piece of artistry you can trust.💝 Heartfelt Appreciation: Thank you for choosing our handcrafted jewelry to represent the precious names and moments in your life. Your support brings our designs to life and makes every creation that much more special.🛒 Gratitude for Visiting: We are honored you've considered our shop for your heartfelt gifting needs, and we thank you sincerely for stopping by. Here's to finding the perfect expression of love and appreciation, hand-forged in gold.🌟 Discover the epitome of elegance and personal touch with our 14K Gold Custom Name Necklace. Crafted with precision and care, this necklace is a true testament to the beauty of bespoke jewelry. Perfect for commemorating special moments or as a daily luxurious accessory, this necklace is designed just for you.🔨 Each necklace is handcrafted by skilled artisans, ensuring no two pieces are the same. Meticulously shaped and polished, your custom name becomes a timeless piece of art.✨ Made with the highest quality materials, you can choose from classic gold, romantic rose gold, or sleek white gold to match your personal style and preference.💝 Whether you're looking for the perfect Mother's Day gift, a thoughtful present for her, or a special treat for yourself, this necklace is a gift that keeps on giving.🔠 Customize it with any name or word that holds a special place in your heart. With every glance in the mirror, be reminded of what matters most to you.📏 Tailor the length to fit you perfectly, ensuring that your necklace sits just right, complementing any outfit you choose to grace.💎 Embrace the fusion of luxury and personalization, and watch as the necklace becomes an instant favorite in any jewelry collection.🎁 Arrives in a beautiful package ready to gift, making it an effortless and unforgettable gesture of affection.👑 Revel in the confidence that comes with wearing a piece of jewelry that is uniquely yours, setting you apart from the crowd.🛒 Thank you for considering our 14K Gold Custom Name Necklace for your special someone or yourself. By choosing our handcrafted necklace, you're supporting artisan craftsmanship and a small business.💕 We are thrilled to have caught your eye and can't wait to create a masterpiece just for you. Thank you for exploring our shop and entrusting us with this special creation.✨ Personalization at its Finest: Experience the joy of wearing or gifting a one-of-a-kind 14K Gold Custom Name Necklace, showcasing your unique identity or that of someone you love.🌹 Three Luxurious Hues: Choose from glittering gold, romantic rose gold, or the sleek shimmer of white gold to perfectly match your style or that of the special someone in your life.🌟 Superior Craftsmanship: Each necklace is meticulously handcrafted by skilled artisans, ensuring that your piece is not only beautiful but made with the utmost care and precision.🔒 Safe and Durable: Crafted with longevity in mind, our necklaces are designed to resist daily wear and tear, allowing you to cherish your personalized piece for years to come.🎁 The Ideal Gift: With Mother's Day around the corner, or any special occasion, gift your loved one a timeless and elegant piece that will remind them of your affection every day.💎 Quality Materials: Made with the highest quality 14K gold, rose gold, or white gold, your necklace will exude a classic elegance that never goes out of style.👩‍🎨 Customize Your Way: From the name inscription to the choice of gold, your necklace is an extension of personal expression, expertly tailored to your specifications.📦 Ready for Gifting: Your necklace comes in a beautiful package, ready to delight its recipient with its thoughtful presentation and your heartwarming consideration.Thank you so much for choosing my handmade creation and checking out my shop! Your support means the world to me, and I hope you or your loved one cherishes this piece as much as I loved crafting it for you. Thank you!",
    "reviews": [
      "My item was delivered very quickly. I love it",
      "This necklace was beautiful and it was very quick shipping!",
      "Absolutely beautiful necklace, delivery was quick and the quality of the necklace is amazing thank you!",
      "It came out exactly how I wanted really nice."
    ]
  },
  {
    "productId": "ppReeSMOJz",
    "url": "https://www.etsy.com/listing/1661356121/grandma-gift-personalized-flower-pot?click_key=df316775780ce4e3d0a08eaca814e50c6363ca12%3A1661356121&click_sum=3043f3db&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-15&pro=1",
    "title": "Grandma Gift, Personalized Flower Pot, Personalized Gifts for Mom, Grandmas Garden, Outdoor Flower Pot, Birth Flower Mom Gifts from Daughter",
    "description": "Introducing our exquisite Birth Month Flower Personalized Outdoor Flower Pot, a splendid gift ideal for grandmothers or mothers on occasions like Mother's Day. The personalized birth month flower design serves as a representation of a floral bouquet, symbolizing the presence of all her cherished ones.Personalization Details:Enter 2-6 Names: Include Birth Months for each name (each name can be up to 12 characters).Optional dates can be added for each name.Line 1 in Bold: Up to 18 characters (e.g., Mom's Garden).Line 2 in Script: Up to 24 characters (e.g., love grows here).Note: None of the text on the pot is automatically included; it is all part of the personalization.Features:Plants not included.Recommended for outdoor use due to the drainage hole at the base.Crafted with precision from fine-quality, heavy-weight, chip-resistant stoneware.Dimensions: 7.25” H x 6.5” in diameter.Imported.Surprise your loved ones with this meticulously crafted outdoor flower pot, a unique and meaningful addition to any garden!",
    "reviews": [
      "Beautiful and fast shipping! Very pleased",
      "This item just arrived.  So well packaged and arrived earlier than I expected.   My friend (who has everything) will just love this planter as a gift.  Thank  you so much!",
      "Loved how these came out and would definitely recommend! I also needed 7 flowers on one pot and the shop was able to accommodate:)",
      "It was so beautiful and worth every cent"
    ]
  },
  {
    "productId": "ufJnWOaRXe",
    "url": "https://www.etsy.com/listing/1487653643/groom-gift-from-bride-picture-cufflinks?click_key=4ff9e9f702e48c1722016e5c6818c830282b2ef6%3A1487653643&click_sum=cdfaac5e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954095-7-16&pro=1&etp=1&sts=1",
    "title": "Groom Gift From Bride Picture Cufflinks, Custom Photo Cufflinks, Personalized Photo Groom Gift Cufflinks",
    "description": "Are you ready for a surprised touching reaction with perfect gift for him? Recapture the moments. For those special times. For those special men in your life. Using your own creative vision make custom cufflinks. You can use any combination of photos or personalized messages to create your cufflinks. You're in control!  No doubt about it any man in your life will love them! More than cufflinks, they are treasured memorial keepsakes. Great for husband gift for your anniversary!I come through for you.  Once you select your shipping method, Etsy will provide a \"ready to ship in\" time frame and an \"estimated delivery\" time frame based on the shipping method chosen. Please be aware expedited shipping does not mean it goes out the following day, rather it will arrive faster than standard shipping once it is shipped within the \"ready to ship in\" time frame. HOLIDAY ORDERS are subject to delays with the carrier services.How to order and send me your Image, Quote, Message or Logo:•    Simply purchase the productHOW TO SUBMIT YOUR PHOTO ON DESKTOP1.) CLICK ON “PURCHASES AND REVIEWS” FROM YOUR PROFILE DROP DOWN MENU2.) SELECT “ORDER” - THEN “HELP WITH ORDER”3.) SELECT “MESSAGE SELLER ABOUT SOMETHING ELSE”4.) CLICK SEND HELP REQUEST5.) YOU WILL DIRECTED TO A CONVERSATION BOX WHERE THERE IS A PHOTO ICON ON THE RIGHT SIDE6.) CLICK ON THE PHOTO ICON TO ATTACH YOUR IMAGES 3 AT A TIMEHOW TO SUBMIT PHOTOS FROM A MOBILE DEVICE1.) CLICK ON “YOU” PROFILE ICON2.) SELECT “PURCHASES AND REVIEWS”3.) SELECT HELP WITH ORDER UNDER YOUR PURCHASE (LEFT CORNER)4.) SELECT “I WANT TO MESSAGE THE SELLER ABOUT SOMETHING ELSE”5.) SEND HELP REQUEST6.) SELECT YOU - THEN MESSAGES - SELECT THE LAST MESSAGE BOX (SHOULD SAY CARLY OR PENDANT PLACE STORE)7.) THERE IS A CAMERA ICON IN THE LOWER LEFT CORNER, CLICK ON THIS AND YOU WILL BE ABLE TO ATTACH 3 PHOTOS AT A TIME•    Light photo correction and background removal available•    Please include your name and email address in the message box.•    Supported files formats - GIF, JPG, PNG. Please DO NOT crop your photo.Rest easy when I message you with a sample of how your photo or message will appear when cropped to the circular shape of your custom cufflinks.You're #1. Honest and trusted with over 2,500 five-star reviews. 100% Satisfaction Guarantee!This custom photo gift includes:•    One pair of 16mm platinum tarnish resistant cufflinks•    Handcrafted boxAlthough these are not engravable, I can add a message to the gift boxSAVE 20% OFF this purchase right now by going tohttp://eepurl.com/dslu2bI do not crowd your email space. I just send an email every so often with an exclusive discount :-)Photos by Lamy Lens photography",
    "reviews": [
      "Seller was very quick to respond and did a phenomenal job. The cuff links came out perfect and I can’t wait to give them to my fiancé on our wedding day!",
      "Absolutely love the way they turned out! I can't wait to gift them to my husband!",
      "The seller sent a draft quickly and it shipped very fast! I’m so happy with this purchase- a sweet way to incorporate passed loved ones!"
    ]
  },
  {
    "productId": "BF1ghhzTnR",
    "url": "https://www.etsy.com/listing/154958597/lace-handkerchief-lace-hankie-custom?click_key=0a4eb1b32b0a909b9a1b98a2c5de347c520be70e%3A154958597&click_sum=a8e1edd1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-25&etp=1&sts=1",
    "title": "Lace Handkerchief - Lace Hankie - Custom Handkerchief - Embroidered Handkerchief - Bridal Handkerchief - Personalized Wedding Handkerchief",
    "description": "If you are in a rush you need to contact me before you check out to see if you need to buy rush or not.   You will most likely need to  add the “rush my order” listing to your cart and/or priority shipping.   DO NOT simply type Rush my orderand expect it to be rushed.https://www.etsy.com/listing/611492829/please-rush-my-order**I do NOT provide proofs, so please make sure your wording is spelt correctly and what you want it to say.This is a nice quality Lace edge Hankie (12\" x 12\" white) You pick what you want it to say and what color thread.You get a choice of Lace edgeA ~ Thin laceB ~ Thick LaceC ~ Heart corner laceD ~ Scalloped EdgeE ~ Scalloped flowerF~ Napkin 20\"x15\"  thick table napkinG ~ Regular edge 15'x15\" more masculine hankieHave your name and wedding date.Or just your initialsWe could even put a saying on it.You chose the color thread on a white hankie. Just let me know what you want.Please e-mail me over with any questions before purchasing.The price is for one Handkerchief.Date 08/18/2013 is one word Date as August 18, 2013 is two words.I will center the writing and put it as far down in the corner as I canPlease don't try and center your text in the message.I will also adjust lines if needed.LikeToday I marry my best friend.I love you, Fred08-18-14SarahorToday I marry mybest friend.I love you, Fred08-18-14SarahI do this so I can make the writing as big as I can with it still looking nice.I do not have the ability to send a proof❤️💙❤️Your item might get wrinkles in the package.We stitch down as low as we can go which can depend on what you choose to write.We fold to fit in our packaging which can result in all of your wording not being visible in the square. This is greatly effected by how many words you choose.Letters may touch depending on their looping.Please note that white thread and off-white thread are extremely hard to read, I would not suggest doing a whole saying in those colors. They work well if you’re just doing a simple initial and a date.This is a great gift for the Mother of the bride or the bride her self. Embroider it with blue thread for her something blue. this would be a great gift or favor for anyone in the wedding party.I look forward to working on your order.Please email me with any questions.I usually take about a week or two to finish these ordersDo you need your item RUSHED, please buy this listing below.Rushing does not pay for express shipping, you would need to add this to your cart if you want it when checking out.Priority shipping doesn't get your order rushed by me, only the USPS.https://www.etsy.com/listing/611492829/please-rush-my-order?utm_medium=SellerListingTools&utm_campaign=Share&utm_source=Raw&share_time=1525200677000&utm_term=so.slt",
    "reviews": [
      "This item exceeded my expectations. I reached out to the seller two weeks before my wedding and asked if I’d need expedited shipping & she informed me I did not. My dad and husband absolutely tested up as they did not expect something this thoughtful. The seller was also able to meet the request I had to write in our native language, Portuguese. I highly recommend !!!",
      "beautiful work, would definitely order again",
      "beautiful work, would definitely order again",
      "Love the quality of this handkerchief! I bought it to give to my mother in law on my wedding day and it’s perfect! Super cute packaging too!"
    ]
  },
  {
    "productId": "vk5tTzCbCZ",
    "url": "https://www.etsy.com/listing/1241528786/personalized-leather-rfid-wallet?click_key=b52433c5471f2101904defbdc502e909d712f212%3A1241528786&click_sum=0f2e2ee1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-26&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather RFID Wallet, Engraved Genuine Leather Custom Wallet, Anniversary Gift For Him, Husband, Boyfriend, Men, Father, Dad",
    "description": "This personalized RFID leather wallet is the perfect father’s day gift or for the new dad to be! With our handcrafted Premium Genuine leather from Argentina, our personalized leather wallets might just be the thing! We offer 3 different colors (Light Brown, Coffee Brown, and Black). You can simply add initials, favorite catchphrase, quote or inside joke, even a logo to make It extra unique and special! Colors may appear slightly different in person versus on the computer screen and our photos are all edited. Each leather wallet is engraved with a laser engraver, therefore there may be a slight difference in positioning of the design than the ones pictured. Who wouldn’t love a brand new RFID leather wallet with their name engraved on it! You can be sure that they will enjoy it for years to come. We are confident it's definitely worth every penny you spend! You can check out the rest of our personalized goods here:https://www.etsy.com/shop/PremiumEngrave-Our premium RFID leather wallet has the capacity for 10 card slots, 2 Bill compartments, and double-sided flip-up transparent compartments for IDs, photos, etc.-Each card slot is equipped with nylon fabric (RFID Blocking) lining, keeping your personal and financial info safe.-Premium Quality is #1 priority to us. Each of our beautiful wallets are handcrafted to perfection with the highest quality Argentinian Leather. Ages beautifully with time and softens naturally with use.-Dimensions: 3.6’' x 4.4’' x 0.5’' making it slim and lightweight.-Beautifully packaged with care!We are a family business that makes personalized Items for people who love to spread joy by giving gifts. What better way to gift your loved one with a personalized premium wallet.Our RFID Leather wallet makes a perfect gift for him on his Birthday, Anniversary, Graduation, Wedding, Thanksgiving, Christmas, or Father’s Day, or even just a treat for yourself! Click “Add to Cart” right now and order yours today!HOW TO ORDER:STEP 1: Chose the color of the wallet you'd like. Then chose the engraving side (Front, Inside Left, Inside Right).STEP 2: Chose the design you would like to be engraved. For this step, you have 4 options.The First option is Monograms/Text: Select the monogram style you want, then write the text.The Second option is Custom Logo: You can send us a custom logo (Company Logo, Personal Logo, Etc.) via Etsy Message to be engraved on the wallet.The Third option is Family Photo: Same as sending a custom logo, please send us a HIGH QUALITY Family photo through via Etsy Message.The Fourth option is Handwriting: Send a photo of handwriting via Etsy Message.Note: Handwriting should be written on plain white paper. Please remember that higher photo quality will give a better result.STEP 3: Place your order.* Front: Design 1 (Bottom Right): Letter D, Name - David* Inside Left - Happy Anniversary Hubby!* Inside Right - I love you to the moon and back.* Please type ''No Personalization'' if you select No PersonalizationORDERING NOTES--------------------------------------We are only able to engrave exactly what the customer put. We're not responsible for any typo provided by the customer. If two slightly different version is provided, the typed instruction overrides the original version.Please make sure everything is correct before you submit the order. We'll do our best to answer any change request, but no guarantee for any changes.SHIPPING--------------------------------------We pride ourselves in delivering your custom product to you in a timely manner. We always do our best to ship orders as quickly as possible. You can select your desired shipping method at the checkout. PremiumEngrave is NOT responsible to any shipping delays once the item is handed to the shipping carrier.RUSH ORDERS--------------------------------------If you need your items sooner, there is a $8 rush fee to process your order in 1-2 business days. After purchasing the rush fee, PremiumEngrave will push your order to the top of our list for orders to do the same day (Before 2pm). To proceed with a rush order just purchase from my rush order listing link below and it will add $8 to your order to fast-track the processing time. RUSH ORDER FEE LINK:https://www.etsy.com/listing/1322459789/rush-my-orderPLEASE NOTE--------------------------------------Let's talk about Genuine Argentinian leather. The wallets we provide are real leather, finished in such a way that it is intended to have a rustic, organic, and rich finish with a lovely leather smell! Genuine Argentinian leather scratches, it marks, it leaves a crease where folded and it looks rustic by design. This is on purpose, and it's beautiful! The first few weeks that you use the wallet the leather will settle into its final patina. If you contact us upon receiving the wallet to complain that the item is damaged because it has some marks, I will refer you to this disclosure. If the wallet looks bumped and worn... keep using it, it'll look amazing and rich in no time! The wallets are structurally very sturdy and the stitching is strong, there is nothing wrong with the wallet, and we will not take returns because you did not see or read this disclosure.Personalized Leather RFID Wallet, Engraved Genuine Leather Custom Wallet, Anniversary Gift For Him, Husband, Boyfriend, Men, Father, Dad",
    "reviews": [
      "The quality is very good and came out perfect 🙂",
      "The personalization turned out SO good! My boyfriend loved it!",
      "Amazing customer service, seller was incredibly understanding and nice!",
      "Item came just as pictured."
    ]
  },
  {
    "productId": "HNNWSiLhlx",
    "url": "https://www.etsy.com/listing/1016672860/personalized-leather-dopp-kitt-for-men?click_key=ecaddc4aec4eeeede74d70a4a039b48ef16bab94%3A1016672860&click_sum=636bce67&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-27&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather Dopp Kitt for Men, Leather Men's Travel Toiletry Bag, Grooms Men Gift, Christmas Gift for Him",
    "description": "Personalized Leather Dopp kit, Omnia, is a compact companion that holds any of your essentials with grace and comfort. Imagine the dreaded moment when you realize your face wash, shampoo, etc. has fully exploded in your suitcase, leaving permanent damage on clothing and valuables… It’s the absolute worst. That’s why we created this durable, long lasting travel gear with timeless aesthetics to help you carry your needs and conquer the clutter.>FEATURESFull Grain Buffalo LeatherReinforced Leather HandleDual YYK zipper for easy access and organizationWaterproof liningLarge Bag:* Size: 10x7x6 in* Outside pocket with zipper for easy access* 2 mesh inside pockets* 1 zipper inside pocketMedium Bag:*Size: 8.5x5.5x5 in* 2 mesh inside pockets>BULK ORDERBulk order discounts are available. Please contact me for more information.>WEDDING GIFTIt will make a perfect best man, groomsmen gift. It comes with luxury gift box. It will make a long lasting impression.>DESIGNOur company's artisans combined old world craft methods with modern function, thus created a multifunctional, classic and practical design that's perfect for today's travel lovers>Matching Travel BagCheck out our matching travel duffle bag to complete your set.https://www.etsy.com/listing/1340985297>MATERIALWe use only premium quality full grain buffalo leather that is sturdy, unique and ages beautifully with every use. And combine it with high quality, environment friendly tanning that high-end bespoke shoe makers and sought-after fashion brands use in this century for soft, supple and durable quality leathers. We also use antique brass buckle and hardware, waterproof lining and YKK extended brass zipper.>IDEASOur leather dopp kit looks elegant and will make a deep impression. Personalization option makes it a perfect, memorable gift and gives a statement making appeal to it.  Perfect gift for Christmas gift for him, Father’s Day gift, Birthday gift for him, Valentine's Day gift for Him, Wedding gift For Him, Anniversary gift for him, Best Men Gift, Leather Toiletry Bag Monogram for him, Mens Toiletry Bag for him, Leather Gift for Him, Monogrammed Groomsmen Gift, Groomsmen Proposal, Men's Shaving Kit, Personalized Toiletry Bag for him, Travel Case for him.>LEATHER CARELeather is sensitive to natural elements: water, oil, heat, light, and environments that are too humid or too dry. So protect it from prolonged exposure to them. If water spills over it, wipe it immediately with a soft, lint-free cloth. This will prevent the formation of stains and blisters.Protect your bag from ink, oily products, and alcohol-based products. Repeated contact with raw or dark textiles might cause undesirable effects on leather that is lighter in color.Let your bag rest, if you are not using it, thoroughly empty your bag, zip all zippers and fold straps properly and store it in a dark, temperate environment preferable in a box or dust cover.Oils will actually clog the pores of the leather, so you’ll only want to apply wax or recommended sprays to waterproof it. You can re-apply these products on your bags once every six months, or if the shine is gone.>RETURN POLICYYou may return NON-PERSONALIZED items in 14 days upon receipt. The buyer is responsible for the return shipment. If there is anything wrong with the item, I can exchange it free of charge.",
    "reviews": [
      "Great quality and shipped fast",
      "Quick shipping, the bag is very high quality and a great deal for the price in my opinion. Have been using it for about three months now and it has held up perfectly!",
      "Great quality and arrived very fast!"
    ]
  },
  {
    "productId": "BOsiLklYvO",
    "url": "https://www.etsy.com/listing/937217575/wax-log-candle-personalized-carved-names?click_key=83b463df23882760c878d7e86e7c0ac9b636f714%3A937217575&click_sum=de8b36a1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-28&etp=1",
    "title": "Wax Log Candle Personalized Carved Names and date Special Valentines Gift For Him Romantic Wedding favor Bridal Shower Gift for Her",
    "description": "All wax candle sculpted, carved, and painted to look like a birch log.4 inches tall3 inches diameterChoose a regular pillar candle or a  tea light insert (plastic tea light cup imbedded in the top of the candle where you may replace the candle after burning)You may personalize with two names and a date.",
    "reviews": [
      "My husband loves all things birch wood.  He really liked this candle.",
      "Nice item - very good customer service",
      "Perfect and arrived with plenty of time for our 16th anniversary. Thank you so much.",
      "Very pleased with my order."
    ]
  },
  {
    "productId": "0xABJBgvvI",
    "url": "https://www.etsy.com/listing/1532914139/recipe-book-binder-bridal-shower-gift?click_key=63ab9aea56daf509b0a2d3051cb6b7e9a3d0c9e1%3A1532914139&click_sum=0154a068&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-29&pro=1&frs=1&etp=1&sts=1",
    "title": "Recipe Book Binder, Bridal Shower Gift for Her, Personalized Gifts for Mom, Custom Cookbook, Birthday Gift For Mom, Mother, Family Cook book",
    "description": "Preserve your cherished family recipes with Redberry Guest Books' beautifully handcrafted wooden recipe book. Made in the USA, our recipe books feature customizable maple or cherry wood covers, engraved with your choice of designs to make it truly one-of-a-kind. Our high-quality acid-free paper ensures your recipes are safely stored for generations to come.A wooden recipe book is not only a practical addition to your kitchen but also a delightful heirloom to pass down through the family. Celebrate the joy of cooking and the memories made in the kitchen with this elegant and timeless keepsake.I N C L U D E SThe listing offers a custom engraved recipe book.• The book comes in either 6\" x 9\" or 8.5\" x 11\" size• The text on the book can be personalized based on the sample provided• You can choose from 30, 45, or 60 sheets of acid-free paper, blank or lined, with or without divides.*Due to wood's organic nature, your product may differ from the photo in terms of knots, dark spots, grain, and engraving darkness. These variations make each book unique.H O W ∙ T O ∙ O R D E R• Choose your book size and timber• Select a paper quantity & paper type• In the personalization box leave the following details:1) Screw Color: Gold, Black, Silver, or Copper.2) Vegan Leather Binding Color:3) TEXT to be engraved:Names: (ie: \"Mom's favorite\")Date: (ie: \"recipes\")*Any other details, such as special design requests and timing deadlinesT U R N ∙ A R O U N D ∙ T I M ETo ensure a speedy turnaround time, we do not send proofs of cover designs prior to production. If there are any questions about the requested details, we will reach out via Etsy message for clarification.Once we receive your order, we aim to ship your book within 1-2 business days.The transit time to US addresses is typically 2-3 business days, but this may vary depending on the chosen shipping method at checkout.𝗙𝗔𝗤:https://www.etsy.com/shop/redberryguestbooks#more-section*Please message us with any questions or for custom requests.………………………………….………………….………………………………© 2023 RedBerryGuestBooks",
    "reviews": [
      "Amazing quality! Will be able to use for years to come:)",
      "This cookbook is beautiful! Amazing quality.",
      "This cook book is absolutely amazing!! It is so cute and such nice quality! And it was shipped very quickly and has many pages for all the recipes! I bought it for a friend who is getting married in a few weeks as they are also building a new house and this is going to be the perfect wedding present!"
    ]
  },
  {
    "productId": "ObpNMJKKmx",
    "url": "https://www.etsy.com/listing/1067008706/sympathy-gift-sympathy-heart-candle?click_key=c68727e7d7c8eafcb7f119cc8eb0f7f4f6c175ce%3A1067008706&click_sum=4481ee67&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-30&pro=1&frs=1&etp=1&sts=1",
    "title": "Sympathy Gift, Sympathy Heart Candle, Sympathy Votive - Personalized w/ Name & Date - There are those who continue to light up the world ...",
    "description": "This lovely heart candle holder would be a beautiful and meaningful sympathy gift for any loved one. It's made of earthenware clay and includes the message shown or add a name and date on the inside too. The text shown reads:There are those who continue to light upthe world long after they have gone.The heart candle holder measures 4\" Dia. x 3 ¾\" H and is made to look handmade and not perfectly smooth. This ceramic piece is very versatile!It glows from inside when a small candle is lit inside.  Do not leave open flames unattended. The holder may get hot while the candle is burning. A white unscented candle (as shown) can be included with the purchase.When checking out, please select if you would like to add custom text to the front, inside rim or both.How to order:If you want to personalize the inside of the candle and want the same text as shown on the front then please choose 'Add Name/Date inside'.If you want the inside left blank but want a custom message on the outside then please choose 'Custom front only'If you'd like the text customized on the inside and outside then choose 'Custom Front & Inside'.You can add your custom text when checking out.Our signature red gift box with silver seal adds the perfect final touch! The box will be flat packed so you can simply assemble it, add your keepsake item and your gift will be ready to give!For up to date production times, shipping estimates, and holiday deadlines please see announcements on shop homepage for more information.  If you need it sooner than our standard lead time please contact us, we are able to expedite many of our products. Upgraded shipping for faster delivery is available at checkout for most items.https://www.etsy.com/shop/SusabellasWe love custom orders so if you have an idea, just send us a message!",
    "reviews": [
      "This seller was so nice and customized our order exactly how we requested. Our friend was so touched when she received the gift. It looks perfect. Thank you!",
      "Beautiful thoughtful gift, great quality, fast shipping",
      "Amazing quality. Beautiful piece of art."
    ]
  },
  {
    "productId": "ru3E1QVcTz",
    "url": "https://www.etsy.com/listing/1287554367/handmade-soap-gift-box-8pk-all-natural?click_key=af667c69e1a86fac4dc5253087a178d2b0d6688f%3A1287554367&click_sum=16c47a77&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-31&pro=1&frs=1&etp=1&sts=1",
    "title": "Handmade Soap Gift Box 8pk | All Natural Bar Soap Gift| Personalized gift for her|Self Care Package",
    "description": "This lovely soap gift box includes EIGHT 4.3oz soap bars with optional gift box and add on options. If you are a big fan of handmade soap, this gift box is the perfect gift for your loved ones or pampering yourself!Our soap bar is handmade with 100% natural ingredients through traditional cold process method to best preserve the nutrients and effectiveness of those gorgeous oils including pure olive oil, organic coconut oil. Enriched with organic shea butter, castor oil to provide creamy and rich lather and leave your skin deeply cleansed and hydrated. Scented with natural essential oil only to make you feel and smell amazing.🌟Gift Box OptionPlain white mailer (no extra charge)Printed Gift Box (#3.5 extra)🌟Add on OptionLinen Cotton Soap Saver ($5.95)Wood Soap Dish ($8)🌟Personalized Soap Option:If you would like to choose your own, please leave your chosen soap code in the personalization box.(If your chosen soap is sold out, we will replace it with a similar one of equal weight). If you would like random, we will pick for you!🌟4.3 oz Soap Choice include:A. rose honeyB. honey orange turmericC. (mint) coffeeD. lavenderE. charcoal cedar roseG. cocoa maple oatmealH. lavender eucalyptusI. pink salt roseJ. lavender cedar zenK. cinnamon walnut oatmealL. blue sea saltM. lemon honey cakeN. citrus cedar marbleO. lemon poppyseedP. peppermint gardenQ. ocean breezeS. coconut milkT. french lavender bergamotU. lemongrass spearmintV. snowy pineW. calming lavenderX. aloe kelp tea treeY. pumpkin spiceZ. california ale (beer soap)INGREDIENTSSoaps are made with pure olive oil, organic shea butter, organic coconut oil, organic castor oil, colored with natural colorant and scented with essential oils. Please see the listing of individual soap bars for full ingredients list and descriptions.All Soaps are cold process handmade soap.ORGANIC & VEGAN BASED ♥ 100% NATURAL ♥ SCENTED WITH ESSENTIAL OIL ONLYPALM FREE ♥ SYNTHETIC FRAGRANCE FREE ♥ ARTIFICIAL COLORANT FREE",
    "reviews": [
      "Great gift. Handcrafted and Quality ingredients.",
      "One thing I like a lot about these soaps is that they don't have a strong or almost invasive scent. The fragrance is gentle and feels more natural",
      "Very nice, very good quality",
      "GREAT PRODUCT, I WOULD BUY FROM THIS SHOP AGAIN!"
    ]
  },
  {
    "productId": "cujDtedwPx",
    "url": "https://www.etsy.com/listing/1277108921/wedding-gift-engagement-gift-engagement?click_key=636b2c93cd7447e01c0b576a0420c8eec86d50b5%3A1277108921&click_sum=290a1355&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-32&pro=1&etp=1&sts=1",
    "title": "Wedding Gift, Engagement Gift, Engagement Candle, Personalized Gift, Personalized Wedding, Couples Gift, Gift For Bride, Custom Wedding Gift",
    "description": "Celebrating a new couple's engagement or looking for a custom gift for a wedding? This custom candle is the perfect personalized gift for a newly engaged or newlywed couple. Include the first names of the couple, the engagement date or wedding date, and give as a gift for a bridal shower.Gift Box Packaging Included -We value a beautiful unboxing experience that matches any occasion. Be sure to include any personalized message you want to include inside our gift box.INGREDIENTSOur candles are hand poured in our studio in Tennessee. We use a natural soy coconut wax blend, premium phthalate-free fragrance infused with essential oils, and cotton wicks. Our soy coconut wax is a sustainable alternative to paraffin that burns evenly and binds beautifully with our toxin-free fragrances to produce a rich, enduring scent. Each candle comes in a muslin bag and then placed inside a white branded box before it is packaged for shipping. Our branded box is included in the listing price. Please see the listing photos for more specifics on how your candle will arrive.FROSTED CANDLE VESSEL-Coconut Soy Wax-Phthalate Free Fragrance-40-45 Hour Burn Time-230g/8oz weight-Cotton Wick-Includes Bamboo Lid-3.75in x 3.15in (with lid)-Comes in 4x4x4 Branded BoxPERSONALIZEDIf You are giving this as a gift, be sure to include the recipient's first name and a short message. We will enclose this in vellum and place it inside of the branded box to be seen first as they open the package. \"Wisdom House Co\" will be placed on candle labels in small print. Please send us a message with any questions.________________FRAGRANCE  OPTIONSGRAPEFRUIT + BASILTop: Grapefruit, Basil Leaves, MintHeart: Lavender, Rhubarb, AppleBase: Vanilla BeanWILD FIG + MOSSTop: Freesia, OzoneHeart: Jasmine, Geranium, FigBase: Patchouli, Moss, Bamboo, PowderTEAKWOOD + BERGAMOTTop: Leather, Allspice,TeakwoodHeart: Tobacco, Cloves, BergamotBase: Sandalwood, Amber, PeppercornBLACK CURRANT + PLUMTop: Bergamot, CitrusHeart: Ripened Plum, Creme de Cassis, Black Cherry,Base: Light Musk, Freesia, Vanilla, AmberPOMELOTop: Orange PeelHeart: Ripened Peach, Grapefruit, MangoBase: Cedar, Red CurrantBIRCH + SAGETop: Eucalyptus, MintHeart: Cypress, Birch Resin, Pine,Base: Sage, Tonka BeanSEA SALTTop: LinenHeart: Eucalyptus, Sea Salt, VioletBase: OakMoss, Light Powder",
    "reviews": [
      "Fantastic product and customer service. My daughter is so excited to give to her bridesmaids in their welcome package",
      "Such a lovely personalized candle. Smells great, arrived quickly and was beautifully packaged. It’s going to be the perfect engagement gift. Thank you so much!",
      "I’ve ordered from this shop twice and everything is perfect! The shipping is so fast and the quality is great. Everyone loves the gifts I buy them from here. 10/10",
      "I ordered this candle for my Goddaughter’s upcoming wedding.  The candle is beautiful.  I cannot wait to give it to her."
    ]
  },
  {
    "productId": "zSwckLgMYW",
    "url": "https://www.etsy.com/listing/931426990/personalised-couples-home-date-night?click_key=ce78231ba6bd141ebbdfeaf86f89e4c0ee21dcb4%3A931426990&click_sum=ea7b7659&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-33&frs=1&etp=1&sts=1",
    "title": "Personalised Couples Home Date Night Dispenser",
    "description": "Inspire romantic date-nights whilst at home with this cute little date night dispenser, containing fun ideas that you don't need to leave the house for!Each little box includes 20 cosy dates -- Romantic movie date night- Game night with lots of snacks (and wine)- Have an indoor picnic- Drink wine and paint a portrait of each other- Have a fondue dinner date night- Make cocktails and listen to each others favourite music- Have a candle lit dinner- Make your own pizza night- Take out and wint night- Have a DIY spa evening together- Build a fort and snuggle- Have a wine and cheese night- Have a bubble bath together- Write each other a poem and read them to each other- Plan and research your nect adventure together- Bake a challenging cake together- Make a bucket list- Have an in-door cook off- Re-create your first date at home------------------Made from:Each dispenser is made from aluminum metal, printed with a gloss finish and contains 20 tear-off movie titles.------------------Dimensions:The dispenser box measures - W5cm x H5cm x D3cm.Each ticket measures - H2cm x W4.5cm.",
    "reviews": [
      "Super cute Valentine’s Day gift! My boyfriend loves it",
      "So cute!! What a unique gift idea.",
      "Cute product and very fast shipping!",
      "Haven’t used it yet but it looks so cute I’m so excited!"
    ]
  },
  {
    "productId": "tdHqzDUDkz",
    "url": "https://www.etsy.com/listing/1665503212/embroidered-easter-basket-custom-kids?click_key=6c6c98505b9f8a0b8ba382bff5fab4d5113834dc%3A1665503212&click_sum=e64c1418&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-34&pro=1&pop=1&sts=1",
    "title": "Embroidered Easter Basket, Custom Kids Basket, Easter, Basket, Personalized Easter Basket, Baby Boy First Easter Basket, Baby Blue Gingham",
    "description": "CHECK OUT THE ADORABLE MATCHING NAME TAG!heathershalo.etsy.comOur embroidered pretty chipwood basket with a denim blue gingham printed liner will be a great Easter basket for your loved one! Fill it with candy and small treats to make a beautiful basket. Carrots decor is included, bunny stuffed animal is not included. Basket included.Details:11\" x 11\" x 7.1\" (28cm x 28cm x 18cm)Chipwood and polyesterEmbroidery will be approximately 2\" in height and length depends on how many characters.",
    "reviews": [
      "Exactly what I was looking for!",
      "I absolutely love it. Everything is as they described. They responded very quickly when I had a slight issue in the mail which was not their fault, (things get lost in mail) they fixed and sent a new one. I will definitely be buying from them in the future 😍😍 100% recommend 👌",
      "absolutely great! so soft, and just as cute as the photos",
      "Awesome blanket! Super soft ! Would recommend anyone to get one!"
    ]
  },
  {
    "productId": "JOHJBZuyaI",
    "url": "https://www.etsy.com/listing/545373854/sweetheart-tree-pint-glass-or-stemless?click_key=21e4838576ea9db0aaa1fe4dd049284ec106032e%3A545373854&click_sum=c1a16389&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-35&frs=1&etp=1&sts=1",
    "title": "Sweetheart Tree pint glass or stemless wine glass, Engagement gift or wedding gift, Personalized",
    "description": "Sweetheart Tree pint or stemless wine glass, Add the initials of the happy couple.  Great gift idea for weddings, for the engaged couple, gift for your girlfriend or boyfriend.This glass is sand etched, it will not fade or rub off and is dishwasher safe.At check out please leave the initials of the happy couple.Adding a date is optional and an additional charge.  If requesting the date option, please leave date in numerical format, ie. 11/27/23 (example)For Pint glasses - If you order one, it comes in a single presentation box, if you order two it will come in the double presentation box.  Stemless wine glasses come in plain single box.",
    "reviews": [
      "The glasses are beautiful! Just wished the shipping was faster. It took 7 days even though it was said to be priority mail. I would have paid more for shipping had I had the choice. The craftsmanship is great.",
      "Suuper cute. It came out perfect",
      "Thank You 😊",
      "Super cute engagement gift for my friends. They loved them! I love that they can be used for more than just their engagement.",
      "Thank you 😊",
      "Great workmanship!  Thank you.",
      "Thank you 😊"
    ]
  },
  {
    "productId": "Va9ldQndcS",
    "url": "https://www.etsy.com/listing/1262443280/custom-marble-wood-premium-engraved?click_key=d4a0483077654fb4f9c815c585d4816e2bbd2fef%3A1262443280&click_sum=b47b80b1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-36&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Marble Wood Premium Engraved Coasters | House Warming Gift | Personalized Gift | Wedding Gif | Engagement Gift | Personalized Gift",
    "description": "Our high quality Premium Marble and Wood Coasters make a grand great gift for nearly every occasion. For Bridal Showers, Weddings, Anniversaries, Wedding Favors, Housewarming Gifts and more.Our Coasters come in sets of 1, 2, 4, and 8Each coaster, will have a unique grain of wood, as no two pieces of wood are the same. The general grain will look similar to all pictures on our listing.We offer our coasters in Circle and Square Shaped.Each Coaster is the standard coaster size of roughly 3.9\" x 3.9\" (inches)",
    "reviews": [
      "These coasters are absolutely gorgeous! Used them for a shower gift - everyone loved them!",
      "This is yet another great Etsy business!  The coasters were beautifully personalized & engraved & shipped out fast.  Very High quality.  Excellent communication/ fast response time as well which was greatly appreciated.  These were a wedding shower gift for a party that was a 5 hour drive from my home.  I was on pins & needles as to whether they’d arrive before the day I had to leave but they arrived promptly to California.  My bestie lives in South Daytona & her packages don’t arrive this fast!  My future daughter-in-law loved them.  I highly recommend WoodsByStu & will definitely do business with again!  Many thanks!",
      "i was gifted a set of these for my wedding and i loved them so much i ordered a set for some friends! i can’t wait to gift them to her. the seller was so easy to communicate with and was very helpful!"
    ]
  },
  {
    "productId": "FqBrVbNRPX",
    "url": "https://www.etsy.com/listing/615701971/wedding-gift-speckled-minimalist-ring?click_key=c4ef91e47c087c14690ee2c270fa71ee48454fa4%3A615701971&click_sum=b715bd3d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-37&etp=1&sts=1",
    "title": "Wedding Gift / Speckled Minimalist Ring Dish / Jewelry Dish  / Engagement Gift / Bridesmaids Gift / Personalized Gift for Her / Ring Tray",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Ordered this for my best friend’s wedding gift! Great customer service & shipped in a timely manner!",
      "Super cute! Makes a great engagement gift!",
      "Absolutely perfect, just as described, great quality!",
      "Sent this to my cousin as an engagement gift and she loved it! Highly recommend and the ring dish was so cute! Also, super fast shipping if you live in California."
    ]
  },
  {
    "productId": "YPrKIbeiAT",
    "url": "https://www.etsy.com/listing/784553483/birthstone-and-bar-personalised-bracelet?click_key=382b951788386ebdbe34ecb4219c1c1b7252bbcb%3A784553483&click_sum=58ed1f0f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-38&frs=1&etp=1&sts=1",
    "title": "Birthstone and Bar Personalised Bracelet • Bar Jewellery • Gift For Her • Mother's Day Gift • Bloom Boutique",
    "description": "𝗕𝗜𝗥𝗧𝗛𝗦𝗧𝗢𝗡𝗘 𝗔𝗡𝗗 𝗕𝗔𝗥 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗦𝗘𝗗 𝗕𝗥𝗔𝗖𝗘𝗟𝗘𝗧The Birthstone and Bar Bracelet is a stunning personalised bracelet that can be engraved with up to eight characters.Make a true one of a kind Personalised Jewellery piece perfect for any Birthday, Mother's Day or Valentine's Gift.Your perfect go-to accessory designed to match a variety of outfits and occasions. Add a meaningful date or a loved one's name to create a unique gift for her.Complete this personalised bracelet with an Aquamarine Swarovski Crystal birthstone charm to make the perfect gift for a March Birthday.• Available in a Stunning Silver, Champagne Gold or Rose Gold Plated• Available in two sizes, Adult's 18cm and Kid's 14cm with a 3cm extender chain• Includes a beautiful Swarovski Crystal Birthstone charm of your choice𝗪𝗛𝗬 𝗬𝗢𝗨 𝗪𝗜𝗟𝗟 𝗟𝗢𝗩𝗘 𝗜𝗧• A gift your loved ones will treasure• Beautifully personalised ready for any special occasion• Made from high quality materials𝗛𝗢𝗪 𝗧𝗢 𝗢𝗥𝗗𝗘𝗥1. Simply select the colour of your jewellery and birthstone from the options provided2. Fill in your required personalisation in the box provided, taking note of any details mentioned in the description (eg: Name, Right Side)3. Add it to your basket and proceed to checkout𝗢𝗧𝗛𝗘𝗥 𝗜𝗡𝗙𝗢𝗥𝗠𝗔𝗧𝗜𝗢𝗡• ﻿﻿All items are beautifully packaged in a luxury gift box ♡﻿﻿• Can’t find information you need? Feel free to contact us.𝗣𝗢𝗟𝗜𝗖𝗜𝗘𝗦•https://etsy.me/3MNqYWQ𝗔𝗕𝗢𝗨𝗧 𝗕𝗟𝗢𝗢𝗠 𝗕𝗢𝗨𝗧𝗜𝗤𝗨𝗘•https://etsy.me/3Qikcvg𝗦𝗢𝗖𝗜𝗔𝗟𝗦• Instagram - @bloomboutique_uk• Facebook - https://www.facebook.com/bloomboutiquejewellery𝗠𝗢𝗥𝗘 𝗙𝗥𝗢𝗠 𝗨𝗦•https://etsy.me/3HgOJFX",
    "reviews": [
      "Perfect thank you very much",
      "Beautiful piece.. my niece adores it",
      "Beautiful item. Arrived so quickly!!",
      "It came out just perfect"
    ]
  },
  {
    "productId": "NnfljhiZNy",
    "url": "https://www.etsy.com/listing/1277941862/handwriting-keychain-customized-leather?click_key=18ee45d498d507c98ccbaaa8e84f054183c27b4d%3A1277941862&click_sum=517ab15b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-39&pro=1&etp=1",
    "title": "Handwriting Keychain Customized Leather Keychain Engraved Keychain Personalized Handwriting gift 3rd Year Anniversary gift Christmas gift",
    "description": "Welcome to Derichi LeatherYou are in the right place if looking for a customized products for you or your loved ones.-Please check listing details for more information about a product which you want to orderGenuine Leather Keychain made to order in 4 colorLight Brown,Dark Brown,Wine Red , Blue2 bronze ring,1 bronze claspEngraving area is around 2.5 inches length, width 1 inchYou may customize Handwriting on Front and back in this listing-Each listing possible customize per your requestYour notes, logos or actual handwriting i can engrave on the items-Up to the product size or area, your engraving on the product can be small or large- About regular font customization fonts usually chosen by me up to your note but if you want any special font i m able to find font which you want to see on the product-About HANDWRITING customization on the product please send photo thru message, i will check and back to you as soon as possible to confirm with you if its enough good to create or no.-Each listing great gift idea for holidays, for anniversary, for birthday celebrations, also for graduationAs a small business owner i m glad to see your feedbacks on my shopYou are welcome",
    "reviews": [
      "It was a great product",
      "Exactly what I pictured. It was a gift to my husband and he loved it.",
      "came out perfect. thank you!"
    ]
  },
  {
    "productId": "NLHoxNtNTH",
    "url": "https://www.etsy.com/listing/1150012610/custom-bunny-rabbit-plush-toddler?click_key=445ea7327a9e5a19733ad5290ebeaf3210f4e60c%3A1150012610&click_sum=e3259fa1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-40&pro=1&etp=1&sts=1",
    "title": "Custom Bunny Rabbit plush - toddler - newborn - Newborn gift - 18” and 12” bunnies! FREE embroidery- gift for toddler - present",
    "description": "Adorable custom plush Bunnies!Follow us @Little_Lady_A_ on Instagram to be updated on more personalized giftsStanding 12” and 18” tall our bunnies are the softest cuddle toy you’ll ever have!with over 52,000 sales we cannot be more proud to say these are our BEST seller and know you’ll love them!**please specify a thread color number for the embroidery on your purchase.- if a color is not chosen then we will chose blue if it’s for a boy,  or pink for a girl.add a embroidered blanket to your gifthttps://littleladyacreative.etsy.com/listing/1207688014With 400+ different color options these are great for both genders!",
    "reviews": [
      "Will make a beautiful first easter bunny for my grandson",
      "Soft and great quality little bunny!",
      "Beautiful gift,lived it .Would buy again"
    ]
  },
  {
    "productId": "nhMOWfEKDS",
    "url": "https://www.etsy.com/listing/640786982/engraved-wood-cutting-board-personalized?click_key=55e6ecf3acd073e941723ee78d973d334615b943%3A640786982&click_sum=b84ecb7d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-41&pro=1&etp=1",
    "title": "Engraved Wood Cutting Board, Personalized Wedding Gift, Custom  Engraved Cutting Board Anniversary gift, Wedding Gift for Couple",
    "description": "If you would like to have a Juice Groove please could you specify where and  which side  of the cutting board you would like to have it.A personalized cutting board is a great way to show off your personality in the kitchen decor. With so many fun and unique designs to choose fromOur personalized cutting boards, available in Walnut, Maple and White Oak can be customized as a housewarming gift or any special occasion.A personalized cutting board is ideal for a housewarming or wedding present or to celebrate a special occasion. Options for customizing a wooden cutting board range from simple monograms to handwritten recipes, and they're available in many different materials and sizes.You can personalize any of our products by engraving a special message, a date or anything else that would make your product truly unique.Perfect for any occasion. Create yours now in just a few clicks with our beautiful designs.With a range of applications and options available, our personalized & engraved cutting boards, chopping blocks and cheese boards can make a stunning addition to your own kitchen or serve as the perfect present for holidays, Christmas gift, Wedding gift ,Mothers Day, Anniversary and other occasions.A custom engraved cutting board make the perfect corporate promotional gift, decorative company display, or for friends and family as a wedding gift, anniversary gift, engagement present, birthday gift, housewarming gift or any other occasion!The engraved side is for display purposes while the other side is for chopping board. The cutting boards are flawlessly finished and all surfaces sanded to reveal the beautiful wood grain. You have the option of adding an easel to display this beautiful board and save counter space, or add our board butter to maintain the beauty of the wood.* How to make an order:*Using a drop-down menu make your selection from the available types of woodAdd the item to your cart.In the notes section of the order, include the information you wish to be engraved on the board EXACTLY the way you would like it to appear. Please follow the guidelines included above regarding personalization options specific to this design.Before submitting the order, double check to ensure that the shipping address is correct. If you are sending a gift, please enter the address of the recipient as the shipping address for the order.Note that multiple addresses cannot be included in a single order, so in such case, place separate orders for each recipient* Lead Time *Our standard processing time is 3 to 5 business days to allow for the artwork, engraving and packaging of each cutting board, which are made to order.  Lead time does not include shipping timeNote : For the special production based on custom made purchase the lead time may vary up to extra 5 working days.* Online tracking is available for all countries.* Personalization *Please specify:1. Last name2. First names2. Date or Yearjuice groove infoIf you also have All juice groove on your order , will be back side of the board on standard if you want different side please inform on your order .If you would like to have a Juice Groove please could you specify where and  which side  of the cutting board you would like to have it.You can provide or request a custom image. The price may change depending on the image requirements.Please leave the exact spelling of the name and date in the 'note to seller' upon checkout.Our Personalized  cutting boards can be corporate gift for your business partners or a clients also!.By courtesy of such a creative idea with the  option of personalizing your clients name even with an image on the front, along with your marketing message or your corporate logo on the back always reminds them of who you are; the service you have provided for them, and the thought you put into that gift with our professional effort and design quality*Additional information*Our cutting boards are engraved on one side permitting the use of the other side for cutting and chopping.Once the engraving process has begun, no changes can be made and no refunds will be issued.We include maintenance and cleaning instructions with each cutting board.We do not use stains, so the color you see reflects the natural color of the wood.",
    "reviews": [
      "Will definitely recommend this again!",
      "A beautiful gift for the newlyweds!  Thank you!",
      "Everything was amazing, thank you!",
      "Great product and service!  Definitely recommend."
    ]
  },
  {
    "productId": "tSABaydabD",
    "url": "https://www.etsy.com/listing/1267527099/personalised-prescription-wine-label-red?click_key=89fca9cc4a577fc23b8b6675823ccde610237ca9%3A1267527099&click_sum=0d0edb0c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-42&pro=1&etp=1",
    "title": "Personalised Prescription Wine Label Red White Rose Vinyl Sticker Funny Novelty Gift Birthday Anniversary",
    "description": "1x Personalised Prescription Wine Label (Choice of Red/White/Rose) with Choice of NamePlease let us know the 'Patient' Name and the name(s) for the 'Signature' in the personalisation box when ordering!Each Sticker measures approximately 3\"x3.5\" (80mm wide to 90mm high)LIGHT GREEN as shown in picture supplied by default however these can be printed and cut in any colour upon request by leaving a note at the checkout.Please see colour chart for options available.1 sticker supplied.Wine not included.Free 2nd class UK postageLow cost international postageCUSTOM SIZES & COLOURS AVAILABLE please message for prices and more infoDelivery:Free UK postage via Royal Mail and low cost international postage.Standard delivery both domestic and international doesn't include tracking information.If you'd like tracked shipping please ensure to select it at the checkout.Disclaimer:We asked our customer to ensure all information left at the checkout is correct as we will not be able to fix any address issues once the order has been dispatched.If orders are retuned to us by royal mail/UPS due to the issues regarding your address we will be in touch and ask you to purchase the link bellow to cover postage cost for resending your order again.https://www.etsy.com/uk/listing/1067207436/postage-listing-for-customers-resends?click_key=ffe2f5fe1ac2acbaafb77fd8770954c78eb7a34e%3A1067207436&click_sum=35163b25&ga_search_query=postage&ref=shop_items_search_1&frs=1Customer service:All messages are dealt with in the morning please do not panic if you do not get a reply instantly, we are busy making your order as everything is made to order and to ensure it goes out in good time.We appreciate your patience and will get back to you asap.",
    "reviews": [
      "Got it for a pharmacist friend, all of her coworkers thought it was hilarious! ❤️",
      "It was so cute. I put it on my friends fav soju bottle and she found it cute and hilarious. She made sure to follow the prescribed dosage.",
      "Lovely item and perfect for gifts"
    ]
  },
  {
    "productId": "TwitTPqbaF",
    "url": "https://www.etsy.com/listing/714286648/personalized-gift-hand-forged-purple?click_key=f73db447512481a95bf02b91e2bd45b66154b823%3A714286648&click_sum=e304ac3a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-43&frs=1&etp=1&sts=1",
    "title": "Personalized Gift - Hand-Forged Purple & White Metal Rose - Iron Anniversary - 30th Birthday For Her - 50th Birthday Gift",
    "description": "This exquisite hand forged iron rose seems to have come straight out of a fairytale! The metalwork is extremely detailed and the petals and stem look just like the real thing, but unlike a fragile natural rose, this metal flower will be around to be admired for years to come.Purple roses symbolize enchantment and desire, so a purple rose is a fitting gift to send a message of \"love at first sight\". Our purple metal roses will last well after the first blush of passion has worn off and will see you through to your \"happily ever after\".Each rose measures approximately 8.5” tall and is shaped by hand in an authentic blacksmith shop in Quebec, Canada.A name or a date can be engraved on the optional base or on one of the leaves.S H I P P I N GFor US and Canada: Standard shipping is free. Please allow 4 to 8 business days (processing + shipping) to receive your order.Expedited shipping is available in the cart for US customers.For international orders: please allow 2-4 weeks for delivery. Faster shipping is available upon request. Please notify us before your order is placed so we can adjust the invoice for the additional cost. All customs and import fees are the responsibility of the buyer.",
    "reviews": [
      "Awesome gift idea! My girlfriend loved it!",
      "Great flower, just as described.",
      "Item as described. Well constructed and looks great! Thank you!",
      "amazing"
    ]
  },
  {
    "productId": "BDwylXvhjY",
    "url": "https://www.etsy.com/listing/591968980/personalised-photo-keyring-in-leather?click_key=0d27370daf605d5a9db498f46b55983fa15b6fad%3A591968980&click_sum=b0003db6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-44&etp=1",
    "title": "Personalised Photo Keyring in Leather Case + Initials | Father's Day Keepsake | Gift for New Dad | Personalized Photo Keychain | UK Made",
    "description": "Perfect for Christmas, this beautiful metal and leather photo keyring makes the perfect personalised gift for him.Your chosen photo is printed directly printed onto the stainless steel insert, and this is hidden within the leather case, making a subtle yet heartfelt gift that can be taken wherever you go. Ideal for Father's Day, Valentine's, Mother's Day or birthday gifts.The leather case is available in either black, navy blue, light natural, leopard print or mint green and can be personalised with foiled or blind debossed initials (up to 6 characters), making each keyring all the more unique. Brown leather will be blind debossed, navy blue with silver foil and all other colours come with gold foil. Either choose from our list of popular options, including Grandma and Grandad, or choose to add your own initials (up to 6 characters) which must be submitted in the 'notes to seller' box at the checkout. Please be aware that our stamping availability is limited to uppercase letters, numbers and the symbols ‘! . ? ‘ & ♥’.Once you have ordered, please refer to our photo guide when choosing the photo you want to include. Your photo should be of the highest possible quality – we recommend iPhone camera standard as a minimum. Please keep the shape of your product in mind – cropping may be required so make sure this is possible without the main part of the image being lost.*****HOW TO ORDER ✍1. Select one of the names from our list or choose 'own initials' if you would like your own text2. Choose your colour3. If choosing own text, enter the name/initials you would like in the personalisation box (up to six characters)4. Add to basket and make payment5. Visit the 'purchases and reviews' tab in your Etsy account📷 HOW TO ATTACH PHOTO 📷1. Click 'Contact the seller' to open a new Etsy Conversation and attach the photo you would like to use.2. Please provide your order number so this is linked to your order.WANT A DOUBLE PHOTO?  📷 📷Visit our listing herehttps://www.etsy.com/uk/listing/825971610/personalised-double-photo-keyring-withWANT ADDED TEXT ON THE BACK? 📝Visit our listing herehttps://www.etsy.com/uk/listing/967715933/personalised-leather-case-photo-keyringMADE FROM🧵UK cowhide leather with stainless steel insert.Our logo is engraved subtly on the ring.Leather is a beautiful, natural product, please note colour and grain may vary from the pictures shown.All products are made to order in our little workshop in The New Forest, Hampshire. Our raw materials are ethically sourced and we are also proud members of The Woodland Trust.DIMENSIONS 📏4cm x 3.5cm x 0.3cm",
    "reviews": [
      "Great quality, second time I’ve ordered from here. Very pleased.",
      "The key chain is amazing. Great quality, super cute and the perfect size. It was SUPER fast shipping and worth the purchase!! Love it!",
      "Everything I expected it to be!",
      "The picture quality is good"
    ]
  },
  {
    "productId": "evDlrdGLIi",
    "url": "https://www.etsy.com/listing/1282689201/personalized-large-charcuterie-board?click_key=48dcceb34a849f52cc2d87ec43d39b6271c841f3%3A1282689201&click_sum=b381f9bb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-45&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Large Charcuterie Board, Rustic Charcuterie Board with Handle, Wood Cheese Board, Custom Wedding Gift, Farmhouse Decor",
    "description": "Rustic farmhouse-style walnut charcuterie boards - These beautiful cheese boards can be used to serve charcuterie, appetizers, cheese, or even be used as wall art and home décor.Your personalization is engraved with our high-power laser using an elegant script handwritten font, this charcuterie board makes for a beautiful wedding gift, anniversary gift, housewarming, Christmas, or just because!DIMENSIONS (including handle)Small: 12.5\" long x 8\" wideMedium: 15.5\" long x 8\" wideLarge: 20\" long x 8\" wideWHO WE AREWindset Studio is a family-owned business located in Reno, Nevada. We live our lives with the philosophy that the environment we create is really an extension of who we are. Everything we put into our boards exemplifies this philosophy - from the attention to detail, materials, and the personalization that makes each piece truly unique.UNIQUENESSThese walnut boards are made with very high standards and each have their own unique grain figuring and coloration. Therefore, each board is a little different (i.e. wood will have different grains, patterns, etc).CARE-Highly Recommended!- Keep your board looking incredible with our board-care kit! The kit contains our handmade conditioner made from a perfect blend of mineral oil & beeswax, a lint-free microfiber cloth, and care instructions to maintain your beautiful board for years to come! See our Etsy store to purchase the care kit with your board.• Avoid scrubbing the board vigorously during cleaning, as it may lead to fading of the finish.• Never soak the board or place it in the dishwasher.• Prevent deep-pigmented foods from coming into direct contact with the board to prevent potential staining.• As with any porous material, food usage is at your own risk.DISCLAIMER:Please double check the spelling and date before ordering. We understand it is easy to make a mistake when ordering, and we want to make sure you get the board as intended. We will copy and paste all information into our designs. We are not responsible for errors caused by misspellings or mistyped information in the personalization box. If you find there is an error after ordering, MESSAGE US IMMEDIATELY and we will work to resolve the issue before your board is made. Once the board is made, we cannot make any changes.",
    "reviews": [
      "Beautiful craftsmanship, great size. Fast shipping",
      "Beautiful board, well made, love the shape. I know the bride and groom will love it!  Bonus, love shopping and supporting local craftspeople!  Thanks.",
      "EXCELLENT product.  Great quality and met expectations.",
      "Love this board for a wedding gift."
    ]
  },
  {
    "productId": "aagmreVRgY",
    "url": "https://www.etsy.com/listing/865897009/custom-doormat-monogram-wreath-family?click_key=881e391c9ec82f17e36e7796ac9edabe355cb2af%3A865897009&click_sum=0c2e1a40&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-46&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Doormat Monogram Wreath Family Name Wedding Gift Personalized Doormat Closing Gift Welcome Mat Door Mat Rug Monogram 1012",
    "description": "Discover the unparalleled quality of our doormats crafted from 100% coir, featuring custom UV-printed ink that seamlessly blends durability and beauty to withstand the elements. Our mats are designed to endure, providing both long-lasting functionality and aesthetic appeal.The unique composition of 100% coir, combined with precision UV printing, ensures a mat that not only stands up to the test of time but also adds a touch of personalized elegance to your space. Coir, known for its resilience, makes these mats ideal for various environments, delivering both durability and style.Choose from a range of size options tailored to suit your specific needs:4\"x4\" Sample Square (Please note: No printing on the sample coir piece; it serves as a pure representation of our coir material.)16\"x24\" for Apartment Doors18\"x30\" - The Most Common Size24\"x36\" - Large Mat24\"x48\" - XL Mat36\"x60\" - Huge Front Door MatIt's essential to care for your doormat to preserve its design and longevity. We recommend placing your mat in a dry, covered area to protect it from the elements and extend its lifespan. Maintenance is a breeze – simply shake or vacuum away any debris to keep your mat looking fresh.Please note that exposure to water may cause discoloration. When coir gets wet, it may temporarily darken, which is a natural characteristic of this material. Embrace the beauty of your doormat's evolving appearance as it weathers the elements.Elevate your entryway with our coir doormats – where durability meets personalized design for a welcoming touch to your home.***We recommend that you keep your doormat in a dry, covered area to prolong the life of the design. To clean, simply shake or vacuum away any debris. If/When Coir gets wet, it will turn to a darker color***Welcome Entrance Greetings Cozy Home Outdoor Decor Entryway Welcome mat Personalized Stylish Rubber Anti-slip Seasonal Funny Hospitality Clean Durable Front door Design Outdoor doormats Welcome mats Entry mats Front door mats Rubber mats Coir doormats Personalized doormats Decorative mats Anti-slip mats Seasonal doormats Funny doormats Custom doormats Indoor mats Non-slip doormats Modern doormats Eco-friendly doormats Novelty mats Washable doormats Heavy-duty doormats Designer doormats Natural fiber doormats Monogrammed doormats Contemporary doormats Patterned doormats Extra-large doormats Low-profile mats Cozy doormats Stylish  Entrance mats Elegant welcome mats Bohemian doormats Colorful doormats Recycled rubber mats Farmhouse doormats Classic entry mats Geometric pattern mats doormats Jute doormats Traditional welcome mats Funny Doormat porch decor doormat cute home doormat Personalized Gift Girlfriend Gift house warming closing gift farmhouse decor Gifts for him birthday gift doormat wedding gift doormat cute Farmhouse New Home Gift Last Name Personalized Front Porch Decor Door Mat Custom Door Mat Closing Gift Welcome Mat Funny Welcome Mat Personalized Doormat Wedding shower Wood Sign Bridal Shower Wedding Decor Funny Doormat cute doormat doormats Gifts for him front door home decor closing gift Boyfriend Gift birthday gift Birthday Gift coir doormat funny gift first house gift new home gift porch decor Funny Doormat Door Mats Funny Welcome Mat Wedding Decor For Couple Personalized Doormat Personalized Last Name Gift for Her Closing Gift Housewarming Gift Cute Doormat Porch Decor Monogram Gift for Her Door Mat Cute Doormat New HomeGift Funny Welcome Mat Wood Sign Front Doormat Welcome Mats Custom Door Mat Funny Welcome Mat Unique Gift Personalized Gift Bridal Shower Front Porch Decor",
    "reviews": [
      "Happy with the order thanks",
      "Very beautiful got for in laws for Christmas",
      "Second order and again great product and customer service, my client loved it!\nWill be ordering again as Closing gifts for my clients"
    ]
  },
  {
    "productId": "eBCniARZzz",
    "url": "https://www.etsy.com/listing/240527779/personalised-custom-rustic-wooden?click_key=fb6adee96db5cee224386ff817194361b1b6b469%3A240527779&click_sum=c4f465de&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-47&etp=1&sts=1",
    "title": "Personalised Custom Rustic Wooden Chopping Cutting Cheeseboard | Anniversary | Personalized Gifts | Unique Wedding Gift | Engagement Gifts",
    "description": "A beautifully designed, unique and custom engraved personalized gift. Crafted from rustic olive wood and ideal to use as chopping, serving, charcuterie or antipasti board, made from sustainable, natural olive wood. A perfect personalised keepsake gift for Christmas, birthday, valentines, weddings, anniversaries, new home/housewarming, etc.The bottom edge has been left organic with hints of bark and rough natural edges for that rustic look and feel.★SustainabilityWe only use wood from very old olive trees that have come to the end of their natural fruiting life and have already been replaced with younger, more productive trees.★Another step forward for sustainability!By now choosing to not brand our gift boxes, we're encouraging recipients to engage in sustainable practices by reusing, repurposing, or regifting them. This approach reduces waste and promotes a more eco-friendly way of celebrating occasions. It also aligns with the growing awareness of environmental responsibility and encourages a circular approach to gift giving. Providing versatile and unbranded gift boxes gives them a longer lifespan and encourages creative thinking on how they can be used beyond their original purpose.Hand finished with an odorless and flavourless, organic hemp oil.★Personalization: Simply enter the details for personalisation in the above text box and follow the instructions  (we can also use your own company logo as part of our branding service. Please get in touch).♥ If the HEART ♥ symbol is required for middle line (as pictured) then simply type the word \"Heart\".Work will be carried out in the advertised layout using ALL 3 fonts AND underlining as pictured. The middle line text will also be in uppercase only, as pictured.★DeliveryThe dispatch and delivery times will show on your order confirmation. We will always dispatch your order on time. Delivery to the US is within 2 working days, once dispatched. Yes, that is correct. Within 2 working days from the UK to US!★Care instructionsHand wash with hot, light soapy water.Treat often with olive, coconut or any other food grade oil.Care guide included.No glue or chemicals are used in the production of this item.★Sizes★4 sizes available.Please check the dimensions of your Personalized Gift carefully before ordering.Shapes of rustic bottom edge, grain and colour will vary as each olive wood cheeseboard is unique.7.9\" x 5.5\" x 0.8\" (20cm x 14cm x 2cm) - Perfectly handy for chopping herbs, chilies, garlic, ginger, cheese, etc.11.8\" x 5.9\" x 0.8\" (30cm x 15cm x 2cm) (MAIN PRODUCT IMAGE) - Great for serving cheese, chopping veg, and as above.15.7\" x 6.5\" x 0.8\" (40cm x 17cm x 2cm) - As above again....but looks great as a serving and presentation board on the dining table.★ GIFT BOXES NOT AVAILABLE FOR THE FOLLOWING SIZE★19.7\" x 7.9\" x 0.8\" (50cm x 20cm x 2cm) - As above, but large enough to serve as a Charcuterie board!More Personalized Gifts and Homeware can be found in our store.https://www.etsy.com/uk/shop/RusticFlitch____________________________________________________________Design, images, titles, product descriptions and content are protected by Copyright and Intellectual Property Law ©2011-2023 The Rustic Dish Ltd®",
    "reviews": [
      "Excellent quality, absolutely loved it!!!!",
      "Oh it's just perfect :) thank you so much 10/10 x",
      "This item was really Beautiful",
      "Beautiful and arrived within days! Can’t wait to give this as a wedding gift!"
    ]
  },
  {
    "productId": "iJshUnocAH",
    "url": "https://www.etsy.com/listing/797154391/a4-met-engaged-married-foil-map-print?click_key=32a2ea4366bd3e8060162d7c403c5bb3156119e3%3A797154391&click_sum=c5c731d7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-954096-7-48&pro=1&frs=1&etp=1&sts=1",
    "title": "A4 Met Engaged Married Foil Map Print, Custom Multi Location Wedding Anniversary Personalised Print in Copper, Gold, Silver or Rose Gold",
    "description": "A combination of your three favourite locations. A favourite memory, a moment to hold forever, a wedding location,  a holiday, the perfect gift for your loved ones or yourselves. Customize your print from our selection of paper and foil colours and your own personalized text. A preview will be available for your own approval 24 hours before producing the print.Using the locations you will provide us, we will print your chosen design and apply by hand copper, gold, silver or rose gold foil.Simply send us your destinations and a short title, for example the location, a date or a memory that can be put underneath each of the maps. This is the perfect gift for that passionate travelers, an anniversary with a loved one, multiple memories to keep forever. Please note that we will choose the radius that makes the best composition for your creation. If you wish for a specific detail on the map to be visible please specify when placing your order.Please bear in mind that this item is handmade and uniquely made for you. Differences in the way the foil adheres to the paper, seldom spots and marks give character and mean that no two prints are identical. Each product though is thoroughly examined to be of top quality and aesthetically perfect.***HOW TO ORDER***▸ Choose your framing option from the drop-down box▸ In the personalisation field, please enter:1. Location 1 - eg. city, postcode or full address, along with any additional details.2. Line 1 of text under Location 1 - to be printed in CAPITALS (customizable fonts if you so wish)3. Line 2 of text  under Location 1 - to be printed in italics4. Location 25. Line 1 of text under Location 2 - to be printed in CAPITALS (customizable fonts if you so wish)6. Line 2 of text under Location 2 - to be printed in italics7. Location 38. Line 1 of text under Location 3 - to be printed in CAPITALS (customizable fonts if you so wish)9. Line 2 of text under Location 3 - to be printed in italics10. Want a heart in the middle?11. Names on the top▸ A preview will be sent that must be approved within 24 hours. If we don't hear back from you within those 24 hours your print will be sent as ordered.**You do not need to include all available lines of personalisation - for example you could just have the first 2 lines with the place name and date.DIMENSIONS:Unframed A4: 21 x 29.7cm (8.3 x 11.7 inches)Frame (1.5cm deep): 24-26 x 33-34.5 cm (9.4 x 13 inches) depending on the frame colourPlease note that all import or customs fees are payable by the purchaser.DELIVERY:We are dispaching from the Netherlands where our workshop and we are located at the moment.UK Delivery:Free delivery by PostNL, which aims to deliver in 1-2 weeks. You can upgrade to Tracked delivery when placing your order.International Delivery:Our Standard International delivery is not a tracked service. You can upgrade to a Tracked & Signed service when placing your order. Please note that all import or customs fees are payable by the purchaser.",
    "reviews": [
      "Excellent gift for Valentine’s Day!\nGreat communication with seller.",
      "We received a very nice print. It was perfectly packed so it couldn't be folded and customer service was great, we liked to have one location a bit zoomed compared to the others, we received a digital example of how it would look like before creating the final version, in the end it was the perfect gift.",
      "Great item to get for any loved one"
    ]
  },
  {
    "productId": "kYXFMJpFYG",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=603d065971843e5774989a28d2bc419571211654%3A1115114382&click_sum=4ca53091&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "ZeASHXMQJn",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=7f7728a0f1b19b1781083b45258525b4f551768f%3A654638870&click_sum=af7f2276&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "LhJiekIzgD",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=e132a13c86104a88fd98c568f5bbe2129fbb1562%3A1355783916&click_sum=bb2754bc&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!",
      "This amazing hand sketch really captures the soul and spirit of the loving couple - thanks to the wonderful work of M Gokhan who was able to  catch every nuance of expression in the original photo  - a beautiful memory to cherish!!"
    ]
  },
  {
    "productId": "MWnmaRIxaO",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=05d8bd73f3fa1dc21fc20bb5cc6ee47d019860f1%3A1411614241&click_sum=6de8e6ff&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "rVZMnZYltc",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=648786cbd8e2d2999429c4714ff63de4b8396eab%3A999136086&click_sum=f54b8447&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "HpvPXFGrW8",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=27e724af3585a6f20a95c1db4470f9a2088be24b%3A1440285597&click_sum=e54dce70&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!",
      "Just as described. Would order again."
    ]
  }
]
