[
  {
    "productId": "uvEKBwLCRp",
    "url": "https://www.etsy.com/listing/934777186/easter-bunny-decor-stuffed-wool-bunnies?click_key=a31dc139bb3340f53d67fae7824747efcc88b765%3A934777186&click_sum=ada6a0c0&ref=search2_top_narrowing_intent_modules_etsys_pick-1",
    "title": "Easter bunny decor, Stuffed  wool bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunny",
    "description": "Easter bunny decor, Stuffed  wool bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunnyStuffed bunnies for home decor, Easter basket bunny, farmhouse style, primitive bunnySet of 3 Easter bunnies. One set is for one green, one pink and one yellow bunny. Bunnies are made of old but clean sweater. I love to upcycle old clothes.Please note: as all the bunnies are made of old sweater- green rabbits have all a little different look! The back side of the green rabbits is shown in the photos (it is plane green).All stuffed Easter rabbits are made of old sweater. I love to reuse old materials. Ecofriendly decorations. Bunnies are perfect rustic farmhouse deocrations or Easter basket decor. Even nice spring gifr idea!All bunnies are stuffed with pillow filling.Bunnies are 9.65 inch (24.5 cm) tall, the widest side is 4.70 inch (12 cm) the bottom.This is a decoration, not a toy!For more Easter ornaments and spring home decor ideas please visit:https://www.etsy.com/shop/tertsdesign?ref=seller-platform-mcnav&section_id=18416408I ship worldwide from Estonia Europa.Thank you for visiting my Tertsdesign shop:https://www.etsy.com/shop/tertsdesign",
    "reviews": [
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!",
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!",
      "Very pretty!  The butterflies were well made, beautiful quality!  Thank you!"
    ]
  },
  {
    "productId": "EVYTfpFR2T",
    "url": "https://www.etsy.com/listing/1653429768/mini-personalized-knitted-wire-name-wall?click_key=04730816715e108f621dac47c261f110d5ce66d7%3A1653429768&click_sum=29f904c1&ref=search2_top_narrowing_intent_modules_etsys_pick-2",
    "title": "Mini Personalized Knitted Wire Name Wall Hanging | Children and Baby Bedroom, Birthday Gifts, Easter Basket Gift Tag",
    "description": "This mini knitted wire is a perfect and special way to decorate your little one's Easter baskets, birthday or Christmas presents, or as a cute decoration for their bedroom. Each measures 3\" in height for the capitol letter, and approximately 2.5for lower case. Length depends on the amount of letters needed.This custom banner is made by hand with knitted wire and is available in over 30 different colors! Easily match your little one's bedroom, nursery, or home's holiday decor. A fun and unique addition to any space. These custom wire hangings make a great gift too! Easily hang on your wall with a push pin or command hook, or tie to any gift with the matching strand provided!\"Brooklyn\" is made with pink yarn\"Grayson\" is made with baby blue\"Caleb\" is made with goldenrodPlease remember that your handmade sign is not a toy and should be kept away from children and pets. During shipping, it is normal for the knit on your sign to pull back, exposing some of the wire. Gently pull the knit back over the wire to cover.Our items are handmade in a smoke and pet free home.*** When purchasing items needed for a specific date, please leave a note in your order form letting me know when. I will do my best to accommodate, however please be aware of my turn around times (which does not include shipping, or bulk/multiple items) and other delays such as holidays or weather. If you have any questions, please message me. Thank you!",
    "reviews": [
      "It turned out awesome!! I can’t wait to gift it at the baby shower!",
      "This is perfect as a decorative hanger for a mirror with chain.  Used a double threaded screw.  Love it!",
      "High quality craftsmanship. Beautiful addition to any decor!"
    ]
  },
  {
    "productId": "0xaeXSMZPI",
    "url": "https://www.etsy.com/listing/1414500238/easter-egg-hunt-tokens-easter-egg?click_key=e6a79b6c75c51095103274a690d9a7d8506ea099%3A1414500238&click_sum=87b8334f&ref=search2_top_narrowing_intent_modules_etsys_pick-3",
    "title": "Easter Egg Hunt Tokens - Easter Egg Stuffers - Easter Basket Stuffers - Easter Reward Token - Wooden Easter Coins - Kids Easter Gift",
    "description": "Want to give your children more than candy in their Easter eggs this year? Tired of the mess of tiny toys that only get played with once? Use these Easter egg fillers instead! Each bunny has a fun or special activity or small monetary amount on it. You can also create your own activities with our blank add on option! Collect memories instead of things this spring. Please note eggs are not included.Tokens are cut, scored, and engraved by a laser machine. Sometimes items and packaging may arrive with a slight smoke/burn smell. If you are sensitive to smoke smell this may smell stronger to you. Tokens may also have slight burn marks. We do our best to avoid this but sometimes it is unavoidable.***** IMPORTANT INFORMATION – READ BEFORE ORDERING *****TURNAROUND- Orders ship in 3-5 business days.………………………………….F E A T U R E S :• Solid wood engraved on one side.• Tokens come in a bag for storage.• Half set is 12 random tokens.• Full set is 24 tokens listed below, including one of each.………………………………….P H R A S E S  I N C L U D E :- Special lunch for school- Date with Mom- Date with Dad- Free chore day- Donuts- Extra game time- Pizza night- Outside time- Ice cream- Extra TV time- Movie night- $1- $2- $3- $5- Build a fort- Stay up late- Zoo trip- Bake cookies- Game night- New book- Go to the park- Small toy- Extra dessert………………………………….S H I P P I N G :• All items get sent via USPS first class mail.• Priority 2-3 day Domestic shipping upgrade available at checkout - NOTE choosing priority shipping does not shorten the production time, it just speeds up time in transit.………………………………….<<< R E T U R N S & E X C H A N G E S >>>Please note that we cannot process cancellations or returns for orders older than 24 hours.Do you have additional questions or want a custom design?If so, please message us directly on Etsy and we will respond as soon as possible.",
    "reviews": [
      "Very cute! Great idea for Easter",
      "Shipping was very fast and the quality of the product was amazing",
      "These were fantastic and my kids were even more excited about them than candy!  Additionally, the shop owner was fantastic. I had ordered these late, thinking I was ordering them for the following Easter, they wouldn’t arrive on time. But the shop owner reached out to me, shortly after placing the orde,  to upgrade my shipping if I wanted them to arrive by Easter. She was great!"
    ]
  },
  {
    "productId": "WZQOQiXfNi",
    "url": "https://www.etsy.com/listing/1660635928/easter-carrot-basket-tags-svg-carrot?click_key=fc42c7949ad936109d0701002b3bd591dbef6d8e%3A1660635928&click_sum=e17dc4ce&ref=search2_top_narrowing_intent_modules_etsys_pick-4&pro=1",
    "title": "Easter Carrot Basket Tags svg, Carrot Bunny Ears Tags svg, Easter Name Tag, Easter Basket Tag, Bunny bundle, carrot dxf, lasercut, glowforge",
    "description": "★ This is and Digital item DOWNLOAD INSTANTLY ★Pay attention: it isn’t the real product, it’s the file which you can download. No physical item will be shipped.PLEASE CHECK THAT YOUR MACHINE CAN USE THESE FORMATS: DXF and SVG filesAfter your payment is confirmed, Etsy will send an automated email to let you know your files are ready to download. To download, follow the Etsy email link or visit your purchase/order history on Etsy and next to the item(s) there will be a \"Download Files\" button. Click that button and follow prompts.LICENSE AND USEYou can:use these files to create items for personal useuse these files to create finished products to sellYou may not:However, you CANNOT:use the picture for another purposeUse any portion of these files to sell digitally in any formatsharing or selling these files for any reasonWARRANTYI don't accept returns, exchanges or cancellations. But please contact me if you have any problems with your order.THANK YOU!",
    "reviews": [
      "great file will shop again",
      "Many thanks!",
      "This is soooo beautiful thank you so much",
      "Love the design will use on other items to."
    ]
  },
  {
    "productId": "jFGxBIuRAh",
    "url": "https://www.etsy.com/listing/1679534057/spring-embroidery-table-runner-hand?click_key=d204d1a17d2c5720514dda8b459dcd0a904daad8%3A1679534057&click_sum=945d0b5a&ref=search2_top_narrowing_intent_modules_etsys_pick-5&frs=1&sts=1",
    "title": "Spring Embroidery Table Runner, Hand Embroidered Cloth Table Mat, Hand Stitched Festive Dinner Table Decor",
    "description": "Delight in the most delicate spring details this Easter! Welcome new beginnings and celebrate the Spring season with our handcrafted and embroidered cotton table runner. Embroidered with our favorite animals: chicks, bunnies, sheep, ladybugs and bumblebees, along with sweet Spring blossoms - this heirloom table runner is set to fill your home with sweetness for the year ahead.With gorgeously hand-embroidered spring blossoms around the center and the edges, our runner can be used throughout the spring and summer holiday seasons.Hand-embroidered.Made from 100% cotton.Crafted with love by artisans in India.60\" Long x 20\" Wide.Pairs delightfully well with our Spring Embroidery Napkin Set and our Spring Embroidery Cocktail Napkin Set.Our table runner comes ready to gift, tied with two cotton ribbons and wrapped in tissue paper along with a postcard highlighting our product's handmade and fair-trade story. You can also add a gift message or chose additional gift wrapping options at checkout.",
    "reviews": [
      "The ornament is exactly as pictured, a nice weight and solid. More than that, the seller was super helpful when USPS lost the package and sent a replacement the same day. Lovely folks to do business with!",
      "This is adorable, I gets lots of compliments!",
      "This basket is so sweet. I am obsessed!!"
    ]
  },
  {
    "productId": "tWbsOZrZlW",
    "url": "https://www.etsy.com/listing/945969660/easter-diy-craft-kit-easter-birdhouse?click_key=e42f226481c84f78d1eb262ef2dd5f18ebabba3e%3A945969660&click_sum=3acf25c4&ref=search2_top_narrowing_intent_modules_etsys_pick-6",
    "title": "Easter DIY Craft Kit | Easter Birdhouse | Kids Spring Craft",
    "description": "In this craft kit you receive everything you need to create this adorable Easter Spring Birdhouse! Paint the 3.8” wooden house, add ribbons, moss or wooden stick roof + cute Easter & spring themed add-ons to make this one of a kind craft!Get creative and design your own cute Easter Spring Birdhouse. Each kit is uniquely curated to make something truly special! These kits are perfect for kids as well as adults!Supplies included:-1   3.8” Wooden Birdhouse-6  Paint colors-4  Mini pastel plastic Easter eggs-1   Mini pastel wooden bunnies-2  Mini foam carrots-1   3D paper Spring butterfly-1   Bag wooden sticks + flower sequins-1   Container of Tacky Craft Glue-1   Paintbrush-1   Small bag of moss-Various sizes + designs + colors of ribbons/stringsSuggested additional supplies NOT included:- Other paint colors or paintbrushes if desired- ScissorsThere are so many ways to create your Birdhouse with plenty of supplies to be as creative as you want! These make great gifts and also a fun at home craft project for you or your little ones.**Please note that the birdhouse design has slightly changed! Now it comes with a loop on top so you can actually hang your birdhouse outside if you desire!Thank you!!**",
    "reviews": [
      "So much fun!",
      "The crafts from this shop are the cutest! The customer service is awesome- so kind and helpful! They really went out of their way to help when needed."
    ]
  },
  {
    "productId": "jwp3wzQBgv",
    "url": "https://www.etsy.com/listing/1683048907/easter-breakable-smash-chocolate-2-large?click_key=b0079c0f7b5fcb037825c531927e84705a818728%3A1683048907&click_sum=d7e9f74c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-1&pro=1&frs=1&bes=1",
    "title": "Easter Breakable Smash Chocolate -  2 large Carrots filled with fun Jelly Belly Jelly beans. Comes w/ 2 hammers. Individually wrapped.",
    "description": "Get your orders in early!! 🐣🐇🌷🌸** Order today and we can delay shipping for Easter arrival -fantastic idea for Easter baskets! 🥕🥕 Break out of the regular gift-giving routine with these unique breakable candy Easter carrots. 🌸🌷Handcrafted of premium orange colored Ghirardelli chocolate, our crave-worthy carrots are filled with Jelly Belly jelly beans in flavors from Root Beer and Blueberry to Sour Cherry and Tutti-Frutti. The festive treats each come with a wooden hammer tied with a lavender bow for cracking them open and releasing the sweets inside. 🐇🌸Deliciously hand-crafted with premium Ghirardelli chocolate. Over-filled with all sorts of fun holiday candy. 🥕Fun for parties, grandkids, gifting little ones, classmates, wedding guests, bridal showers, baby showers, sweet 16’s, class parties, co-workers, teacher gifts…. 💜**🐇🌸 Orders of 48+ get free personalized labels on each box, and choice of coordinating ribbon color**🥕🌷PRODUCT DETAILS* 11.9 oz./168.86g food total.* 6.5” length/2” at their widest point.* Set includes 2 chocolate carrots and 2 wooden mallets.* nut freeRECEIVING INSTRUCTIONS* Store unopened at room temperature for up to 12 months.Arguably the best tasting Easter breakables on Etsy!Get your orders in now before the Easter ordering frenzy starts. 🤪",
    "reviews": [
      "Such a cute item for Easter! The seller was very accommodating with getting my item shipped so it wouldn’t sit and melt in the mailbox while we were out of town.   I can’t wait to see the kids get excited to crack open their carrots!",
      "Thanks Thanks thanks thanks thanks",
      "Exactly as described!!!  Will definitely be back."
    ]
  },
  {
    "productId": "jBVlSjbFMc",
    "url": "https://www.etsy.com/listing/1420363215/personalized-kids-easter-tote-easter-egg?click_key=2026c67f021aeddeea2623e92e49964b47cb5cdb%3A1420363215&click_sum=631b8aea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-2&pro=1&bes=1&sts=1",
    "title": "Personalized Kids Easter Tote, Easter Egg Hunt Bag, Girl Boy Personalized Easter Basket Tote Bag, Easter Eggs Hunting Bag",
    "description": "♥Please read below about our professionally printed personalized Easter totes♥Size 15.5\" x 13.5\" (please allow +/- 1/2 in. tolerance)Natural Linen colorReusable and perfect for Easter egg hunts, Easter basket fillers, Easter gifts,  shopping, going on trips and more!Professionally printed in our studio with a permanent ink that will not fade or peel.Printed on one side, reverse is blank.Hand wash with plain detergent and air dry; warm iron on reverse when necessary. Do not use baby soaps or free or clear type soaps, no bleach.Each tote is custom made to order and may vary slightly in design or color. You will have the option to choose either the girl or boy style at checkout.Listing is for one personalized tote bag only, photo props not included.Please note that colors on monitors can vary slightly from monitor to monitor. The color on the product you receive MAY vary slightly from what is shown on your monitor.",
    "reviews": [
      "LOVE!!! Will buy from here again! Great quality!!",
      "SO CUTE!!! Love the quality!!!",
      "Perfect! Just as pictured, fast shipping.",
      "Cute tote!!! Good quality! Fast shipping!"
    ]
  },
  {
    "productId": "0bLGCbWXjH",
    "url": "https://www.etsy.com/listing/1186627937/easter-basket-candy-arrangement-large?click_key=71f376c24aec95935dea5c09e7fcfdfd4adebc05%3A1186627937&click_sum=85748b38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-3&sca=1",
    "title": "Easter Basket Candy Arrangement Large",
    "description": "Large Easter Basket is used to create this large Easter Candy Arrangement.  Easter themed chocolate is included.  Any specific candy preferred can be requested.",
    "reviews": [
      "This basket was absolutely beautiful and huge filled with amazing candy. I would definitely recommend buying this and I would buy it again I made a review earlier because Etsy made me feel like I was supposed to have gotten it but I didn’t because I agree to get the basket closer to easter. But I was not disappointed. 5 stars.",
      "Sent to a friend as a birthday gift, she loved it.  Came out beautiful.  Will definitely buy something again. Highly recommend.",
      "Amazing quality and packaging \n5 stars",
      "These are an excellent “thank you gift”, for my daughter’s wedding!  The seller is quick to respond & my order was here in a few days!  The packing was extremely well padded, so the pretzels arrived as pictured.  My husband and I had a taste test…..they are delicious!  The groom pretzel is chocolate & the bride pretzel is vanilla (my husband said the groom pretzel tastes like a Twix).  \nThe seller & her product are excellent!!"
    ]
  },
  {
    "productId": "ZacfvnNzfV",
    "url": "https://www.etsy.com/listing/778787366/easter-gift-box-easter-care-package?click_key=898b0258892f01c2fc18bc83111f461401294dff%3A778787366&click_sum=7993664b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-4&pro=1&frs=1&pop=1&sts=1",
    "title": "Easter Gift Box| Easter Care Package - Succulent Gift Box with Soy Candle, Sea Salt Caramels, Matches, and Greeting Card",
    "description": "Is there someone you think is truly awesome – a coworker, friend, neighbor? Then let them know by sending them one of our truly lovely gift boxes packed with thoughtful items …. and we can mail directly to them!Love Delivered ❤️➡️GIFT BOX INCLUDES:✿ A Live, Healthy Succulent in 2.5 in. Designer Pot**. Succulent Care Instructions Included✿ 4 oz. Scented Hand Poured Soy Candle with a Cotton Wick & a 15 Hour Burn Life✿ 4 Mouth Watering Chewy Caramels✿ Decorative Matches✿ Crinkle Paper✿ Personal greeting card with your handwritten message!✿ Free Shipping➡️SUCCULENT CARE:Please let your recipient know there is a LIVE plant being delivered and the look of succulents vary. They come in a variety of shapes and sizes. Some are taller and some are shorter, and may differ from the display photo. They are chosen at random. Your succulent will need immediate sun & water upon delivery. Succulents are very hardy plants; however, on rare occasions the plant may get damaged during shipping. Give the plant a day or two to recover and follow the enclosed succulent care instructions.  If the succulent does not recover from rough shipping or you are not satisfied with the succulent PLEASE REACH OUT.  We strive for 100% customer satisfaction!**Due to succulent pot shortage there may be variations in pot designs and color. They will still have a cute feel and same vibe as our shop! 🖤➡️SHIPPING:✿ Shipped in a branded Gift Box Love Co box ready for gifting!✿ All gifts are shipped out 1-2 business days after the order was made. Additionally, as you're making your order, Etsy provides you with an estimated delivery date.✿ Please note, if you are shipping this as a gift, please update the shipping address to the giftees address. We will ship to the address you give at Etsy checkout.***✿ If an incorrect shipping address is given and the gift is returned back to our shop, the customer is responsible for paying the re-shipping fee.***✿ PERSONALIZATION can be made by leaving a message in the personalization area; please remember to ALSO INCLUDE YOUR OWN NAME. Messages written on the card are exactly as they were received in the order.✿ Please check the photos for instructions and answers on questions you might have.✿ No receipt or pricing information is included in our gift boxes.✿ We ship using USPS and FedEx depending on package size and delivery location.",
    "reviews": [
      "My daughter loved her Easter gift!",
      "My daughter said it was “AWESOME!”",
      "Great to work with.",
      "Amazing to work with."
    ]
  },
  {
    "productId": "qMsQpMq7dN",
    "url": "https://www.etsy.com/listing/1417089291/personalized-easter-egg-craft-kit-paint?click_key=ff8847362e49efbced22f06fd46391cc2cba64d9%3A1417089291&click_sum=5cc8a47f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-1&bes=1&sts=1&content_source=bebab29a64745c1d86aa58fc5d308cc57b46e6f5%253A1417089291",
    "title": "Personalized Easter Egg Craft Kit, Paint Kit for Kids, DIY Children's Craft Kit, Gift for Child Grandchild Nephew Niece, Easter Activities",
    "description": "Who doesn't love to paint?  This would make a great and fun activity for Easter!  These Easter eggs have been cut from MDF wood and measure at approximately 5.75\"x4.4\".Concerned about a potential mess after painting?  No worries!  If you buy the set with the paint and brushes, the paint included is washable and non-toxic.Each set (egg, paint and paintbrush) will be individually wrapped in a clear, reseable bag with crinkle paper placed inside.   If you would like each egg individually boxed for gifting purposes, be sure to choose the “Set - Gift Box” option!  The gift box will have the name of the recipient on the top via sticker.  Gift box sets will not be in a clear resealable bag.**Note: This listing is only for one egg.  If you would like to order multiple, please place as many eggs as you would like into the cart with a personalization note for each.***Feel free to message me if you have any questions!",
    "reviews": [
      "They both loved their eggs",
      "Grand daughter loved her egg",
      "Just what I was looking for",
      "The item is very cute."
    ]
  },
  {
    "productId": "PynkfqWbFZ",
    "url": "https://www.etsy.com/listing/790311017/first-easter-gift-personalized-baby?click_key=58d69deef4a634874dd57ded6d21981be7d5381b%3A790311017&click_sum=ac63f0b3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-2&pro=1&frs=1&etp=1&sts=1&content_source=7ed6dbde6fd812ff604e138c311cce4a48afb74d%253A790311017",
    "title": "First Easter Gift, Personalized Baby Blanket, Personalized Baby Gift, Bunny Blanket, Easter Blanket, Baby Shower Gift Birthday Gift Animal",
    "description": "Baby BlanketThis blanket makes a perfect keepsake and baby shower gift for a mom to be.They are perfect for Hospital Gifts, Birth Announcements, Birthday Gifts, Christmas and just snuggling those precious babies.DETAILSDesign: Printed On One Side. Designs are printed using high quality inks that will not fade or peel. The fabric stays silky smooth against skin. This is NOT embroidery or vinylCare: Machine Wash; Tumble DryAvailable Materials: Fleece / Minky / Sherpa (dependent on size)Please Note: All sizes have a variance +/- 1\"-2\" due to heat causing shrinking when pressed.DISCLAIMER: Periodically tiny microfiber dots may occur – this is a natural occurrence in the fabric (mostly seen in fleece). They typically appear black, blue, orange or yellow in color. Once the fabric is washed, they usually are less visible. This is common in sublimation - caused by natural fiber particles!Please note with preconstructed items, exact symmetry is not guaranteed.*Please review photos for size references!*CUSTOM ORDERSI LOVE creating new designs but for a design that I do not currently offer please contact me before ordering to see if can create your request.HOW TO ORDER1. Choose the Size & Material for the drop down menu above (see photos for references)2. Add your Personalization requests (include the name(s), font, and color)3. Click \"Add to Cart\"4. Enter your payment information, shipping address, *DOUBLE CHECK EVERYTHING* and click \"Order\"5. Sit back and wait for your special package in the mail!RUSH ORDERSIf you are in a rush, I do offer an express production option.Please add this listing to your order-https://www.etsy.com/listing/498793304RELATED LISTINGSInterested in more personalized baby gifts? Look through the following listings to complete your order!https://www.etsy.com/shop/DashingFoxCoFAQS:.What material is most popular?Jersey is our most popular for baby swaddles because they're stretchy and are not thick.  Minky and Sherpa are our most popular for a standard baby blanket because of the softness and thickness.Are these personalized?Yes, the babies name will be changed to the one that is left in a note for me during checkout. If you would not like a name to be added you can leave the note blank or simply leave \"No Name.\"Do you do custom designs?Absolutely! I love to make custom designs. Please contact me before ordering to make sure that I am able to produce the design you would like.Can the blanket be made in a different color?Sometimes, The text and parts of some designs can be made with a different color. Watercolor floral is not able to be changed however I can try to create something with floral in the color you are looking for. Please contact me before purchasing to make sure I can make the adjustments you would like.Can my order be rushed?Yes, if you need your order rushed, I do offer an express production option to have your order shipped quicker. Just apply it to your order:https://www.etsy.com/listing/498793304Can the fonts be changed?Absolutely!! Just include a note for me during checkout.What is Minky?Minky is a special type of plush fabric that is often used to make baby blankets, baby clothing and baby accessories. Minky fabric is like fleece – but softer and thicker.What is Jersey?It is a 100% lightweight polyester material that stretches. Perfect for swaddling. Features rounded corners.What is Fleece?Fleece blankets are made of 100% Polyester. It is a thinner blanket but provide a very vibrant print.What is Sherpa?Sherpa is an Ultra Plush blanket. It is a 100% polyester with a faux fur fabric on the back. The faux fur side is available in white. Tan back is available by request only.Will I receive a proof?We do not supply a proof of your personalized design as standard to ensure we do not delay your order, however if you would like to see the design before we create it please request this along with your personalization when you place your order. If requested we will not proceed with your order until you are 100% happy with the design. Please ensure you factor in extra time for this, as edits may delay your order.ADDITIONAL NOTES▹ Please keep in mind when ordering that color settings on monitors and lighting in product photography vary so the product might differ a tad from what you see on screen.▹ I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.▹ If you have any questions, please use the “Message Seller” button next to the price and I’ll get right back to you.Remember to select the ♥ FAVORITE button to save this product for later!Thank you so much for shopping at DashingFoxCo!https://www.etsy.com/shop/DashingFoxCo© 2019 DashingFoxCo",
    "reviews": [
      "Second to me ordering the same item for my second born and I love it!",
      "Soo beautiful for my babies first Easter!",
      "Gorgeous,gorgeous,gorgeous",
      "Exactly as picture !!!! Received it on time for Easter !!"
    ]
  },
  {
    "productId": "GwNknOpdpB",
    "url": "https://www.etsy.com/listing/1157296781/baby-boy-romper-baby-boy-easter-baby-boy?click_key=a4355172b903b7781ac23853503fe027a28f4db5%3A1157296781&click_sum=82c581cb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-3&pop=1&sts=1&content_source=e75f23b7bb7375e1307f87ec1715ad079fbe4d17%253A1157296781",
    "title": "Baby Boy Romper, Baby Boy Easter, Baby Boy Bunnies, My 1st Easter, Newborn Boy Clothes, Tesa Babe",
    "description": "Baby boy romper with \"My 1st Easter\" front graphic. He'll look cute and feel comfy in our soft and stretchy 100% cotton rib.  Envelope neck and snaps underneath for easy on and off. Optional hat completes the outfit.  THIS ITEM IS SPECIALLY PRICED AND IS NOT RETURNABLE. PLEASE CHECK DETAILS CAREFULLY BEFORE ORDERING.SHIPPING & PROCESSING TIMEFree Shipping on orders $35 & up (domestic only) via 1st Class USPS.Our usual processing time is 3-5 business days. Transit time is usually be 1-4 business days domestically, and 3-12 business days internationally. You may upgrade shipping at checkout if you’d like quicker transit time. Review details & turnaround time quoted in this listing and make sure this works for you.  We are not able to rush orders after being placed, and we cannot accommodate requests to speed up processing time.SIZESNewborn fits 6-9 lbs (3.6 kg), up to 20\" (51 cm) tall0-3M fits 9-12 lbs (4.7 kg), 21-24\" (57 cm) tall3-6M fits 12-16 lbs (6.3 kg), 24-26\" (63 cm) tall6-12M fits 16-22 lbs (8.6 kg), 26-30\" (71 cm) tall12-18M fits 22-28 lbs (11.3 kg), 30-32\" (79 cm) tallCARE INSTRUCTIONSMachine Wash Warm, Tumble Dry Low.100% organic cotton rib, exclusive of decoration.Embellished in Irvine, CA of imported materials & garments.CANCELLATIONS, RETURNS & EXCHANGESI accept returns, exchanges, and cancellations on non-sale, non-specially priced items:• Request a cancellation within 8 hours of purchase• Contact me within 3 days of delivery to return or exchange• Ship items back to me within 7 days of delivery to return or exchangeUnless they arrive damaged or defective, I cannot accept returns for specially priced styles or anything on sale.Because of the nature of these items, unless they arrive damaged or defective, I cannot accept returns for:• Custom or personalized orders• Items on saleCHANGES AFTER ORDERINGIf you’ve discovered you need to make a change on an order already placed, convo us within 8 hours and request a cancellation.  Then you can place a new order with correct information.  Etsy does not allow for changes on orders once in their system, and we have found that errors and misunderstandings can occur when changes are made manually.ABOUT TESA BABETesa Babe offers original boutique clothing and accessories for newborn, infant and toddler girls & boys. High quality and made with care, we provide a combination of soft & snuggly, fun & fabulous clothes.JOIN US!Want to be the first to hear about our newest styles and upcoming sales?  Convo us with your email address and we’ll add you to our list!© 2021 Truffle Kids Inc.The photographs, visual artwork on product, garment style of product and wording in this listing are all copyrighted and owned by Truffle Kids, Inc. Tesa Babe® is a registered trademark of Truffle Kids, Inc. All rights reserved.",
    "reviews": [
      "Great Easter gift for my grandson!",
      "Very nice quality. Soft material.",
      "I bought this for my son’s first Easter outfit and it did not disappoint! He’s only going to be a few days-weeks old for Easter and it was so hard finding a cute first Easter outfit for a newborn. I cannot wait to put him in this little adorable little romper. It’s great quality and it arrived quickly. Definitely don’t hesitate to purchase you won’t regret it!",
      "So adorable- excellent quality.  I highly recommend this shop!!"
    ]
  },
  {
    "productId": "zkmxquPHNB",
    "url": "https://www.etsy.com/listing/1662911408/hand-painted-wooden-easter-eggs?click_key=32fd456fae039703d866719bacc54d496a4fd266%3A1662911408&click_sum=fc502205&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-4&etp=1&content_source=2d7f907d43cfe45b20f26b79222eb1d07b45734f%253A1662911408",
    "title": "Hand Painted Wooden Easter Eggs",
    "description": "Hand painted 3\" wooden eggs.",
    "reviews": [
      "Item is beautifully hand crafted.",
      "Beautiful! Delicate painting of high quality. Arrived  quickly and was well packaged. Will buy again.",
      "Beautifully crafted. Items arrived quicker than expected!",
      "Thank you so much!",
      "I just wS\nwasn't satisfied till I had all of the eggs! The colors look so pretty toether! The only thing I need now is a lavender!",
      "Thank you so much for your kind words! (Lavender is in the works!)"
    ]
  },
  {
    "productId": "alBtUfC8jZ",
    "url": "https://www.etsy.com/listing/1662757222/16-easter-tokens-easter-egg-fillers?click_key=a8240f1739fee8028c4eff0b9b5e91727aca66b5%3A1662757222&click_sum=2e990082&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-5&pro=1&bes=1&content_source=3970a5466375d4dc513661a8a2d435d74a7d05fe%253A1662757222",
    "title": "16 Easter Tokens. Easter Egg Fillers. Easter Egg Hunt. Wooden Reward Tokens For Kids. Children Reward Coupons. Easter Activity For Toddlers.",
    "description": "· Easter Tokens ·A great game for children on Easter.Hide tokens in plastic eggs and organize an egg-collecting quest for your little ones.16 tokens that include various tasks and nice bonuses in the form of coins.Collect memories with BUSY PUZZLE and spend this wonderful time with your family.PLEASE NOTE that plastic eggs are not included.Wooden Easter tokens are packed in a specially designed bag. (See photos).· COUPON ·When buying 2 or more Baby Toys or Easter Decor, we have an additional coupon discount: EASTERJust add it to your shopping cart.· Details ·• The TOKENS is made of plywood.• There are five color sets available:- Blue- Pink- Yellow- White- MixedSee the infographic!· The dimensions of each egg ·Length: 1.2 inches (30 mm)Height: 1.5 inches (38 mm)· List of tasks ·1. Date with mom2. Date with dad3. Pizza night4. $15. $36. $57. Movie night8. EXTRA 5 MINUTES SCREEN TIME9. LATER BEDTIME10. You pick dinner11. Outside time12. Morning donuts13. Park day14. Treat after dinner15. FUN ACTIVITY16. One toy at store· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Very well made, would order from this seller again.",
      "Perfect Easter basket addition! Can’t wait for our boys to see them!",
      "Super cute Easter basket addition, will be placing inside plastic eggs instead of candy.  Nice craftsmanship and quality.",
      "N/a. I don’t want to"
    ]
  },
  {
    "productId": "bthSRzebin",
    "url": "https://www.etsy.com/listing/1432360357/tic-tac-toe-valentine-custom-travel-game?click_key=aa67ee89494f5ce26039b8759cea93ccac15628c%3A1432360357&click_sum=27c38d93&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-6&pro=1&frs=1&etp=1&sts=1&content_source=d87fb6c9f3071dfabbbba638dc465d59f73e7f3a%253A1432360357",
    "title": "Tic Tac Toe Valentine, Custom Travel Game Children, Valentine's Day Gift for Kids, Valentines for Class, Wooden Kids Game, Personalized Gift",
    "description": "You should not miss this one if you are looking for adorable and unique Easter Basket Stuffers!This listing is for a freshest design of personalized Tic Tac Toe board to be printed or laser engraved with a custom name, phrase or sentence on top.You are also allowed to pick any 2 shapes from a list of different styles, as shown in the last image. Truly personalized, meaningful and one of a kind.The board and and pieces are made of linden wood. Each piece is laser cut and edges are carefully rounded.Each set will come with 10 game pieces total, 5 of each style.Each game board measures approximately 4.5\" x 5.5\" and will easily fit into a purse or bag to travel, play on coffee table, or keep kids entertained in cars.***HOW TO ORDER***Please pick the shape styles you love and then place the item in cart.  When you checkout you will see a box for you to write personalization instructions to seller. Please write the name/phrase/message you hope to print or engrave on top of the board.***Turnaround***This is a custom made item and will be made to order. Please allow 8-15 days for it to arrive at your place.",
    "reviews": [
      "I love this puzzle. It’s the perfect gift for a toddler",
      "Great gift for new baby.",
      "Seller was very helpful on answering my questions and able to show me a mock up before finalizing . I’m so happy with the wooden name and how it came out . thank you!"
    ]
  },
  {
    "productId": "CZYFyESAli",
    "url": "https://www.etsy.com/listing/1678780701/18-easter-bunny-designs-cute-easter?click_key=1ebf7c054f867faa43e603d01d9340055596582a%3A1678780701&click_sum=691da755&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-7&pro=1&bes=1&content_source=6a6ebe84c37a8fa4235b37a19dfd36d6e5f45f0a%253A1678780701",
    "title": "18 Easter Bunny Designs. Cute Easter Decor. Personalized Bunnies. Wooden Custom Peeps. Easter Family Gifts. Spring Fireplace Set.",
    "description": "• Personalized Easter Bunny •Add a pop of color to your Easter decor with our Wooden Easter Bunnies! Available in various hues, these charming decorations are perfect for family gatherings and make delightful gifts for loved ones.• Available Designs •We offer 18 different designs in two sizes: S (small) and L (large).CHECK out the infographic!• Sizes •S (small): 3.94x1.97 inches (10x5 cm)L (large): 4.72x2.36 (12x6 cm)Egg Holder: 3.94x3.15 (10x8 cm)• Personalization •For an additional fee, you can have the name applied to the bunny.• Available Variations •Two options are available: boy (bowtie on the neck) and girl (bow on the ear).• Materials •Made from solid wood and covered by water-based paint or linseed oil (for wooden one).• Questions •1. If you receive a damaged product, please contact us. We will gladly resolve this issue.2. Please note that we do not own delivery services and cannot control the shipping process. If you experience delays, check if your product was sent correctly. If everything was sent on time, the issue may be with the delivery service.",
    "reviews": [
      "These are so adorable. I can't wait to give them to my granddaughters!",
      "Super cute, well made, beautifully painted and personalized",
      "The bunnies are super cute, love the color selection. The bows add that extra something. They are very well made and personalized",
      "Thank you for your feed back!\nIt is precious to know the items have met your expectations!\nWe will be happy to make more personal items for you in the future)",
      "The bunnies are super cute and very well made and personalized"
    ]
  },
  {
    "productId": "JcellccNbq",
    "url": "https://www.etsy.com/listing/1177590667/funny-easter-cards-for-best-friends?click_key=3be049deec57675e06dbdf2bd574465011dd5886%3A1177590667&click_sum=92d834e4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-8&etp=1&sts=1&content_source=55dc41d10fab1426589f6456c232ca2b74275d9c%253A1177590667",
    "title": "Funny Easter Cards For Best Friends - Creepy Rabbit Cats Easter Cards",
    "description": "Awkward Family Photos with the vintage Easter Bunny Mascot to celebrate spring season. This funny Easter card is perfect for cat lovers.😃Hand-painted, printed, folded, and packed all by me - 100% handmade😃A2 size 4.25 x 5.5 inches folded card😃Blank inside😃Printed on extreme heavyweight cardstock with matching envelope😃Ship in rigid protective mailer, full refund for damaged/lost cards😃Sustainably sourced materials - No plastic packaging for single cardBack to the shop:LiyanaStudio.Etsy.com🎁 GET A FREE CARD! (AND MONTHLY 15% OFF COUPON)Get a coupon code to receive a free card with any purchase instantly when you sign up for our e-mail list at:👉 Signup: https://rb.gy/1bolcd😸 GREETING CARD SETSWant more than one? Check out our greeting card sets with discount plus free shipping!https://www.etsy.com/shop/LiyanaStudio?section_id=23123028💖FOLLOW US FOR UPDATES!I am @Liyanastudio on Instagram & Pinterest.🌈WHOLESALE?Interested in wholesale? We'd love to work with you! Send us a message for more information.Please contact me with any questions, I usually reply super-fast all 7 days.We are trying to be more eco-friendly by reducing single-use plastic waste, so a single card will be shipped without a cello bag. It will be carefully shipped in a DO NOT BEND rigid mailer and will arrive safely. Please, let us know if you would like your card to be shipped in a cello bag (i.e. your area is in the rain season).",
    "reviews": [
      "Cute card and quick shipping!",
      "My sister loved it so much. It’s a framer",
      "Cute cards for cat lovers."
    ]
  },
  {
    "productId": "rIRCBFysdH",
    "url": "https://www.etsy.com/listing/1187456229/personalized-soothing-bunny-sensory-toy?click_key=6ba8e3af29906aa126a25418b5613665407865e2%3A1187456229&click_sum=f56df215&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-5&frs=1&bes=1&sts=1",
    "title": "Personalized Soothing Bunny | Sensory Toy | Name Engrave Baby Shower Gift | Easter Bunny Wooden Silicone Bunny | Wooden Ring | Toy Rattle",
    "description": "PERSONALIZED IN SAN ANTONIO, TEXAS, FROM ONE MOMMA TO ANOTHER!At BabySalute we love to provide affordable Children, Baby, Toddler Products.  As a momma of two Young Boys I know how hard it is to find something unique and custom.This adorable Bunny made from Silicone and Beechwood makes the perfect addition to any Gift Basket, Holiday Basket, Baby Shower Gift, and above all for your own baby!!On top of all this, we Custom Engrave in a very Modern Cursive Font called \"Autumn\" Font for that Farmhouse, Rustic Look!Pick your choice of Color, and then simply place the name you would like to have on the Bunny Wooden area.  Please limit this to one word, the Bunny only has a few areas to engrave.Any additional engraving requests are extra.FREE SHIPPING ON OUR ITEMS ALWAYSHelps with development, grasping, hand eye coordination and motor skills.We have a wide variety of colors compared to many other shops on here! Comes in its own special baggy as well.For personalization please ensure you purchase the personalized option. Do not pick Non Personalized and add a name. We will send out a non engraved bunny.--PRODUCT DETAILS--- All our products go through rigorous safety testing before they launch, from both our side, and our supplier side.- Made from Food Grade Silicone- Non Treated Beech Wood Ring (Can be treated with beeswax, or coconut oil at your own preference)- Free of BPA, PVC, Phthalates, Lead, Cadmium, or Harmful Colors- Beechwood is Naturally Resistant to Bacteria- Safety tested to meet US requirements CPSIAMost bunnies will have light charring due to wood burning as it engraved.  We let the bunny Air out with airflow fan to cure these scents but regardless they can continue. Any excess burn marks can we wiped off with damp wipe. Any excess burn smell usually goes away after a few days but has no chemicals as it is natural non treated wood.--SAFETY--Our number one goal is that you enjoy our product while at the same time knowing about safety!Remember this is a small photo prop and needs to take the following into consideration the moment you make the purchase and it is in your hands.• Please always use under adult supervision at all times• Inspect the item regularly and with each use in order to identify any signs of wear and tear; if you see any type of sign Please Discard immediately• Clean before and after each use, silicone is prone to catching dust--CARE INSTRUCTIONS--Both the Silicone and Wooden part of the Bunny needs to be treated nicely with extra care in order to keep the wood in good and usable condition so that it can last longer. Please do not submerge bunny in water and Only wipe with damp cloth to clean.",
    "reviews": [
      "So cute and can't wait to give it to my granddaughter for her first Easter.",
      "It is the perfect gift for our grandson's first Easter.",
      "Very nice baby gift.\nFast service."
    ]
  },
  {
    "productId": "NYBxUKWuKA",
    "url": "https://www.etsy.com/listing/1639709942/personalized-baby-busy-board-puzzle?click_key=e14a79c934c6a17c83ef7816789c49c85e25f091%3A1639709942&click_sum=112e448a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-6&pro=1&frs=1&bes=1",
    "title": "Personalized Baby Busy Board Puzzle, Custom Name Puzzle, Baby Gifts, Toddler Montessori Toys, First Easter Gifts For Kid, Busy Board Gift",
    "description": "✨Welcome to GreenTabella, where it's a world of toys for children, and you can discover the perfect name puzzle toy for your little one.🌷This busy board name puzzle is brimming with creativity, offering six different color schemes and six distinct themed puzzles. It's not just a toy; it's an educational tool that's crucial for your child's development and fun-filled play. It will stimulate your child's imagination, help them explore various elements and themes, and provide opportunities for interactive learning with you.🎁If you're in search of the ideal Christmas, baptism, birthday, or milestone growth gift for your child, this busy board is undoubtedly your best choice. This personalized busy board isn't just for entertainment; it aids in cognitive and motor skill development and sparks creativity and imagination.💍Dimensions:Length: 15.35 inches (39 cm)Width: 9.45 inches (24 cm)Perfectly sized for little hands to hold and play with.🧡Each element on the busy board has been designed and drawn by my child and me, brimming with our passion and creativity. This busy board is an expression of our deep love and dedication to this product. Each pattern, each color represents the beautiful moments we've shared, making this busy board not just a toy for us, but also a symbol of precious memories and family emotions.🛒How to Order?-Choose the number of letters in your child's name and whether you need pegs (for easy gripping by little hands).-Select whether you need a stand and laser engraving.-Fill in your child's name, puzzle color scheme, and laser engraving text (if selected) in the message section.🎨Why Choose Us?-Handcrafted with love and attention to detail.-Safe, non-toxic materials for your child's well-being.-Unique design for a truly personalized touch.-24-hour prompt response.-Fast and reliable shipping for your convenience.💌We hope that this passion and creativity can be passed on to you, becoming a companion for you and your child as you explore and grow together.🎁 You can find more personalized gifts here:https://www.etsy.com/shop/GreenTabella😊Have any Questions?• If you have received a damaged product, please reach out to us. We are ready to return your full price for bad quality.• Please keep in mind that we do not have ownership of the delivery services, and we are unable to directly control the shipping process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.🎈Terms and Conditions for Safe UseEvery child is blessed with imagination, and we have gone to great lengths to provide you with a toy that prioritizes safety.🧡Comment:If you have any special requests or further questions, please feel free to contact us, we will reply you as soon as possible within 24 hours.",
    "reviews": [
      "Super cute girt for a toddler!",
      "Beautiful work and shipped and delivered quickly",
      "Beautiful item, shipping took longer than anticipated but overall a great buy"
    ]
  },
  {
    "productId": "DSJwEwydAa",
    "url": "https://www.etsy.com/listing/993613650/ships-next-dayeaster-playdough-kit?click_key=b237ae71ee498a4a56099238ad9ab152896e149f%3A993613650&click_sum=30eddc29&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-7&bes=1&sts=1",
    "title": "SHIPS NEXT DAY!,Easter Playdough Kit, Playdoh kit, Play Dough Kit ,sensory bin,Spring Sensory Kit, kids party favors,easter basket stuffers",
    "description": "Happy Life Magic presents the most ADORABLE Spring Play Dough Sensory JARS!!These jars are too sweet to pass up on... loaded with Company made ,fresh, all natural play dough,AND the cutest SPRING accessories for the kids to make endless creations!They make the perfect class gift, or a fun filled activity with your sweet little one!! These will be a hit for sure!!!!Easter Play Dough Jars include:- This listing is for one jar.-  plastic jar with lid- over 3 ounces of company made, all natural, preservative free play dough- toys/ trinkets to match themeBuild a Cottontail!- 8 oz jar-6 ounces of white play dough-eyes, ribbon bow, buttons and little jar to build a bunny- bunny figure- 2 roses- mini easter eggs- pom pom ball tail**** Ships free with orders over $35***Small Parts- Warning. Not for children under 3. Adult supervision necessary.",
    "reviews": [
      "This was a gift for a friend's daughter who is autistic & she loved it..",
      "The seller was fast and communicative! The jars were wrapped in bright color tissue paper and inside the jars the play dough was wrapped separately in cellophane. I can’t wait to gift these for Easter! Will buy again",
      "The seller was fast and communicative! The jars were wrapped in bright color tissue paper and inside the jars the play dough was wrapped separately in cellophane. I can’t wait to gift these for Easter! Will buy again"
    ]
  },
  {
    "productId": "PblhqrzKBp",
    "url": "https://www.etsy.com/listing/1685649897/easter-bunny-peeps-candle-gift-easter?click_key=5a729fabb0d5fa6f72f02f2721224e91befb4e4c%3A1685649897&click_sum=376aafea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-8&pro=1",
    "title": "Easter Bunny Peeps Candle Gift, Easter Candle, Cute Easter Gift, Easter Decor, Favorite Bunny Gift, Best Friend Gifts, Womens Easter Gift",
    "description": "Personalized, \"You're One Of My Favorite Peeps\" Candle with Custom Name!Packed with immersive aromas, these scented candles come in 9oz glass jars and are one size (2.8″ × 3.5\") (7.1cm × 8.8cm). Made with 100% natural soy wax blend, each candle features a 100% cotton wick and a permanent adhesive label where your custom designs can come alive..: Materials: 100% natural soy wax blend, 100% cotton wick and a glass jar.: One size: 2.8″ × 3.5\" (7.1cm × 8.9cm).: Burning time: 50-60 hours.: Glossy permanent adhesive label.: Choose from five different aromatic scents.: Assembled in the USA from globally sourced parts.: NB! All scents have the same wax color",
    "reviews": [
      "They came out perfectly and arrived quickly!! I’m so happy with them!",
      "Great product! Loved the vanilla scent!",
      "Securely packaged.  Smells great and looks great"
    ]
  },
  {
    "productId": "qZIfgphpEq",
    "url": "https://www.etsy.com/listing/1504095837/personalized-kids-hat-embroidery-name?click_key=efde099a1492e0cc524dc54953286184a1cfe036%3A1504095837&click_sum=12ee65c6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-9&pro=1&bes=1&sts=1&content_source=5db93f07b82900f9d05c8b0812a78e94577c34c7%253A1504095837",
    "title": "Personalized Kids Hat, Embroidery Name Baseball Hat, Baseball Cap for Child, Soft Hat for Baby, Candy Color, Unisex Cap, 0-4 Years Old",
    "description": "✤ Tips: Due to the soft material of the hats, embroidery may result in slight wrinkling.✤ Product details:Each hat is embroidered with a personalized name, adding a unique and special touch. Whether it's for a day at the park, a family outing, or simply to complete their everyday look, these hats are a must-have for your little fashionistas.✤ Embroidery Name:Make these hats truly special by adding your child's name with beautiful embroidery. The personalized touch adds a unique and memorable element to their hat, making it one-of-a-kind.✤ Perfect Size:Hat Circumference: 17.7-19.6 inchesSuggested Age: 8 months - 4 years oldThis ensures a secure and comfortable fit, accommodating the growth of your child as they explore the world around them.✤ Fabric: Cotton.The Kid's Base Hat is made from high-quality materials that are both soft and durable.✤ Eye-Catching Candy Colors:Available in 6 different colors: Black, Cream, Yellow, Light Blue, Red, OrangeFrom bright pinks to cheerful yellows, there's a color to suit every taste and personality.✤ Soft and Comfort:The soft material ensures a gentle and comfortable fit, allowing your child to wear the hat for extended periods without discomfort.==================================================We will do our best to ship your order as early as we can, you will receive a notification email with tracking information from ETSY.==================================================Return Policy:Due to the nature of customized products, we do not accept returns or exchanges unless there is a misspelling or design due to our mistake, we will send a corrected item at no additional charge.",
    "reviews": [
      "This is the cutest little hat/cap for a 14 month old.  Going back for more!",
      "Just the cutest hat for my little unborn grandson who is coming this July ‘24!",
      "Great material and very cute color! The embroidery is perfect too. Didn’t even realize before buying that it has a drawstring in the back for custom sizing - bonus!",
      "CUTEST HAT EVER. I LOVE IT."
    ]
  },
  {
    "productId": "thVdVbcRdW",
    "url": "https://www.etsy.com/listing/1669754202/personalized-easter-basket-custom?click_key=1a9be95cd6d47ca68c05d2bd0f20e57e50b6ba00%3A1669754202&click_sum=727aeb1a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-10&pro=1&bes=1&content_source=a2388e467502d8c9a95765db32ece7549fcea382%253A1669754202",
    "title": "Personalized Easter Basket. Custom Embroidered Easter Bunny. Kids Easter Basket. Baby Girl And Boy Basket. Egg Basket For Easter Activities.",
    "description": "LINK FOR EASTER BASKET STUFFERShttps://www.etsy.com/shop/BusyPuzzle?section_id=40022252· Personalized Easter Basket ·Our Personalized Easter Basket is the cutest gift for your little ones.By embroidering a name, you can make this basket more special.The basket has ears that tie up and turn it into a bag in which kids can store their toys.Also these cute Easter rabbit baskets can be used as Easter gift basket for kids, or let them fill with eggs on their exciting Easter egg hunt! Your kids will love going for an Easter egg hunt with this lovely rabbit basket!· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.· Dimensions ·Height: 8.6 inches (22 cm)Width: 8.6 inches (22 cm)· Details ·• Our Easter basket is available in 5 designs (SEE INFOGRAPHIC).Design #1 (beige-white checkered with a white inside part).Design #2 (gray-white checkered with a white inside part).Design #3 (mocha + white polka dots with a white inside part).Design #4 (white with pink eggs inside).Design #5 (white with blue eggs inside).• Bunny and embroidery are available in three colors (white, pink and blue) that you can choose from the options.NOTE that it isn't possible to embroider the name in capital letters.Only first letter of the name will be capitalized.For example, instead of EMMA you will receive Emma.PLEASE NOTE, if you want double name embroidery you have to pay extra and can choose it in the options.One Name is MAXIMUM 10 letters.• The basket is made of natural fabrics: cotton and plush (rabbit).• The inner color of the basket matches the color of the bottom.• The color of the bunny matches the inner color of the ears.· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·Don’t use machine wash to keep the baskets looking their best.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Love love my baskets.  They are perfect.  As I ordered them",
      "Love my baskets., just like I ordered",
      "I ordered these for my two boys and they came just in time for Easter! They are beautifully crafted and I am so pleased with everything, thank you!!"
    ]
  },
  {
    "productId": "dFvTJPibSH",
    "url": "https://www.etsy.com/listing/685223487/martins-chocolatier-luxury-easter?click_key=b1c17d10ca4def8b4f952510e461d74752ba2c95%3A685223487&click_sum=5bc6d748&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-11&etp=1&content_source=36bc408ca93281eb70fef79d42a4dcbb315e838f%253A685223487",
    "title": "Martin's Chocolatier Luxury Easter Chocolate Gift Box",
    "description": "A luxury selection of Easter Chocolate for all the family to enjoy. This assortment contains familiar Easter characters such as Chocolate Eggs, Easter Bunnies, Easter Hens and more. Made using Milk Chocolate, White Chocolate and Dark Chocolate, this chocolate gift set is perfect for adults and children alike!Our Luxury Easter Chocolate Gift Box contains 17 chocolates, perfect to hide around the house and the garden for a fun Easter Egg Hunt!Martin’s Chocolatier is an independent chocolate brand based in Nottingham, UK. Our chocolates are sourced ethically and sustainably across Europe.",
    "reviews": [
      "My nephew loved these. His parents also said they were delicious.",
      "Fantastic!! :) Very recommend!! :)",
      "Well packaged and see you again next Easter!"
    ]
  },
  {
    "productId": "ZyglCYKyfS",
    "url": "https://www.etsy.com/listing/1178409945/easter-basket-tags-basket-name-tag?click_key=9b01d9b86823776af0275a2ab9f8237a41999014%3A1178409945&click_sum=01216770&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-12&pro=1&frs=1&bes=1&sts=1&content_source=8fe2404d8709e20c4111dcb95535c64e860cda50%253A1178409945",
    "title": "Easter Basket Tags, Basket Name Tag Personalized, Easter Gift for Kids, Easter Gift Basket, Easter Basket, Easter Egg, Spring Gift Tag",
    "description": "Looking for a fun and personalized way to make your child's Easter basket stand out this year? Our Easter basket tags are made from high-quality wood and personalized with your child's name in durable acrylic, this tag adds a personal touch to your child's Easter basket that will make it stand out from the rest.Our egg-shaped basket tag is not just stylish, but also functional. With its sturdy design and easy-to-read personalization, you'll be able to easily identify your child's basket from the rest, making Easter egg hunts a breeze. Plus, our tag is reusable, so you can use it year after year, creating a special tradition for your family.We understand the importance of creating cherished memories with your loved ones, which is why we've created this special Easter basket tag just for you. Let your child's Easter basket stand out with our personalized egg-shaped basket tag, and make this Easter a truly unforgettable one!Our tags include multiple style options from flowers and butterflies to easter bunnies!Each of our custom Easter tags includes a white drawstring organza bag for safe storage so they can be stored safely!>>DETAILS• 1⁄8” Thick Highest-Quality Baltic Birch Wood• Name cut out of 1⁄8” acrylic in selected color>>DIMENSIONS4” h x 3” w>>FINE PRINTPlease note that each tag is made to order with natural wood. Both wood grain and wood markings will vary for each individual name tag. This is a quality to be treasured for its uniqueness. The tag has dark edges from the laser engraving and cutting process.All of our items are designed, cut, and assembled in Florida!Items are shipped USPS First Class and packaged with care to arrive safely to you.",
    "reviews": [
      "Very fast shipping, great simple name tag for Easter basket",
      "Purchased one for my daughter last year and one for my newborn son this year. The quality is amazing. Very fast shipping. Definitely recommend!",
      "So cute! I can’t wait to use it for my son’s Easter basket!"
    ]
  },
  {
    "productId": "zKwOvNefGY",
    "url": "https://www.etsy.com/listing/1391684201/hand-painted-fox-wooden-easter-egg?click_key=623dddbaab589c839a1fd7e4434c43b6cc7779bc%3A1391684201&click_sum=ccb945fb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-13&etp=1&content_source=98ba130be6c1020a7218ff394b6fd0854a98ee85%253A1391684201",
    "title": "Hand Painted Fox Wooden Easter Egg- Personalized Egg Ornament- Polish Pisanki- Custom Pysanky- Easter Gift- Easter Decoration- Floral Decor",
    "description": "Whether you're looking for an Easter gift, or a way to decorate your home, this original hand painted ornament is a way of doing so with style and meaning.Growing up in a traditional polish household, I was raised with the custom of hand decorating eggs for Easter. Nowadays, I put my own modern spin on this rich symbolic tradition; covering the eggs with everything from decorative patterns to floral motifs-  the possibilities are endless!This wooden hen egg has been hand painted with acrylic terra cotta paints which give it slight texture and a vintage accent. I painted a fox surrounded by a floral wreath and some more florals in the back of the egg to fit the scene. It was then coated with a water based satin finish.Each egg is made of solid wood.The small hen egg (round or flat bottom) weighs approximately 1.5 oz and is 2.5\" tall and 1.75\" wide.The medium goose egg weighs approximately 3.4 oz and is 3 1/4\" tall and 2 3/16\" wide.The large goose egg weighs approximately 6.6 oz and is 4 1/4\" tall and 2 3/4\" wide.They all have a flat bottom for easy standing.There is also an option to purchase an egg stand or cup for the 2.5\" round or flat bottom hen egg. The egg stand is 1-1/8″ tall x 1-3/4″ wide and the egg cup is 2-1/8″ tall x 1-11/16″ wide. I paint the egg stand/ cup to match the color scheme and design of the egg ornament you choose.The primary color options refer to the background color of the egg.Due to the hand painted nature of this product, no ornament is exactly the same - every piece is one a of kind and that's the beauty of it!If you'd like to personalize your egg, please note that the surface is rather small, so the shorter the message the better it will look.  Personalization is free of charge.Please let me know if you have any questions and I will be glad to help out.The eggs will be carefully and sustainably packaged so they arrive to you in perfect condition.*Colors may vary due to monitor settings.",
    "reviews": [
      "VERY Beautifully painted Red Fox Egg!  It actually has a little weight to it and the artwork is VERY colorful!  I ordered it w/a stand and the stand color matched the egg, VERY cute!  Received in about a week and a half so HIGHLY recommend this seller and would buy from seller again.",
      "Bought this for my daughter for Easter as she gets a painted egg each year. It is very pretty and I think it’s lovely! Charming",
      "It is so beautiful! Thank you so much!"
    ]
  },
  {
    "productId": "bioCPLpftg",
    "url": "https://www.etsy.com/listing/1167806271/1-x-pink-hand-decorated-egg-real-chicken?click_key=f3f01c5b55a5d9b2d0a9647c1513718064463348%3A1167806271&click_sum=54d98aa8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-14&bes=1&content_source=8fe16a837a095e2129e096a3bae4630e9f1f53a9%253A1167806271",
    "title": "1 x  Pink Hand Decorated Egg. Real Chicken Egg. Pysanky. Ornament. Gift.",
    "description": "Pink Collection.Hand decorated chicken egg using traditional Slavic technique called ‘Drop Pull’, Pysanky are made using similar technique. The egg is hollowed, properly cleaned, dried and decorated with melted wax using different sizes of pinheads and other tools to create the design.  Final design is protected by 2-3 layers of clear coat.Each egg is original, no two are the same, but a specific design and color combination (egg and wax colors) can be made in any number as needed.Feel free to choose an egg/eggs that you like from the pictures I have posted.  I have pre-made stock available but can custom create at no extra charge.Each egg comes with a ribbon.",
    "reviews": [
      "Beautiful eggs! Coming back for more!",
      "Made the recipient so happy!",
      "Can't give enough stars for these beautiful eggs! Absolutely perfect! <3 <3",
      "One of set of six.  Great purchase, highly recommend."
    ]
  },
  {
    "productId": "zZbnfotFCQ",
    "url": "https://www.etsy.com/listing/1398562659/personalized-easter-egg-custom-wood?click_key=92f7e7f0accb9c9451b4047ad3fe23e18de8dfe9%3A1398562659&click_sum=5416246a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-15&frs=1&etp=1&sts=1&content_source=0ca369b5168ba3a98aa8e3c949a099b0c7353210%253A1398562659",
    "title": "Personalized Easter Egg, Custom Wood Easter Egg, Easter Basket Gift, Personalized Easter Gift, 2023 Easter Gift Ideas, Kids --EGG-NW-100",
    "description": "Personalized Easter Gift 2023, New Easter Basket Gifts, Personalized Easter Gift, Custom Easter Eggs, Easter Gifts Ideas 2023, Easter Gift Ideas for Girls, Easter Basket Gifts for Boys, Easter Gift Ideas, Personalized Egg, Personalized Eggs, Wood Easter Eggs, Painted Easter EggsEtch This Out's new Personalized Easter Eggs are the perfect gift for your loved ones Easter Basket!Each Easter Egg features a professionally laser engraved design with your custom name or message.Our Easter Eggs have a flat base so they stand up, they are 2.5\" tall and 1.85\" inches wide.⚙️ Product SpecificationMaterial: Solid WoodSize: 2.5\" x 1.85\" inchesColor Options: Light Blue, Pink, Purple, Yellow, White, Raw Wood✅ Ordering & ProcessingWe make it our mission to process our orders fast and efficiently! You will be asked if you would like a proof upon adding your product to the cart. If you select No we will begin the production process right away for you! If you choose Yes on the proof, we will email you your proof of your order to ensure it is exactly how you envisioned it. We will work with you until you are completely in love with your new personalized gift and 100% satisfied with your order. Once we know you are completely satisfied with your and we receive your approval via email- Our team will start processing and making your unique gift!📦  Production ProcessIts time to get busy engraving! All orders are processed and shipped out within 24 hours of when we have received your approval of your proof.⏱️ Shipping TimesPlease be aware that shipping times may vary from 2-6 business days depending on the product and shipping class. First class mail generally takes 2-5 business days, while priority mail takes 1-3 business days to arrive.⭐ Satisfaction GuaranteeAt EtchThisOut, we know your are going to love your personalized product when you receive it. However If for any reason you are not satisfied with your order, we would be happy to assist you on replacing your item or fixing it for you.💲 Bulk OrdersWe are proud to offer bulk pricing on all of our products when purchasing 25 or more. Prices do vary based on the quantity you are looking for. Please send us a message about the quantity you are looking for and the zip code we will be shipping to.Personalized Night Lights Kids, Kid's Night Light, Children Night Lamp, Boys Room, Night Lights for Kids Kid’s Bedroom Decor, Children’s Lamp, Children’s Light, Personalized Night Light, Custom Night Light, Children’s Light, Kids Bedroom, Girls Room",
    "reviews": [
      "I love these!!!",
      "Item was too small and came late",
      "Item was too small and came late"
    ]
  },
  {
    "productId": "rdJzkBZuoA",
    "url": "https://www.etsy.com/listing/1396406497/easter-cottage-mini-edible-sugar?click_key=b615910dc07d4a68c69c04aedca332bcd47b33ef%3A1396406497&click_sum=da42e0fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-16&etp=1&sts=1&content_source=6044f98107eab7a81011cb793508fceff7073566%253A1396406497",
    "title": "EASTER COTTAGE MINI Edible Sugar Decorations - 36 Pieces Cupcake or Cake Toppers -  Easter Egg, Bunny, Carrots & Mushrooms",
    "description": "Make your cupcakes, cakes and other desserts stand out with these edible assortment of Easter-themed toppers!Featuring mushrooms, eggs, bunnies, and carrots, these mini decorations will add a little pop of color to your delicious treats.Made of finely granulated sugar and painted with edible food color.INGREDIENTS: Sugar, Water, Gelatin (Bovine), Modified Corn Starch, Cream Of Tartar, Maltodextrin, FD&C Yellow # 5, FD&C Red # 3, FD&C Red # 40, FD&C Blue # 1.Dimensions:BUNNY: 0.65 x 0.80 x 0.20 inchesEGG: 0.50 x 0.65 x 0.20 inchesCARROT: 0.30 x 0.65 x 0.20 inchesMUSHROOM: 0.60 x 0.45 x 0.20 inchesThis product will be properly packed and shrink-wrapped with adequate cushioning to protect from breakage during shipping. If breakage occurs, please contact me.For health and safety reasons, this cannot be returned or exchanged as these are food grade products.STORAGE: Store in a cool, dry place and not exposed to light. Light will cause the colors to fade over time.",
    "reviews": [
      "These are cute little toppers. Good for cupcakes. Hoping they will fit my mints, but may be a little to vig, even though they are mini. Definitely recommend!",
      "Arrived perfectly and fast! So cute! Thank you so much ❤️",
      "These are absolutely adorable! Thank you so much! Quick shipping!"
    ]
  },
  {
    "productId": "7PdwxIFxfM",
    "url": "https://www.etsy.com/listing/1674522249/easter-day-super-heroes-toddler-shirt?click_key=adbf1d25271be5dcefecf7843d07ebf3f9ba2c02%3A1674522249&click_sum=6e89b91a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-9&pro=1&bes=1&sts=1",
    "title": "Easter Day Super Heroes Toddler Shirt,  Easter Day Boy  Bodysuit, Easter Day Boy Shirt,  Cute Easter Bunny Boy Shirt  BB-11-27",
    "description": "HOW TO ORDER:1) Choose Bodysuit or shirt size2) Choose Bodysuit or shirt color3) Select design color if applicable4) For personalized designs - enter customization in “Add your personalization” field5) Select the \"Quantity\".6) Click \"ADD TO CART\". If you want additional items (to avoid paying for multiple shipping), go back to our shop and repeat the above steps.*Please review the product photos for available styles, size, shirt colors and other detailsProcessing Time/Shipping- All custom shirts are made to order and will ship mostly the next business day. Depending on your location, shipments should arrive within 3-5 business days from sent day for all USA orders.- All items will be shipped via USPS. Tracking is included. We are not responsible for damage to items or lost packages once it leaves our hands. We are not responsible for shipping delays.Care Instructions- Wash inside out with cold water- Machine wash cold on a delicate cycle- Do not bleach- Hang to dry (or low tumble dry)- Do not iron the design❤ BABY SIZES 📐3-6 Months :: 20-25 in. / 12-16 Ibs.6-9 Months :: 25-28 in. / 16-22 Ibs.12 Months :: 28-30 in. / 22-27 Ibs.18 Months :: 30-32 in. / 27-30 Ibs.❤ TODDLER T-SHIRT SIZES 📐2T :: Age: 1-2y | Chest width: 12 in. | Length: 15.5 in.3T :: Age: 2-3y | Chest width: 13 in. | Length: 16.5 in.4T :: Age: 3-4y | Chest width: 14 in. | Length: 18.7 in.5T :: Age: 4-5y | Chest width: 15 in. | Length: 18.5 in.",
    "reviews": [
      "Loved the finished product. Grandkids will be pleased.",
      "My son will absolutely love the shirt 👕 Fast shipping... Thanks so much!!",
      "Exactly what I wanted. Love how soft bella canvas tshirts are!"
    ]
  },
  {
    "productId": "iIZqI3zoni",
    "url": "https://www.etsy.com/listing/1188992911/personalized-puzzle-name-board-toy-gifts?click_key=91c5fe8f9784f7e6d21ea57259b093cffdd6d1c4%3A1188992911&click_sum=a579385b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-10&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Puzzle Name Board, Toy Gifts for Baby Girls, Custom Name Puzzle for Toddlers, Custom Wooden Baby Keepsake, Baby Shower Gift",
    "description": "This well designed name puzzle will be a unique toy gift for 1-4 years old girl or boy. It's could be a great early learning toy and beautiful name board as nursery decor.As listed is a personalized wooden name puzzle with adorable animal heads. Babies could learn to spell their names and tell animals while playing with this name puzzle. Below the animals, the name of each will be laser engraved so it could also be played as a matching game.>>>> WHAT'S SPECIAL <<<<♦ Completely Colored Letters- Letters on a common name puzzle are only colored on the front side. We do far more than that. Front, back and edges of each TYU name puzzle letter will be completely colored with water-based, non-toxic inks.♦ Free Engraving- TYU will not charge you a cent when you require us to engrave a message on anywhere of the puzzle. No limit on letter quantities.♦ Free shipping to USA, Canada, Australia, UK and most EU countries. No MOQ.♦ More Choices, More Customizable- TYU provides 20 different colorful animal head options and 25 color choices for letters. Pick your favourites and make your gifts one of a kind.♦ Light Weight, Soft Touch- TYU name puzzles will all be made of linden wood which is lightweight and soft, perfect for babies to play with.♦ Safer- Laser cutting applied for all parts to make sure every piece is cut neatly and smooth to avoid hurting babies' fingers.-  Pegs are secured with hidden nails so won't fall off and bring choking hazard.Each puzzle set is 3/8 inch thick in total. Letters are 1/5 inch thick and are raised an 1/8 inch above the front of the puzzle so it's easy for a kid to play with.Want to have a look at other unique designs we have? Here is the whole section:https://www.etsy.com/shop/Tyuweddinggifts?ref=simple-shop-header-name&listing_id=790066607§ion_id=24125360>>>> HOW TO ORDER <<<<You will be required to type you requests in the personalization box when you checkout. Please write below:1)  name of the baby2) color number for each letter(check the last image for my color list)3) animal numbers>>>> TURNAROUND <<<<All puzzles are custom made made to order. Please allow 10-15 business days for delivery after ordering.",
    "reviews": [
      "Great gift for new baby.",
      "Items matched the description. Arrived on time. Will definitely order again.",
      "Second puzzle we have ordered. Customised it for us to be exactly what we wanted. Beautiful quality, speedy delivery and excellent service. 10/10",
      "Fast production and delivery! Looks great"
    ]
  },
  {
    "productId": "tHCXv6eNBo",
    "url": "https://www.etsy.com/listing/1668922572/easter-bunny-money-holder-gift-easter?click_key=6c7d9e86411598225b3c2a3172dc2382f8072728%3A1668922572&click_sum=cde3ce26&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-11&pro=1&bes=1&sts=1",
    "title": "Easter Bunny Money Holder Gift | Easter basket stuffers, Easter Gifts | Easter Basket Decoration, Personalized gift, Easter Basket Tags",
    "description": "These cute personalized Easter Bunny Money Holders will make your kids Easter Day even more lovely and unique <3PRODUCT DETAILS• purchase contains 1 piece of Easter bunny money holder the custom name• product is made from premium quality wood• size of the product is around 3.7\" x  6.4\" - (need a different size? Message us!)• custom text can be added by request over the private message***RETURNS are not available, since orders are personalized and made just for you!***FIND US ON INSTAGRAM!instagram.com/ourvibescoFor FAQs and more information, please message us, we will be more than happy to hear from you :)",
    "reviews": [
      "I ordered 2 of these Bunny Money holders for our grandsons.  I'm sure they will like them.",
      "Super cute! It arrived quickly.",
      "My son will love this",
      "I love it for the children in the house"
    ]
  },
  {
    "productId": "ObIwQPHnmR",
    "url": "https://www.etsy.com/listing/1675115275/10-easter-bunny-lollipop-candy-kabobs?click_key=754613084a5c47020afb5a420c87fd53eb326147%3A1675115275&click_sum=1c445eec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-12&pro=1&bes=1",
    "title": "10+ Easter Bunny Lollipop Candy Kabobs Class Party Favors, Valentine Candy, Kids Candy Gram, Valentines Favor, Candy, Birthday, Easter Gift",
    "description": "Our Kandy Kabobs are always the biggest hit for classroom parties, baby showers, graduations, birthdays, or any other special occasion!♥ FAST SHIPPING! ♥Kabob orders will come wrapped in gift tissue and ribbons, ready to gift or party!For orders above 100, please contact us for a custom order!These make the perfect, jaw-dropping party favors and offer a great variety of candy to fit all taste buds!These are 6\" and 11\" sticks with approximately 4\" and 8\" of high-quality candy!WHAT'S INCLUDED IN XL:♥A Bunny Marshmallow Peep in Yellow, Pink, and Blue colors!♥Rainbow marshmallow twists♥Rainbow Sour Belts♥Marshmallow with white chocolate and sprinkles♥Fruity Mini Marshmallows♥Gumballs in Pink, Blue, and Yellow♥Gummy fruit slices♥Fruity marshmallow fruit slicesand more!Please note: Some candies and orders or candy may vary slightly. We will send only the best and vary depending on best quality available! Need to substitute or have a special request? Just message us!I am always getting new candies for new designs so feel free to ask for special requests and I will do my best to accommodate! I am also a professional graphics artist and can design labels for you, catering to your party theme or event.Candy may vary slightly depending on availability and what looks best!Contact me for special orders or larger orders!",
    "reviews": [
      "These Easter Bunny Kabobs were a major hit!  The kids I sent them to LOVE them!",
      "The item was beautiful and met my expectations",
      "Absolutely PERFECT!  These are the most precious kabobs for Easter or any events.  EXACTLY as pictured, forget the cake pops for a child's event these are so fun.  Child or adult event.",
      "The glasses are great and fun!"
    ]
  },
  {
    "productId": "tbjCNMmjth",
    "url": "https://www.etsy.com/listing/1679584851/gray-easter-bunny-with-chick-ornament?click_key=2965ceb59c5765eadb098d870f359bdd2df39ef0%3A1679584851&click_sum=60a55242&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-17&etp=1&sts=1&content_source=c5a7dd77c3e12206e0f1531661e4d03c9aadb5e6%253A1679584851",
    "title": "Gray Easter Bunny with Chick Ornament, Hand Felted Gray Rabbit Charm, Handmade Easter Decor",
    "description": "Our cute as can be Bunny is just a delight! Snuggling with its little chick friend, it's the sweetest gift to add to an easter basket. Certain to touch your heart and add that little touch of tenderness to your Easter decor.* All details are hand needle felted* Our ornaments come ready to hang with a string attached.* Made from sustainably harvested, locally-sourced merino-blended wool.* Fairly traded and made with love.* H: 5\"/13cm W: 1.5\"/4cm L: 1.75\"/4.5cm.Like all of our ornaments, this comes ready to gift in a lovely cotton pouch along with a postcard highlighting our product's handmade and fair-trade story. You can also add a gift message or choose additional gift wrapping options at checkout.This item is in stock and ships within 2-3 business days via USPS. We do our best to complete your order and ship it promptly. However, please note once your package is in the hands of the post office, we are not responsible if it becomes lost, damaged or stolen during shipping. After your order has shipped we will provide you with the details to track your package. We ask that if issues arise during shipment that you check with your local post office.Quality and magic that can’t be found in a factory. We design and craft beautiful gifts that support women’s entrepreneurship and preserve artisanal traditions, while cultivating ethical and environmental business practices that support everyone in our supply chain. We are detail and design focused. Obsessed with beauty. Committed to spreading joy.Our Products are made by hand in an environment of hope, honor and pride.Learn more about our work in our About Shop Pagehttps://www.etsy.com/shop/Craftspring/about?ref=shopinfo_about_leftnav",
    "reviews": [
      "The bunny holding a chick is just a classic vintage looking decoration.  The workmanship is excellent.  It’s evident that care was given in creating this bunny.",
      "This bunny is absolutely adorable! Fast shipping too!",
      "I love these bunnies for my Easter decor."
    ]
  },
  {
    "productId": "YMEfudAMZJ",
    "url": "https://www.etsy.com/listing/1173772351/laser-cut-easter-eggs-rabbit-stand-svg?click_key=731e74afbcbef3c772988d0f510127f64f28d1fa%3A1173772351&click_sum=8afcd6e4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-18&bes=1&dd=1&content_source=fd813f6997e9bb71e56e42b52793957c018fce62%253A1173772351",
    "title": "Laser cut Easter Eggs Rabbit Stand svg template Glowforge Easter bunny dxf vector Egg holder laser cut template pattern Laser cut cnc plan",
    "description": "✔️Laser cut Easter Eggs Rabbit Stand svg template✔️ SIZE: 120 * 109 mm / 4,7 * 4,3\"✔️ This file is created for 3mm, 1/8\", 4mm, 1/6\" and 6mm material✔️ ZIP file includes CDR, DXF, PDF, SVG files✔️ This files is created for laser cut machines✔️ DIGITAL item for INSTANT DOWNLOAD, No physical items will be shipped ‼️❓If there is any problem with the files or you need any help, please let me know❓Please use the “Ask a Question” button under the black ADD TO CART button and we will get right back to you!♦♦♦♦♦♦♦♦♦♦♦♦♦♦♦♦♦Thanks for shopping at 1LasercutFile!",
    "reviews": [
      "really love this item very cute",
      "Perfect, great, nice. \nThank you.",
      "Had to make a few adjustments to make it work. But over all a great start to my project."
    ]
  },
  {
    "productId": "TBRnhyrTIN",
    "url": "https://www.etsy.com/listing/943035959/wooden-egg-easter-decorations-hand-made?click_key=9427f9fd0f6edbc9ce1d89d0e329535336a6903b%3A943035959&click_sum=c189a7b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-19&etp=1&sts=1&content_source=4f2a7dc95f861242c98ca216e4e8623ee8f15030%253A943035959",
    "title": "Wooden egg, easter decorations hand made, ukrainian easter eggs, Pysanka, ukrainian wooden eggs, original easter gifts",
    "description": "We have put together sets for you with color-coordinated, hand painted Easter eggs. Each one is unique.Ukrainian traditional decorative art, Petrykivka style, which is a UNESCO World HeritageHand made and hand painted Ukrainian handicrafts, PysankaMaterial: woodSize of the egg: 6 cmMade in UkraineThe photos are for reference, the actual drawings and colors may vary as each easter egg is unique!",
    "reviews": [
      "Everything is perfect! Thank you very much!",
      "This is a stunning hand painted Easter egg. Absolutely gorgeous!  The people of Ukraine are in my thoughts and prayers.",
      "Beautifully made, the perfect gift. A pleasure shopping here. Thank you so much, Yuliia 🌸🌸🌸",
      "Beautiful pysanka, well made and just perfect for my needs.  Will be ordering from this business again x"
    ]
  },
  {
    "productId": "BPNKAbRkpD",
    "url": "https://www.etsy.com/listing/1161979596/farm-sign-carrot-patch-easter-footprint?click_key=3646f4d55bb04b04457087377ced7e2127041e72%3A1161979596&click_sum=241db86a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-20&bes=1&sts=1&dd=1&content_source=d6d3bb0b1615086d22ee2ee574fd316238dc1e22%253A1161979596",
    "title": "Farm Sign Carrot Patch Easter / Footprint Feet Art Craft / Kids Baby Toddler / Activity Keepsake Gift Card Decor Sign / PRINT IT OFF 0417",
    "description": "♥ PRINT IT OFF - Handprint & Footprint Art Made Easyhttps://www.etsy.com/au/shop/PrintitoffShopFarm Sign Carrot Patch Easter / Footprint Feet Art Craft / Kids Baby Toddler / Activity Keepsake Gift Card Decor Sign / PRINT IT OFF 0417Recommended max foot size 14cm➜ WANT TO EDIT THE WORDS OR ADD A MESSAGE??See this listing ...https://www.etsy.com/au/listing/1409192629♥ PRINT IT OFF - Handprint & Footprint Art Made Easywww.printitoff.com - FREE PRINTS, News, Tips, Tricks & More!***********************************INSTANT ACCESS – Digital Download FileSTEP 1. Download and save.STEP 2. Print file at home or local print shop.STEP 3. Print child's footprintsYOU WILL RECEIVE:A4 and 8x10\" size (high quality JPG files).*No physical product will be shipped, this is a digital downloadable art print.***********************************GIFT FROM THE HEART PROMISEWe guarantee you will be creating cute baby memories and heartfelt craft/gifts LIKE A PRO with our prints or your money back!! Absolutely no risk to you!***********************************➜ Print on medium to heavy WHITE CARD for best results.➜ Set your printer settings to best quality mode and make sure scale is 100%.➜ Print colours may vary due to monitors, paper & printer settings.➜ Use child safe ink or paint. Have fun & be creative!➜ Hand write names/date and frame for a personal touch.***********************************SOCIAL MEDIA- Follow Instagram & Facebook for free prints, discounts, tips, tricks & behind the scenes.- We love seeing your prints!!! TAG @print.it.off to be featured.★ SNAP, TAG, WIN $$$ - A winner every month just for tagging @print.it.off on your photos!!!***********************************♥ SAVE MONEY - Create a gift that is priceless on a very small budget.♥ MORE TIME - Instant download and create in minutes.♥ SUPER EASY - No need to be a crafty person to create.♥ STAY SAFE - Perfect to print on a home-printer.♥ HAPPY TEARS - Give the best kind of gift that comes from the heart.♥ CHERISH FOREVER - Special memories to love and keep forever.♥ CRAFT TIME - Great sensory fun creating & painting with children.***********************************THIS IS NOT A CUSTOM ORDERThis digital file comes as shown and is not editable + cannot be customised.Please do not request changes to prints in order notes. We do not create customprints/add names/change words etc. Digital file comes just as shown.***********************************- Copyright ©PRINT.IT.OFF- Original artwork by PRINT IT OFF- This is not a physical product. This is a digital download file.- For PERSONAL USE ONLY - Please do not print off multiple copies, share files, sell or distribute files.- Not for commercial use or large print runs.***********************************Please feel free to message if you have any issues, questions or need help.Sign up for the PRINT IT OFF newsletter:https://printitoff.com/pages/signup",
    "reviews": [
      "Awesome and thanks so much!",
      "Great quality - great quality - great quality",
      "Such a cute gift for Grandparents. It worked perfectly.",
      "Love it! Cant wait to do this with my baby."
    ]
  },
  {
    "productId": "ZJEEQlsGIc",
    "url": "https://www.etsy.com/listing/1662945854/personalized-easter-egg-painting-kit?click_key=59cc8ca75207a400d62610bff41d7d44df84ae57%3A1662945854&click_sum=5a7a281d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-21&pro=1&etp=1&sts=1&content_source=a0a39d1f397edff65ea1ba5c5a46a3c3a92d0894%253A1662945854",
    "title": "Personalized Easter Egg Painting Kit - Easter Craft Kit - Egg Decorating Kit - Kid's Craft Set",
    "description": "FOR EASTER FUN: Unleash their creativity! Young artists will adore having the chance to express themselves on Easter by turning wooden eggs into beautiful works of art.UNIQUELY PERSONALIZED: A new spin on Easter egg painting! Customize the woven wood basket carrying case—a blank canvas that can also be painted—with any name up to 12 characters.SUPPLIES GALORE: The kit includes an egg display carton, 6 wooden eggs, 12 paint colors, 2 labeled paint brushes, 6 tubes of glitter, glue bottle, 5 glitter sticker sheets, assorted googly eyes, sequins and starburst sequins.PREMIUM QUALITY: The basket measures 8.5\"Lx5\"Wx6.25\"H. Recommended for little artists 3+. Imported for final manufacture locally.A CREATIVE GIFT: Make this Easter one they'll never forget with this fun way to create Easter eggs that last. It's an ideal gift for your grandkids, nieces and nephews or your own kiddos.",
    "reviews": [
      "Turned out great! Quick to message back after I realized I made a mistake with the date",
      "fourth one I ordered and cont to love it",
      "just finished wrapping the third of four I ordered",
      "Love the quality of this product"
    ]
  },
  {
    "productId": "HsnKJPfrnZ",
    "url": "https://www.etsy.com/listing/954674594/t-rex-dinosaur-funny-easter-card-set?click_key=8d8b944a2c6f2d66bafbddd5600dbc7adfa949a3%3A954674594&click_sum=9586c2b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-22&etp=1&sts=1&content_source=28107df3e3d71fc3927e1c201e68b8bad655fb2f%253A954674594",
    "title": "T Rex Dinosaur Funny Easter Card Set - Easter Egg Hunting Happy Easter Cards Pack For Kids",
    "description": "Spring's greeting with humor and laughs. Send this poor short-armed t-rex dinosaur trying the best to hunt Easter eggs card to your family and friends to share the happiness and laughter.😃Hand-painted, printed, folded, and packed all by me - 100% handmade😃A2 size 4.25 x 5.5 inches folded card😃Blank inside😃Printed on extreme heavyweight cardstock with matching envelope😃Ship in rigid protective mailer, full refund for damaged/lost cards😃Sustainably sourced materials - No plastic packaging for single cardBack to the shop:LiyanaStudio.Etsy.com🎁 GET A FREE CARD! (AND MONTHLY 15% OFF COUPON)Get a coupon code to receive a free card with any purchase instantly when you sign up for our e-mail list at:👉 Signup: https://rb.gy/1bolcd😸 GREETING CARD SETSWant more than one? Check out our greeting card sets with discount plus free shipping!https://www.etsy.com/shop/LiyanaStudio?section_id=23123028💖FOLLOW US FOR UPDATES!I am @Liyanastudio on Instagram & Pinterest.🌈WHOLESALE?Interested in wholesale? We'd love to work with you! Send us a message for more information.Please contact me with any questions, I usually reply super-fast all 7 days.We are trying to be more eco-friendly by reducing single-use plastic waste, so a single card will be shipped without a cello bag. It will be carefully shipped in a DO NOT BEND rigid mailer and will arrive safely. Please, let us know if you would like your card to be shipped in a cello bag (i.e. your area is in the rain season).",
    "reviews": [
      "Seller gave me a free St. Patrick's Day card for being a repeat customer which is above and beyond awesome customer service. I know my daughter will love both cards.",
      "My nephew almost liked it more than his candy",
      "AWESOME...I would highly recommend for all your dinosaur loving children!",
      "Very cute card which will go to my dinosaur loving grandchildren this Easter."
    ]
  },
  {
    "productId": "ByaNnVYEsv",
    "url": "https://www.etsy.com/listing/1423173304/jumbo-easter-bunny-cookies-half-dozen?click_key=752579dd23f2abea16e94d5c7348f598eaa36df2%3A1423173304&click_sum=e65544e4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-23&frs=1&etp=1&sts=1&content_source=d592dc27ae6ded0a137a6e2bd5a29b9a8e97e6e7%253A1423173304",
    "title": "Jumbo Easter Bunny Cookies (half dozen)",
    "description": "Looking for the perfect Easter basket stuffer? This yummy little guy is IT! Our charming Jumbo Easter Bunny gift box features half a dozen hand-decorated, buttery sugar cookies iced with traditional royal icing. Bagged individually and tied with a festive satin ribbon, our jumbo bunnies will be the perfect addition to your little one's Easter basket.Made with premium ingredients. All our cookies are made from scratch, decorated by hand and individually heat-sealed for freshness in our Mobile, Alabama bakery.DESCRIPTIONIncludes: 6 Jumbo Bunny CookiesSize:  approx. 4 oz ea, 4″ x 5″FREE SHIPPINGWe offer free shipping via UPS Ground.  If you would like to upgrade to expedited shipping (UPS 3-Day Select, UPS 2nd Day Air or UPS Overnight), please send us a message.INSTRUCTIONSUpon receipt, store cookies at room temperature, for up to 2 weeks, unopened. Once opened, store cookies in an airtight container, for up to 2 weeks. If there’s too many cookies to fit in your tummy, we recommend freezing them for up to 3 months, they will still taste yummy.INGREDIENTSSUGAR COOKIE: Butter, Sugar, Eggs, Vanilla, Flour, Salt.ROYAL ICING:Corn Starch, Egg Whites, Sugar, Gum Arabic, Calcium Sulphate, Citric Acid, Potassium Acid Tartrate, Artificial Flavor, Silicon Dioxide, Confectioner’s Sugar, Water, Food Coloring*We do have allergens, such as nuts, eggs and dairy products in our bakery. If allergens are a serious health concern for you, we recommend that you do not consume our baked goods.",
    "reviews": [
      "Sooo cute and they tasted delicious! The cookies looked adorable on the big platter we displayed them on at the baby shower. They were shipped incredibly well and looked just like I expected them to look!  Thank you!!",
      "Thank you so much, Kimberly! We’re thrilled to hear that you are happy with your cookies! We would love to serve you again in the future. Have a great day! \n- Jennifer",
      "Delicious and packaged well! These St Pateick’s Day cookies are so cute and were a big hit at our event!",
      "So cute. Tasted great. Great communication to get delivered on correct date.",
      "YAY! Thank you SO much for taking the time to leave such a sweet review, Johanna! You just made my night. 😊\n- Jennifer"
    ]
  },
  {
    "productId": "avZVjbmEKd",
    "url": "https://www.etsy.com/listing/1414751321/funny-cat-easter-card-cute-easter-card?click_key=1de18671d779faf378ab05f94aae412192289d3f%3A1414751321&click_sum=e60b7397&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-24&frs=1&bes=1&sts=1&content_source=1e91b2d58a624daf1060cac9f4e65360a94b882c%253A1414751321",
    "title": "Funny cat Easter card, cute Easter card for cat lover, unique easter cards",
    "description": "This 5x7in cat Easter card is printed on high quality white card stock, and includes a brown Kraft envelope.All of my cards are shipped in a protective sleeve and carefully packaged so they do not bend in transit.!",
    "reviews": [
      "Beautiful card.  A joy to send to cat lovers!",
      "Love this card! Super cute",
      "Really great quality, and came quick."
    ]
  },
  {
    "productId": "XNkAmLVJTX",
    "url": "https://www.etsy.com/listing/1439077405/kids-personalized-bookmarkgift-for?click_key=7a1ca9f8e6d830055ab7503867a81425795f98fb%3A1439077405&click_sum=3ee2c3d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-13&pro=1&bes=1",
    "title": "Kids Personalized Bookmark,Gift for Kids,Easter Gifts,Kids Easter Basket Gift,Custom Bookmark,Personalized Gift,Bookmark for Kids",
    "description": "This one-of-a-kind kid's personalized bookmark is the perfect Easter Basket filler! It is meticulously crafted with top-grade wood, laser engraved with your child's name. The classic design of this book mark is etched with great care and detail, making it an heirloom-quality item. We also offer different laser engraving options for the bookmark so that you can customize it to make it even more special. There are several animals to choose from!Nothing shows your special someone how much you care like a personalized gift, and this kid's personalized bookmark makes the perfect addition to any Easter Basket. Give your children something that they will treasure for years, and something that will remind them of you with every turn of the page. This delightful bookmark is sure to become a treasured family keepsake for years to come. Plus, the laser engraved details make it a truly special, one-of-a-kind gift!Order your custom-engraved kid's personalized bookmark today and give a thoughtful and unique Easter Basket filler they will be sure to love!All of my products are handmade to order. Please know that slight variations and unique imperfections may exist.Due to imperfections on the wood no two pieces are made to look exactly alike.To see more behind the scenes follow us on social media TikTok and IG @simplycraftycustomsThank you for supporting my small business ❤",
    "reviews": [
      "Super super cute great gift",
      "I thought they were kind of pricey, but they are adorable and a very unique gift.  My grandchildren will love them!",
      "Very happy with quality perfect gift"
    ]
  },
  {
    "productId": "tWXAOEjVXh",
    "url": "https://www.etsy.com/listing/1680217975/he-is-rizzin-shirt-funny-jesus-shirt?click_key=0cbbbb1de14d85b21bac3df45e49f83b6ca4b624%3A1680217975&click_sum=7ded1b74&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-14&pro=1&bes=1&sts=1",
    "title": "He Is Rizzin' Shirt, Funny Jesus Shirt, Humor Easter Shirt, Christian Easter Shirt, Easter Gift, Easter Day Outfit, Jesus Basketball Easter",
    "description": "* We choose one of these brands according to stock status; Bella Canvas, Gildan Soft Style, Next Level, Outlash, Tee Factory, and Rustic. If you want a specific brand please tell us*He Is Rizzin' Shirt, Funny Jesus Shirt, Humor Easter Shirt, Christian Easter Shirt, Easter Gift, Easter Day Outfit, Jesus Basketball Easter---How To Order ---1-) Please, check and review all photos2-) Choose your t-shirt size and color3-) Click add to cart. You can go back to add more product4-)Click \"Proceed to check out\"5-)When you check out, you can add a note to seller for any requestUnisexUnisex t shirt fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.Features: Side-seamed. Retail fit. Unisex sizing. Shoulder tapingWoman Tank TopWomen's racer back tank top made with blended semi-sheer fabric.• 4.0 oz., 60% combed ring-spun cotton/40% polyester• Self fabric binding• Tear Away labelYouthThis youth tee fits like a well-loved favorite, featuring a crew neck, short sleeves and superior airlume combed and ring-spun cotton that acts as a blank canvas for printing.Features: Side-seamed. Retail fit. Unisex sizing.ToddlerToddler short sleeve fits like a well-loved favorite, featuring a crew neck, short sleeves and designed with superior airlume combed and ring-spun cotton that acts as the best blank canvas for printing.Features: Side-seamed. Crew neck. Tear-away label.---Care Instructions---Wash item inside out in cold water, do not bleach, do not dry clean, do not iron directly on the design.---Production and Shipping---Processing is 1-3 days. First Class Shipping is 2-5 business days(after processing time).If you need item sooner upgrade shipping in the chartPlease choose your design color from text color chartThank you...---Care Instructions---Wash item inside out in cold water, do not bleach, do not dry clean, do not iron directly on the design.---Production and Shipping---Processing is 1-3 days. First Class Shipping is 2-5 business days(after processing time).If you need item sooner upgrade shipping in the chartPlease choose your design color from text color chartThank you...",
    "reviews": [
      "Arrived quickly and super cute!",
      "I bought this for a student of mine who taught me what the word meant! He loved it!",
      "Good quality shirt and quick delivery",
      "Fun shirt. Was Fast shipping"
    ]
  },
  {
    "productId": "dTMaWkhn7q",
    "url": "https://www.etsy.com/listing/927526784/personalized-easter-tic-tac-toe-bunny?click_key=ff57e1961d1f9d686d159fdaa6f50b2d0d07188f%3A927526784&click_sum=aa0fd4bb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-15&frs=1&bes=1",
    "title": "Personalized Easter Tic Tac Toe Bunny and Eggs - Easter Basket Stuffer For Kids - Easter Gift Basket - Kids Baby Toddler Basket Stuffer",
    "description": "These adorable personalized tic tac toe sets are the perfect stocking stuffer. Comes with 5 bunnies and 5 eggs. Pick any 2 colors of your choice for your game set.Set is 4.5”x5.5Made out of solid wood*Grain of wood may vary*Colors may vary from photos due to the coloration of your monitor*If no color is selected, colors will be chosen at random*NOT RECOMMENDED FOR CHILDREN UNDER 36 MONTHS OF AGETO ORDER:Put colors & name you’d like in “notes to seller” box at checkout!",
    "reviews": [
      "Thinner wood than I anticipated but cute.",
      "Thinner wood than I anticipated but cute.",
      "Thinner wood than I anticipated but cute."
    ]
  },
  {
    "productId": "VSqqIvgTrO",
    "url": "https://www.etsy.com/listing/1678920583/next-day-shipping-easter-bunny?click_key=28db6e577e201116fced150ad45f9a0447f78b08%3A1678920583&click_sum=67446ee8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5515-3-16&pro=1&frs=1&sca=1",
    "title": "NEXT DAY Shipping Easter Bunny Personalized Wooden Sign With Kids Names, Easter Gift, Custom Family Sign With Names, Easter Decor, Easter",
    "description": "Super cute wooden Sign perfect addition to your Easter Decor. Let them know how loved they are with the personalization of this unique gift!This super cute wooden sign would also make an amazing gift idea! If you are looking for a birthday gift, housewarming gift, mothers day gift, Father’s Day, christmas gift, a gift for family, a gift for friend or a appreciation gift for teachersNOTE the more names the bigger the signMade with birch wood, laser carved and engraved by me here in Florida.PLEASE double check your cart before ordering. Once an order has been placed we CANNOT make any changes or additions to your order. Additionally any order that has been processed to ship cannot be canceled.DELIVERYWe ship to the address listed in the order confirmation. Any packages returned due to a wrong or incorrect address will be reshipped at the cost of the purchaser. Quick! Take a glance or two and double check your address is right.\u2028\u2028Please be aware that once a package is shipped, the USPS often does not update package tracking information until it is delivered.3LE Designs does not accept liability for any packages after they have been accepted by the USPS for delivery to customer. ALL LOST, STOLEN OR RETURNED packages are the responsibility of the buyer. In the rare event of a USPS failure, please contact them with any questions or concerns.By purchasing from this site, you agree to our policies.If you’ve received a defective item or received a wrong item, please contact us immediately so we can make it right!CHECK OUT MY SHOP FOR MORE SUPER CUTE GIFT IDEAS!!Thank you for supporting our small business!If you have any questions, please message me. 😊",
    "reviews": [
      "Great Easter gift for adult children!! I highly recommend",
      "I bought 3 of these for my daughters they turned out perfect!!",
      "Fast shipping!! GREAT quality and they were very quick to respond with to my questions!!",
      "I purchased this for my daughter, and she loves it!"
    ]
  },
  {
    "productId": "iuUVQLHyFB",
    "url": "https://www.etsy.com/listing/1414753395/funny-tuxedo-cat-easter-card-cute-easter?click_key=f3b639d41f0ec43e803a9f3e80d1b80dd0ade3ac%3A1414753395&click_sum=0c5676dd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-25&frs=1&etp=1&sts=1&content_source=67b4514bb4ed8a7206b6f11fd0acc8b99449f6bb%253A1414753395",
    "title": "Funny tuxedo cat Easter card, cute Easter card for cat lover, unique easter greeting cards",
    "description": "This 5x7in cat Easter card is printed on high quality white card stock, and includes a brown Kraft envelope.All of my cards are shipped in a protective sleeve and carefully packaged so they do not bend in transit.!",
    "reviews": [
      "These Easter cards are awesome! So fun!",
      "Hilarious card!  Well done!",
      "this card is an exact replica of my Benjamin Arthur...love it"
    ]
  },
  {
    "productId": "GELDCczBMi",
    "url": "https://www.etsy.com/listing/1228550424/chicken-baby-lovey-easter-gift-farm?click_key=e1b5e75e13ea02b2e4c5abd9b09f03d78621da57%3A1228550424&click_sum=fb70a976&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-26&frs=1&sca=1&sts=1&content_source=8637670c915ca87364aa9e6316e98f7f76f273cc%253A1228550424",
    "title": "Chicken Baby Lovey Easter Gift, Farm Themed Baby Shower,  Western Nursery Decor, Baby Security Blanket, Chicken Baby Blanket, Farm Nursery",
    "description": "The most adorable new friend for your little! Chicken lovey is ready to cuddle with a flat body, stuffed head and little tail. Perfect for your little one to hug, carry and snuggle.Moving, new sibling being born, time to give up the pacifier? Great for bringing comfort too!Made of velvet blanket yarn he’s cozy and soft to the touch. Hand crocheted with attention to detail and exceptional quality in mind.Measures 13” long from top of head to end of feet.Features white body, yellow feet and beak.Choose from embroidery (safest for children under 3) or plastic safety eyes.Care:Recommend gentle hand washing and lay flat to dry or spot cleaning as needed.Shipping:Chicken is made to order and will be shipped via USPS with tracking information. Delivery within the United States is typically 2-5 days, but exact delivery date is not guaranteed.All items are made in a smoke free home with non shedding pets.Based on pattern by @mamamademinisLooking for more available options?https://www.etsy.com/shop/thenorthwestbaby/?section_id=36959374",
    "reviews": [
      "This is the cutest chick",
      "I got four different animals from this shop and they were all beautifully made!! I love them.",
      "The absolute cutest and softest little chicken! The quality is amazing! I can't wait to give this to my daughter! It's perfect!",
      "I can’t wait to give this to my chicken loving friend for her new daughter!! It’s perfect!"
    ]
  },
  {
    "productId": "KsqtyJYTjf",
    "url": "https://www.etsy.com/listing/1416433338/easter-gifts-kids-easter-gifts-for?click_key=c1941eb4354b3b0b94d38e7516f86ce9355c99b1%3A1416433338&click_sum=f4f31432&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-27&pro=1&frs=1&etp=1&sts=1&content_source=738dba38cef542321c2c0433155ed164906fc51c%253A1416433338",
    "title": "Easter Gifts Kids, Easter Gifts for Toddlers, Wood Toddler Toys, Easter Gift For Baby Girl, Wooden Name Puzzle For Girls, Easter Bunny Gift",
    "description": "NAME PUZZLE - FIGURE - ENGRAVING⭐- ITEM OVERVIEW• Handmade item• Materials : wooden plywood , Non Toxic Wood Paint .• Made to order• Ships from USA⭐- ITEM DETAILS• Name Puzzle First, Second, Third Birthday Gift , Wooden Toys , Wooden Montessori Toys.• This custom name puzzle is a great learning tool to help them learn how to spell their name.• Custom Name Puzzle is a great way to make children feel special and help them to learn their own names at the same time.• Name Puzzle helps them to develop many skills – motor skills , color and shape recognition.⭐- PUZZLE DETAILS• Size depends on the name length  – 16X9X1• The Puzzle is lightweight so the baby could easily hold it. ( Average weight is 15 oz.)• We use special paint and varnish that is %100 safe for the babies.• All of the puzzle pieces are raised, making them easy to get out and play with.• Each letter height : 2,55 inches - 6,5 cm• Comfortable raised letters to grab for a baby. No pegs needed.✨OUR PUZZLES ARE THE PERFECT FOR✨• Easter Gift• First, Second and Third Birthday Gift• Christmas or New Year Gift• Nursery Décor• Kids Room Décor• Baby Shower Gift• Friend’s Baby Gift💕HOW TO ORDER💕1- Choose the number of letters,2- Put the desired name , Select Style for Color Options, Engraving message (if you purchased Engraving) into the personalization box.3- Add to cart4- Check out🎉For ex :BRAXTON ( Name of the Puzzle )Color Options: Style 1Engraved Message : (If Purchased) Happy 1st birthday, my sweet girl.NOTE: Puzzle Stand is not included. If you would like to purchase Stand or Add Extra Figure and Add Engraving you may ADD Wooden Name Puzzle Stand or ADD Extra Figure or ADD Engraving from our listings.😊Thank you for choosing PuzzlElla for your special order!",
    "reviews": [
      "Perfect addition to baby gift",
      "High quality, exactly as pictured. Love it!",
      "This is exactly what I was looking for as part of my daughter’s gift from the Easter Bunny! She loves puzzles and now she has a personalized one. It was also on major sale when I bought it which makes it even better. Absolutely love it"
    ]
  },
  {
    "productId": "J4EPpSxhDJ",
    "url": "https://www.etsy.com/listing/1681415402/name-puzzle-with-pegs-personalized?click_key=2973e2ff625f1e15e38061526e4d7ba26e2948bc%3A1681415402&click_sum=250e2b8f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-28&pro=1&frs=1&etp=1&content_source=67b083acf6085f2b1e11862af6c62904dd7e3824%253A1681415402",
    "title": "Name Puzzle With Pegs Personalized Wooden Name Puzzle Baby Girl Gift 1st Birthday Gift Montessori Toys For Toddlers Easter Gift For Kids",
    "description": "· Name Puzzle from BusyPuzzle is the Best Personalized Wooden Gift for Kids ·· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.In 4 years, we have sold 500,000 puzzles worldwide. We have received tens of thousands of reviews and are constantly trying to improve our Name Puzzles.Most often we receive orders for Christmas and Birthdays.Our Name Puzzles are suitable not only for playing but also as decor for a nursery. Especially for this we have developed 10 color schemes.· Approximate Dimensions ·Length: 13.7 inches (35 cm)Height: 3.1 inches (8 cm)Thickness: 0.35 inches (0.9 cm)The specified sizes refer to a puzzle of 5-6 letters.The size of your puzzle will depend on the number of letters in your child's name.We will be happy to make personalized puzzles for your kids!PLEASE NOTE, that the size of puzzle was changed in order to keep same price.Over the past 4 years, we have created many other puzzles and different toys for kids, as well as Christmas Decor.We have many products that complement each other to create a special atmosphere in the baby's room.To see the entire range, go to the main page of our store:https://www.etsy.com/shop/BusyPuzzle· Have any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms and Conditions for Safe Use ·1. All kids have imagination. And we did all we can to give you a safe toy. But be careful and try not to leave your child alone with puzzles. Instead - play with your kid. Collect memories2. Please, note  If your puzzle has letters «i», «j» or number «1» we recommend you to attach it to the wooden base.PLEASE NOTE  that the BusyPuzzle name logo is engraved onto every product and cannot be removed.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Lovely gift for a little girls christening. Fast delivery.",
      "The item was beautifully made",
      "So cute! I'm happy about the outcome, very well made and high-quality. I'd recommend this shop to friends and family",
      "Beautifully crafted with great colour options! Bought for a little girl and it was nice to have colours other than the standard primary- red, blue, yellow"
    ]
  },
  {
    "productId": "DgdxcUyUGK",
    "url": "https://www.etsy.com/listing/1419022241/women-chicken-sweatshirt-farm-sweatshirt?click_key=56d1ae4930c259418d794dbfac8144db55c05af1%3A1419022241&click_sum=b2d4a729&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-29&pro=1&etp=1&sts=1&content_source=6f41462454606d4234a1990d2b487dccc024c6d0%253A1419022241",
    "title": "Women Chicken Sweatshirt, Farm Sweatshirt, Chicken Sweatshirt, Chicken Lover Sweatshirt,Mom Life Sweatshirt,Animal Sweat,Easter sweat",
    "description": "Women Chicken Sweatshirt, Farm Sweatshirt, Chicken Sweatshirt, Chicken Lover Sweatshirt,Mom Life Sweatshirt,Animal Sweat,Easter sweatDescriptionDue to the nature of the fabric as well as your monitor or mobile screen colors may differ slightly.Our tees and more are handcrafted one at a time. It is therefore very rare to create identical items so you may find minor distinctions that make your SassyPantsTees items special and truly one-of-a-kind.All sales are final. Cancellations, Refunds and Exchanges are not accepted. All information is provided in the Item description as well as the photos attached to each listing. I do not stock items. As soon as your order is received the process of ordering supplies has begun and can not be altered. Please order accordingly. Thank you for your understanding.The price is for individual sweatshirt, not a setORDER INSTRUCTIONS** Check and Review all Photos.**Select Your sweatshirt Size and sweatshirt Color from drop down menus.**Choose Your Design Print Color from images, write your design color in the \"Add your personalization\" field.EXP :-Print White ,-Print Black ,** Choose Your Quantity you want.**Click ADD TO CART. And, you can go back to add more product color for your family members or You can complete the checkout process.**Please Click “Proceed to Check Out”**Finally, Your order will be ready to ship 3-5 Business Day.FABRIC8 oz.(US) 13.3 oz.(CA), 50/50 preshrunk cotton/polyesterHeather Sport colors: 60/40 polyester/cottonAir jet yarn = softer feel and reduced pillingDouble needle stitching at shoulder, armhole, neck, waistband and cuffs1 x 1 rib with spandexQuarter-turned to eliminate center creaseSafety Green: Compliant with ANSI / ISEA 107Tearaway labelCARE INSTRUCTIONS• DO NOT iron directly on Heat Transfer Graphic. Iron on low heat with shirt inside-outNever iron directly over design• DO NOT dry clean• Machine wash COLD with mild detergent• Turn inside out when washing• Dry on low setting or hang to dry• No chlorine bleach• Wait 24 hours before first wash*Do not use bleach",
    "reviews": [
      "Love the sweatshirt \nVery cute\nI ordered another for my daughter",
      "Nice soft shirt great graphic and color. Good fit,",
      "Bought as a gift and she loved it! Thank you!",
      "way too small ordered wrong size"
    ]
  },
  {
    "productId": "ZtPijLzlXY",
    "url": "https://www.etsy.com/listing/1636927004/personalized-easter-basket-custom?click_key=2a84a30f75607212b1a858af647978d6a25fde68%3A1636927004&click_sum=b1b01197&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-30&pro=1&bes=1&content_source=f7824b448836fbe0e33eb5cdc8df559cfab1dd8d%253A1636927004",
    "title": "Personalized Easter Basket. Custom Embroidered Easter Bunny. Kids Easter Basket. Baby Girl And Boy Basket. Egg Basket For Easter Activities.",
    "description": "LINK FOR EASTER BASKET STUFFERShttps://www.etsy.com/shop/BusyPuzzle?section_id=40022252· Personalized Easter Basket ·Our Personalized Easter Basket is the cutest gift for your little ones.By embroidering a name, you can make this basket more special.The basket has ears that tie up and turn it into a bag in which kids can store their toys.Also these cute Easter rabbit baskets can be used as Easter gift basket for kids, or let them fill with eggs on their exciting Easter egg hunt! Your kids will love going for an Easter egg hunt with this lovely rabbit basket!· COUPON ·When buying 2 or more Baby Toys or Christmas Decor, we have an additional coupon discount: BUSYPUZZLEJust add it to your shopping cart.· Dimensions ·Height: 8.6 inches (22 cm)Width: 8.6 inches (22 cm)· Details ·• Our Easter basket is available in 5 designs (SEE INFOGRAPHIC).Design #1 (beige-white checkered with a white inside part).Design #2 (gray-white checkered with a white inside part).Design #3 (mocha + white polka dots with a white inside part).Design #4 (white with pink eggs inside).Design #5 (white with blue eggs inside).• Bunny and embroidery are available in three colors (white, pink and blue) that you can choose from the options.NOTE that it isn't possible to embroider the name in capital letters.Only first letter of the name will be capitalized.For example, instead of EMMA you will receive Emma.PLEASE NOTE, if you want double name embroidery you have to pay extra and can choose it in the options.One Name is MAXIMUM 10 letters.• The basket is made of natural fabrics: cotton and plush (rabbit).• The inner color of the basket matches the color of the bottom.• The color of the bunny matches the inner color of the ears.· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·Don’t use machine wash to keep the baskets looking their best.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "Great product! Would purchase again!",
      "Great product! Would purchase again!",
      "The item received was just as expected. The packaging was great, and so is the quality! Will be back to shop!",
      "Love this basket for my first Grandbaby! It adorable and high quality. I was out of town and held my mail. The owners were so nice telling me it had shipped and was being held at the post office, making sure I knew. Thank you!",
      "Thank you for such a kind words and for your feedback!\nWe always strive to be helpful and to make all possible to satisfy our clients' interests since we appreciate our clients.\nHope to make you more personal items in the future!"
    ]
  },
  {
    "productId": "BkrIOFGjDT",
    "url": "https://www.etsy.com/listing/1415743392/personalized-easter-egg-custom-wood?click_key=ab2bf563fb0e9801f18e6c670795227d60a45394%3A1415743392&click_sum=c653f2d5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-31&frs=1&bes=1&sts=1&content_source=300f92c6282891e85a8e2ea1fdababf6d7862cd2%253A1415743392",
    "title": "Personalized Easter Egg, Custom Wood Easter Egg, Easter Basket Gift Personalized Easter Gift 2023 Easter Gift Ideas Kids easter --EGG-NW-ABC",
    "description": "Personalized Easter Gift 2023, New Easter Basket Gifts, Personalized Easter Gift, Custom Easter Eggs, Easter Gifts Ideas 2023, Easter Gift Ideas for Girls, Easter Basket Gifts for Boys, Easter Gift Ideas, Personalized Egg, Personalized Eggs, Wood Easter Eggs, Painted Easter EggsEtch This Out's new Personalized Easter Eggs are the perfect gift for your loved ones Easter Basket!Each Easter Egg features a professionally laser engraved design with your custom name or message.Our Easter Eggs have a flat base so they stand up, they are 2.5\" tall and 1.85\" inches wide.⚙️ Product SpecificationMaterial: Solid WoodSize: 2.5\" x 1.85\" inchesColor Options: Light Blue, Pink, Purple, Yellow, White, Raw Wood✅ Ordering & ProcessingWe make it our mission to process our orders fast and efficiently! You will be asked if you would like a proof upon adding your product to the cart. If you select No we will begin the production process right away for you! If you choose Yes on the proof, we will email you your proof of your order to ensure it is exactly how you envisioned it. We will work with you until you are completely in love with your new personalized gift and 100% satisfied with your order. Once we know you are completely satisfied with your and we receive your approval via email- Our team will start processing and making your unique gift!📦  Production ProcessIts time to get busy engraving! All orders are processed and shipped out within 24 hours of when we have received your approval of your proof.⏱️ Shipping TimesPlease be aware that shipping times may vary from 2-6 business days depending on the product and shipping class. First class mail generally takes 2-5 business days, while priority mail takes 1-3 business days to arrive.⭐ Satisfaction GuaranteeAt EtchThisOut, we know your are going to love your personalized product when you receive it. However If for any reason you are not satisfied with your order, we would be happy to assist you on replacing your item or fixing it for you.💲 Bulk OrdersWe are proud to offer bulk pricing on all of our products when purchasing 25 or more. Prices do vary based on the quantity you are looking for. Please send us a message about the quantity you are looking for and the zip code we will be shipping to.Personalized Night Lights Kids, Kid's Night Light, Children Night Lamp, Boys Room, Night Lights for Kids Kid’s Bedroom Decor, Children’s Lamp, Children’s Light, Personalized Night Light, Custom Night Light, Children’s Light, Kids Bedroom, Girls Room",
    "reviews": [
      "These are so adorable! Arrived quickly and are just as described.",
      "Very cute. I have one for each grandchild on display on my mantle with Easter decorations.",
      "Love how the wood laser engraved eggs came out! I think my twin nieces will love. Great quality, service and fast shipping.",
      "The recipient loved seeing their name engraved. Great quality and nice wood keepsake."
    ]
  },
  {
    "productId": "dwQkNXXvwY",
    "url": "https://www.etsy.com/listing/1657802812/wooden-rabbit-minimalist-sculpture?click_key=e660e45d2f20f67e7a0c6be8bd5888d4708a6cdf%3A1657802812&click_sum=f602e7e9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-32&sca=1&sts=1&content_source=eecb75f787efe79dd4d9f9c2b65437f7a51439af%253A1657802812",
    "title": "Wooden Rabbit, Minimalist Sculpture, Handmade Animal Figurine, Easter home decor, Crafted Oak",
    "description": "If you love bunnies, this little fella is here to bring some extra charm to any space.Place it on your shelf, move it around your home, gift it to a friend, or let it be the guardian of your bookshelf! :)--- Note ---This is a bespoke item.Due to the natural variation in wood grain, your rabbit may differ from what you see in the pictures, but rest assured, we always strive to provide the most suitable piece of hardwood for every project :)--- Size (approx.) ---Height: 15-18 cm / 5.9-7.1 inchWidth: 4-6 cm / 1.6-2.3 inchDepth: 6-8 cm / 2.3-3.1 inch--- Wood finishing ---The surface is impregnated with natural oils and finished with our self-made blend of mineral oil and filtered beeswax.--- Shipping ---The parcel will be ready to ship within 10 business days.We send all orders as priority parcels.--- Maintenance ---Avoid contact with an open flame or other sources of heat (gas stove, oven, etc.)Please do not leave it in the dishwasher!--- About 'I Wood Say' ---We take care of the complete process.Designing, woodworking, and finishing this is what we do in our workshop.If you have any questions, please feel free to reach out to us.Enjoy IWS!",
    "reviews": [
      "I am a repeat customer and for good reason: loving work, fast shipping with a personal touch. Gladly again 😃",
      "Cutest little donut vase ever!!! Arrived quickly and in perfect shape.",
      "Excellent product. I will buy more for gifts."
    ]
  },
  {
    "productId": "tKJuaAOQmu",
    "url": "https://www.etsy.com/listing/1156436590/easter-gift-for-kids-crochet-bunny?click_key=8213d96f2712256924c0ab01feb1603788842e43%3A1156436590&click_sum=c90b6e2c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-33&frs=1&etp=1&sts=1&content_source=33a81be606254524bfc22fb4fccab02cf79c8443%253A1156436590",
    "title": "Easter gift for kids, crochet Bunny basket with ears, easter basket in the shape of abunny ideal as an Easter gift, for children's birthday,",
    "description": "Easter basket,Bunny basket with ears for Easter, basket in the shape of a bunny ideal as an Easter gift, for children's birthday, decorationBeautiful baskets made of thick and fleshy cotton string. Stiff ears, however, allowing to be modeled. They can be bent and laid at will. Wonderful and sweet bunny baskets will decorate any children's room and will bring a lot of joy to the little baby. They will also decorate the house beautifully for the Easter holidays.You may You can store candles, Easter eggs, sugar lambs, chocolate chickens in them.The string is made of the most delicate cotton with STANDARD 100 by OEKO-TEX certificate. STANDARD 100 by OEKO-TEX is the world's leading textile safety mark. The yarn used in production is free from harmful substances in concentrations that have a negative impact on human health and the environment. ( except colors: lemon, mint - they are not oeko-tex).We love thick weaves, and the cotton string thanks to the unique way of weaving is at the same time extremely soft and smooth to the touch.size on the photo:Adiameter: 18 cm ( 7in)high basket 8 cm add  12 cm ears = 20 cm ( 8in)You may choose another size:B diameter: 25cm 9.8'' ,depth 8cm 4'' + lenght of earsLooking for another size? Let me know, I will do it for you.Hand or machine wash in 30st.Please choose color.to see more colors :https://www.etsy.com/pl/listing/1165855098/easter-bunny-basket-with-ears-basket-in?click_key=bd9b4b15936327acc8ca7917096e86a4b053154f%3A1165855098&click_sum=43be0fcb&ref=shop_home_active_5",
    "reviews": [
      "The medium easter basket was beautiful when it arrived. Color was vibrant and it is very well crafted.",
      "Thank you !!",
      "Very cute!! Easy to work with!!",
      "Thank you very much for a great review!",
      "Super cute!! Can’t wait to give them as gifts!!",
      "Thank you very much for a great review! It's wonderful that you will give them to your loved ones as a gift.",
      "These baskets are so amazing!  This is exactly what I was looking for!  The Seller had exceptional communication throughout the entire process. So, so adorable and very well made!!"
    ]
  },
  {
    "productId": "eYpSQOCgrJ",
    "url": "https://www.etsy.com/listing/1418108302/set-of-16-easter-egg-tokens-easter-egg?click_key=2a78ab3a55447759fa964baa91b4a6241be9f42c%3A1418108302&click_sum=1041e6ba&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-34&pro=1&etp=1&content_source=54e996897946a97027643c4a79d4379e7bfcc14c%253A1418108302",
    "title": "Set of 16 Easter Egg Tokens, Easter Egg Fillers, Kids Easter Gifts, Easter Hunting Games, Easter Basket Stuffers, Easter Egg Coin Tokens",
    "description": "· Easter Tokens ·A great game for children on Easter.Hide tokens in plastic eggs and organize an egg-collecting quest for your little ones.16 tokens that include various tasks and nice bonuses in the form of coins.Collect memories with BUSY PUZZLE and spend this wonderful time with your family.PLEASE NOTE that plastic eggs are not included.Wooden Easter tokens are packed in a specially designed bag. (See photos).· COUPON ·When buying 2 or more Baby Toys or Easter Decor, we have an additional coupon discount: EASTERJust add it to your shopping cart.· Details ·• The TOKENS is made of plywood.• There are five color sets available:- Blue- Pink- Yellow- White- MixedSee the infographic!· The dimensions of each egg ·Length: 1.2 inches (30 mm)Height: 1.5 inches (38 mm)· List of tasks ·1. Date with mom2. Date with dad3. Pizza night4. $15. $36. $57. Movie night8. EXTRA 5 MINUTES SCREEN TIME9. LATER BEDTIME10. You pick dinner11. Outside time12. Morning donuts13. Park day14. Treat after dinner15. FUN ACTIVITY16. One toy at store· Have Any Questions? ·• If you got a damaged product - contact us. We will gladly resolve this issue.• Remember, that we don’t own delivery services and can’t control this process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.· Terms And Conditions For Safe Use ·1. DO NOT LEAVE your child alone while he / she is playing with a toy.2. Ensure that the child does not take small parts for him.Please, contact us if you have any further questions about the product. Thank you for shopping at Busy Puzzle!",
    "reviews": [
      "It is so cute and better than candy",
      "Smaller than what I wanted but very nice",
      "These Easter egg tokens are absolutely adorable. Can’t wait to use them for our Easter Egg Hunt. Excellent workmanship and shipped promptly. Will definitely be buying from this small business again.",
      "Beautifully made, the grandkids are going to love them"
    ]
  },
  {
    "productId": "prRFngPKce",
    "url": "https://www.etsy.com/listing/1564788363/personalized-name-puzzle-for-kids-baby?click_key=67f7258f6e41b9de291a3a61da8074f28677c62c%3A1564788363&click_sum=ee7874fc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-35&pro=1&frs=1&etp=1&content_source=9a228573e702eea9551263d7a74cc2efe1f95b91%253A1564788363",
    "title": "Personalized name puzzle for kids, baby name puzzle, Easter Gifts,birthday gifts for boys and girls, educational baby montessori toy gifts",
    "description": "Both a learning tool and eye-catching decor, our Wooden Name Puzzle is more than a toy. It’s the perfect custom keepsake to help babies and toddlers learn their name, colors and letters. Our custom puzzles encourage logic abilities, color recognition, name spelling, and early self-esteem for your child.➤ Approximate DimensionsLength: 13.7 inches (35 cm)Height: 3.1 inches (8 cm)Thickness: 0.35 inches (0.9 cm)🧡Note:The specified sizes refer to a puzzle of 5-6 letters. Size runs 12 - 24 inches depending on the name length.Recommended for ages 6 months – 3 years old. We will be happy to make personalized puzzles for your kids!🎁 You can find more personalized gifts here:https://www.etsy.com/shop/GreenTabella😊Have any Questions?• If you have received a damaged product, please reach out to us. We are ready to return your full price for bad quality.• Please keep in mind that we do not have ownership of the delivery services, and we are unable to directly control the shipping process. So, if you have trouble with the time of shipping - check if your product was sent correctly. If all were sent in time - the problem is from the part of the delivery service.🎈Terms and Conditions for Safe UseEvery child is blessed with imagination, and we have gone to great lengths to provide you with a toy that prioritizes safety.🧡Comment:If you have any special requests or further questions, please feel free to contact us, we will reply you as soon as possible within 24 hours.",
    "reviews": [
      "Love this design this will be fun",
      "Beautiful craftsmanship and quick delivery! What a great gift! I will be ordering again. Thank you!!",
      "Excellent quality, exactly as described, lovely gift for granddaughter. thankyou."
    ]
  },
  {
    "productId": "rpfpfzrOdj",
    "url": "https://www.etsy.com/listing/1374913580/easter-bunny-tray-custom-bunny-tray-with?click_key=95bd42da9f67cd694fdd354eaa42b7ff3456c0ff%3A1374913580&click_sum=4d719cff&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-36&etp=1&sts=1&content_source=2b51962d4e8d8b143ea5afbf58a1e3aaefb35903%253A1374913580",
    "title": "Easter Bunny Tray, Custom Bunny Tray with drink bowl,Easter Bunny Treat Tray with Personalization, Easter Tray, Snacks for the Easter Bunny",
    "description": "Easter Bunny Tray, Custom Bunny Tray.,Easter Bunny Treat Tray with Personalization, Easter Tray, Snacks for the Easter BunnyThis Easter Bunny tray is custom with your child(s) names. Small white bowl for bunny water is included with this listing. If you wish to have a family name please add that in the personalization area.Item details:10 inch round1/4 inch heightDecorative cut for the snacks area.Flat surface for drink bowl to sit.Small drink bowl included.** Each piece of wood is different and absorbs the stain and paint differently. Texture, knots, cracks, and other natural characteristics of the wood may or may not show up in your finished piece. Each piece will have its own unique finished look. All trays that are created in our shop are not identical. All trays are unique and will have imperfections due to how the paint takes, we do our best to make them as clean as possible.Average production time for this item is 2 business days before they are ready to ship. When it gets closer to the holiday you can expect the production time to take up to 5 business days. Be sure to plan accordingly.",
    "reviews": [
      "was made of much thinner wood than was in the description.  My grandson was excited.",
      "My grandson's reaction was one of excitement.  He can't wait on the Easter bunny.  Was made of much thinner wood than I expected.",
      "A little thinner than what I was expecting but SUPER cute!! Fast shipping."
    ]
  },
  {
    "productId": "sfaSaCxyKf",
    "url": "https://www.etsy.com/listing/1052173252/ukrainian-easter-eggs-handmade-with-bird?click_key=91611ae38945ce6eb57147a2b9ef58b99a31175f%3A1052173252&click_sum=7acb6108&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-37&etp=1&sts=1&content_source=c9a277ca4a9d3203088c76dbd7982a4b4617bf12%253A1052173252",
    "title": "Ukrainian Easter eggs handmade with bird design -Hand painted eggs Pysanka, ukrainian wooden eggs, traditional Easter gifts Petrykivka",
    "description": "Hand painted Easter eggs. Each one is unique!Ukrainian traditional decorative art, Petrykivka style, which is a UNESCO World HeritageHand made and hand painted Ukrainian handicrafts, PysankaMaterial: woodSize of the egg: 6 cmMade in UkraineThe photos are for reference, the actual drawings and colors may vary as each easter egg is unique!",
    "reviews": [
      "Beautiful craft! After receiving them I immediately ordered some more for friends and family. Good to keep in mind that you are getting a unique product, so no point choosing based on colours etc. in the pictures. Worth being surprised!",
      "I bought several of these as a gift for a sibling.  So, I am writing the same review for each one I bought.  Lovely!  Gifted to a sibling who truly appreciates this type of artwork.  I was amazed by the quick shipping.  My sibling has lived and traveled in Europe, and finds these Ukrainian eggs to be very nice examples of their type.  He could tell that care had been taken in their crafting.",
      "Quality item.  Loved it and ordered another.  I plan to order some of the others as well.  People I gave them to also loved it.",
      "Absolutely beautiful 🤩 Amazing painting and fast shipping. Very happy 😊"
    ]
  },
  {
    "productId": "F4pUCPTEHq",
    "url": "https://www.etsy.com/listing/790306473/first-easter-gift-personalized-baby?click_key=0011eb5f28cdcf1fe07cace19ffb794e5c9c5082%3A790306473&click_sum=b091ab82&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-38&pro=1&frs=1&etp=1&sts=1&content_source=590239b2a8fa1c435e5abb38e07c9785f19914f6%253A790306473",
    "title": "First Easter Gift, Personalized Baby Blanket, Personalized Baby Gift, Bunny Blanket, Easter Blanket, Baby Shower Gift Birthday Gift Animal",
    "description": "Baby BlanketThis blanket makes a perfect keepsake and baby shower gift for a mom to be.They are perfect for Hospital Gifts, Birth Announcements, Birthday Gifts, Christmas and just snuggling those precious babies.DETAILSDesign: Printed On One Side. Designs are printed using high quality inks that will not fade or peel. The fabric stays silky smooth against skin. This is NOT embroidery or vinylCare: Machine Wash; Tumble DryAvailable Materials: Fleece / Minky / Sherpa (dependent on size)Please Note: All sizes have a variance +/- 1\"-2\" due to heat causing shrinking when pressed.DISCLAIMER: Periodically tiny microfiber dots may occur – this is a natural occurrence in the fabric (mostly seen in fleece). They typically appear black, blue, orange or yellow in color. Once the fabric is washed, they usually are less visible. This is common in sublimation - caused by natural fiber particles!Please note with preconstructed items, exact symmetry is not guaranteed.*Please review photos for size references!*CUSTOM ORDERSI LOVE creating new designs but for a design that I do not currently offer please contact me before ordering to see if can create your request.HOW TO ORDER1. Choose the Size & Material for the drop down menu above (see photos for references)2. Add your Personalization requests (include the name(s), font, and color)3. Click \"Add to Cart\"4. Enter your payment information, shipping address, *DOUBLE CHECK EVERYTHING* and click \"Order\"5. Sit back and wait for your special package in the mail!RUSH ORDERSIf you are in a rush, I do offer an express production option.Please add this listing to your order-https://www.etsy.com/listing/498793304RELATED LISTINGSInterested in more personalized baby gifts? Look through the following listings to complete your order!https://www.etsy.com/shop/DashingFoxCoFAQS:.What material is most popular?Jersey is our most popular for baby swaddles because they're stretchy and are not thick.  Minky and Sherpa are our most popular for a standard baby blanket because of the softness and thickness.Are these personalized?Yes, the babies name will be changed to the one that is left in a note for me during checkout. If you would not like a name to be added you can leave the note blank or simply leave \"No Name.\"Do you do custom designs?Absolutely! I love to make custom designs. Please contact me before ordering to make sure that I am able to produce the design you would like.Can the blanket be made in a different color?Sometimes, The text and parts of some designs can be made with a different color. Watercolor floral is not able to be changed however I can try to create something with floral in the color you are looking for. Please contact me before purchasing to make sure I can make the adjustments you would like.Can my order be rushed?Yes, if you need your order rushed, I do offer an express production option to have your order shipped quicker. Just apply it to your order:https://www.etsy.com/listing/498793304Can the fonts be changed?Absolutely!! Just include a note for me during checkout.What is Minky?Minky is a special type of plush fabric that is often used to make baby blankets, baby clothing and baby accessories. Minky fabric is like fleece – but softer and thicker.What is Jersey?It is a 100% lightweight polyester material that stretches. Perfect for swaddling. Features rounded corners.What is Fleece?Fleece blankets are made of 100% Polyester. It is a thinner blanket but provide a very vibrant print.What is Sherpa?Sherpa is an Ultra Plush blanket. It is a 100% polyester with a faux fur fabric on the back. The faux fur side is available in white. Tan back is available by request only.Will I receive a proof?We do not supply a proof of your personalized design as standard to ensure we do not delay your order, however if you would like to see the design before we create it please request this along with your personalization when you place your order. If requested we will not proceed with your order until you are 100% happy with the design. Please ensure you factor in extra time for this, as edits may delay your order.ADDITIONAL NOTES▹ Please keep in mind when ordering that color settings on monitors and lighting in product photography vary so the product might differ a tad from what you see on screen.▹ I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.▹ If you have any questions, please use the “Message Seller” button next to the price and I’ll get right back to you.Remember to select the ♥ FAVORITE button to save this product for later!Thank you so much for shopping at DashingFoxCo!https://www.etsy.com/shop/DashingFoxCo© 2019 DashingFoxCo",
    "reviews": [
      "It is exactly what I was expecting. Absolutely beautiful.",
      "Very pretty. Very soft. Can't wait to give as Easter gifts to my grandchildren.",
      "So soft and cute. Glad I didn’t get the small size so it can grow with baby."
    ]
  },
  {
    "productId": "NumvkPfxCw",
    "url": "https://www.etsy.com/listing/960915006/wholesale-25-sets-organic-stuffed-bunny?click_key=70d8954b4273e74cfd30fa9fbd6e39ddcd14c4d5%3A960915006&click_sum=6cb0f0da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-39&etp=1&sts=1&content_source=816e3a801196416fb0107217da3ff808f5d9d8d2%253A960915006",
    "title": "Wholesale 25 sets - Organic stuffed bunny, 3 bunnies in carrot zip purse, Easter bunny toy, Home decor, Children's gift",
    "description": "☆★ Please take your time to read shop policy, item descriptions before making a purchase.25 sets of 3 bunnies in carrot zip purseCute bunny set is a great addition to your Easter decor or decorate your room. It will be a perfect Easter gift! It made with organic cotton and cotton fabric. The inside is filled with hypoallergenic fiber filling.【Size】Carrot : 8\", Bunny : 2.5\"【Color 】Brown, grey, white【Material】Organic cotton, cotton ✂【Gift】If you are looking for a gift, PLEASE buy a gift wrap(See Gift wrapping details)【Care】It is recommended to wash only by hand, with mild detergents, dried naturally.----------------------------------------------------------------------✈ Ship worldwide by Fast-ship.co Mail Standard / Thailand post / YunExpress / USPS✈ /-- Instant tracking-- We ship Mon-Fri (ex. Holidays)-- To USA : Fast-ship.co Mail Standard via USPS mail service system : Estimated time delivery 10-14 days➽ UPGRADE TO EXPRESS SHIPPING ➽-- Make your selection on the Shipping Method page✈ESTIMATED DELIVERY TIMES✈-- USA: 3 - 5 business days-- EU: 3 - 5 business days-- Canada: 4 - 6 business days-- Australia + New Zealand 4 -7 business days-- The rest of the world: 3 - 5 business days➽CONTACT PHONE NUMBER is required for including on the shipping label and courier delivery purpose. Please leave your phone number / note when you place an order.➽ PLEASE NOTE that the delivery is not available to P.O. Boxes. The area that appears \"Remote area\", an additional delivery fee will be charged.-----------------------------------------------------------------------✔️ Please note : You may see the same type of product from the same source. But what a different is the sewing, hand stitching and quality of materials and workmanship. Products in my store are produced in the family and it is through the process of checking on my own. This is why I can guarantee that you will get good quality products from TanMadeShop : Cotton is naturally dyed and bleached to give the color of the bark. Therefore, the dark color of some rolls of fabric may be distorted from the color in the picture.----------------------------------------------------------------------Any questions *Message seller* ✉📷 The picture was taken in natural light.📺💻 Product color may slightly vary due to photographic lighting sources or your monitor settings.🇫​​​​​🇦​​​​​🇨​​​​​🇪​​​​​🇧​​​​​🇴​​​​​🇴​​​​​🇰​​​​​Animal gift idea : https://www.facebook.com/tanmadeshop",
    "reviews": [
      "Adorable and really well made. Materials used were of great quality too!",
      "Thank you so much for taking the time to leave an excellent rating. I really appreciate you being a customer and helping to share the word about my work. Your feedback helps me to improve service for everyone! Ratcha...",
      "Love this little carrot set…..I should have paid more attention to the description, however.  It’s a lot smaller than I was anticipating, but still darling.",
      "So cute! Great for Easter baskets."
    ]
  },
  {
    "productId": "GbeKsubLvO",
    "url": "https://www.etsy.com/listing/754120222/mini-pastel-bunny-sugar-cookies-easter?click_key=06317c8a7739506ebc3d0bda1a90179f53c51023%3A754120222&click_sum=49309d3d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-40&etp=1&content_source=bb2299dcce1a95776cba60b99c12b282459f8709%253A754120222",
    "title": "Mini Pastel Bunny Sugar Cookies (Easter, Baby Shower, Birthday Party)",
    "description": "How adorable are these mini bunny cotton tail cookies!?Perfect for baby showers and Easter!The sugar cookie recipe is based off my Italian grandmother’s cookie recipe. I then added my part by decorating each cookie with delicious royal icing. I take pride in using only the finest ingredients and putting detail into every sweet treat.  Customers tell me “you can’t each just one!” Other than these cookies being additive, they are also super cute!Ingredients:Flour, Sugar, Egg, Butter, Vanilla Extract, Almond Extract, Baking Soda, Salt, Powder Sugar, Meringue Powder, Food Coloring, WaterPerfect for parties, events, favors, or just to snack on!Timeline:All cookies are made to order so please allow 1-2 weeks. If you are ordering a larger quantity please contact me in advance to make sure that I have the availability for the order.Shipping:I take great care to seal the cookies in bags and then wrap the cookies in bubble wrap bags. Cookies are then placed in a box with crinkle paper and packing peanuts. A cookie may occasionally break or crack. I do not offer refunds for breakage, as I cannot control how your package is handled by the post office. I promise though, the cookies will always taste delicious!Storing Cookies:Cookies can stay fresh for a couple weeks if stored in the bags or a sealed container away from sunlight. No need to be put in the fridge. Cookies stay fresh at room temperature.Cookies are 2 inches tall.",
    "reviews": [
      "Love the bunny cookies they are so cute",
      "Quality item, the item was better than expected and it fully met our expectations.  All the guests loved them at our party!",
      "Absolutely adorable AND delicious."
    ]
  },
  {
    "productId": "fCqmEJsHXk",
    "url": "https://www.etsy.com/listing/1408668638/sports-easter-lambada-greek-orthodox?click_key=963060eef686138926c8ee1a491214209a53b1d6%3A1408668638&click_sum=b0e62cc4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-41&frs=1&sca=1&sts=1&content_source=a598cd270850c6da6bddd399a3ec0377814374c3%253A1408668638",
    "title": "Sports Easter Lambada, Greek Orthodox Easter Candle, Basketball Lambathe, Soccer Lambathes, Baseball Lambada, Labades, Λαμπαδα για το Πασχα.",
    "description": "Sport Easter Lambada decorated with a wooded soccer ball, basketball, or baseball. One white taper candle with coordinating ribbons. It's the perfect gift for godchildren.An 11\" flameless battery-operated candle is available*. The perfect option for keeping little kiddos safe from flamed candles.For a lovely touch, you can add twine wrapping to your candle.Please allow 3-5 days for production depending on the volume of work! If you need the item by a specific date, please leave instructions.- Please note that all of our products are MADE TO ORDER, so each one is unique and may vary slightly.- If you want your order for a gift, please leave instructions for personalization, and we can handwrite a message for you.- If you want to offer an Easter candle as a gift we can send it directly to the recipient.Dimensions-Candle 15\" / 38.1cm-Soccer ball 3.5\"H / 9cm x 3.5\"W / 9cm-Basketball 3.5\"H / 9cm x 3.5\"W / 9cm-Baseball 3.5\"H / 9cm x 3.5\"W / 9cm*batteries not included with flameless candles.",
    "reviews": [
      "This is a very well crafted lambada",
      "Beautiful for a baptism or Easter"
    ]
  },
  {
    "productId": "cvSyo0EBuw",
    "url": "https://www.etsy.com/listing/592731024/dinosaur-crayons-dinosaur-party-favors?click_key=90051457d00255958a4f8781704278a7b96810e5%3A592731024&click_sum=e84af55f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-42&etp=1&sts=1&content_source=789ea97406cecb85fd97f85880352710bb952e6c%253A592731024",
    "title": "Dinosaur Crayons - Dinosaur Party Favors - Kids Gifts - Stocking Stuffers - Kids Birthday Gifts - Easter Basket Stuffers - Kids Party Favors",
    "description": "This awesome Dinosaur Crayons Gift Set is made from 100% non-toxic crayons. They are perfect for Santa/Easter Bunny to use as stocking stuffers/basket fillers, gift giving, party favors, classroom favors or just to have! They are ready to give and will definitely bring on the smiles. The crayons  measure approximately 2\" long and 1\" tall.>>You Will Receive<<1 Set of 7 Dinosaur Crayons in a 8\"x2\" Gift Box(The colors may be different than pictured. The colors will be an assortment of different shades of red, green, blue, yellow, orange, purple, pink, gray, black, and brown).The complete Gift Set measures 8 inches by 2 inches.Looking to use these for party favors or to sell in your store? Checkout the Wholesale/Bulk set here:https://www.etsy.com/listing/715467570/wholesale-bulk-dinosaur-crayons-dinosaur?ref=shop_home_active_2&frs=1&new=1Check out all of our crayons and laser engraved items in the shop. There is a little something for everyone!KagesKrayons.Etsy.comNeed invitations, party supplies, or art prints? Checkout my other shop!:StudioSereneByStacie.Etsy.comIf you need more or less crayons than this listing offers, feel free to message me for a custom order!***not intended for children under 3***Stay connected with us at www.KagesKrayons.com,@KagesKrayons on Instagram, and KagesKrayons on FacebookNot Suitable For Children Under 3 Due To Small Parts",
    "reviews": [
      "Great quality. They will look adorable in the Easter Baskets this year.",
      "My son loved these crayons!",
      "Crayons are super cute and are the perfect size for my grandsons’ little hands.",
      "What a great idea for a toddler's holiday gift! These are absolutely perfect, with minute detail. Boxing was prettily done as well!"
    ]
  },
  {
    "productId": "nxGSfHVfdG",
    "url": "https://www.etsy.com/listing/1681935271/personalized-easter-bunny-18-designs?click_key=745afd0b7223b9ae823af6955c6a1d0638d52a0d%3A1681935271&click_sum=dd51419a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-43&pro=1&etp=1&content_source=08884f4b53be15c9affeb1fab9dfafa858660a10%253A1681935271",
    "title": "Personalized Easter Bunny. 18 Designs. Kids Toys. First Easter Gift. Easter Stuffers. Easter Table Decor. Wooden Bunny With Name. Baby Gift.",
    "description": "• Personalized Easter Bunny •Add a pop of color to your Easter decor with our Wooden Easter Bunnies! Available in various hues, these charming decorations are perfect for family gatherings and make delightful gifts for loved ones.• Available Designs •We offer 18 different designs in two sizes: S (small) and L (large).CHECK out the infographic!• Sizes •S (small): 3.94x1.97 inches (10x5 cm)L (large): 4.72x2.36 (12x6 cm)Egg Holder: 3.94x3.15 (10x8 cm)• Personalization •For an additional fee, you can have the name applied to the bunny.• Available Variations •Two options are available: boy (bowtie on the neck) and girl (bow on the ear).• Materials •Made from solid wood and covered by water-based paint or linseed oil (for wooden one).• Questions •1. If you receive a damaged product, please contact us. We will gladly resolve this issue.2. Please note that we do not own delivery services and cannot control the shipping process. If you experience delays, check if your product was sent correctly. If everything was sent on time, the issue may be with the delivery service.",
    "reviews": [
      "Lovely gift for a little girls christening. Fast delivery.",
      "The item was beautifully made",
      "So cute! I'm happy about the outcome, very well made and high-quality. I'd recommend this shop to friends and family"
    ]
  },
  {
    "productId": "DXYttqL9WJ",
    "url": "https://www.etsy.com/listing/1404154178/my-first-easter-sign-some-bunny-loves?click_key=d66608b3edaa8d4498841c9a59bb37345f69b2de%3A1404154178&click_sum=e2178292&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-44&bes=1&sts=1&content_source=c1197a20c69372d9f6c67c342090cdf635d807b9%253A1404154178",
    "title": "My First Easter Sign, Some Bunny Loves You, Kids Milestones, Footprint Sign, Easter for Kids, Easter DIY, Easter Basket Stuffers",
    "description": "These measure 8\" wide & 10\" tall with the ears. The square portion is 8x8\".Paint not included.If it is not their first Easter, I can rephrase with just their name and the year.This listing is for one footprint board. You will need to change the quantity, if you would like more than one.Footprints in listing photo belong to an almost 2 year old for size reference. My 6 year old’s foot hangs over the edge, so this won’t work for kids past toddler age.**Due to the nature of wood, the grain will vary amongst each piece.",
    "reviews": [
      "why not include an ink pad",
      "Such a cute gift and it arrived in plenty of time for Easter!",
      "Love it!!! It’s great quality also",
      "So cute and I received it quickly!"
    ]
  },
  {
    "productId": "lDECKPtVwQ",
    "url": "https://www.etsy.com/listing/1635625670/hand-painted-floral-easter-egg-wood?click_key=394bb61f484cf5c1bd9b86facb6269c25e2aa762%3A1635625670&click_sum=3faa63e8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-45&bes=1&content_source=c6553f5b93777fe3b4a20dd705176def42dbeb35%253A1635625670",
    "title": "Hand Painted Floral Easter Egg Wood Ornaments",
    "description": "Each solid wood egg is delicately hand painted in acrylic paint. They are a beautiful gift or a special piece to keep for yourself.Two sizes available.Medium Eggs:-2.5 inches high and 2 inches wide (the size of an actual egg)-option to add a gold hang ring and a silk ribbon hanger-can be hung like an ornament or displayed in a basket.Large Eggs:-3.25 inches high and 2.5 inches wide-flat bottom-can stand on their own or displayed in a basket.Individual brown Kraft gift box included with each egg.Feel free to message with any questions.",
    "reviews": [
      "Absolutely love these eggs they’re amazing!!!",
      "Absolutely love these eggs they’re amazing!!!",
      "Absolutely love these eggs they’re amazing!!!"
    ]
  },
  {
    "productId": "girEhNawml",
    "url": "https://www.etsy.com/listing/1376649262/personalized-easter-basket-tags-easter?click_key=1114e86a4caf1a82bf6135c3ac5cfb8efa330a8f%3A1376649262&click_sum=f59cb5a5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-46&bes=1&sts=1&content_source=6384294e0a22544db3992aa9735a30611d61dd44%253A1376649262",
    "title": "Personalized Easter Basket Tags, Easter Money Holder, Easter Gifts teens, Easter basket stuffers, Easter Bunny Money Holder, Easter Gift Tag",
    "description": "Personalized Easter Basket Tags, Easter Money Holder, Easter Gifts teens, Easter basket stuffers, Easter Bunny Money Holder, Easter Gift TagMake adding money to your kids' Easter basket a little more fun with this super cute easter bunny money holder tag. Featuring a cute bunny with an option to personalized with a name, these tags make a great gift on their own or fit into any Easter basket. These tag are also perfect for kids who have outgrown the tradition of having a basket, but you are looking for a fun way to still celebrate the holiday. Perfect Easter gift for teens, girls, boys, parents, and adult kids. The Easter bunny wooden handmade money holders will be the hit of your Easter activities.Bunny Money Holder with stand can be found the the link below:https://ritterohanawoodwork.etsy.com/listing/1654114555/easter-money-holder-easter-basketEaster tags are laser cut/engraved from maple wood. Due to the laser cut process there  may be a very slight smell of wood burning. This will go away with time.NON personalized Bunnies are 6.25\" tall and 3.75\" widePersonalized Bunnies are 6.5\" tall and 3.75\" wide.Money NOT includedDue to lighting, monitor, and mobile displays, colors may appear different the actual color. I do my best during the editing of the photos to match the true product coloringDue to the laser there may be a slight smell of burn, this will go away with time. With the natural wood there may be inconsistencies due to the nature of wood. I do my best of personally choosing the best pieces.I am the original designer of this specific design and all of my photos have my logo on them as authentication. You will finds many look a likes in your search. I appreciate you supporting the original owner.The photos found on my page are the property of Ritter Ohana Woodworking, LLC. No one has permission to use my photo for any reason.Please Note:I use USPS to ship all of my orders.  Shipping times vary  based on the shipping you choose at checkout.You may experience delays with the USPS. Once your package is dropped off it is out of my control on delivery times. Should anything happen to your package a claim will be made through USPS. Please reach out to me first so I can quickly help resolve the issue.Thank you for understanding!CONTACTFeel free to contact us with any questions via Etsy conversation.",
    "reviews": [
      "Very cute! I love it and my grandson will too",
      "This is my second time ordering from them. I absolutely love these bunnies.",
      "The quality of the item was great and matched the description. Great customer service and super fast shipping!"
    ]
  },
  {
    "productId": "eqMFiCmcOq",
    "url": "https://www.etsy.com/listing/1170954237/musical-wooden-easter-egg-shakers-easter?click_key=ba1375a704ca531410d0bd3ac47f0cb98e3e176a%3A1170954237&click_sum=67d889b2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-47&pro=1&bes=1&content_source=13ded548c4d5ea874414794395160aba4b4b451c%253A1170954237",
    "title": "Musical Wooden Easter Egg Shakers | Easter Gift | Baby First Easter",
    "description": "These wooden shaker eggs are a beautiful keepsake and sensory gift for your little one this Easter.Size: Each egg is approx. 6cm x 4cm in diameter, and come in Natural WoodThese eggs give off a beautiful sound when shaking.DO NOT LEAVE YOUR CHILD UNATTENDED WHILE PLAYING WITH THERE EGGS.  DO NOT ALLOW CHILDREN TO PUT THE EGGS IN THERE MOUTHS.By placing your order, you understand that colours and wood grain vary from monitor/screen to in-person. You acknowledge that handmade products may differ ever so slightly from the photos on the website.",
    "reviews": [
      "Beautiful product! Excited to gift it",
      "Nice item - as described.",
      "Loved the appearance and the personalization. The description was a bit misleading in that it said musical egg when in fact it appears to have salt inside so it’s a shaker.",
      "Looks lovely. Very happy 😄"
    ]
  },
  {
    "productId": "oSmUxaAbQd",
    "url": "https://www.etsy.com/listing/1435725265/personalized-easter-basket-tag-easter?click_key=f003dc17b1f3859e6e7e2e9a821f7ede3ed1ce33%3A1435725265&click_sum=299e92e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=easter+gift&ref=search_grid-5516-3-48&bes=1&content_source=2cbfcea1028d4c6e4a478a4806884d81f947a5a5%253A1435725265",
    "title": "Personalized Easter Basket Tag| Easter Basket Name Tag | Carrot Easter Tag | Kids Easter Basket | Easter Basket Tag | Carrot Name Tag",
    "description": "Arrives AFTER Easter, please review datesPersonalized Carrot Easter basket tags add the cutest touch to those easter baskets!| D E T A I L S |Measures 5.5\" longCarrot base is made of 1/4\" birch woodLayered acrylic carrot with layered name*please note names will not overhang the carrot shape but instead appear flushed",
    "reviews": [
      "Cute and easy to add to baskets",
      "Super cute - can’t wait to put it on my sons Easter basket",
      "Great addition to my sons Easter basket 🤍",
      "Great quality! Exceeded my expectations"
    ]
  },
  {
    "productId": "cyILpKyFiX",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=48fc203e18fb6d616d71c3f34de9d0435ce0d5f9%3A1567221560&click_sum=e17e0f0d&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!"
    ]
  },
  {
    "productId": "rmAYcQRNIA",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=81135a1f9d52e325847de7c19a8dcf7f532940c1%3A1544035118&click_sum=e1b4b37b&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Great product, and service would highly recommend it to anyone.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "ezxkc0fdJD",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=0a1f4e11faffc1513711c8323ab00a92c22567c2%3A747068567&click_sum=abac45e8&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!"
    ]
  },
  {
    "productId": "euPzrmEMNe",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=509d1870d463e3d789b17bdb255e18efd99fe3ac%3A654638870&click_sum=980b7065&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "kccoSyjapJ",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=dce799d1b531230632695f20cd97a1f70d10c61a%3A1355783916&click_sum=9bafa665&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist"
    ]
  },
  {
    "productId": "4QBGyFGRrx",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=a94cbb0484c4ba71bd6b69bebffb91928a3a97d9%3A1411614241&click_sum=07f70345&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!",
      "The only thing I didn’t consider was my outlet is sideways where I wanted to put it and the prongs on this base are not able to be turned. The item itself is great though!"
    ]
  }
]
