[
  {
    "productId": "OzxMMlPPkG",
    "url": "https://www.etsy.com/listing/1207495293/gift-for-him-personalized-bbq-set?click_key=948bf2c4a66509678198b8ea1c18e453476e514d%3A1207495293&click_sum=46c00285&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-1&pro=1&frs=1&etp=1&sts=1",
    "title": "Gift for Him | Personalized BBQ Set | Barbecue Gift | Personalized Gift | Fathers Day Gift | Housewarming Gift | Boyfriend Gift | Birthday",
    "description": "A Personalized Grill set is a perfect gift for anyone who loves to grill. Let's face it, who doesn't?  Grill masters everywhere will want this.We personalize each BBQ Set to your likings, based on one of our premade designs. We are able to do more customized items for a small fee if desired.Specs and Details:Box measures: 18\" x 6\" x 3\"Set Weight: 4.5 lbs5 Stainless Steel ToolsHow to Order:Select the quantity and click the design you want and in the \"Notes Section\" upon check out leave all your engraving details so we can personalize your bbq grill set.Due to the nature of the wood the engraving may appear in lighter and darker colors.",
    "reviews": [
      "More than expected ♥️ ♥️",
      "Great little set. I didn't engrave it but wish I had. It's a very simple box that would have popped with something on it.",
      "Came quick, the engraved box looked so good."
    ]
  },
  {
    "productId": "xozSgoETIR",
    "url": "https://www.etsy.com/listing/1425463870/customized-charcuterie-board-wedding?click_key=a5f108a677da7f51b860c0120927b70698277d64%3A1425463870&click_sum=a3c2e53f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-2&pro=1&frs=1&sts=1",
    "title": "Customized Charcuterie Board, Wedding Gift, Handmade Gift for Her, Personalized Gift for him, Cheese Board Set, Gift for Women, Couples Gift",
    "description": "Personalized Gift Idea : Customized Cheese Cutting / Serving Board with Knife SetFeatures:●\t BAMBOO MATERIAL – Natural and Durable●\tLIGHTWEIGHT - From picnics to parties, carry it everywhere●\tCOMPACT DESIGN – Slide-out drawer contains a cutlery set with 4 different tool●\tEASY TO CLEAN – Just wipe it with a wet cloth●\tPERFECT PERSONALIZED GIFTS – Unique Personalized Gift for any occasions.● Gift Card and Gift Wrap are available at the check-out.Dimensions●\t13\" x 13\" x 2\"This unique personalized charcuterie / cutting board with long-lasting laser engraving makes it the perfect personalized gift for any occasion.Whether you are entertaining at home or sending it as a gift, this classic wooden cheese board set is always a winning idea for gift baskets.It is the perfect personalizedMothers Day GiftMother of the Groom giftWedding gift for a coupleBridal shower giftsHoliday giftsBirthday giftHousewarming giftHostess giftGift for momGift for dadGift for the homeBirthday, Anniversary or any other occasion for your loved ones; you can’t go wrong with this product.Whether preparing for a small gathering or a large party, this home-living personalized cheese board and knife set will help you create unforgettable memories and enjoy time in good company. This wooden serving tray is perfect for outdoor entertaining like camping or just relaxing at home.The cutlery set, which includes 4 different types of tools for shredding, slicing and serving all kinds of cheese, sausage, and fruit, is located in a drawer inside the product.  This laser engraved charcuterie board with storage and utensils offers both neatly organized tools and a compact appearance.https://www.etsy.com/shop/UsWoodArts",
    "reviews": [
      "Perfect for a given wedding gift and the couple were very pleased. Though there was a decent scratch/chip in the board that was very noticeable, I’m overall happy with the gift.",
      "Super cute \nBought it for a wedding gift and they loved it",
      "Great gift for family for Christmas",
      "It’s absolutely beautiful!  Exactly what I wanted!"
    ]
  },
  {
    "productId": "CahVGPDBUF",
    "url": "https://www.etsy.com/listing/1164099305/dopp-kit-for-men-leather-toiletry-bag?click_key=706d9d729e738af0f254e3e56631fdcdcf985b82%3A1164099305&click_sum=4f4f65d4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-3&pro=1&frs=1",
    "title": "Dopp Kit for men, Leather Toiletry Bag, Shaving Kit, Mens Travel Kit, Personalized Gift for men, Gift for him, Leather Dopp Kit,",
    "description": "Personalized Leather Dopp Kit, Third Anniversary Gifts For Men, Leather Toiletry Bag, Birthday Gift For Dad, Valentines Day Gift For Him, Dopp Kit, Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for HimMaterials: %100 Genuine Full Grain Cowhide Leather, Italian Leather, Distressed Leather, Reliable Smooth Heavy-Duty Zipper**Get it fast! Free Ships out by USPS when you order up to 2PM(ET) from New JerseyITEM SIZEXL Dopp Kit:Approx. 9.5\" x 4.5\" x 4.5\"Large Dopp Kit:Approx. 8.25\" x 4.25\" x 4.25\"Small Dopp Kit:Approx. 7\" x 3.9\" x 3.9\"COLOR OPTIONS-Light Brown-Dark Brown-Blue-Antic BlackPERSONALIZATION INSTRUCTIONSWe will engrave your initials, names or monograms to the bottom right corner of the bag. Also we can engrave your handwriting, messages or pictures such as family photo, pets photo, team logo groomsmen photo ect. to the middle of the bag. Please specify your personalization request at the personalization section.HOW TO ORDER________________________________1. Please Select Your Quantity, Color and Size then Add This Listing to Your Cart.Example: Design 9, Groomsmen, Anthony,Example: Design 11, SFR, 7/2/2023Example: Design 1, Anthony2. At the checkout page, enter the personalization information for the item in the labeled box 'Note to CraftCornerHouse'.👀👉Please don't forget to specify which design you want.👈🏽👀If you don't specify which design you want,I use \"Design 6\" for Initialsand \"Design 3\" for Names as the default design.► We love custom orders, so if you don’t find what you are looking for or if you have a custom idea please contact us.If you are looking for a perfect men's gift, you need to look no further. We use premium-grade leather to produce beautiful handcrafted and extremely durable toiletry bags which are a timeless classic gift for any occasion: Birthdays, Father's Day, Graduations, Weddings, Travels, you name it.***Want to order 9 or more items? Contact for bulk pricing!If you have any questions or need help regarding our products, get in touch with us!Thank you for visiting our shop!",
    "reviews": [
      "Great product! Highly recommend buying!",
      "Great shipping timing.",
      "It’s a beautiful bag! Really nice quality, and the personalization looks PERFECT. FAST turn around. I paid for expedited shipping since I ordered last minute. It got here faster than expected. When I messaged the shop to confirm quick turn around, they responded immediately. So happy with the purchase. Will buy with this shop again for sure!",
      "Beautiful product!!  I loved it so much this was my 2nd order."
    ]
  },
  {
    "productId": "ploztgOGOx",
    "url": "https://www.etsy.com/listing/1532612369/custom-makeup-bag-personalised?click_key=20e42d5c4266fb174de5c26b1a8e49e91fb327af%3A1532612369&click_sum=96d424ed&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-4&pro=1&frs=1&pop=1&sts=1",
    "title": "Custom Makeup Bag, Personalised Bridesmaid Gifts, Wedding Gift, Travel Toiletry Bag, Cosmetic Bag, Birthday Gift for Her, Mother's Day Gift",
    "description": "💕Indulge in the elegance of velvet with exquisitely makeup bag & toiletry bag.  are a cute gift for women, It’s a practical and memorable gift for them. Handcrafted with care and precision, this bag serves as a luxurious home for all your beauty essentials.  is also a perfect thank you gift, birthday gift, maid of honor gift, mother's day gift, and much more...is perfect for travel!Want it faster? Expedited Production & Expedited Shipping Service is available.See this link:https://www.etsy.com/listing/1373117202- Material: 100% Italian Velvet- Customized Heat Stamp (Gold by default)- Size: Perfectly sized to accommodate all your beauty essentials or your bathroom items: toothbrush, cream, face moisturizer, brushes etc- Good for travel: small and easy to carry- Personalization: Add your name or initials for a custom touchEach bag can be personalized with the name of your loved one, top quality guaranteed.ANY QUESTIONS? Send me a message and I will be there to help.",
    "reviews": [
      "Love. Would definitely purchase again. Took the bigger size and it is perfect for traveling. Also purchased one for my sister and she loves it.",
      "Will definitely purchase again for friends and family! Amazing detail!",
      "Great bag and fast shipping!",
      "Quality and appearance of the makeup bags are amazing! Will definitely be purchasing more as gifts throughout the year! There was a slight hiccup in one personalization. Seller was quick to respond and send a new one promptly! Great business!"
    ]
  },
  {
    "productId": "wH8OapcSMG",
    "url": "https://www.etsy.com/listing/1222884263/birth-month-flower-personalized-small?click_key=fe5ccca500e29787472003710caaafc4ce188d68%3A1222884263&click_sum=c69b80d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-1&pro=1&etp=1",
    "title": "Birth Month Flower Personalized Small Heart Garden Stone, Birth Flower Garden Stone, Garden Decor, Gifts for Her, Mother's Day Gifts",
    "description": "The Birth Month Flower Personalized Heart Garden Stones add a pop of color to any garden or walkway. Outdoor decor makes a wonderful gift for Mother's Day, Birthday, and many other occasions!𝙋𝙚𝙧𝙨𝙤𝙣𝙖𝙡𝙞𝙯𝙖𝙩𝙞𝙤𝙣 𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣:- Name: up to 12 characters- Optional Birthdate: up to 8 characters𝙋𝙇𝙀𝘼𝙎𝙀 𝙉𝙊𝙏𝙀:Spaces and punctuation count as a character. If no personalization is wanted; please place a 𝑷𝑬𝑹𝑰𝑶𝑫 \".\" in the name's text box.𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- Each piece sold individually- This is the small garden stone- Personalize with birth flower, and birth date up to 8 characters, name up to 12 characters- Measures 5.75\" L x 5.75\" W x .5\" H at widest parts- Constructed of polyresin and sand material- Flat on reverse side, so it sits easily in your garden or walkway- Made for outdoors, recommended to bring inside during inclement weather- Natural tone of the stone may vary slightly𝑪𝒉𝒆𝒄𝒌 𝒐𝒖𝒕 𝒐𝒖𝒓 𝒐𝒕𝒉𝒆𝒓 𝒊𝒕𝒆𝒎𝒔 𝒉𝒆𝒓𝒆!*Large heart garden stone can be purchased within the following link:https://www.etsy.com/listing/1208930646/birth-month-flower-personalized-large",
    "reviews": [
      "Good product for the price",
      "Good product for the price",
      "Yes great quality would recommend"
    ]
  },
  {
    "productId": "Cnm3nHAATd",
    "url": "https://www.etsy.com/listing/1406463743/easter-tic-tac-toe-basket-fillers-easter?click_key=f0f7b6867259532d25c345f6e5ff2765d8928ee9%3A1406463743&click_sum=4f48baa6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-2&pro=1&etp=1&sts=1",
    "title": "Easter Tic Tac Toe, Basket Fillers, Easter Gift for Kids, Basket Stuffers, Wooden Kids Game, Personalized Gift, Bunny, For Girls, For Boys",
    "description": "These adorable wooden Tic Tac Toe boards are the perfect Easter Basket Stuffers!  These personalized gifts for kids feature your choice of multiple design options and colors.  Work on fine motor and critical thinking skills with this fun hands on version of the classic Tic Tac Toe game.Choose from Easter bunnies, Easter eggs, and carrots for the shapes, and a variety of color options.The base and pieces are made out of wood and each set includes 10 game pieces total, 5 of each design.  The game boards are approximately 4.5\" x 5.5\" and easily fit into a purse or bag to travel, play in your favorite restaurant, or keep kids entertained in the car.**WARNING- The tic tac toe pieces are small and are a choking hazard. This toy is not for children 3 and under.**",
    "reviews": [
      "Very cute.  My granddaughter will love it.",
      "Item as described. Good quality. My niece will love these as part of her Easter basket. Thank you!",
      "Amazing quality! And extremely fast shipping!! Thank you!"
    ]
  },
  {
    "productId": "gTiUjzQzWO",
    "url": "https://www.etsy.com/listing/1495095833/silver-name-necklace-personalized?click_key=db9629874149bb6a1fc3d397b5ccae8429611735%3A1495095833&click_sum=f0f295a4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-3&pro=1&frs=1&etp=1",
    "title": "Silver Name Necklace, Personalized Necklace, Solid Gold Necklace, Dainty Necklace, Gift For Her, Birthday Gift, Christmas Gift, Mother Gift",
    "description": "Name Necklace: A Timeless Personalized Jewelry TrendName necklaces have emerged as a timeless and popular trend in personalized jewelry, offering individuals a stylish and meaningful way to express their identity. These necklaces feature the wearer's name, initials, or a significant word, crafted into an elegant and customizable pendant. In this article, we'll delve into the enduring appeal of name necklaces, their customization options, and how they've become a beloved accessory for people of all ages.The Enduring Appeal of Name Necklaces:Name necklaces have stood the test of time, remaining a cherished jewelry staple for decades. Their timeless elegance and personal significance make them a favorite choice for individuals seeking to adorn themselves with a meaningful accessory.Personalization and Individuality:At the heart of the name necklace trend is the desire for personalization and self-expression. By wearing a necklace adorned with their name or initials, individuals can showcase their unique identity and celebrate their individuality.Customization Options:Name necklaces come in a variety of styles and materials, offering ample customization options to suit every taste and preference. From classic script fonts to modern block letters, and from precious metals like gold and silver to more affordable options, there's a name necklace to match any style and budget.Meaningful Gifts:Name necklaces make thoughtful and sentimental gifts for loved ones on special occasions such as birthdays, anniversaries, and graduations. Giving a personalized necklace demonstrates thoughtfulness and consideration, creating a lasting memento that holds sentimental value.A Symbol of Connection:Wearing a name necklace can symbolize various connections and relationships in one's life. It may represent the wearer's own identity, commemorate the name of a loved one, or serve as a reminder of a meaningful word or mantra.Versatility in Styling:Name necklaces are incredibly versatile and can be styled in numerous ways to suit different outfits and occasions. Whether worn alone as a statement piece or layered with other necklaces for a trendy look, they add a touch of elegance and personal flair to any ensemble.Celebrities and Influencers:The popularity of name necklaces has been further fueled by celebrities and influencers who often showcase their personalized jewelry on social media platforms. Their endorsement has helped propel the trend into the mainstream and inspire countless individuals to embrace name necklaces as a must-have accessory.Conclusion:Name necklaces are more than just pieces of jewelry; they're symbols of identity, individuality, and connection. With their timeless appeal, customizable designs, and versatile styling options, name necklaces have become a beloved accessory for people of all ages. Whether worn as a personal statement or gifted as a meaningful gesture, name necklaces continue to captivate hearts and adorn necklines around the world, leaving a lasting impression wherever they go.O U R ∙ S E R V I C EWe accept return and exchange if there is any quality issues, please feel free to contact us if you if you have any concern with the customized necklace. and we will reply to you within 24 hours to ensure that you enjoy the wonderful shopping experience. your satisfaction is all we pursue.R E T U R N & R E F U N D• I guarantee to make a new one for any quality issues, Unfortunately, I cannot guarantee user errors.• If the order has not been sent yet, I can refund if you want.• I cannot return or refund the products made and sent.• I focused on being satisfied and happy to my valued customers. so if there is any problem please contact me first.I would be pleased.M O R E ∙ F R O M ∙ U Swww.etsy.com/shop/HoneyPersonalized",
    "reviews": [
      "My daughter in law loved it!",
      "product was great and so cute!",
      "Good quality and arrived fast"
    ]
  },
  {
    "productId": "cNWjgBuxBW",
    "url": "https://www.etsy.com/listing/660316275/leather-dopp-kit-personalized-groomsmen?click_key=5f0d882f76e8d478e07538dd6b68af308724fbd8%3A660316275&click_sum=957e4639&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-4&pro=1&etp=1&sts=1",
    "title": "Leather dopp kit, Personalized groomsmen gift, leather dopp kit, mens leather toiletry bag, mens dopp kit, mens toiletry bag",
    "description": "✦We can guarantee a timely arrival if you send a message with the deadline prior to ordering this leather dopp kit (toiletry bag or groomsmen gifts) which is also personalized for free.Give it a try, even if it's a matter of a week.________________________________________________________________________________________________________________Growing is forever. This is my latest creation so far.These leather dopp kits are every bit as great as you could think they are.I would like to emphasize on this little moment:The personalization is hot stamped (that's an old school technique and it's hard to do, and it's not laser engraved). Stamped leather smells great, and doesn't have an unpleasant laser burned smell).It's a man against the machine thing, so it's really important.✦SizeStandard:8,5\"x4,5\"x3,5\"Large (I'd prefer to call it huge, but it sounds a bit rash for an official name)9,5\"x6,5\"x4,5\"✦LeatherI use distressed top grain cowhide leather, of the best quality. It's solid, but very soft.The distressed nature allows it to age beautifully, writing down the life story of it's owner.✦MakingYou are in the maker's shop. These bags are cut and sewn from the very scratch.You receive an object made with warmth and personal care, coming from a small studio, where people laugh, joke, and listen to the good music.✦PersonalizeIt is branded with a custom name/initials.Branding can be done on the outside and/or on the inside.While adding an item to the cart,Choose option \"1 stamp\" if you only want it personalized on the outside or on the inside.Choose option \"2 stamps\" if you want it personalized both on the outside and on the insidePlease provide information about names, letters, monogram style, stamp color(plain/gold), personalization strip color in \"note to the seller\", at the checkout.✦ShippingUS: around two weeks since the day of your order. Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.Canada: around three weeks since the day of your order.Europe: between two and three weeks since the day of your order.Australia: between three and five weeks since the day of your order.Rest of the world: between two and four weeks.Multiple items are shipped for the price of a single one - pay for shipping only once!",
    "reviews": [
      "Absolutely beautiful!! The quality is incredible. The shipping was also crazy fast! Definitely would buy again.",
      "Beautiful gift for my husband",
      "Great quality and very roomy I got the large. And the guy I got it for loves it. Will probably buy another one for my brother",
      "Very beautiful bag and the stamping was perfect! Husband was pleased with his gift!! Will be back for more gifts!!"
    ]
  },
  {
    "productId": "OMAXDRAFQE",
    "url": "https://www.etsy.com/listing/292079473/bestie-candle-gift-bestie-scented-candle?click_key=240fb2b8f792c103885625d579157c5fa87517be%3A292079473&click_sum=e6231864&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-5&pro=1&etp=1",
    "title": "Bestie Candle Gift | Bestie Scented Candle | Best Friend Gift | Best Friend Birthday Gift | Girl Friend Gift",
    "description": "Hi, welcome to Hello You Candles!  Our Best Friend Gift Candles are made with 100% American grown, eco-friendly soy wax, and we only use clean burning fragrance and essential oils to scent our candles. Our candles are always free of dyes, harsh chemicals and pollutants and are hand poured in our shop in Laguna Hills, California.  A clean candle is a better candle, better for you and better for the environment.WHAT YOU WILL RECEIVE:1 - 4 oz, 9 oz or 16 oz soy candle in the design shown in the first image.  Your candle will arrive perfectly packaged in our signature gift box, complete with complimentary Hello You matches.Make it personal, add a custom message to the back of your candle (no additional charge :)CANDLE SCENTS:♥ VANILLA:  Vanilla | Bourbon | Buttercream♥ LAVENDER:  Lavender | Eucalyptus | Cedarwood♥ POP THE BUBBLY: Champagne | Strawberries | Guava♥ BOUQUET:  Roses | Ylang Ylang | Green Leaves♥ WEDDING CAKE:  Champagne | Buttercream | Vanilla♥ SPICED HONEY:  Spiced Honey | Dried Tobacco | Tonka Bean♥ BEACH DAY:  Sea Salt | Coconut | Tonka Bean♥ SPA DAY:  Aloe | Green Florals | Patchouli♥ GREAT OUTDOORS:  Pine | White Birch | Cedar♥ BLUE SKY:  Sea Salt | Ozone | Cottom Blossom♥ HEALING WOOD:  Cardamom | Palo Santo | Sandalwood♥ SUNSHINE CITRUS:  Grapefruit | Orange | Lemon | Vanilla♥ HERB GARDEN:  Eucalyptus | Rosemary | Sage♥ HAPPY HOUR:  Cardamom | Butterscotch | Bourbon♥ ENCHANTED FOREST:  Oakmoss | Amber | Sandalwood♥ STRONG COFFEE:  Coffee | Cream | Sugar♥ BIRTHDAY CAKE:  Buttercream | Vanilla | SugarSIZE GUIDE:~ 4 oz candle measures approximately 2.5 inches tall and 2 inches in diameter, 20 hours burn time.~ 9 oz candle measures approximately 3.75 inches tall and 2.75 inches in diameter, 50 hours burn time.~ 16 oz candle measures approximately 4 inches tall and 4 inches in wide, 80 hours burn time.We ship all candles via USPS 2–3-day priority mail. Please check our shop announcement for our current lead time.OTHER HELPFUL INFO:We do offer a discount on bulk orders, please contact me for details.",
    "reviews": [
      "Quality was superb. Met every expectation.",
      "Smelled amazing & it was fun giving a candle with a personalized message on the back!",
      "This was great thank you",
      "Very nice candle. Smells so good."
    ]
  },
  {
    "productId": "yzWmoTQntV",
    "url": "https://www.etsy.com/listing/251037170/girlfriend-gift-gift-for-her-unique-gift?click_key=00d2a3e53684bc14aaaf0e1c7644e4da44852e31%3A251037170&click_sum=522e84c4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-6&pro=1&etp=1&sts=1",
    "title": "Girlfriend Gift Gift for Her Unique Gift for Women Bedroom Love Girlfriend Birthday Gift Ideas Gift for Her Romance",
    "description": "Customize Your Magic Box for FREE💘💘💘Enter the message You would like to be projected. Our team will do the rest!🧙We are more than happy to bring to your attention our unique Magic Box. We are able to cut words into the wood, so that the holder can project a custom message on a wall. All you have to do is load the candle that is included in the package into the Magic Box and place it next to a wall in a dark room. Watch how the place will be filled with romantic light and words will be displayed on the wall. Then see the reaction of the people next to you ! 💘💘💘This product is perfect for you if you would like to make a present to a friend, a relative, people you LOVE. For family events, Christmas, St. Valentines, engagements, weddings, birthdays, name days and ALL kinds of emotional events !OUR MAGIC BOX is in the shape of a cuboid. The length of its sides is 12,5x12,5x11,7 centimeters or about 5 inches. It weighs around 0.8 pounds. Having in mind those parameters, please note that we are limited on the number of symbols we can cut on one side in order for the projection to be clear enough.Please, make sure Your message is not longer than three lines, 12 symbols per line.https://www.etsy.com/shop/MagicWoOod#aboutThank you so much for your credence!🙋❓If you have any other questions don`t hesitate to contact us.💘 Favorite our shop for great inspiration & one of a kind gifts💘https://www.etsy.com/shop/MagicWoOodThank you! ❤️Annie & Emmie 👧👧",
    "reviews": [
      "It's a great product, highly recommended",
      "Got this as a gift for my partner and she uses it almost nightly since we are living in different cities at the moment. It was a cute way for us to bring intimacy. Would recommend.",
      "Wife loved it. I like the custom one off aspect. Only problem I had was trying to track the shipping. But it did arrive exactly on time.",
      "Thank You for your review!:) We always attach the tracking number to your order! :)"
    ]
  },
  {
    "productId": "QTiOZEilbc",
    "url": "https://www.etsy.com/listing/561000129/jewelry-dish-speckled-minimalist-ring?click_key=aabe8c454fd4bfde57952942e3acd6eb8e5e5db2%3A561000129&click_sum=988845ae&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-7&etp=1&sts=1",
    "title": "Jewelry Dish / Speckled Minimalist Ring Dish / Wedding Gift / Engagement Gift / Bridesmaids Gift / Personalized Gift for Her / Ring Tray",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Mailed directly to recipients, and they loved it!",
      "Love this item came out great!",
      "The dish was as beautiful as it looks in the pictures.",
      "Purchased for my bride of twenty years. Custom made.\nShe loved it!"
    ]
  },
  {
    "productId": "CBKPTSiWZd",
    "url": "https://www.etsy.com/listing/758020902/personalized-bumble-bee-garden-stake?click_key=ea12b60a2cb900b4ef2e0f13523973a81be3f14e%3A758020902&click_sum=a18dc9b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-8&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Bumble Bee Garden Stake - Gifts for Her - Personalized Gifts - Garden Decor - Free Shipping - Planter Decor",
    "description": "Let this personalized bumble bee garden stake add some charm to your outdoor space. This metal yard art is perfect for your garden, yard, or patio. This marker is a great way to add a beautiful dedication to your garden decor.Personalize this sign with three lines of text. Enter the exact text that you would like in the personalization box!  ​ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding a different image, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 12\" wide x 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.***PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.***-Finish OptionsRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "I bought a round garden sign with a honey bee and personalized with my name. I can't say enough how much I love it!  It's well made and the metal is sturdy...not flimsy at all. Also packaged very well to avoid damage in shipping. You can tell the seller takes great pride in their work. I can't wait to set it up in my garden this spring!",
      "Great my Aunt loved it.",
      "Great product. Shipped quickly and looks as expected. Great gift!"
    ]
  },
  {
    "productId": "NmwfGNyZCb",
    "url": "https://www.etsy.com/listing/1455887961/custom-auntie-sweatshirt-with-children?click_key=0c92a492a3c5394c79a03a418c419bcef9b25033%3A1455887961&click_sum=a48dbd5b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-5&pro=1&bes=1&sts=1",
    "title": "Custom Auntie Sweatshirt with Children Name on Sleeve, Crewneck or Hoodie, Personalized Gift for Aunt, Neck Auntie with Nieces Nephews Names",
    "description": "Custom Auntie Sweatshirt with Children Name on Sleeve, Crewneck or Hoodie, Personalized Gift for Aunt, Neck Auntie with Nieces Nephews Names🌿WELCOME TO UNIQUE TRENDS DESIGNIf you are looking for soft, comfy, first-rate sweatshirts, you’re in the right place! Here at Unique Trends Design, we love what we do and strive to make your shopping experience just right for you. If you have any questions, concerns, or comments about our products, feel free to shoot us a message anytime. Even on weekends and holidays, we’ll try our best to respond as quickly as possible!Product DetailsUnisex Sweatshirts:- Gildan Brand-50% cotton- Light/medium weight and soft, this sweatshirt is sure to be your next favorite sweatshirt.🌿Sizing and ColoringPlease make sure you select the right color and size for you so you can receive your order without delay.We have various beautiful and vibrant colors available for this design! Choose your color and size along on the dropdown boxes to the right. You can scroll through the photos to see our size chart.🌿ShippingYour order is custom made only for you soon after you place your order! We do our best to prepare your items as quickly as possible. Our items usually ship out within 3-4 business days but if you need any item by a certain date, please message us and we’ll see what we can do!🌿Care InstructionsOur clothing items are SUPER easy to take care of. Simply turn the clothing inside out and machine wash cold with mild detergent. Do not dry clean, bleach, or iron directly.Thank you for shopping at Unique Trends Design where we aim to make shopping just right for you! Click this link to see more of our items:https://www.etsy.com/shop/UniqueTrendsDesign",
    "reviews": [
      "I absolutely adore my sweatshirt. Not only does it fill my heart to have my loves on my sleeve, the product is pretty and it is beyond comfortable. I will definitely purchase from this store again and I have shared this store with friends of mine. Happy shopping.",
      "Exactly as described. Great quality.",
      "It was the perfect gift"
    ]
  },
  {
    "productId": "AubvIJfZLl",
    "url": "https://www.etsy.com/listing/1019139304/lavish-last-name-engraved-stainless?click_key=dff0fb79dbcb20833158b9b4dcb7bf94d881388e%3A1019139304&click_sum=f8d7134c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-6&pro=1&frs=1",
    "title": "Lavish Last Name Engraved Stainless Steel Wine Chiller, Personalized Wine Gifts, Personalized Gifts",
    "description": "If no text is desired, please enter “NONE” where text is required, and we will ensure no wording is produced on your items.Perfect if you are the hostess or makes a great hostess gift, the Lavish Last Name Engraved Stainless Steel Wine Chiller is an impressive bar accessory that replaces the ice-filled wine bucket.- Custom etched with any initial monogram, optional name and personal message for a sleek and distinguished personal touch- Does not include wine bottle or wine glass- Double-walled insulated cylinder provides a consistent temperature- Measures 9.5\" H x 5\" diameter- Made out of brushed stainless steel- Fits 750ML wine & champagnes bottles- Hand wash- Imported",
    "reviews": [
      "Nice Quality, it was a gift and thy loved it.",
      "I had this item shipped directly to a friend in another state so O didn’t see it myself. The recipient was thrilled with it.",
      "The piece is beautiful. Exactly what is in the picture and the delivery is fast!",
      "Great quality and very heavy!"
    ]
  },
  {
    "productId": "tz0xukTeNA",
    "url": "https://www.etsy.com/listing/941954799/personalized-water-bottles-for-boys?click_key=6cad41e9aa9775cfa08c21b1ad87a542a8b2621c%3A941954799&click_sum=f172ceb7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-7&pro=1&bes=1&sts=1",
    "title": "Personalized Water Bottles for Boys Girls | Personalized Gifts for Kids Engraved Kids Tumbler 12 oz Stainless Steel | Toddler Kids Gifts",
    "description": "Gear up for going back to school with custom engraved water bottle for the classroom! Your boys or girls can take a drink with them whenever they're on the move.💦 Material: stainless steel insulated bottle and stainless steel lid with leak proof silicone seal, keep both cold and hot and withstand acidic and carbonated drinks.💦 100% BPA free, phthalates free, toxins free💦 Does not retain nor impart any flavor and dishwasher safe💦 Wide mouth for ice filling and easy cleaning💦 Long-lasting and eye-catching color coating, available in white, pink, sky blue and black💦 Product Dimension: 7.3\" x 3.5\"💦 Capacity: 12oz/350ml💧 How to OrderSelect the tumbler color/ font design and animal icon of your choiceYou can choose as many colors/combinations as you want, add them separately into your cart and check out together to SAVE on SHIPPING**If personalization is purchased, please specify the following info in the “Note to seller” section at checkout:All monogram letters will be printed exactly as provided by the buyerPlease enter font style and name.❤Default is Font#1 if not specified when order.❤Case sensitive❤ 10 character limit❤ Font #1,#4,#5- all capsExample:Font#5- AndrewFont#6- Allison💧 About shipping:DOMESTIC (U.S.): 3 - 5 business daysINTERNATIONAL: 7 - 14 business daysTherefore, it generally takes 4 - 7 business days (PROCESSING + SHIPPING) after the order date to receive your order.Please note: the \"ship by\" date on your invoice is NOT equivalent to the actual \"delivery\" date.- SHIP BY DATE: When your package leaves our studio.- DELIVERY DATE: When your package arrives to you.------------------------------------------------------------------------tumbler, skinny tumbler, custom tumbler, engraved tumbler, water bottle, reusable hydro flask, custom hydro flask, custom water bottle, kids water bottle, children's tumbler, reusable tumbler, reusable bottle, refillable bottle, kids birthday gift, kids birthday gift idea, kid birthday gift, kid birthday gift idea, 2 yr old birthday, 2 yr old birthday gift, 3yr old birthday gift, 3yr old birthday, 4yr old birthday, kid custom gift, tumbler personalized, personalized gifts, personalized water bottle, birthday gift for him, custom flask, engraved flask, tumbler with straw",
    "reviews": [
      "Lovely design, easy to order, fast turnaround",
      "Beautiful gift for my daughter",
      "Love it for my niece!"
    ]
  },
  {
    "productId": "txZczIOwwt",
    "url": "https://www.etsy.com/listing/963147161/custom-wood-sign-personalized-family?click_key=b732d49b6557bb753dec945204d6232d94dc6811%3A963147161&click_sum=608fd2fd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-8&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Wood Sign | Personalized Family Name Sign | Last Name Pallet Sign | Wedding Gift | Home Wall Decor | Anniversary Gift",
    "description": "★ SMALL PRODUCT DOESN'T HAVE A “SECOND LINE” AND “EST” PART.★★ MEDIUM & LARGE: FREE SHIPPING★ UNIQUE & 3D WOOD SIGN | These wooden signs are made of natural wood, so the texture of each product is different, and each product is unique. The words are laser-cut from mdf material and installed on the main real wood plate. Therefore, it has a 3D appearance.● A GREAT GIFT | This wooden sign is a great choice for various occasions, such as wedding gift to your loved ones, office gift, new home gift, housewarming gift, anniversary gift. It will be a very special gift for your loved ones!● DIMENSIONS:(S) Small: 24\" x 7\" | (61 cm x 18 cm)(M) Medium: 24\" x 11\" | (61 cm x 28 cm)(L) Large: 29\" x 14\" | (74 cm x 36 cm)★ Letter Thicknesses: 0.20 \" (5 mm) - (Usually others use 3 or 4 mm)★ This product is not suitable for outdoor use. If you want to buy products that can be used outdoors, you can contact me.● CUSTOM AND MULTI-FUNCTION SIGN | A special wooden sign will have a special place on your door at the entrance to your home, adding more difference to your home than other wall decorations. At the same time, you can use this wooden sign as an advertising sign in your office by operating your brand.Behind your desk in your office, you can use it as a decor in your child's room.You can use this product to make a difference anywhere you want on a bar wall or in a restaurant. This personalized wooden sign will attract a lot of attention by your friends, guests!● QUALITY & SAFETY WOOD | Our real wood products are coated with natural teak oil, a nourishing and protective oil that penetrates deeply into the wood, giving it water repellent properties. Applied teak oil has permission to be applied in children's toys. En 71/3 Standard (Safety of Toys/Migration of some Elements)● BENEFITS OF WOOD | Research on the effect of wood clearly shows that the presence of wood has positive effects; it lowers blood pressure, pulse and stress compared to other materials. It has a positive effect on one's emotional state.(Pallet Wood Decor, Custom Wood Sign, Personalized Family Name Sign, Last Name Sign, Wedding Gift, Home Wall Decor, Anniversary Gift, Welcome Wall Decor, Pallet Signs, Farmhouse Living Room Wall Decor, Desk Blocks With Sayings, Wooden Letters Name, Name On Wall Decor, Name Personalized, Signs, Decor, Wall, Wooden, Home, Company Logo Sign)",
    "reviews": [
      "So well made this is my forth purchase. I will buy more for gifts",
      "I am so happy with my order. This is absolutely a masterpiece. The quality of this item is amazing and it matched the description perfectly. This item has met all of my expectations and more. Very happy and thank you. I highly recommend this website and looking forward to ordering from you. \n\nKindly,\nAngelica",
      "Fast service, great product! Thanks",
      "Your wonderful review has brought a smile to our faces! We're so grateful for your high praise and appreciate the time you took to share your thoughts. We can't wait to have the pleasure of serving you again in the future! Warmest regards.",
      "Arrived within days, and looks perfect!",
      "Your wonderful review has brought a smile to our faces! We're so grateful for your high praise and appreciate the time you took to share your thoughts. We can't wait to have the pleasure of serving you again in the future! Warmest regards."
    ]
  },
  {
    "productId": "fUubLyjJGc",
    "url": "https://www.etsy.com/listing/1592788065/custom-wine-corks-custom-wood-wine-cork?click_key=7b5fc3658cd0258a1eb1b68733a9618ea4bdd8dd%3A1592788065&click_sum=023ad64c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Wine Corks | Custom Wood Wine Cork | Wine Corks | Wine Stoppers | Custom Wine Stopper | Bridal Shower Gift | Wedding Favors | Cork",
    "description": "These wine stoppers for weddings are a perfect detail for your guests to remember your big day. They are also very practical and useful, so your guests will surely put them to good use at home. Whether you're looking for a gift for your guests, or want to add an elegant touch to your reception table, these wine stoppers are the perfect choice for any wedding. Each wine stopper is made with high quality materials, ensuring durability and freshness. In addition, their high-quality design features a variety of classic wedding elements, such as engagement rings, flowers and hearts, which add a romantic touch to any wine bottle.WHAT IS IT MADE OF AND HOW DO WE MAKE IT?They are made in natural wood from sustainable plantations, and natural high quality cork from Portugal (not agglomerate cork, not colmated cork) only natural high quality cork. The wooden capsule is sanded and then the 2 pieces are glued together. then they are engraved with a laser, this way the image will be perfect, and not be will erase with the time.SIZES:-Cork Diameter: .768\" (19.5mm)-Cork Length: .850\" (22mm)-Cap Diameter: 1.1\" (28mm)-Fits 3/4\" openings like wine bottles, etc - Standard sized wine bottles.- Each cork will vary slightly in appearance from one to another.HOW MAKE THE ORDER?1) First, for a 100% successful purchase, we invite you to read all the information we provide here, we know that people don't often have time available but it is essential to know what are you buying and if it works exactly for what we want. at the end of the description we have questions and answers that can help you a lot with some of the doubts you may have.2) See the image with all our designs and choose the one you like3) Select the quantity that you need on the first line4) In the customization box place:A) Design that you want:B) Name of the couple or surname according to the model chosen:C) Date of the occasion:Remember that you will receive a design in approximately 30 minutes to 6 hours with your information for your approval and then we can continue with the order, without this approval we can not place the order and we can not ship it to you.if you have no doubt about what you are asking for and if all the information you are sure is correct, you can write NO SAMPLE NEEDED, and if all the information is clear we will send it immediately without the need to send the design and without the need for approval.5) Then it says quantity again, this quantity leave it at 1 (just choose the quantity you need in the first line)6) Check that the delivery date on etsy is before the date you need the item for, if that date does not work for you please contact us to see if it is possible to have it sooner. (We also have DHL express available, which normally takes 3-4 business days to Europe and 5-6 business days to the rest of the world.)7) Check that your address is correct, many times we have old or wrong addressesFREQUENTLY ASKED QUESTIONS ABOUT THE ITEM:Can do it in another language?Yes, we can do it in the language you want, send us the information exactly as you want it.Can you do it for another occasion?Yes, in fact we already have designs made for many occasions, just write us and let us know what you need.I need it faster, can you help me with this?Yes, depending on the hour we can do it the same day and send it, sometimes it takes us more time because we have to wait for the approval of the design by the client, if you approve fast, we can send it fast and with DHL express normally takes 3-4 working days for Europe and 5-6 working days for the rest of the world. write us any doubt you have before buying.You can engrave my own logo?normally yes, send us the logo by message to verify it before the purchase.Can you help me with an original design for me?Yes of course, just let us know your idea as detailed as possible so we can make something as close as possible to what you are thinking.I need more quantity is there any special discount?Yes, we have special prices for large quantities, companies and charities.GENERAL FREQUENTLY ASKED QUESTIONS :https://www.etsy.com/shop/Allincork?ref=search_shop_redirect#policiesIN THE FOLLOWING LINK YOU CAN SEE MORE PRODUCTS OF THIS SAME CATEGORY:https://www.etsy.com/shop/Allincork?ref=simple-shop-header-name&listing_id=742858914§ion_id=27572030Please contact us with any questions you may have, we are happy to help you.If you have read this far, we thank you, since it is very important that customers are informed that they are buying, in this way they will make better choices and be happier with their purchases, and this is very important to us. Since we take away your valuable time we will send you an additional gift, for this at the time of purchase write to us: I have read everything i want a gift.The Allincork team wishes you a beautifull day ;)AA005",
    "reviews": [
      "Second purchase, Great product, highly recommend",
      "Great little gift, will recommend",
      "Gorgeous job and super fast delivery- Juan- you are the best- thanks so much!!\nHighly recommended."
    ]
  },
  {
    "productId": "AdyWBSsdti",
    "url": "https://www.etsy.com/listing/1405360569/abalone-earrings-minimalist-earrings?click_key=48f80bb157384100805c9908551ad32bb1cd47f2%3A1405360569&click_sum=780c1402&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Abalone Earrings, Minimalist Earrings, Gift Set",
    "description": "Our handmade silver abalone earrings are the perfect iridescent jewelry and gift for wife. Shop our collection of unique and elegant handmade jewelry today.925 Silver Abalone Drop Earrings, Iridescent Abalone, Minimalist Sterling Silver Abalone Stone Handmade Jewelry is an elegant and understated option to complement any outfit. The abalone shell is a unique and elegant piece, with its beautiful print in blue, green and black tones, it gives it a touch of sophistication and originality. These earrings are a perfect option both to wear on special occasions and to wear on a daily basis. These earrings are ideal to wear on special occasions or to wear daily.PACKAGING:The jewelry is carefully packed in a soft peach skin bag and box. The peach skin bag is elegant and non-abrasive, which protects jewelry from scratches and damage during transport. The box provides an extra layer of protection and security for jewelry. This careful packaging helps keep jewelry in good condition and protected while in storage and transport.WHY WE?Each of our beautiful pieces is made with love and care from high-quality materials. We love creating beautiful jewelry and we hope our designs bring you as much joy as we do making them.If you have a question or special request, please contact us.We would love to hear from you!https://phoebeshopboutique.etsy.com• All images and videos are copyright of Phoebe Shop. All rights reserved •",
    "reviews": [
      "These came well packaged.  Super cute.",
      "Beautiful earrings, arrived a little late",
      "Beautiful earrings, not pricy, well packaged and sent in a nice box with an assorted cleaning cloth and an extra sample pair of earrings. Very happy customer.",
      "I AM in love with these earrings! So beautifyl."
    ]
  },
  {
    "productId": "MZEROkqJPu",
    "url": "https://www.etsy.com/listing/1393233546/adventure-book-scrapbook-couples-gift?click_key=1449cb2150d2831a7d1aa86bcdeaac5305f8aeff%3A1393233546&click_sum=7431bd29&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-11&pro=1&frs=1&etp=1&sts=1",
    "title": "Adventure Book Scrapbook Couples Gift for Boyfriend, Anniversary Gifts Couples, Personalized Gift, Valentines Day Gift for Him",
    "description": "Our Adventure Book is the perfect keepsake gift for a boyfriend, an anniversary gift for couples, gift for him, valentines day gift for him, personalized gift, christmas gifts, personalized gifts! Designs are laser engraved with YOUR unique details, every book is one-of-a-kind!I N C L U D E S• Vegan Leather Fabric Binding Book (6\"x9\"  OR  8.5\"x11\")• Cherry or Maple wood covers• Your choice of 30, 45, or 60 sheets of acid-free paper- 28lb Standard Paper option includes BLANK white sheets- 65lb Cardstock Paper option includes BLANK black, cream, or white sheets (recommended for use with photos)*Wood color and grain will vary naturally from the example photo. Wooden covers are coated with a lacquer finish to prevent scratches and to provide a water-resistant coating.H O W  ∙  T O  ∙  O R D E RFrom the drop-down menu:• Select a book size and type of wood• Choose sheet quantity, & paper typeIn the \"Add your personalization\" box:1) Screw Color: Gold, Black, Silver, or Copper.2) Binding Color: See listing photos for all options.3) TEXT to be engraved:*Any other details, such as special design requests and timing deadlines4. Request proof of cover:Check out our shop page for more designs!www.RedBerryGuestBooks.etsy.comT U R N  ∙  A R O U N D  ∙  T I M EIn order to provide a quick turnaround on orders, we do not send proofs of the design unless requested in the notes at checkout.Once the order is received, your book will be sent to production and ready to ship out within about 2 business days. From there, transit time will depend on the shipping method that you select at checkout.………………………………….………………….………………………………Please message us with any questions or for custom requests.We look forward to working with you!© RedBerryGuestBooks*PLEASE NOTE: Wood is a natural product. Knots, dark spots, and grain of the wood will vary naturally. While we do our best to select the best wood pieces for your books, we can not guarantee that the book will be free of these natural occurring variations.",
    "reviews": [
      "Amazing product I would recommend",
      "The book was amazing and very high quality.",
      "It looks absolutely gorgeous, super good quality"
    ]
  },
  {
    "productId": "BdXMRMxluI",
    "url": "https://www.etsy.com/listing/1409145704/custom-portrait-couple-portrait-cartoon?click_key=884823c8ab3ab554b8c6005deaee3aca24063828%3A1409145704&click_sum=314d38b3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-12&pro=1&frs=1&etp=1",
    "title": "Custom Portrait Couple Portrait Cartoon Portrait Engagement Gift Custom Couple Portrait Couple Drawing Personalized Portrait DIGITAL",
    "description": "Custom Portrait, Couple Portrait, Cartoon Portrait, Engagement Gift, Custom Couple Portrait, Couple Drawing, Personalized Portrait, DIGITAL PRINTTurn your favorite photos of you or your friends into adorable and playful anime works of art.If you're interested in ordering a custom printable wall art, simply place your order and message me with a clear photo of you or your friend and I'll take care of the rest. You'll have one-of-a-kind printable wall art that not only looks great but also is cute and unique.♥️  HOW  T O  ORDER  ♥️1. Choose the print size you would like from the drop-down menu and add it to the cart.2. Enter the color you want in the background. ( Example C2 )3. Please send a photo after you've made the payment via Etsy messages.4. Within 24 hours we will send you a high-resolution PDF and JPEG file ready for you to be printed. This will be sent to the email address associated with your order.♥️  A V A I L A B L E   S I Z E S  ♥️- A5 - 5..8 x 8.3 inches- A4 -8.3 x 11.7 inches- A3 - 11.7 x 16.5 inches- A2 - 16.5 x 23.4 inches- 5 x 7 inches- 8 x 10 inches- 11 x 14 inches- 16 x 20 inches- 20 x 30 inches- 24 x 36 Inches♥️  IMPORTANT ♥️This listing is PRINTABLE instant download prints. No physical print will be mailed.You can print the file at home, at a local print shop, or using an online print service.♥️ IMPORTANT NOTE ♥️The final print quality depends on the type of printer and paper used. Colors may appear different in person than on screen.",
    "reviews": [
      "It’s what I expected it to be",
      "They were very helpful and understanding",
      "Thank you so much for your feedback 😊❤️",
      "Looks great! My boyfriend loves it.",
      "Thank you so much for your feedback 😊❤️",
      "Fast services and great quality",
      "Thank you so much for your feedback 😊❤️"
    ]
  },
  {
    "productId": "EicUksvn3b",
    "url": "https://www.etsy.com/listing/1113439038/personalised-folded-book-art-name-or?click_key=ee91889db5e5330a9065df7d9edbe9262f6860dc%3A1113439038&click_sum=1860fe92&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-13&etp=1",
    "title": "Personalised folded book art name or date",
    "description": "Personalised folded book. A name, word or date folded into a book! Guaranteed to wow a book lover with this perfect gift or make a statement on your book shelf! Perfect present for birthdays, Christmas, anniversary or any event.Perfect from 1-8ish letters. Can do more/a few words but the longer it is the less effective it looks. Feel free to message your request though if unsure and I can let you know if it will work.Please note I don't always use brand new books but will always choose books in good condition! I can use certain books upon request (price may vary depending on the book) but they need to be a hardback and around 500 pages depending on what you wanted folded 😊 But feel free to message ant questions!Please allow 5-7 days as each book can take me a few hours to complete but if you do need it sooner please let me know!Thanks so much for looking 😁",
    "reviews": [
      "quality and very fast delivery",
      "Quality product, very  highly recommend!!",
      "Amazing quality item with a lot of time put into such an amazing gift that i wanted to get for my girlfriend. Went out of there way to keep me updated with the status of my parcel to ensure it got delivered to me on time. Thank you so much :)",
      "Loved the book, made my wife very happy.\nThe wrapping and note was very nice\nThank you"
    ]
  },
  {
    "productId": "epoRxrlrCz",
    "url": "https://www.etsy.com/listing/660168036/personalized-date-night-dice-5th?click_key=0104884c6de82a952a8532a0eb32252e3be371cc%3A660168036&click_sum=4c8f3399&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-14&etp=1&sts=1",
    "title": "Personalized Date Night Dice - 5th Anniversary Gift  - Custom Wooden Engraved Dice  - Engagement Wedding Gift Valentine's Day",
    "description": "Tucked into a soft, linen drawstring bag, each set includes a customized tag, three 3/4\" (20mm) wood dice, and dice tray (with slots for \"food,\" \"activity,\" and \"afterwards\").  Dice are customizable and can accommodate six phrases up to 15 characters each (TEXT ONLY).    Tag can be personalized with couple's names, a short phrase (up to 25 characters) or both.    PLEASE NOTE: We will engrave TEXT ONLY; emojis are not standard across devices; they may not come through correctly with your order, if at all.Tag can be personalized with couple's names, a short phrase (up to 25 characters) or both.Please let us know if you would like a proof of your design. If not specified, we will go forward without a proof to expedite the process.  Please review our Proof Approval policy (at the end of our shop page here:https://www.etsy.com/shop/SugarBlushStudio).  Kindly review proofs in a timely fashion to prevent delays in your order's production; a prompt response from you assures we'll be able to get your order made right away!Not sure what to engrave?  Our Standard Phrases include the following:FOOD DIE:  my choice, your choice, pizza, burgers, fancy schmancy, make dinner togetherACTIVITY DIE:  go out to a movie, stay in for a movie, game night, bowling, museum, see a live showAFTERWARDS DIE: cocktails, snuggle at home, coffee, dessert, go to a club, go for a walkAll Sugar Blush Studio items are original designs and are proudly designed, cut, assembled and shipped from Colorado.",
    "reviews": [
      "Just like the picture. It was such a cute gift.",
      "So adorable, they were customized perfectly and my husband will love them!",
      "Arrived quickly and was exactly like the description. I gifted this to my husband for our 5 year anniversary and he loved it!",
      "So cute and perfect for date day! Thank you!"
    ]
  },
  {
    "productId": "mLPoBrmpZM",
    "url": "https://www.etsy.com/listing/1352225755/custom-wood-marble-coasters-custom?click_key=7faf41db6a63ce666aba2dcaa5b31e717aef586d%3A1352225755&click_sum=bcf8d769&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-15&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Wood & Marble Coasters | Custom Engraved Marble Coasters | Custom Gift | Personalized Coaster | Customized Wedding Gift | Coasters",
    "description": "These custom wooden coasters are the perfect wedding favor for your guests! Looking for a wedding gift? Nothing better than a personalized coasters with your name on them. Maybe a house warming present? This is the perfect way to add a special touch for friends and family.We engrave and cut all of our products in our small shop in Houston, carefully creating items perfect for any occasion. Each piece is created with love ♥️*please note that these coasters do not come with a holder*♥️♥️♥️Need it faster than our processing time? Add this listing to any order for us to rush your order:https://www.etsy.com/listing/827056613/rush-my-order-fee♥️♥️♥️Thank you for supporting our small business! Please let us know if you are have any issues with your order and we will do everything in our power to make it right.© 2020 Birch & MortarFollow us on Instagram @birchandmortar for new products and sales announcements!",
    "reviews": [
      "It was a wedding gift for my best friend.  It arrived quickly and they were both pleased with the quality and the gift!",
      "Loved the coasters for my parents for Christmas. Thank you!!",
      "Very nice product. Excited to give for a wedding gift",
      "Beautiful coasters and the wrapping was perfect!"
    ]
  },
  {
    "productId": "RSnitlLcdd",
    "url": "https://www.etsy.com/listing/1416623939/personalised-minimalist-name-necklace?click_key=abbcef95da06f2e36c2e36e4ba1811f526fbab6f%3A1416623939&click_sum=f4eabeb0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-16&pro=1&frs=1&etp=1",
    "title": "Personalised Minimalist Name Necklace with Box Chain, Custom Name Necklace, Gold Name Necklace, Personalised Gifts, Christmas Gifts for Her",
    "description": "Premium Quality Box Chain Custom Name Necklace• Material: Brass• Finish: Sterling Silver ∙ 18K Gold∙ Rose Gold• Handmade jewellery with excellent craftsmanship• How to: Simply put your CUSTOM NAME / TEXT into the PERSONALISATION BOX, and check out with the preferred size & finish.O T H E R ∙ I N F O R M A T I O N🎁 Packaging: Nicely packaged with aesthetic boxes. They are ready to go as a gift.✍️ Design: Free mock-up at request.• All images are copyrighted by DanielsArtsyDesign. All rights reserved •",
    "reviews": [
      "Love! Exactly what I ordered and expected",
      "This is my second time purchasing from this shop and specifically a name necklace and I couldn't be happier.  Can't wait to gift my mom this name necklace!",
      "I really loved my necklace."
    ]
  },
  {
    "productId": "OBVRvFlTke",
    "url": "https://www.etsy.com/listing/1056698572/personalized-serving-tray-charcuterie?click_key=a0914a06ce931c5822b132f5970c6b63b019af2d%3A1056698572&click_sum=1d8df083&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-9&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Serving Tray - Charcuterie Board Set - Custom Engraved Cheese Board - Cutting Board for Wedding, Valentines Day & Engagement",
    "description": "➤ Personalized Serving Tray - Charcuterie Board Set - Custom Engraved Cheese Board - Cutting Board for Wedding, Valentines Day & EngagementValentines Day, Birthday Gift, Bridal Shower Gift, Best Friend Gift, Realtor Closing Gift, Unique Wedding Gift, Thank You Gift, Bride Gift, Mother of the Bride, Housewarming Gift, Custom Cutting Board, Serving Board, Cheese Board, Charcuterie Board, Corporate Gift, Wedding gifts for the couple🎀You’ll be so excited to unwrap this high quality, thoughtfully designed bamboo cheese board. This comes with an adorable slide out drawer with initialed specialty knives, slates, markers and a wine opener.  Packed lovingly, as a luxury item deserves, you’ll also get a white cloth bag to keep the wooden cheese tray in.🎁The personalization makes it so much more special than any plain board. You’ll be eager to give this high-quality gift, because it comes out gorgeous.🤔How does this charcuterie board outperform the others?💡It’s large. Measuring 13.5 x 13.5, there's a lot of room for food, charcuterie, cheese, fruits, nuts or cake.💡 No design skills needed for set-up. The groove at the edge holds smaller items like crackers or nuts, while the flat center is for larger food.💡 Built with a slide-out drawer with 4 useful, specialty knives, slate boards, markers and a wine opener.💡 Your choice of personalization on the board only, on the board + the knives, or without personalization.💡 Sturdy, thick and overall high quality.💡 Gift wrap and note available at checkout.Knowing how much hopes you have pinned on the wooden serving board, we’re around to help. Please send us your questions or requests—our customer service earns five stars. And when you need this to arrive in time for the holiday, wedding, closing or birthday, take advantage of Our FreeSame day shipping so you will get your Gifts on time!✅Material:Bamboo (the eco-friendly, sturdy, and chemical-free choice)✅Dimensions:13.5x13.5x26.5 LB👁️‍🗨️When providing personalization information, please make sure spelling is correct. We will engrave based on what you provide.",
    "reviews": [
      "made a great wedding gift. Couple loved it.",
      "I bought this as a gift and it was perfect. They did a great job.",
      "Great wedding gift. Personalised and fun",
      "Perfect gift for my sister!"
    ]
  },
  {
    "productId": "DBmjUDKXRG",
    "url": "https://www.etsy.com/listing/1112144887/christmas-gift-whiskey-decanter?click_key=f5ec27c415abe222207ff33ce96e122133ef2092%3A1112144887&click_sum=6792ed80&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-10&pro=1&sts=1",
    "title": "Christmas Gift Whiskey Decanter Personalized, Gift for Men Custom Whiskey Decanter, Engraved Decanter Whiskey Decanter, Scotch Decanter Gift",
    "description": "Christmas Gift Whiskey Decanter Gift Set, Custom Personalized Decanter. Our Scotch Whiskey Decanter set is Personalized with our stylish Designs .Whiskey Lovers will adore this unique Personalized Engraved Whiskey Decanter Glass gift. Each 23.75 ounce Decanter features a stylish engraved design. The perfect Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift. Made and engraved in The USA. Option to Add 2 pcs 10 oz Rocks Cocktail Glasses, Each holds 10 oz of your favorite Spirits.ITEM DETAILS:- GLASS ENGRAVED IN USA- Whiskey Decanter Holds 23.75 oz liquid, Option to add 2 pcs 10 oz Whiskey Glasses.- Permanently Etched , Laser Engraved- Makes a Great Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift- Great addition the Barware or even housewarming wine glass gift.To Personalize items please do the following:1. SIMPLY ADD PERSONALIZATION INFO in the personalization box.You can find many More Unique Housewarming and Gifts for the Couples on our store by Clicking the link below:https://www.etsy.com/shop/PersonalityGiftShop?ref=simple-shop-header-name&listing_id=717905139&section_id=25132821*** Shipping ****   FREE SHIPPING APPLIES TO ORDERS VALUE OVER $35.00 NOT INCLUDING SHIPPING COSTS*****This item ships via USPS. We will send you the tracking number once your order has shipped.We ship to the Continental US . Please contact us for shipping quotes to Hawaii and Alaska.",
    "reviews": [
      "I gave this item 4 stars because the etching is on the light side. It is a nice collection though. A perfect Christmas gift.",
      ":)",
      "BEAUTIFUL!! QUICK SHIPPING - OVER ALL GREAT!!",
      "BEAUTIFUL!! QUICK SHIPPING - OVER ALL GREAT!!"
    ]
  },
  {
    "productId": "dyTP4gkgTw",
    "url": "https://www.etsy.com/listing/1618689539/personalized-cutting-board-for-grandma?click_key=86cd452e227f262d0d8ea30c242ae48086ba50bb%3A1618689539&click_sum=4104b405&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-11&pro=1&bes=1&sts=1",
    "title": "Personalized Cutting Board for Grandma Gift Personalized Gift for Grandmother Christmas Gift Charcuterie Board for Grandma, Nana, Mimi, Gigi",
    "description": "Beautiful \"Nana's Kitchen - Meals and Memories Made Here\" Laser Engraved Walnut or Red Oak Cutting Boards!These make the perfect gifts for your Nana!Details:Paddle Board:17\" Long8\" Width4.5\" Handle Length3/4\" ThickJuice Groove Rectangle Board:8\"X12\"11\"X17\"Wood Options:WalnutRed Oak",
    "reviews": [
      "Beautiful item! My mom loves it.",
      "Really nice cutting board! Got it for my mom for Christmas (even though it didn’t make it in time) and she loved it! Great quality!",
      "Love this item. It was a great gift for my mom for Christmas. The only issue I had was that it it originally didn't have the correct spelling. I reached out to customer service and they got me the correct one quickly. Will be buying more stuff from this shop in the future."
    ]
  },
  {
    "productId": "AjLftxJUcD",
    "url": "https://www.etsy.com/listing/1661356121/grandma-gift-personalized-flower-pot?click_key=f7ba5655cf04d989721e3cf617ec554ff0006d63%3A1661356121&click_sum=d78b7017&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-12&pro=1",
    "title": "Grandma Gift, Personalized Flower Pot, Personalized Gifts for Mom, Grandmas Garden, Outdoor Flower Pot, Birth Flower Mom Gifts from Daughter",
    "description": "Introducing our exquisite Birth Month Flower Personalized Outdoor Flower Pot, a splendid gift ideal for grandmothers or mothers on occasions like Mother's Day. The personalized birth month flower design serves as a representation of a floral bouquet, symbolizing the presence of all her cherished ones.Personalization Details:Enter 2-6 Names: Include Birth Months for each name (each name can be up to 12 characters).Optional dates can be added for each name.Line 1 in Bold: Up to 18 characters (e.g., Mom's Garden).Line 2 in Script: Up to 24 characters (e.g., love grows here).Note: None of the text on the pot is automatically included; it is all part of the personalization.Features:Plants not included.Recommended for outdoor use due to the drainage hole at the base.Crafted with precision from fine-quality, heavy-weight, chip-resistant stoneware.Dimensions: 7.25” H x 6.5” in diameter.Imported.Surprise your loved ones with this meticulously crafted outdoor flower pot, a unique and meaningful addition to any garden!",
    "reviews": [
      "Beautiful and fast shipping! Very pleased",
      "This item just arrived.  So well packaged and arrived earlier than I expected.   My friend (who has everything) will just love this planter as a gift.  Thank  you so much!",
      "Loved how these came out and would definitely recommend! I also needed 7 flowers on one pot and the shop was able to accommodate:)"
    ]
  },
  {
    "productId": "bJAahgSVyC",
    "url": "https://www.etsy.com/listing/238175938/large-classic-kaleidoscope-traditional?click_key=c612b3517a98edfe59ce252660031a789f1133cf%3A238175938&click_sum=ac39898b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-17&frs=1&etp=1&sts=1",
    "title": "Large Classic Kaleidoscope, Traditional Kaleidoscope, Dark Brass Kaleidoscope, Personalized gift - COL",
    "description": "Classic Kaleidoscope, Brass Kaleidoscope. The traditional Kaleidoscope is made with techniques originating from the invention of the kaleidoscope in 1817. At one end of the apparatus consisting of two mirrors, is a closed section containing glass shards, beads and other reflective objects. These all move and drop within the void when the barrel is turned, and at every given moment a new magnificent image is created.✦✦✦ Important Facts about this great kaleidoscope model:✦ This model is dark and should be under a light / lamp to see the reflections in the best way (because light enters from the SIDE).✦ In the last image of the model, you can see what is the optimal way to look and see the inner visuals clearly.✦ All the objects in this model, painted with fluorescent pigments. So if you look under ultraviolet light, the visuals will glow, you will be able to see the inner visuals, in fascinating rich colors! *(Ultraviolet light can be purchased online for a few dollars.)﻿Amazing and a very special gift for anyone:)Can be ordered with custom engraving!﻿✦✦✦ Details✦✦✦﻿✦ Size: 19 cm long, 4 cm dim✦ 2 mirror system✦ Colors:Dark brass // Gold brass✦ Made from polished brass, high grade optical mirrors, natural stones and colored crystal glass beads.✦ All Kaleidoscopes comes with a stand. There are two types of stands:Brass stand (First photo)Wooden stand (2nd photo)✦✦✦ Hand Engraving✦✦✦✦ All models can be custom ordered with hand-engraved ~ names, quotes and short (sample at the last photo)✦ If you choose a kaleidoscope with hand engrave,Simply mark \"Engraved\" at the Engraving section, and write your engraving request at \"Add your personalization\" section.Please make sure your sentence for engraving, not to exceed 12 words (Otherwise it gets too crowded for engraving). Thank you!✦Please contact me if you are interesting in Laser made engraving ~ Suitable for large quantity orders only:)>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>✦ See here all my classic kaleidoscopes models:https://www.etsy.com/shop/royskaleidoscopes?ref=seller-platform-mcnav§ion_id=13707464✦ Please take a moment to read my shop policies before you make an order:www.etsy.com/shop/royskaleidoscopes#policies✦ ✦ ✦ Thank you for visiting my shop!✦ ✦ ✦",
    "reviews": [
      "It’s a great masterpiece. Magical.",
      "A wonderful kaleidoscope full of endless visual wonders! \nA serious collector's item.\nMazel tov!",
      "I am delighted with this kaleidoscope and it's quality.\nVery well-made and wonderful to use",
      "Same as review for it's twin that I bought. Great item! Sturdy, inspires, and/or relaxes."
    ]
  },
  {
    "productId": "fhZbZZjzxp",
    "url": "https://www.etsy.com/listing/1479930911/custom-photo-shirt-for-dad-fathers-day?click_key=d380e42b024e574f5b38713b18650a71df5277ac%3A1479930911&click_sum=ffda3572&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-18&pro=1&etp=1&sts=1",
    "title": "Custom Photo Shirt for Dad, Father's Day Tshirt, Personalized Dad Portrait Shirt, Fathers Day Gifts, Dad Birthday Gifts, Gift for Husband",
    "description": "📢 📢 📢 HOLIDAY CUT-OFF SCHEDULE ANNOUNCEMENTAll orders made after the cut-off day CAN NOT BE guaranteed delivered by Christmas✔️ ORNAMENT: Dec 5th✔️ SHIRT: Dec 4thWe can process the order in framed time but the shipping time may not be. Please consider this information before purchasing!🌸This graphic t-shirt is just one of many designs we offer in our store. From holiday themes like Christmas and Halloween to everyday designs that celebrate life's little moments, we have something for everyone. And with our customizable options, you can create a truly unique and personalized gift that will be treasured for years.So why wait? Browse our collection of graphic t-shirts today and find the perfect gift for your loved ones. With our fast shipping and excellent customer service, you can shop with confidence and know that you're getting the best possible product.***PLEASE KINDLY TEXT US BEFORE WRITING A REVIEW IF THERE IS ANY PROBLEM WITH THE PRODUCT SO WE CAN MAKE THINGS RIGHT FOR YOUNO FACE DETAILS INCLUDEDThis is a PRINTED shirt, not an EMBROIDERED shirt⭐️Adult T-shirtMade by Gildan• For women, this shirt is a Men's size tee, you should buy one size smaller than your usual size.⭐️SweatshirtMade by Gildan8 oz; 50% cotton/50% polyesterAir jet yarn for a softer feel and no pilling1×1 athletic rib cuffs and waistband with spandex; Double-needle stitching⭐️Long SleevesMade by Gildan6.1-ounce, 100% cottonDouble-needle neck, sleeves and hem⭐️DELIVERY TIMEProcessing time: 2-4 working daysShipping time: 5-9 working days📌PLEASE NOTE:• Due to the lighting effect and computer color, the actual color may be slightly different from the picture, please understand.• Please allow 0.3-0.5\" / 1-2 cm differences due to manual measurement.📩 Feel free to contact us if you have any queries! :)",
    "reviews": [
      "Absolutely gorgeous. Love this gift I got for my dad.",
      "Amazing. Fast shipping. Too cute",
      "Great gift idea for a dad"
    ]
  },
  {
    "productId": "tCWUvqdbTj",
    "url": "https://www.etsy.com/listing/1373660842/personalized-engagement-gift-newly?click_key=18e1f2ac900534461ff8c868511f71003ff060ad%3A1373660842&click_sum=adc9a8b3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-19&etp=1",
    "title": "Personalized Engagement Gift, Newly Engaged Gifts for Couple, Engagement Picture Frame, Engagement Photo Gift, Minimalist Engagement Gift",
    "description": "Our personalized engraved picture frames make the perfect gift for the newly engaged couple to celebrate their special day!We thrive on simplicity and a minimalist vibe, the details are in the memory.♥♥♥♥DETAILS♥♥♥♥We pride ourselves in the details. Each piece is handmade by us, for you.♥ 8x6\" birch wood board♥ Engraved with the quote of your choice♥ Personalized with your details♥ 2 strong gold magnets to hold photo♥ Holds a 3x4\" photo (we suggest cutting a 4x6\" photo down)♥ Comes with a peg for easy displaying♥♥♥♥SHIPPING♥♥♥♥We ship all items next day to help you give a timely meaningful gift, when it means the most to your friend and loved ones.♥♥♥♥Thank you for supporting our small business! It literally means everything to us♥♥♥♥",
    "reviews": [
      "Extremely fast shipping, was happy with the product",
      "Purchased as a gift! Very cute!",
      "Satisfactory shipping time.  I didn't see it, as it was a gift sent directly to recipient.  Recipient sent me photo and they loved it!"
    ]
  },
  {
    "productId": "xIEZMDJvGy",
    "url": "https://www.etsy.com/listing/1418565387/personalised-custom-wine-glass-glasses?click_key=4bfbc64c973fa85bcf18021c40de2690011e85e2%3A1418565387&click_sum=7549886a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-20&pro=1&frs=1&etp=1",
    "title": "Personalised Custom Wine Glass - Glasses for Wedding Bridesmaids Birthday Gift Present Customisable Custom Bridal",
    "description": "The perfect gift for every occasion. Birthdays, Weddings, Bridal Parties, New Homes etc! Celebrate every milestone with these personalised glasses.Bulk Corporate and Wedding Orders also available at cheaper prices! Please DM for quote!Each glass is carefully wrapped in bubble wrap and tissue paper and packaged in a cardboard box with a branded sticker.♥ GLASS DESIGN* You can edit the font and colour of the text* Up to 12 characters per glass* Different personalisation on each glass* All text is centered on the glass unless otherwise specified!* Design is applied with a white permanent vinyl and can't be removed once applied.♥ ABOUT THE GLASSES* Wine Glass 420ml 25cm* High quality glassware* Shipped in secured eco friendly packaging* No invoices included so you can ship straight to your loved ones* FYI no alcohol is included, empty glasses only (sorry)Our vinyl will stay on for a very long time, however we recommend upgrading to our ‘Eternally Etched’ glasses for personalisation that will last a life time. Our glassware is high quality, however it is not recommended to put the glasses in the dishwasher as the adhesive will not last - It is recommended that all glasses are hand washed in warm water.♥ HOW TO PLACE YOUR ORDER1. From the Drop Down Menus, Select your “Quantity” and “Font”2. PERSONALISE your glasses by entering the following details in the \"PERSONALISATION\" box:3. Click \"Add to Cart\"*If you would like to see a proof before printing, please mention PROOF REQUEST (in all caps) in your order details (add this when in your cart). If no colour is listed white will be used.♥ PRODUCTION + SHIPPING* Please allow 1-2 working days for order to be created and dispatched.* Delays may occur around peak periods eg. Mothers Day, Christmas etc* DELIVERY TIME: Please check your Etsy cart at checkout for an estimated delivery time.The perfect last minute gift for anniversary gifts, birthday gifts, bridesmaids, bridal party gifts, gift for new home owners, parents etc!!",
    "reviews": [
      "Fantastic product. bought it as a gift and they're really pleased.",
      "Beautiful customised gifts!\nOne glass arrived broken, we sent them an email with photos and she was very helpful and sent a new glass to us and it made it on time before Christmas Day.",
      "Besides it taking almost 3 weeks to get here everything is great! If you need something for a specific date order it a month before if you’re in the US. I will be ordering again !",
      "Such cute glasses, shipping was fast and the packaging was cute and made sure the glasses didn’t break."
    ]
  },
  {
    "productId": "HrjnAUmDDu",
    "url": "https://www.etsy.com/listing/1573645785/personalized-baby-shower-gift-basket?click_key=0a427dd6a4b791b2a261a76929eb63c67aa5558e%3A1573645785&click_sum=20739de1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-21&etp=1",
    "title": "Personalized baby shower gift basket custom rope basket custom name gift knit name gift personalized diaper storage newborn baby shower girl",
    "description": "Create a one-of-a-kind present with our personalized baby shower gift basket, featuring a custom rope basket and a knit name gift for that extra touch of warmth and charm. This thoughtful gift is perfect for newborn baby showers, especially for baby girls, and can be used as a personalized diaper storage solution. New parents will be surprised and thrilled with your unique, custom name gift!🧸 These would make a great gift as a personalized baby shower gift, gift basket for newborn, custom diaper basket, custom name gift, 1st birthday gift, personalized diaper caddy, new mom gift and more.✨ XL custom baskets!https://etsy.me/406wNHe✨ Big sister and brother baskets:https://etsy.me/44HTbaX✨Custom basket sets!:https://etsy.me/3DeGAkd✨ Design details & Sizes:✧ Yarn i-cord, handmade✧ Sturdy cotton rope baskets with fringe & handles📏 Small: 7.1\"x7.1\"x5.5\"📏 Large: 9.5\"x9.5\"x7.0✨ You can add a name, design, or both!✨ Ordering more than one? You may choose a different yarn color for each basket! Also, see this listing for basket sets of 3 (S,M,L!):https://etsy.me/3DeGAkd✨ How to order:✧ Select your basket color and size from the drop downs✧ In the personalization box add desired lettering color, and name or word you would like on the basket.*(If you need to color match message us pictures)✧ ADD TO CART✍️Personalization example:1. Enter, name, word or design2. Enter yarn color per listing (A-Y)Example -1. Xander2. A✨Important note:✧ Baskets do not come pre-filled✧ Baskets may be shipped folded and need to be reshaped, reshaping instructions are included.🤩Have a unique idea for your kids room? Please reach out so we can coordinate to make your ideas come to life!🤩📍Shipping📍All of our items are packaged with care. You will be provided with a tracking number once your items have shipped, please check our shop announcement for current processing times. Ground shipping the default shipping method and you may upgrade at checkout if a faster shipping time is desired. Once a package is is handed to the shipping carrier Llama Loon LLC is not responsible for any delays in shipping.✨More items in our shop!:🌿 New big sister rope basket:https://etsy.me/44qpWJJ🌿 Custom storage basket sets:https://etsy.me/3DeGAkd🌿 XL custom baskets (perfect for blankets or yoga mats!):https://etsy.me/3XwtSqf🌿 Beaded macrame plant holder: https://tinyurl.com/36zfuscr🌿 Pressed MN wildflower charms:https://etsy.me/3NQWmXi🌿 Custom knit wire name sign:https://etsy.me/3NCe7t6🌿 Personalized mama sweatshirt:https://etsy.me/3JB3tSn🌿 Custom pom pom rainbow wall decor:https://etsy.me/44DU0lo🦙 Back to our shop 🦙http://www.llamaloon.etsy.com✨ About us:✧ All items are designed and produced with love in our workshop, located in Saint Paul, MN 🌲🦌✧ Check out our shop announcement for current processing times✧ Please send us a Message if you have any questions about ordering!✧ We stand behind the quality of our products 👍📸 Check out our Instagram for exclusive discount codes, customer and new product sneak peeks, customer photos and behind the scenes!:🦙 Instagram:@LlamaLoonhttps://www.instagram.com/llamaloon/📝Copyright © 2023 by LlamaLoon. All rights reserved. This design or any portion thereof may not be reproduced or used in any manner whatsoever without the express written permission of Llama Loon LLC. Duplication of intellectual property is illegal and all infringements are subject to fines and penalties. Failure to comply will result in legal action.",
    "reviews": [
      "This is a beautiful high-quality basket. However, it is way way way way way smaller than I thought it was going to be. I bought a medium one. I thought it would be laps size. Like the size of the Easter basket. Because that’s what I’m using it for, but it is probably around as my hand and I have small hands. And as tall as my hand is. Wish I would’ve got the large, but even that I think would be too small.",
      "Hello Katrina thank you so much for your review, we are happy that you love the look and quality of your basket ❤️! As far as size I am sorry that you think it is smaller than you would have liked, we care very much about transparency and have our basket sizes listed in both the description and in our listing photos. We will think about what you said and look for additional ways to convey the sizing in the future! We have had many customers who are happy with all 3 sizes for Valentines, Easter, Christmas and for their baby shower gifts. Enjoy your day and thanks again ❤️!",
      "Beautiful addition to our nursery decor.",
      "Thank you Danielle so happy to hear you love basket!!",
      "This basket is beautifully hand made!",
      "Thank you so SO much!!! ❤️🥰😍"
    ]
  },
  {
    "productId": "eWhrwunivW",
    "url": "https://www.etsy.com/listing/1471286900/personalized-gift-for-him-wood-beard?click_key=a6685088cd9bb48f1cf7854a171dc5a217b329e0%3A1471286900&click_sum=18dd6dec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-22&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Gift for Him Wood Beard Comb | Groomsmen Gifts Custom Comb | Valentines Day Holiday Birthday Gift for Husband Boyfriend",
    "description": "Our wooden beard comb, made from real woods including amoora, nyatoh, and verawood, is ideal for Father's Day, Valentine's Day, birthdays, anniversaries, and groomsmen gifts. It's not only light weight but also small enough to carry in your pocket, making it a portable grooming tool. The natural wood material eliminates electrostatic charge, promoting healthier hair and scalp.We personalize it with laser engraving, ensuring a lasting and meaningful gift that will be cherished forever. Give the gift of style and functionality with our wooden beard comb. If you prefer an icon-only customization, simply select the “icon” option from our menu. If you'd like to have text along with the icon, select the desired font size and leave us a message specifying the icon and text you want. We'll ensure that your personalized wooden beard comb is crafted to perfection, reflecting your unique style and preferences.Length when folded up: 4\"Length when open: 7.9\"Material: Amoora, Nyatoh, or Verawood---------------------------------------------------------------------Pocket Comb for Beards, Pocket Beard Comb, Beard Comb, Custom Wood Beard Comb, Engraved beard comb, Custom wooden comb, Wood Beard Comb, Laser Engraved Sandalwood, Bearded Dad, Bearded Husband , Bearded Grandpa, Personalized Gifts for Him, Gifts for Him, Men’s Gift, Birthday Gifts for Him, Mustache Gift, Father’s Day Gift, Gift for Dad, Gifts for Dad, Gift for Grandpa, Gifts for Grandpa, Valentine’s day gift, Groomsman gift, Anniversary gift, Gift for husband, Face furniture, Mo Bro, Mo Sista, Cookie duster, Lip rug, Movember movement, Beard enthusiasts, Beard vendors, WhiskerMania, Great American Beard,  Moustache Championship, Beardie, Beardo, Beardlover, Beardie Bear, Beard Bear, Whisker Wizard, Fuzzy Face, Fuzzy, Bearded Babe, Bearded Beauty, Facial Hair Fiend, Mr. Beard, Mustache comb, Facial hair comb, Beard grooming comb, Beard styling comb, Beard brush, Whisker comb, Facial mane comb, Beard detangler comb, Beard care comb, Facial hair maintenance tool",
    "reviews": [
      "Absolutely amazing! The engraving is crisp and beautiful. Would buy again!",
      "He loved it!  I got it a little late for Valentine's Day but I was a bit late ordering as well -",
      "I ordered two of these - one for each of my sons.  They love them!  My oldest leaves his comb in his vehicle in case he needs to fix his beard before seeing a client.  Loved the personalization too.",
      "Perfect!  The silhouette looked exactly like my neighbor (who the gift was for).  Very good quality also."
    ]
  },
  {
    "productId": "yHFzZySiPY",
    "url": "https://www.etsy.com/listing/1086207125/personalised-couple-print-couples-gift?click_key=3f95b1444243b4df487a8b20520bac676d31d65e%3A1086207125&click_sum=b728de63&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-23&frs=1&etp=1",
    "title": "Personalised Couple Print, Couples Gift, Gift for Her, Boyfriend Girlfriend Print, Anniversary Gift, Valentines Day Gift, Christmas Gift",
    "description": "♡ PERSONALISED COUPLES PRINT ♡Capture the love and memories of your special relationship with a personalized couple print!Whether you're newlyweds or have been together for years, our custom prints make the perfect keepsake for your home or gift for your loved ones. Choose from a variety of designs and add your names, special dates, or a heartfelt message to make it truly unique. Each print is carefully crafted and printed on high-quality paper, ensuring it will be a cherished piece for years to come. Order now and celebrate your love story in style.✔ SHIPPING• Frames / canvas are shipped in secure cardboard boxes• Small prints (A4 and below) are shipped in board backed envelopes• Large prints (A3 and above) are shipped in secure postal tubes• Digital files will be sent via Etsy chat*For Canvas and very large prints (A1, 20x30 inches, 30x40 inches), delivery could take 1-3 extra working days✔ PRINT DETAILS• We print everything on professional Canon printers using original ink only• Paper type: 230gsm, Satin (premium quality)✔ PRINTS SIZES• A5 - 5.8 x 8.3 inches, 14.8 x 21.0 cm• A4 - 8.27 x 11.69 inches, 21.0 x 29.7cm• A3 - 11.69 x 16.53 inches, 29.7 x 42.0cm• A2 - 16.53 x 23.39 inches, 42.0 x 59.4cm• A1 - 23.39 x 33.11 inches, 59.4 x 84.1cm• 5 x 7 inches• 8 x 8 inches• 8 x 10 inches• 10 x 10 inches• 12 x 12 inches• 12 x 16 inches• 11 x 14 inches• 16 x 20 inches• 20 x 20 inches• 20 x 30 inches• 30 x 40 inches✔ FRAMES SIZES• A4 - 9.1 x 12.8 inches, 23.0 x 32.5cm• A3 - 12.8 x 17.7 inches, 32.5 x 45.0cm• Width of frame : 1.8cm• Depth of frame : 1.5cm✔ CANVAS SIZES• 8 x 8 inches• 8 x 10 inches• 8 x 12 inches• 10 x 10 inches• 12 x 12 inches• 12 x 16 inches• 12 x 18 inches• 16 x 20 inches• 16 x 24 inches• 20 x 20 inches• 12 x 36 inches• 20 x 24 inches• 24 x 24 inches• 20 x 30 inches• 24 x 30 inches• 24 x 32 inches• 24 x 36 inches✔ CANVAS DETAILS• Canvas material has a matte finish• All canvas orders come with hanging kit*Please contact us if you require a size that is not listed★ ABOUT US ★Our mission is simple: To help you decorate your home with unique prints that are both of good taste and great quality!Thank you for visiting our shop :)---Personalised Couple Print, Couples Gift, Gift for Her, Boyfriend Girlfriend Print, Customised Couple, Anniversary Gift, Valentine, Christmas",
    "reviews": [
      "Beautiful picture and great quality work. Fast shipper!",
      "Great quality 👌🏼 quick delivery",
      "Turned our perfect..husband loved it also",
      "Came in pretty fast, I love the customization, turned out very well"
    ]
  },
  {
    "productId": "XXgNFLfdcO",
    "url": "https://www.etsy.com/listing/837356891/bangle-bracelet-to-personalize-mom?click_key=75889e6a6b7b939a8997cedf428c5ccbd6f33708%3A837356891&click_sum=b009ca6c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-24&etp=1&sts=1",
    "title": "Bangle bracelet to personalize, Mom Bracelet, Godmother, bridesmaid jewelry, EVJF jewelry, birth gift, engraved birthday gift",
    "description": "Customizable bangle bracelet:Refined and elegant, the customizable bangle bracelet is an essential to add to your jewelry collection. Make it unique by engraving the word you want!🔎JEWELRY INFORMATION:- Jewel in stainless steel- Available in three colors: gold, rose gold and silver.- 160mm in length and 4mm in height. Engraving possible on the front and/or back(Minimum 15.5mm wrist)- Jewel delivered in its pretty box🌷PERSONALIZATION:1. Choose the color options of your jewel in the first drop-down menu.2. Choose the number of face(s) to engrave in the second drop-down menu.3. Write in the space named “Add your personalization:- the word(s) to be engraved as well as the pictogram(s) (in brackets)- the font number (N°4 by default)Example :Front: I love you [02]Back: For lifeFont #5.Text engraved only in the center of the bracelet.4. Add the jewelry to your basket and that's it!🚚DELIVERY:All of our jewelry is made to order and shipped as quickly as possible.Delivery by tracked mail in a bubble envelope.⭐CARE OF MY JEWELIn order to preserve the life of your jewelry, here are some tips:- Remove your jewelry before going to sleep to limit breakage.- Avoid keeping your jewelry in the pool or when diving in the waves. We also advise you to remove them when doing the daily dishes or household chores. For our fabric wristbands, we recommend no contact with water.- Avoid putting your jewelery in contact with hydroalcoholic gel, perfumes and other cosmetics which can be aggressive.- Try to store all your jewelry separately to prevent them from rubbing against each other and getting damaged. Keep all the strings separate to prevent them from getting tangled.Bangle bracelet | Customizable bracelet | Men's gift | Women's gift | Mom Bracelet | Personalized Bracelet | Personalized Jewelry | Mom Bracelet | Personalized Gift | Birth Gift | EVJF bracelet | Nanny Bracelet | Best friend bracelet | Name bracelet | Metal Silver • Gold • Rose Gold",
    "reviews": [
      "Great order! Product conforms to order",
      "Perfect I recommend, the article complies",
      "Very beautiful bracelet given to a grandmother, delighted!"
    ]
  },
  {
    "productId": "jckgZLuvyu",
    "url": "https://www.etsy.com/listing/1007552508/personalized-mens-bracelet-mens-leather?click_key=c1ef3274b0ba057353310e5d01cc1db5e8824eeb%3A1007552508&click_sum=b205f673&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-13&frs=1&sts=1",
    "title": "Personalized mens bracelet • Mens leather bracelet with kids names • Personalized gifts for dad • Gifts for men • Mens jewelry • dad gifts.",
    "description": "Surprise your loved one with a simple yet very meaningful gift. Each Bead can be personalized with your own unique message. Popular personalization include family names and special dates. The engraved Beads of our Men Braided Leather Beads Engraved Bracelet create a beautiful symbol of never-ending love. Whether you're a romantic at heart and want yours and your sweetheart, father, fiancée or husbands name stamped on this Men Braided Leather Beads Engraved Bracelet, or prefer having your son or daughter's name stamped across this wonderful piece, we are happy to provide you with a beautiful bracelet you can treasure forever.❥ Bracelet's specs:• Material: Genuine Nappa Leather• 925 Sterling Silver Charms• Length: Small wrist 6.5\" (Perfect for women's) - Standard Wrist (7.5\"\" - Large Wrist (8.5\") - Extra large (9.5\")• Charm Width: 10mmFor personalized engravings, please limit text (letters and numbers only) to a total of 9 characters or less. Entries must not exceed 9 characters.❥  Free Shipping:• United states:  3-5 business days.• Canada: 5-8 business days.• United Kingdom: 5-8 business days.• Australia: 7-10 business days.Be advised to check the estimated delivery time before placing your order, as we are unable to cancel your order once it has been processed. These are finale sale.If you have any questions, please feel free to contact me.Myriam♥",
    "reviews": [
      "Great quality. Comfortable. My husband loves it",
      "Looks really nice and fits well",
      "This is the second time I am buying the bracelet. I gifted this to my husband a year ago and he doesn’t take it off, I am buying a second one because the first one is starting to smell haha."
    ]
  },
  {
    "productId": "dQmcIljxyw",
    "url": "https://www.etsy.com/listing/1258337056/personalized-gift-for-him-custom-photo?click_key=5413696f8acd927fc86adae05a4fc6796656de4c%3A1258337056&click_sum=aedfa8cf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-14&pro=1&frs=1&bes=1",
    "title": "personalized gift for him, custom photo wallet, valentines day gift for men, anniversary gift for husband, pet memorial gift, boyfriend gift",
    "description": "Personalized Leather Wallet, Slim Wallet, Father's Day Gift, Minimalist Leather Photo Wallet, Leather Wallet, Custom Card Holder, Gift for Him, Gift for Husband, Christmas Gift, Personalized Wallet, Groomsmen GiftPRODUCT FEATURES- This wallet is made of 100% Genuine Leather.- High-quality materials were used for this case with Original Full-Grain Cow-Hide Genuine Leather.- It has 1 main money slot and 1 ID slot. Moreover, it has 12 card slots and three of them can hold multiple cards.- It is very easy to carry in your front or back pocket.- Every single one of our beautiful wallets is handcrafted to perfection and subject to rigorous quality control standards. The quality, function, and style in our wallet are unavailable from competing products.- It softens naturally with use and ages beautifully with time. It is a high-quality product that can totally be used for a long time.>>If you are thinking of the perfect gift, this has a nice personal touch of custom engraved monogram, name or initials, or your custom logos such as company, team, or military! It will surely make a great gift for your loved ones or even for yourself!COLOR-Dark Brown-Brown-Antic Black-Antic Gray-Navy BlueHOW TO ORDERSTEP 1: Chose the way you view your finished wallet: Your options are: This will help us place the engraving in the correct place for that style.STEP 2: Chose what you want to be engraved. For this step, you have 3 options.The First option is Monogram/Logo: Select the monogram style you want, then write your letter.The Second option is Phrase: If you want to engrave a Phrase please select one of the four font styles, then write your message.The Third is Handwriting: Send a photo of handwriting via Etsy Message or Mailing at  PrincetonLeather [!at] gmail.comNote: Handwriting should be written on plain white paper. Please remember that higher photo quality will give a better result.STEP 3: Place your order.* Example-1: Design-1: ROBERT* Example-2: Font 2, \"I love you to the moon and back\"* Please type ''No Personalization'' if you select No Personalization>>We are only able to engrave exactly what the customer puts. We're not responsible for any typo provided by the customer. Please make sure everything is correct before you submit the order. We'll do our best to answer any change request, but no guarantee for any changes. It is good for Army, Navy, or Team Logo.>> Same-day free shipping by USPS when you order up to 2 PM (ET)>> %100 Money-back guarantee in 30 days!>>Our wallet makes a perfect gift for him or her on his or her Birthday, Anniversary, Graduation, Wedding, Thanksgiving, Christmas, Father’s Day, or Mother’s Day! Also, it is great for a Boyfriend gift, Husband gift, and Groomsmen gift, even just a treat for yourself!Click \"Add to Cart\" right now and order yours today!https://www.etsy.com/shop/PrincetonLeather",
    "reviews": [
      "It’s perfect! Thank you so much. My husband loves it.",
      "So beautiful and my husband loved it",
      "The seller was extremely sweet and made my order exactly how I wanted it! They shipped it so quick, I just got it and it’s beautiful! Would highly recommend them!",
      "Excellent customer service, nd the product itself was very nice quality though some details were a little lost but nothing to serious overall very happy with the product and the seller"
    ]
  },
  {
    "productId": "NCOAiMLmAt",
    "url": "https://www.etsy.com/listing/1461345893/custom-library-embosser-library-book?click_key=c9c2f7bc622ae73a483a4333399dd57891da5fc9%3A1461345893&click_sum=5f983f1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-15&frs=1&bes=1&sts=1",
    "title": "Custom Library Embosser, Library Book Stamp, Personalized Book Embosser, Monogram Embosser Stamp, Teacher Appreciation Gift, Teacher Stamp",
    "description": "This book embosser is both functional and stylish, making it the perfect product for teachers, librarians, and all-around bookworms! Expertly crafted with the highest quality materials, this custom book embosser is designed to leave a crisp and clear impression on every book it touches.The custom options will include the embossing direction as well as the option to add seals of your color choice for a little extra pizzaz. Whether you're a book collector or a dedicated reader, this embosser is the perfect way to add a personal touch to your favorite books.❤Details❤•This embosser works best with 20 lb paper or less, as anything heavier may damage the plates• Your text is laser-engraved into soft rubber to produce fine words and small details• The impression size for all options is approximately 1.615” Wide x 1.615” High• 2 seal colors to choose from❤Embosser Information❤• Creates a raised impression that is pressed into paper• The embosser is conveniently built to sit stationary on a desk• Will last for as many crisp impressions as you require• No ink needed but option for an ink insert is available• Great for professional and personal use❤Shipping❤• We aim to have your order sent out within 1-2 business days!• USPS First Class Mail takes 3-5 days to deliver within the United States• Shipping is free in the USA, but shipping internationally incurs a $12 charge• International orders may take anywhere from 10-20 days for most countries❤ All stamps are proudly customized in the USA - thank you for shopping small! ❤",
    "reviews": [
      "Fantastic tool that surpassed expectations",
      "Arrived quickly and as expected",
      "The emboss is the perfect size to be seen, but not so big is damages what is on the page. I ordered the one that crimps from the right; I like that it can be used anywhere along the side of the page so one has options as to where to leave their mark!",
      "Quality! Easy process and shipped quickly!"
    ]
  },
  {
    "productId": "MNCqqvyXQB",
    "url": "https://www.etsy.com/listing/933297264/personalized-water-bottle-custom-water?click_key=15f0713a28cdc074290d84a7059c2813333ab01c%3A933297264&click_sum=8ebf88d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679448-10-16&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Water Bottle, Custom Water Bottle, Personalized Gifts for Her, Engraved Insulated Water Bottle & Straw Lid - Name Bottle",
    "description": "Water Bottle Personalized w Logo or Design - Custom Water Bottle, Stainless Steel - Personalized GiftsOur Bulk Prices--------------------------------18OZ - 2PC $54.9518OZ - 3PC $74.9518OZ - 6PC $129.9518OZ - 10PC $199.95--------------------------------24OZ - 2PC  $59.9524OZ - 3PC  $79.9524OZ - 6PC  $149.9524OZ - 10PC  $229.95--------------------------------32OZ - 2PC  $62.9532OZ - 3PC  $84.9532OZ - 6PC  $159.9532OZ - 10PC  $239.95--------------------------------40OZ - 2PC  $69.9540OZ - 3PC  $87.9540OZ - 6PC  $164.9540OZ - 10PC  $249.95Our bottles are BPA-free but not dishwasher safe.****If you need a custom design please contact us before placing your order.****PREMIUM INSULATED WATER BOTTLE - Stay hydrated in style with a sleek bottle that takes care of your favorite drink. 18, 24, 32, 40 oz. powder coated water bottles are made of stainless steel and have double-walled insulation, which means your beverage will stay hot for 12 hours and cold for 24 hours. Easily fill your bottle with ice and clean it through the wide mouth opening.CUSTOMIZE ON YOUR OWN - Select your size, color & design then enter your customization which fits with your selective design. Laser engraving will remove the paint on the tumbler, exposing the smooth stainless steel. Our products are crafted to be as unique as you are, and designed to inspire the community with others. Choose your color and design to create your own bottle that is perfect for your lifestyle.MULTIFUNCTIONAL - Note: Fits any cup holder. For sports, fitness, gym, traveling in your car, staying hydrated at work, drinking soup while camping, enjoying hot, piping coffee, iced cold water, and so much more.ECO-FRIENDLY - Safe, healthy alternative to plastic bottles and cups. Reusable, unbreakable, and easy to wash. Eliminate single-use cups and waste and buy this cup that lasts a lifetime. Help save the world!!!! KINDLY NOTE: HANDWASH ONLY !!!FAST SHIPPING: We ship orders in 2 Business days. If you have any questions, please contact our customer service and we will reply shortly.",
    "reviews": [
      "GOOD QUALITY. Fast shipping. As descrive.",
      "It was perfect, worth every penny!",
      "I love so much ❤️",
      "I have already reviewed this product"
    ]
  },
  {
    "productId": "InvsCOjPLk",
    "url": "https://www.etsy.com/listing/870439619/personalized-leather-mens-wallet-gift?click_key=58fc079e35bcf21b0bbde6399c8eca52ae1d82c2%3A870439619&click_sum=caae1013&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-25&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Leather Mens Wallet, Gift for Father's Day, Dad, Boyfriend, Him Husband, Handwriting Engraved Custom Wallet, Anniversary Gift",
    "description": "🔹  Personalized Leather RFID Blocking Men's Wallets, Bifold Wallet, Gifts for Father's Day, Him, Husband, Dad, Boyfriend, Anniversary gift, Groomsmen Gift, Wedding Gifts Graduation Gifts, Monogrammed Gifts, Engraving Initials & Quotes l Vegetable Tanned Full-Grain Leather Wallet with RFID Blocking:🟢   Do you need a high-quality, protective wallet that will hold your valuables in a secure and stylish way? You have come to the right place!🔵   Our wallets are made from the finest vegetable-tanned full-grain leather. The perks of having the wallet made from premium quality full-grain leather makes the wallet age backward; the color becomes more vibrant and pretty.🔴   Alongside its durability, our wallets are built-in with RFID blocking to protect your identity so that it doesn’t go into the wrong hands. The high-quality nylon lining inside the wallet protects against bad odor and sweat. It is also easy to clean.⚫️   Add a personal touch to this wonderful wallet by engraving and adding a quote to the side of your choice!🟠    This wallet is a perfect present for Your Loved Ones for their Birthdays, Anniversaries, Weddings, graduations, Father’s Day, and many more! Get this gorgeous gift for that special person or as a present for yourself!🟣   Our wallet has the capacity of 11 card slots and 1 NON-REMOVABLE flip-up transparent compartment for IDs, photos, etc.🟤   Get your own CaglarCreations wallet to melt hearts and impress your loved ones or get it as a special present for you!♦️Dimensions♦️4.3\"*3.5\"0.6\"💕💞💞 ENGRAVE OPTIONS 💗💘💖🖤  FRONT SIDE: INITIALS OR NAME OR DATE OR LOGO🧡  BACKSIDE: INITIALS OR NAME OR DATE💜  INSIDE RIGHT: NAME OR INITIALS OR QUOTE or LOGO or HANDWRITING💛  INSIDE LEFT 1: NAME OR INITIALS OR QUOTE or HANDWRITING🤍  INSIDE LEFT 2: NAME OR INITIALS OR QUOTE or HANDWRITINGNOTE: Inside personalization can be up to 4 lines and 4-6 words per line.We can engrave any Font, Logo, or emojis. Please mention the font and size that you want. If YOU DON'T MENTION YOUR REQUEST, WE USE Times New Roman and medium font. (We do not accept responsibility for customers' typos.)-You can send your images from the message section.💻💻 You can send your image/logo via  caglarcreations [!at] gmail.com*** Front side Small Engraving size: 0.31\" (8mm) {The first picture brown wallet: (JLJ)}*** Front side Medium Engraving size: 0.39\" (10mm) {The 6. picture Dark brown wallet: (MVS)}*** Front side Large Engraving size: 0.47\" (12mm) {The 9. picture black wallet: (AJM)}😘😘😘 Would you like DISTRESSED LEATHER? Here is the link: 👇👇👇https://www.etsy.com/ca/CaglarCreations/listing/926179598/personalized-mens-distressed-full-grain?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1610594978418***SLIM WALLET LINK***https://www.etsy.com/ca/CaglarCreations/listing/1014885981/personalized-mens-full-grain-super-slim?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1621190834706🔹  Personalized Leather Men's Wallets, Gifts for Father's Day, Him, Husband, Dad, Boyfriend, Anniversary gift, Groomsmen Gift, Wedding Gifts Graduation Gifts, Monogrammed Gifts, Engraving Initials & Quotes l Vegetable Tanned Full-Grain Leather Wallet with RFID Blocking",
    "reviews": [
      "Amazing! Just ordered my second one for another gift. Highly recommend - great quality and work!",
      "Exactly what I was looking for and what was pictured. Quick dispatch and delivery.",
      "Very beautiful. Exactly what I wanted",
      "Great quality, very pleased with our purchase!"
    ]
  },
  {
    "productId": "oRJwcPCvRw",
    "url": "https://www.etsy.com/listing/940976001/personalized-cosmetic-bag-with-name?click_key=4fa3c5fdf937c613e779bbb5d2bbfc3387d364f0%3A940976001&click_sum=55bec558&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-26&etp=1&sts=1",
    "title": "Personalized cosmetic bag with name | Beauty Bag | Make Up bag | Mothers Day gift | birthday gift for Mum | Personalized gift for Her",
    "description": "Customized cosmetic bags in two sizes, personalized with your name. This is how you organize your chaos.The name is printed with the first capital letter followed by lower case letters.❤︎ Product Information & FeaturesThe toiletry bag made of vegan leather with a saffiano look is available in two sizes or as a set.small: 18 x 11 x 4.5 cmlarge: 25 x 16 x 10.3 cmThe wash bags are available in the following colors:With golden zipper:- new in white- new in taupe- ivory- light grey- pink- lilac- turquoise (incl. inside pocket with zip)- emerald green *Limited Edition, (incl. inner pocket with zip)- berry *Limited Edition, (incl. inside pocket with zip)- blackWith anthracite colored zipper:- black❤︎ PersonalizationThe name of choice (capital initial) can be applied inthe following colors:- gold- silver- black- white- pink- and much more. Please feel free to ask.The name is printed with the first capital letter followed by lower case letters.Do you have a special personalization request? Please send us a message before ordering.Due to the individual personalization, the bags are non-returnable.If you are unsure about the font, please ask for a preview in advance when ordering. The visualization is subject to our design sensitivity and is therefore no reason for a complaint.EXPRESS:Would you like to receive your order faster? Please note our express processinghttps://www.etsy.com/en/listing/1169392478/express-editing------------------Important instructions:This article is made to your liking and is therefore non-returnable. Therefore, please check your details before ordering or send us a message before placing an order if you are unsure about the design. If you do not request a preview for approval, the visualization is the responsibility of our design team and does not constitute a reason for complaint if your idea deviates.The decoration shown on the product image is not part of the scope of delivery.You can find more great personalized gifts here:https://www.etsy.com/de/shop/JelliesDesign",
    "reviews": [
      "Looks super chic. I think it will be very well received by the recipient.",
      "Well made and a very nice product",
      "Everything was great, fast shipping, nice gift!"
    ]
  },
  {
    "productId": "AYTCUJmPbX",
    "url": "https://www.etsy.com/listing/1273481494/whiskey-making-kit-diy-cocktail?click_key=8cb38793b5e29b511f05002252346103a54af756%3A1273481494&click_sum=8705c5aa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-27&pro=1&etp=1",
    "title": "Whiskey Making Kit, DIY Cocktail Infusions For Adults, Valentine Gifts For Men, Make Your Own Personalized Bourbon, Unique Barware For Him",
    "description": "WHISKEY INFUSION KIT by Crafted InfusionsWelcome to Crafted Infusions! We're a husband-and-wife team based in Atlanta, and we create handmade gifts for adventurous spirits. Our DIY alcohol infusion kits have made a five-star splash at everything from birthday parties, PhD graduations, and holiday gift exchanges to groomsmen proposals, wedding anniversaries, and real estate closings.EVERY WHISKEY INFUSION KIT INCLUDES:• (12) BOTANICALS — 100% natural with no artificial flavors and no added sugar (see our FAQs below for a complete list)• (5) INFUSION SATCHELS — plastic-free & compost-safe• (5) RECIPE CARDS — instructions for five infusions (and five cocktails!) with space to review your personalized spirits• (1) INSTRUCTIONS CARD — simple, straightforward instructions for every step of the infusion process and flavor profiles for each botanical ingredient• (2) REUSABLE WOODEN COCKTAIL STIRRERS — laser-cut from 1/8\" Baltic birch, hand-sanded, and finished with food-safe Danish oil* Alcohol, glassware, and other props featured in our product photos are *NOT* included.— FREQUENTLY ASKED QUESTIONS —[ WHAT MAKES CRAFTED INFUSIONS UNIQUE? ] 🇺🇸 WE ARE GENUINELY HANDMADE IN THE USA • Every Crafted Infusions kit is handmade by the two of us in our Atlanta, GA workshop. 🌿 Rather than ordering pre-made infusion kits from overseas manufacturers on Al!baba like many other Etsy sellers, the two of us fill every tube, fold every box, assemble every kit, and ship every order ourselves. 🌎 WE PRIORITIZE PEOPLE & THE PLANET • We source our materials from other small American businesses whenever possible. ♻️ To lessen our environmental impact, we package each infusion kit in a 100% recycled and recyclable box printed with non-toxic algae ink, and we reuse every piece of protective filler we receive (think bubble wrap, air pockets, and kraft paper) when packing orders. 📦[ WHAT TYPE OF WHISKEY SHOULD I INFUSE? ] We recommend a BOURBON, RYE, or TENNESSEE WHISKEY 🥃 with a minimum ABV of 45% and a price tag under $50. If you've got a local distillery nearby, give their spirits a shot! If not, Drizly's bestsellers are a great place to start your search.[ WHAT BOTANICALS ARE INCLUDED? ] 🍊 The 12 botanicals included in our whiskey infusion kit are  (1) allspice berries, (2) American oak chips, (3) black peppercorns, (4) cacao nibs, (5) chili peppers, (6) cinnamon chips, (7) French oak chips, (8) ginger root, (9) grapefruit peel, (10) hibiscus flowers, (11) orange peel, and (12) spearmint leaf. 🌿[ HOW MUCH WHISKEY CAN ONE KIT INFUSE? ] In general, we recommend using up to 2 total tablespoons of botanicals per 8 ounces of whiskey. Following that guideline, one kit can infuse at least seven 750mL bottles.[ WHEN WILL MY ORDER ARRIVE? ] 📍 To check how long it normally takes for a package to travel from our location to yours, search \"30316\" on the official USPS Priority Mail delivery map >> usps.com/priority-mail/map[ WHAT’S MY TRACKING NUMBER? ] Once your order ships, Etsy will email you a link to track its progress online.[ DO YOU OFFER FREE SHIPPING? ] Yes! 📦 Orders over $35 ship free via USPS Ground Advantage (3-5 business^ days). Need it faster? Free shipping can be upgraded to USPS Priority Mail (1-3 business^ days) or USPS Priority Mail Express (1-2 business days). ^business days do NOT include weekends or federal holidays.[ CAN I CANCEL MY ORDER? ] Yes, you can cancel your order *BEFORE* its status is updated to \"Pre-Transit.\"  At that point, your order is already en route to our local post office and cannot be canceled.[ WHAT'S YOUR REFUND POLICY? ] Refunds are available ONLY when an item is damaged^ during transit **AND** we receive the USPS-required photos that will allow us to file an insurance claim. When requesting a refund or replacement due to shipping damage, please include (1) at least one photo of the external shipping box with the shipping label visible and (2) at least one photo that clearly shows ALL of the products you received. We cannot offer you a refund if we do not receive these photos. 🚫 PLEASE NOTE: SHIPPING COSTS ARE NON-REFUNDABLE.[ DO YOU ACCEPT RETURNS? ] Our infusion kits are handmade and consumable so we unfortunately cannot accept returns. Instead, we recommend gifting your kit to a whiskey-loving friend, relative, or colleague. 🎁",
    "reviews": [
      "Bought it as a gift and they love it!",
      "Father in law appreciated it.",
      "My partner loved this gift so much! Some of the mixes have been extremely tasty",
      "Super cute, my husband loved it"
    ]
  },
  {
    "productId": "KCMdnArKPP",
    "url": "https://www.etsy.com/listing/1144106134/im-yours-no-refunds-funny-anniversary?click_key=3b0c80d1826c21dbf31750648ca6da67660dc4a3%3A1144106134&click_sum=5734a2dd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-28&pro=1&etp=1",
    "title": "I'm Yours No Refunds Funny Anniversary Card For Him, Joke Anniversary Card For Boyfriend, Girlfriend, Husband, Wife, Anniversary Card V029",
    "description": "Simple, stylish, and printed on 350gsm lightly textured cardstock with premium kraft envelope INCLUDED!✉ DIMENSIONSEach card measures 148x148mm (approximately 6x6\")*Please note that this card is blank inside.TIMESCALEOnce purchased and approved we print and dispatch your order within 1 working day.United Kingdom: 1-2 business daysEurope: 2-3 business daysUSA and Everywhere else: 7-10 working days",
    "reviews": [
      "Was great card very happy",
      "Good stuff good quality undamaged. But I have to admit, they are making good money off this, as my partner came across this for 9x cheaper elsewhere 0.67p. Nonetheless, thank you for giving me the product in the timeframe I had.",
      "Nice item, as expected on arrival",
      "Nice little gift more personal than the normal card"
    ]
  },
  {
    "productId": "zQoTLyRXAN",
    "url": "https://www.etsy.com/listing/983384839/personalized-family-name-doormat?click_key=ab397da41ed4517c3e08188b9dc1027040112e96%3A983384839&click_sum=f54b637b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-29&pro=1&etp=1&sts=1",
    "title": "Personalized Family Name Doormat - Housewarming Gift - Family Name Doormat  - Personalized Doormat - Custom Welcome Mat - Custom Doormat",
    "description": "Introducing our range of custom coir doormats. A cute accent to your home which also serves a practical purpose.★ UK Fast & Fully Tracked Shipping On All Orders★ USA Fast & Free Ship Over $35 with FedEx★ Fast Fully Tracked Shipping via FedEx to UK, CA, AU, Europe, & ROW★ 100% Happiness Money Back Guarantee★ We've Worked With MTV, ABC, TeaPigs, House Beautiful, Visit Anaheim & lots more!ORDERING OPTIONS:[SIZE]: 16x24\" or 18x30\" or 24x36\"[FINISH]: Durable UV Printing (more info below)[FONTS]: You cannot change the fonts shown on this listing - If you wish to either create your own custom mat from scratch or have a mat design based off of this one, then you can do so using the following listing; you can use any font on dafont.com or use the popular fonts which will be shown in the listing images:https://www.etsy.com/listing/1468225073/personalized-doormat-custom-door-mat?ga_search_query=custom+doormat&organic_search_click=1MATERIALS AND CRAFTSMANSHIP:Our eco-friendly mats are made from durable and natural coconut fibers with a biodegradable PVC vinyl backing to help keep the mat from sliding around.UV PRINTED:Our mats are created using a specialist printing technique that gives an extremely sharp, bold looking doormat. The design is cured using UV light to lock the ink into the mat fibres, they look fantastic and are durable; much stronger and longer lasting than laser engraved or spray painted mats. They are by far our most popular product. You or your gift recipient will be blown away, guaranteed.PREVIEWS:Please note that we only send previews upon request for custom designs and not until after purchase. Any pre-designed mats, including doormats with last names, do not get proofs unless requested. There are font references in each listing where applicable. Please send us a message if you have any questions.RUSH ORDERSNeed your order quickly (last minute gift ideas anyone?) We offer an Express upgrade on the cart drop down, which will ensure you mat leaves us the next working day. Shipping to the UK is next working day with this service, and the US is 2-3 days.IMPORT FEES/TAX:We do not cover Canadian taxes and import fees as these are determined and imposed by the Canadian government, and it is the responsibility of the recipient to comply with these requirements. We encourage our customers to familiarize themselves with the relevant Canadian tax and import regulations to make informed decisions regarding their purchases and to avoid any unexpected costs or delays.CARE INFO:Each mat is hand crafted by our team with the best materials possible to ensure they last. We really care about each one that leaves our little workshop! We recommend that you keep your doormat in a dry, covered area to prolong the life of the design. To clean the mat, shake it out. Our mats are made from natural coir fibres and may have small chunks of imperfection and different variances of color. All mats are unique. Do not saturate the mat in water. Excess water can cause discoloration or fading of the design. Orders cannot be returned and refunded if mat has not been taken care of as advised above.CUSTOM DESIGNS:Do you have a design in mind or a business logo you’d like placed on a doormat? No problem! We love making custom designs, just reach out to us with your idea and image if you have one and we will work with you on making it exactly as you imagined. You can also find a 'Custom Mat' listing on our shop or click here:https://www.etsy.com/listing/1084583465/your-text-here-custom-doormatREVIEWS / SOCIAL MEDIA:We love to hear from all our customers so please share a photo of your mat with us on Etsy Reviews as well as our social media!Instagram: https://www.instagram.com/designsbyimagineered/Facebook: http://facebook.com/designsbyimagineeredBULK/WHOLESALE ORDERSPlease get in touch for your bulk order needs, we'll be happy to help.REALTORSWe can meet realtors requirements with logo mats or custom designs for your clients closing gifts, whether we ship to you or direct to your client.",
    "reviews": [
      "It's lovely, very happy with it!",
      "Great product! Would order again.",
      "Exactly what I wanted, thanks!"
    ]
  },
  {
    "productId": "KXVSfUfCgw",
    "url": "https://www.etsy.com/listing/948156525/small-leather-fanny-pack-with-patterned?click_key=f6d9af85a12bb4e8117897df4be6f2dd38fae008%3A948156525&click_sum=1ff46818&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-30&etp=1&sts=1",
    "title": "Small Leather Fanny Pack with patterned shoulder strap, Festival Bag, Small Cross Body Bag, Leather Fanny Pack with patterned bag strap",
    "description": "📏 DimensionsBag S- Width: 22 cm- Height: 13 cm- Depth: 6 cmBag M- Width: 25 cm- Height: 16 cm- Depth: 8 cmBag L- Width: 30 cm- Height: 19 cm- Depth: 9 cmBag XL- Width: 40 cm- Height: 20 cm- Depth: 12 cmBag XXL- Width: 47 cm- Height: 25 cm- Depth: 15 cmLeather belt (= BASIC | always included)- Length: 60-105 cm- width: 2,5 cmadditional shoulder strap (selectable via the numbers)- length: 80-120 cm- width: 5 cm📱 DEVICE SIZE- Suitable for all smartphones🤎 MATERIAL- All our bags are made of high quality, sturdy cowhide leather, which is extremely durable- Finished in a traditional Italian manufactory☑️ FEATURES:- Closure type: zipper- number of compartments: 1 main compartment- Inside pocket: yes- Detachable strap: yes- Adjustable strap: yes- Metal details: silver🤍 TONIFanny pack TONI by lePelou is the perfect accessory for your everyday life. It is made of high quality leather and is manufactured in traditional manufactories in Tuscany, Italy. With its versatile function as a fanny pack, hip bag and crossbody bag, it is a practical companion for any occasion - for example, TONI is also ideal as a festival bag.TONI Crossbody Bag is available in five different sizes and 13 different colors, offering the perfect choice for every taste. The detachable leather shoulder strap (=BASIC option) can be replaced with a patterned bag strap to customize the bag and give it a personal touch.The bag offers enough space for all your everyday essentials and is equipped with several compartments and a practical zipper to keep your stuff safe. Whether you use it as a fanny pack for sports, as a hip bag for outings or as a crossbody bag for strolling around town, the TONI Crossbody Bag is a stylish accessory that perfectly complements your outfit.It is practical and comfortable to wear because it can be worn over the shoulder or across the body. So you have your hands free and can move freely.Overall, the TONI Crossbody Bag from lePelou is a must-have for those who appreciate practical style and comfort. With a wide range of sizes and colors to choose from, as well as the ability to change the strap, this is the bag for you if you're looking for a little more individuality in your everyday life.Fun Fact: Because of their banana-like shape, fanny packs are called \"sac banane\" in France 🍌🇮🇹 MADE IN ITALYThe preservation of traditional craftsmanship and fair working conditions are particularly important to us. That's why our products are handmade in Tuscany in regional manufactories that can look back on many years of experience in their craft.The often small family businesses use vegetable-tanned leather for the production of our bags, which they cut out and carefully hand-sew into high-quality bags.",
    "reviews": [
      "Omg! Such a beautiful bag. Perfect size and the strap design was gorgeous! I also appreciated the plain option they included in case you wanted a simpler look. I will be ordering other colors again!",
      "So many compliments on my purse!",
      "Purchased as a gift. Really impressed by the quality!",
      "The bag is beautiful and of great quality. The only thing is the medium ended up being a bit smaller than I thought it'd be. I didn't really pay attention to the measurements though. I may opt for a larger size. The medium can hold a phone, thin wallet, and maybe a lipstick and glasses."
    ]
  },
  {
    "productId": "mu6uRzbscz",
    "url": "https://www.etsy.com/listing/1268557135/personalized-tumbler-with-same-lid-and?click_key=7ccccefe263150f2d66bc2fac68039defbb552c9%3A1268557135&click_sum=62ae67f5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-31&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Tumbler with Same Lid and Straw,16 oz Acrylic Skinny Tumblers,Pastel Matte Tumbler,Bridesmaid Gift, Bridesmaid Proposal",
    "description": "Personalized tumblers perfect as bridesmaid gifts, bachelorette party gifts,girls trip gifs and ect.16 oz Double Wall Arcylic Skinny Tumbler with Same Lid and StrawCustom names are made using premium outdoor vinyl.This is the same vinyl that is used on outdoor signs.Waterproof and sun protection.- Dimensions: 8.35 inch (H) x 2.8 inch(D)- BPA free and Non Toxic- Hand wash onlyPlease enter the names in the personalization field and add them to the cart together with the checkout, or make a note of all personalized names in the order.Please feel free to contact us with any questions and we will reply within 24 hours. Thank you very much!",
    "reviews": [
      "These tumblers are very nice, the plastic has a very nice soft touch/feel to it, and it’s nice and thick.",
      "Really stunning water bottle, makes the perfect gift!",
      "We loved this item so much!",
      "We loved this item so much!"
    ]
  },
  {
    "productId": "hlqOqbywOF",
    "url": "https://www.etsy.com/listing/1216248938/custom-dog-face-blankets-personalized?click_key=f8358fc3c990dede500728fdf7bcde7ee30f37e9%3A1216248938&click_sum=f3e3e66c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-32&frs=1&etp=1&sts=1",
    "title": "Custom Dog Face Blankets, Personalized Pet Photo Blanket, Fleece Dog Blankets, Customized Photo Throws, Dog Dad Gifts, Pet Lover Gifts",
    "description": "This is the cozy blanket you're looking for with your beloved pet's picture on it! It is the perfect gift to any pet lover for any occasion: Birthdays, Valentine's Day, Mother's Day, Father's Day and Christmas!We customize the blanket with the photo of your choice. Our talented artists turn the picture you send us to an artistic piece. The picture will look like an oil painting with all the imperfections cleared out. We can print up to three pets on a blanket without any extra charges.HOW TO ORDER1. Select the blanket size.2. Select the background color of your choice from the color chart and find it in the dropdown menu.3. How to fill the personalization box:-Enter your pet's name-Enter the color you want the name written in (two options:black and white) if left blank we will use white fontExample:Charlie Black4. Place your order and send us your pet's photo via Etsy messageIf for any reason you can't use Etsy messaging service you can also email us at  customblanky [!at] gmail.com with your order number.",
    "reviews": [
      "Excellent quality! Matched the description perfectly!",
      "Absolutely adorable! My best friend loved her blanket!",
      "My sister was very happy with her gift.",
      "Great quality. Just what I was looking for. Would order again!"
    ]
  },
  {
    "productId": "HGIwCSAZqg",
    "url": "https://www.etsy.com/listing/1000924071/personalized-unicorn-story-book-for?click_key=8b07a76074e31453f4b99bdc8ab7cee6ff5a4a35%3A1000924071&click_sum=1557bc5a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-33&pro=1&etp=1",
    "title": "Personalized Unicorn Story Book for children christening gifts New Baby First 1st Birthday Presents Baptism Godchild Girls Mother's day",
    "description": "Everyone needs magic in their lives - send your child on an amazing adventure with our magic unicorn. A beautifully illustrated Children's story book with personalised rhyming verse and a character based on your child.PERSONALISING YOUR BOOKSuitable for one child - we can only personalise books with one name.- In the dropdown select from a range of skin and hair colours for girls or boys (see image for colour guide)- Select soft cover, or upgrade to a beautiful hard cover, perfect bound and matt laminated to protect your book for years to come.- Enter Child's first name in personalisation field (max 12 characters - suitable for one child, we can only personalise books with one name.)- On the first page we print your gift message - enter this in NOTES TO SELLER at checkout. Only enter a message as everything you type here will be printed. If you have any other questions - please contact us with a separate message.THE BOOKA perfect keepsake for grandchildren, birthdays or from godparents for christenings, the rhyming verse takes them on an adventure of a lifetime and teaches them some very important lessons along the way, from making friends, respecting the earth, being adventurous, loving their family, overcoming fears, learning new things, finding happiness and believing in themselves... with a little help from a sprinkling of magic.For our full range of books with further personalisation, visit letterfest.com24 pages, 210x250mm when flat (a little shorter than A4)Please Note: You will need to choose skin tone from the image provided within the product images",
    "reviews": [
      "Was a perfect gift for my niece! So cute!❤️",
      "This is an adorable present for children of any age!",
      "Lovely personalised book for birthday present",
      "Lovely quality item. Fast delivery"
    ]
  },
  {
    "productId": "JZhZcwuPxb",
    "url": "https://www.etsy.com/listing/702366053/leather-forever-rose-in-glass-dome?click_key=18bfdb796a62aa238c78db9bf141c3267e27c8f0%3A702366053&click_sum=835999e4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-34&pro=1&frs=1&etp=1",
    "title": "Leather Forever Rose in Glass Dome Preserved Flower Box, Personalized Leather 3rd 5th Anniversary Gifts for wife girlfriend partners her him",
    "description": "This Leather Rose Preserved Flower Gift Box is a perfect as a girlfriend gift, women's gifts, mother's day gift, Valentine's gifts, anniversary gift, personalized gift, etc. It is made from Italian Buttero leather with a special packing box to protect the glass cover and the flower.Approx closed dimensions - Length: 16.2cm, Width: 11.5cm.Here is the link for the other Leather Flower of my store:Leather Sunflower:https://www.etsy.com/listing/707153516/leather-sunflower-preserved-flower-boxLeather Christmas Tree:https://www.etsy.com/listing/740121222/leather-forever-christmas-tree-preservedLeather Carnation:https://www.etsy.com/listing/807029109/leather-carnation-forever-preservedThis leather flower's leather label can do a Custom Monogramming. The font's symbols and examples are listed in the 2nd picture of the product gallery. Max around 25 characters, may split as two lines. Please note I will monogram exactly as entered. Please check spelling and upper and lower case with me through message or email.（I will use \".\" in date form, such as 12.25.2020, instead of 12-25-2020 or 12/25/2020）Please be aware that colors may be slightly different due to lighting and monitor displays.Please feel free to contact us if you have any question via Etsy Message.Leather Rose Flower Preserved Flower Box for Women Mother's Day Gift Ideas, Personalized Leather Third 3rd Anniversary Wedding Gift Bouquet",
    "reviews": [
      "Item arrived quickly and looks great.",
      "Made me the hero Christmas morning, thank you!",
      "Quality product and it was packaged excellently, definetely recommend",
      "Very well made and displayed"
    ]
  },
  {
    "productId": "MfdqjaKENj",
    "url": "https://www.etsy.com/listing/1416456978/personalized-beer-glass-18-oz-beer-glass?click_key=678b331088f006a3b3d5cda9f4241dde7d329cd0%3A1416456978&click_sum=f780c1c2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-35&pro=1&etp=1",
    "title": "Personalized Beer Glass- 18 oz. Beer Glass -pint, camping, outdoor, adventure, Wilde Nomad, beer lover, camping mug, personalized gift, beer",
    "description": "Any & all wording works! We can have these say whatever you'd like!This custom 18 oz. beer glass is perfect for anyone and any occasion! Sitting on the back deck on a warm day, taking it camping with you in your camper, showing your favorite adventure buddy your appreciation for them! You just let us know who or what you want it to say and we will do the rest!Looking for an idea for a wedding party, maybe a gift for your bridesmaids or groomsmen? How about a wedding favor for all your friends and family to have as a keepsake? We are always personalizing them for major events for people, feel free to reach out if you want to have these glasses be a part of your big day.Care Instructions:HAND WASH ONLYNOT microwave or dishwasher safe.Printed in Denver, CO. These mugs are not made with any sticker material they are sublimated. They will last forever. It is recommended you hand wash them to really make it last for all your adventures.**This glass is 18 oz.** No refunds on personalized itemsAll Sales are FINAL for personalized items. PLEASE MAKE SURE TO DOUBLE AND TRIPLE CHECK YOUR SPELLING AND DATES AS WE ARE NOT RESPONSIBLE FOR TYPOS.If we make the typo we will always make it right , all the glass wraps do not fully wrap, there is a slight  gap but they still look awesome & beer and iced coffee taste amazing out of them!",
    "reviews": [
      "Bought these as an anniversary gift for my sister and brother-in-law who love the outdoors and they loved them! Arrived fast and just as pictured!",
      "So cute and so amazing!! So happy with it.",
      "My husband loved his Valentine’s Day gift! Looked as expected, arrived intact and is perfect for his collection.",
      "Perfect and something we will cherish always. The seller also helped me ensure this arrived in time for my anniversary. So so grateful. 10/10"
    ]
  },
  {
    "productId": "NSVRKhOPXT",
    "url": "https://www.etsy.com/listing/602502259/sailboat-box-baptism-gift-baby-gift-or?click_key=1d7129483e6d8450bb5a4ecd0a6a9eedb58a72c0%3A602502259&click_sum=c5c91611&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-36&pro=1&frs=1&etp=1&sts=1",
    "title": "Sailboat Box - Baptism Gift, Baby Gift or First Communion Gift - Personalized Gift",
    "description": "This personalized modern sailboat box would be a perfect baptism, first communion or baby gift and is one that can be enjoyed all year round. It's made of earthenware clay and can have the child's name printed on the front of it with a little anchor (as shown), star, heart, olive branch, shamrock or cross image. The back of the boat can include a personalized message or can be left blank. The sailboat measures 6¾\" L x 2¾\" W x 6\" H and is the perfect size to hold money or other small trinkets inside.The text and graphic on the keepsake box comes in the color shown which is a deep brown/sepia. We can also add the text and graphic in a different color for an additional $3. Our colors include black, light blue, light pink, deep green, navy blue and purple. Please note the colors may slightly vary in person from the ones displayed in the photo or on a computer screen.When checking out please select the graphic image and color option, then add the name for the front and any custom text for the back in the personalization section.If you'd like to send this directly to the recipient please let us know and we'd be happy to include a personalized note too.Our signature red gift box with silver seal adds the perfect final touch! The box will be flat packed so you can simply assemble it, add your keepsake item and your gift will be ready to give! If you'd like to add a gift box (as shown in the last image) please add the link below to your cart before checkout:https://www.etsy.com/listing/836494785/add-gift-box-to-order-additional-service?ref=listings_manager_gridFor up to date production times, shipping estimates, and holiday deadlines please see announcements on shop homepage for more information.  If you need it sooner than our standard lead time please contact us, we are able to expedite many of our products. Upgraded shipping for faster delivery is available at checkout for most items.https://www.etsy.com/shop/SusabellasWe love custom orders so if you have an idea, just send us a message!",
    "reviews": [
      "The printing was great and shipping was well done to protect the item. My only minimal complaint is that the top of the sailboat seems too small for the base. You have to be very specific on placement to cover the opening.",
      "This is my 3rd purchase from this shop. I’m not surprised to have another perfect product. The shipping is so fast and quality is amazing. Would absolutely recommend.",
      "Love it: the ship looks exactly as depicted and feels high-quality. It exceeded my expectations! Thanks so much for!",
      "An amazing gift for a baptism"
    ]
  },
  {
    "productId": "qVqEXBaTKs",
    "url": "https://www.etsy.com/listing/928620146/photo-heart-valentines-day-photo-folding?click_key=b2797e8e0cf0e50f812b071884aee5f7e994bdd3%3A928620146&click_sum=7a845d66&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-37&pro=1&etp=1&sts=1",
    "title": "Photo heart - Valentines day photo folding gift, gift for girlfriend, for Mom, birthday gift, anniversary gift, photo gift for her for him",
    "description": "Choose your pictures in order to create your own elegant Photo Heart. The infinite motion of this unique gift will bring joy and trigger the smiles of your loved ones.For sure, it will become the best thing in the house.More videos of our products on our INSTAGRAM page:https://www.instagram.com/woodili_gifts/Key information:Natural woodLongevity of your displayed photos is guaranteedHeart approximate size: W6.7 x D6.7 x H1.6 inchesHow to order:Add to cartComplete all delivery informationCheck outRecommendations for the photos:Be sure that the photos you send are the ORIGINAL full-size images.Higher image quality = better result. Avoid dark, blurry and unfocused images.Due to cropping reasons do not add any text to your photo (we cannot add text for you).After purchasing my heart, what should I do?You just need to confirm your order number and upload your pictures on the following link:https://woodili.com/products/uploadYour product will be shipped out in 1-2 business days and you will receive a confirmation from Etsy with the link in order to track your parcel.If there is an issue with your photos, our designer will contact you directly via email in the next 24 hours.Returns:Contact us within 14 days after delivery to discuss available optionsIf you have any questions, do not hesitate to contact us.:)",
    "reviews": [
      "Great quality, came in super fast! I’m so excited to give it to my boyfriend for our anniversary!",
      "great product and fast shipping",
      "The item was delivered on time for Valentines day as stated and the photos came out wonderfully!",
      "Super fast production and shipping. So unique and well made. Very excited to gift this!"
    ]
  },
  {
    "productId": "VEdosUVExA",
    "url": "https://www.etsy.com/listing/785238424/personalised-botanical-floral-mug-for?click_key=010c7b2037b13a869612c94fbe88b10d32ec98dd%3A785238424&click_sum=00b2aed7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-38&etp=1&sts=1",
    "title": "Personalised Botanical Floral Mug For Mum - Personalized Mug - Gift For Mum - Mug For Mum - Floral Mug - Mug With Name - Mothers Day Gift",
    "description": "The perfect mug to show someone you love how much they mean to you, with this lovely personalised mug.An ideal mug to use every day at home or at work. This wonderful personalised floral mug is sure to bring a smile to anyone's face.The perfect present for a trendy mum! Great for Mother's Day or perfect as a Birthday present!This lovely floral mug has space for a message or name which is printed on both sides. The floral design wraps around both sides of the mug.The design features a floral design and personalised message on both sides of the mug.Made from: This mug is made from white ceramic and is both dishwasher and microwave-safe.Each mug includes its own presentation box which can be seen in the listing images. The presentation box is bubble-wrapped and placed in a standard cardboard box to ensure that you receive it in perfect condition.Dimensions:Approx 9.5cm x 8.5cm",
    "reviews": [
      "Ad advertised, looks lovely and well made.",
      "I love this mug! So much so, I’ve just ordered another for work 🌷",
      "For mums mid morning coffee!! She loved her new mug",
      "Perfect gift for Mother’s Day."
    ]
  },
  {
    "productId": "XyDE8qg2gL",
    "url": "https://www.etsy.com/listing/1193971186/gift-for-him-man-grill-gift-idea?click_key=5370f3661f8d8292ae1e63c21dd653d5d54a31a5%3A1193971186&click_sum=3d11184c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-39&pro=1&frs=1&etp=1&sts=1",
    "title": "Gift for Him | Man Grill Gift Idea | Personalized BBQ Set | Grill Gift Set | Personalized Gift | Father's Day Gift | Fathers Day | Dad Gift",
    "description": "A Personalized Grill set is a perfect gift for anyone who loves to grill. Let's face it, who doesn't?  Grill masters everywhere will want this.We personalize each BBQ Set to your likings, based on one of our premade designs. We are able to do more customized items for a small fee if desired.Specs and Details:Box measures: 18\" x 6\" x 3\"Set Weight: 4.5 lbs5 Stainless Steel ToolsHow to Order:Select the quantity and click the design you want and in the \"Notes Section\" upon check out leave all your engraving details so we can personalize your bbq grill set.Due to the nature of the wood the engraving may appear in lighter and darker colors.",
    "reviews": [
      "quality of barbeque tools is good - - it's a special present for son - sure to love it!",
      "It was a perfect gift.",
      "Beautifully made, well organized and the BBQ tools are perfect",
      "My brother loved this gift, it even smelled of fresh wood when opening it"
    ]
  },
  {
    "productId": "dHqhtALnAn",
    "url": "https://www.etsy.com/listing/1266376608/personalized-leather-key-holder-minimal?click_key=13a2accf9badf7bf73e7cd823005dc477f708055%3A1266376608&click_sum=0796a83d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-40&pro=1&etp=1&sts=1",
    "title": "Personalized Leather Key Holder ,  Minimal Round Key Holder , Simple Monogrammed Key Organizer , Key Fob  Gift for Him Her Mother's Day",
    "description": "It's just a sweet personalized gift for every occasion such as birthday, graduation , bachelorette , wedding , 3rd anniversary, housewarming,Mother's Day GiftKeep your keys handy! Our sturdy leather key fob looks and functions great !Avoid losing your keys indoors or outdoors with our personalized handmade product.Attach the keys to the high quality key ring and it's good to go. Easy and safe and this key holder looks very cool!It's small enough to carry in the pocket yet big enough to accommodate 4-5 keys nicely.Can be personalized during checkout. You can select either one letter or one number. Hot stamped with gold foil.This leather will get a beautiful patina over time and will look fabulous!FEATURES:Dimensions:Total length without keys: 4\"Material:Our genuine vegetable tanned leather key holder is handmade from real cow leather in our pet-free, smoke-free studio in Brooklyn, NY.Available colors: Natural , Jade Green , Crimson , Yellow Ochre, Bardolino , Sapphire and BlackThis round leather key fob is made out of premium vegetable tanned cow leatherTo make it a long lasting product we used the highest quality leather, gold plated solid brass rivets,  and solid brass gold plated key ring.NOTEThis listing is only for the leather key fob. Props are not included.This key holder has a modern/minimal feel to it, and is manufactured in a smoke-free , pet-free environment.You can find our detailed return policy in FAQI gladly accept returns, exchanges, and cancellationsReturns are accepted  for full refund minus outgoing shipping  costs.Questions about your order?Please contact me immediately if you have any problems with your order. I will be more than happy to help.FOLLOW our story & production process and be in the know about all collaborations , new items , impromptu sales :  www.instagram.com/zeyn.nyBACK TO OUR SHOPwww.etsy.com/shop/zeynnyABOUT US : We are a  husband and wife team, immigrated from Istanbul  to New York in 2014. Both of us held corporate jobs for over five years before deciding to pursue a creative career. We first manufactured leather goods for other designers but in 2020 pivoted to selling our own designs on Etsy. Today, we create unique leather and waxed canvas goods for our Etsy shop Zeyn NY, while also operating a retail shop in Red Hook/ Brooklyn.Thank you for visitingZeynep & Erdem",
    "reviews": [
      "Perfect gift - thank you",
      "Beautiful key n chain for my son!",
      "Exactly as pictured.  I love it!",
      "Will shop here again. Thank you!!"
    ]
  },
  {
    "productId": "zLlbbwSPTr",
    "url": "https://www.etsy.com/listing/1301614460/custom-two-name-necklacegold-couple-name?click_key=fd5bd19e84ae6e6939217a3a32631ca1a76b547e%3A1301614460&click_sum=7068c75a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-41&pro=1&etp=1",
    "title": "Custom Two Name Necklace,Gold Couple Name Necklace,Kids and Mom Necklace,Moms Jewelry,Charm Necklace,Mothers Gifts,Mothers Day Gifts",
    "description": "♡ D A I N T Y - N A M E - N E C K L A C E ♡It is a dainty cursive name necklace. Perfect jewelry gift, personalized for her!Custom Gold Name Necklace,Signature Necklace,Personalized Moms Necklace,Minimalist Moms Jewelry,Personalized Gifts For Her,Bridesmaid Gifts,Mothers Day Gifts,Wedding Gifts,Silver Name Necklace,Personalized Necklace,Christmas Gifts,Gifts For Mom,Gifts For Wife♡ M O R E - D E T A I L ♡Finish : Sterling Silver Plated ∙ 18K Gold Plated ∙ 18K Rose Gold PlatedPackage : All jewelry will come with a beautiful box.Pendant High : 13mm.Pendant Width : According to the number of letters in your name.♡ H O W - T O - O R D ER ♡1.Choose the necklace finish.2.Choose the necklace chain length.3.Enter your personalized information.4.Click “Buy it know” or “Add to cart”.♡ T U R N - A R O U N D - T I M E ♡All products are handmade, usually it takes 4-8 working days to make, but this may be extended due to the peak season. So please buy early before the holidays.For the UK, the usual shipping time is 3-5 business days.For other countries, the usual shipping time is 7-20 working days.♡ O U R - S E R V I C E ♡If your necklace has any quality problems, please contact me in time, we will resend or refund you! But because this is a customized product, we do not accept returns for customer reasons.If you have any questions about your order, you can contact me. I will reply you within 24 hours.♡ Enjoy your shopping! ♡",
    "reviews": [
      "Lovely necklace, just what I was looking for. I appreciated the help from the seller before purchasing too.",
      "Very good quality, made a very special gift",
      "Thanks for purchasing from our store and sharing your review to all customer.",
      "Beautiful necklace. Thank you so much",
      "Thanks for purchasing from our store and sharing your review to all customer.",
      "Great item really happy with it.",
      "Thank you!"
    ]
  },
  {
    "productId": "bhUuPSeuCb",
    "url": "https://www.etsy.com/listing/1528263259/writing-dice-inspiration-for-creative?click_key=ff7ae14b627451a92d45c53f5d050685c12afa9e%3A1528263259&click_sum=a5391f69&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-42&etp=1&sts=1",
    "title": "Writing Dice - Inspiration for creative writing / Overcome writer's block. Gift for writers, authors, teachers. Classroom or studio",
    "description": "Writing Dice—the solution to writer's block. When faced with a blank page, it can be hard to know where to start. Whether you’re an established writer or just want to find creativity through the written word, Writing Dice provides a thoughtful framework that will guide & inspire any type of creative writing—from stories & novels, to screenplays & comics. With millions of combos, you’re bound to encounter something that helps you find your flow. So roll the dice. Write fearlessly. You never know what’s inside you until you try! Makes a perfect gift for writers, authors, writing students, and teachers.• INCLUDES: 9 color-coded wood dice (1 inch with easy-to-read text) that cover Who, What, When, Where, & Why in depth. Just roll, brainstorm, & write!• PERFECT SOLUTION TO WRITER’S BLOCK: Whether you’re an experienced writer or you just want to dabble — with thousands of combinations, you’ll never fear the blank page again!• WORKS FOR ANY TYPE OF CREATIVE WRITING: Writing Dice provides a thoughtful framework that will guide & inspire any type of creative writing — from stories & novels to screenplays & comics.• PLAY ALONE OR TOGETHER: Can be played alone, with friends and family, or to teach story structure in the classroom, while encouraging creativity and collaboration. Connect through writing!• MULTIPLE WAYS TO PLAY: Full instructions include suggested exercises to get you started, as well as teaching variations for the classroom.• GREAT GIFT: Makes a perfect gift for writers, writing students, authors, and teachers.",
    "reviews": [
      "The quality of the item was awesome! The item met every description and it exceeded my expectations! Thank you for this, and God bless!",
      "I bought this game to help expand the knowledge and creativity of my military journalists, they love it!",
      "It was a gift for my art therapist cousin! e\n\n(I asked the seller to send the paint one not the writing one as I made a silly mistake but they were super kind and helpful)",
      "Great gift, perfect Christmas gift."
    ]
  },
  {
    "productId": "ZRfmHplnXK",
    "url": "https://www.etsy.com/listing/699326867/personalized-wall-art-mom-gift-from?click_key=f52152fabc4b68be88b5ba6348df31b07592b726%3A699326867&click_sum=5e955829&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-43&pro=1&frs=1&etp=1",
    "title": "Personalized Wall Art, Mom Gift From Daughter, Custom Mother Son Print, Mom Birthday Gift, Family Portrait, Mothers Day Gift for Mom, Prints",
    "description": "Celebrate your mom's special day with a personalized family portrait illustration that captures the essence of your family's love and connection. Our custom family portrait illustrations are crafted by our team, using the personalizations you provide. You can choose to include just your mother and yourself, or the entire family, including siblings, spouses, and even pets! You can also choose the skin tones, body types, outfits, hairstyles and accessories from the option photos to match your family's personal style.The result is a stunning and personalized piece of wall art that your mother will cherish for years to come. Every time she looks at it, she will be reminded of the special bond she shares with her children and the love that surrounds her. Whether you're looking for a heartfelt Mother's Day gift or a thoughtful birthday present, this custom family portrait illustration is sure to make your mom's day extra special.You can choose between a physical print or a digital file, and we offer multiple sizes to fit your needs. The physical print is available in 8x10 or 11x14 sizes, printed on thick fine art matte paper. The digital file is a high-resolution jpg format and will be sent via Etsy messages.To order, simply select the print format and number of people/pets, and personalize the design from left to right. Provide the personalization details in the \"Add your Personalization\" box using the template provided. You can also add requests for additional items, such as hats or wings, in the personalization box or note to the seller during checkout.►►DETAILS:►Physical Print:• Available Sizes: 8x10 Print or 11x14 Print• Printed on Thick Fine Art Matte Paper• Vertical Print (2-3 people) // Horizontal Print (4+ people)• Free digital file. Personal usage only. You may print multiple copies for family/friends.• Frame Not Included• Designed and printed in California►Digital File Only:• Digital printable file only. You will not receive a physical print in the mail.• Vertical file (2-3 people) // Horizontal file (4+ people).• Digital file will be sent via etsy messages. The file will be in a high resolution jpg format.• Personal usage only. You may print multiple copies for your family/friends.• Designed in California►INTERNATIONAL CUSTOMERS: IF YOU'RE INTERESTED IN A DIGITAL FILE ONLY, PLEASE PURCHASE THROUGH THIS LINK TO AVOID BEING CHARGED SHIPPING:http://etsy.me/32LKMcn►►HOW TO ORDER:• Choose the print format (physical print or digital file) & number of people/pets from the drop-down menu.• Look through the photos for available options to personalize the people/pets.• Personalize the design from left to right (left = first person)Provide the personalization details in the \"Add your Personalization\" box. An example of what to write is below:Quote/Saying: The Johnson Family1st person:-Skin Tone: Light-Hairstyle: 2B-Body: Slim-Outfit: F2-Name: Mary• Add to cart and complete checkout.►►PERSONALIZATION TEMPLATE:Copy and paste the following template into the personalization box when ordering:Quote/Saying:1st:-Skin Tone:-Hairstyle:-Body:-Outfit:-Name:2nd:-Skin Tone:-Hairstyle:-Body:-Outfit:-Name:3rd, 4th, etc...HELPFUL TIPS:- If you want to add a baseball cap, cowboy hat, angel wings, or a halo to the artwork, please add the request in the personalization box.- If there is not enough space in the personalization box, add the personalization info in the “note to seller box” during checkout.📦 PRODUCTION & SHIPPINGOrder Production: please check out our shop announcement for current production time.Standard Shipping: 3-7 business days after production timePriority Shipping: 2-3 business days after production time✨ KEEP SHOPPINGcheck out the rest of our shop here:www.etsy.com/shop/promenadefield---------------------------►►SOCIAL MEDIA + OTHER LINKS:WEBSITE: promenadefield.comINSTAGRAM: instagram.com/promenadefieldFACEBOOK: facebook.com/promenadefieldPINTEREST: pinterest.com/promenadefield",
    "reviews": [
      "Great  customer service, great product - thanks!!",
      "Sorry for the super late review! My mom absolutely loved this! She was brought to tears. Thank you so much!",
      "Thank you so much! 😊 My mom loved it and it was exactly what I was looking for!",
      "loved this item and so did my family!"
    ]
  },
  {
    "productId": "VDotPYWjqn",
    "url": "https://www.etsy.com/listing/773369357/personalized-stuffed-teddy-bear-custom?click_key=719bf5d35193c8fb8e06f3b7ae698dcc774f9468%3A773369357&click_sum=15aa6001&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-44&etp=1&sts=1",
    "title": "Personalized stuffed teddy bear, Custom plush, Crochet bear",
    "description": "Personalized bear / Stuffed teddy bearThe size of the toy is approximately 14-16\" (36-42 cm).🚩 Attention! The colors of the toys on the screen may differ from the actual color of the yarn. It depends on the settings of your monitor and the batch of yarn.Thank you for visiting!To view my other products, please click here:https://www.etsy.com/shop/HappyToysByAnn/Care Instructions:Hand wash with temperature not more than 30°C (86℉). Dry on a towel on a horizontal surface.Do not hang. Do not wring. Do not iron.",
    "reviews": [
      "We got these as heirloom gifts for both of our sons and our niece. They are great quality. Highly recommend!",
      "Thank you so much for the beautiful work you do, great looking product, and well made.",
      "This is my second time ordering a teddy bear from Ann. They are the cutest I have seen, and extremely high quality. Thank you, Ann. We are still praying for you and Ukraine.",
      "Great quality and shipped faster that I thought it would."
    ]
  },
  {
    "productId": "IgaSGUSxnv",
    "url": "https://www.etsy.com/listing/1577605065/mini-custom-watercolor-cat-portrait-cat?click_key=9730ef0f7902a898c13de6fcab5104eccddd759c%3A1577605065&click_sum=45324f49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-45&pro=1&frs=1&etp=1&sts=1",
    "title": "Mini Custom Watercolor Cat Portrait, Cat Memorial, Cat Loss Gift, Cat Lover Gift, Pet Painting, Tiny Paintings, Miniature Painting",
    "description": "🐾 Cherish Your Pet's Love Forever! 🖼️This isn't your average print. Our custom pet portraits are hand-painted by talented artists and printed on high-quality paper. You'll see every brushstroke and tiny detail, making it a timeless keepsake.Your Happiness Matters 🤝🔍We won't ship until you're happy. You can request revisions, but most of our portraits are so perfect, they rarely need any changes. Each piece is tailored just for you.How to Order? 🛒📝1. Place Your Order 🛒: Select number of pets and size.2. Send Us a Photo 📸: After placing your order, send us a photo of your pet by messaging the seller.3. Receive a Proof 🎨: Our talented artist will hand paint your pet portrait and create a digital proof of your pet's portrait. We'll send this proof to you for approval.4. Approve the Proof ✔️: Take a look at the proof and let us know if you'd like any adjustments. Once you're thrilled with the design, give us the green light to proceed.5. Shipping 🚚: Your prints will be carefully packaged and shipped to your addressContact Us 📩🙋‍♀️Got questions? Need help? Shoot us a message! We're here to make your custom request a reality and ensure you're thrilled with your purchase.",
    "reviews": [
      "Absolutely perfect. Got this for my best friend’s birthday and I know she’ll love it. Seller was also super responsive and friendly throughout the whole process!",
      "Fantastic painting! Did a good job but took a long time to arrive",
      "Beautifully depicted our beloved bunny. Thank you for your talent and time.",
      "This made the perfect gift.  It isn't an actual painting...it's a print which is important to realize, but my recipient was happy."
    ]
  },
  {
    "productId": "GabtWolypW",
    "url": "https://www.etsy.com/listing/1437692912/one-line-drawing-custom-couple-portrait?click_key=bdaf6b2a5d14415b1e0f4cfe27ec220d4006a73f%3A1437692912&click_sum=550b0f6c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-46&frs=1&etp=1&sts=1",
    "title": "One Line Drawing , Custom Couple Portrait, Custom Family Gift, Personalized Wedding Anniversary Gift, Custom Line From Photo",
    "description": "Hello, welcome to my MAZPrintsStudio store.Create a beautiful custom portrait of your family or best friendsThese special portraits will capture the unique characteristics of each member of your family. You can add your pets too!Perfect for wedding gift, anniversary, birthday and more!How to order:1: In the first drop-down menu, select the number of people/pets you want.2: Place your order3: After purchasing the image, contact me via Etsy or etsmehmetzengin[!at] gmail.com.Send me the photos you want me to show.It is important that they are high-resolution and that the facial details are clear. !!We can discuss more details if needed, feel free to make a special request if you need something that is not in my shop.- What is the processing time?Processing time: 1 days, depends on the number of orders in progress.-If I need revision, how does it work?Revisions are free, if you need them please message me on Etsy.- How can I send you my photo(s)?To add your photos, you can send them to the Upload Seller or Contact icon (under the Store Owner's avatar) or to etsmehmetzengin [!at] gmail.com.If you send me multiple photos without specifying how to use it, I will choose the best one.IMPORTANT- This is Digital Files only. It will be sent to you immediately via email or link so you can print it at your home or at a local print shop.So you save cost and time. No shipping time,shipping cost and risk of damage.- You will get High Quality Files in JPEG and PNG files.- Have a deadline and need an urgent order? No problem, just contact me.",
    "reviews": [
      "So quick! Seller was super helpful!",
      "Good quality and quick delivery within 2 hours!",
      "This seller was excellent! They worked with me to create the exact illustration I wanted and I am so happy with the results. I highly recommend and I would order from them again."
    ]
  },
  {
    "productId": "YXqMIJfEnj",
    "url": "https://www.etsy.com/listing/1429949225/personalized-easter-egg-custom-wood?click_key=6dd9d6d484cc4283959fb981edbda9959d32df05%3A1429949225&click_sum=5da5917e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-47&frs=1&etp=1&sts=1",
    "title": "Personalized Easter Egg, Custom Wood Easter Egg, Easter Basket Gift, Personalized Easter Gift, 2023 Easter Gift Ideas, Kids --EGG-NW-ABC",
    "description": "Personalized Easter Gift 2023, New Easter Basket Gifts, Personalized Easter Gift, Custom Easter Eggs, Easter Gifts Ideas 2023, Easter Gift Ideas for Girls, Easter Basket Gifts for Boys, Easter Gift Ideas, Personalized Egg, Personalized Eggs, Wood Easter Eggs, Painted Easter EggsEtch This Out's new Personalized Easter Eggs are the perfect gift for your loved ones Easter Basket!Each Easter Egg features a professionally laser engraved design with your custom name or message.Our Easter Eggs have a flat base so they stand up, they are 2.5\" tall and 1.85\" inches wide.⚙️ Product SpecificationMaterial: Solid WoodSize: 2.5\" x 1.85\" inchesColor Options: Light Blue, Pink, Purple, Yellow, White, Raw Wood✅ Ordering & ProcessingWe make it our mission to process our orders fast and efficiently! You will be asked if you would like a proof upon adding your product to the cart. If you select No we will begin the production process right away for you! If you choose Yes on the proof, we will email you your proof of your order to ensure it is exactly how you envisioned it. We will work with you until you are completely in love with your new personalized gift and 100% satisfied with your order. Once we know you are completely satisfied with your and we receive your approval via email- Our team will start processing and making your unique gift!📦  Production ProcessIts time to get busy engraving! All orders are processed and shipped out within 24 hours of when we have received your approval of your proof.⏱️ Shipping TimesPlease be aware that shipping times may vary from 2-6 business days depending on the product and shipping class. First class mail generally takes 2-5 business days, while priority mail takes 1-3 business days to arrive.⭐ Satisfaction GuaranteeAt EtchThisOut, we know your are going to love your personalized product when you receive it. However If for any reason you are not satisfied with your order, we would be happy to assist you on replacing your item or fixing it for you.💲 Bulk OrdersWe are proud to offer bulk pricing on all of our products when purchasing 25 or more. Prices do vary based on the quantity you are looking for. Please send us a message about the quantity you are looking for and the zip code we will be shipping to.Personalized Night Lights Kids, Kid's Night Light, Children Night Lamp, Boys Room, Night Lights for Kids Kid’s Bedroom Decor, Children’s Lamp, Children’s Light, Personalized Night Light, Custom Night Light, Children’s Light, Kids Bedroom, Girls Room",
    "reviews": [
      "I bought 10 of these for my Easter table setting",
      "I bought 10 of these for place settings. Good quality. As expected",
      "Bought 10. Using as a place setting at Easter. Exactly as expected."
    ]
  },
  {
    "productId": "CATPjmuZbE",
    "url": "https://www.etsy.com/listing/1135946482/bridesmaid-proposal-monogrammed-cosmetic?click_key=d8e0804d685a2d7ba45ab475ec5ad29ae97d480c%3A1135946482&click_sum=53aa6378&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-679449-10-48&pro=1&etp=1&sts=1",
    "title": "Bridesmaid Proposal Monogrammed Cosmetic Bag Gift for her Personalized Makeup Bag For Bridesmaids Gift Christmas Gift Bridal Gift",
    "description": "Browse our collection of pajama sets, sleep shirts, dresses, robes and more at :https://www.etsy.com/shop/SSweddings🌸 THE ALBI MAKEUP BAGOur Albi makeup bag is such a great travel companion. Large enough to hold smaller shampoo bottles, deodorant, sunscreen, loofah, lotion, toothbrush and toothpaste, brush, and of course makeup! A favorite for bridesmaid gift, mother's day gifts. and a 'treat yourself' gift!Features and details :- Crafted from natural cotton canvas with genuine leather accents and piping.- Gold zip and accessories.- Gold, Silver, Rose Gold or Natural personalization offered for your makeup bag.We can fit everything from Names to Initial(s) or even your wedding initials and date!- Size : 8.85\" X 3.54\" X 5.9\" (L x W x H)- Available in 8 colors : Navy, Baby Pink, Tiffany, White, Black, Champagne, Deep Mauve and Lilac**When selecting \"No Personalization\" or \"Plain\" for Personalization, the bag comes without a leather label** Otherwise, personalized labels will be placed on the outside of the bags as depicted in the listing photos*CARE INSTRUCTIONSWe recommend these to be professionally cleaned to protect the integrity of the items.Our all-natural Cotton Canvas may have some slight color variation built into the fabric. Such natural occurrences may look like tiny spots left on the fabric, however this is simply a part of the natural nature of the handmade canvas:https://i.etsystatic.com/icm/c10851/537799726/icm_fullxfull.537799726_q4cq1531r9wo4kkkss4g.jpg?version=0https://i.etsystatic.com/icm/86f0bd/537799762/icm_fullxfull.537799762_a6tu18qoq8wggo0co04w.jpg?version=0",
    "reviews": [
      "Good\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood and on time",
      "Awesome product and fast shipping!",
      "Awesome product and fast shipping!"
    ]
  },
  {
    "productId": "INYrAqJPaw",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=11835f86b7de15264735c63ff7b7d0169f06ab59%3A747068567&click_sum=4811ec6a&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Would recommend this is a great gift",
      "I paid extra for this to be delivered by Christmas--and it came early :) Great responsiveness and its beautiful.",
      "The best! A great housewarming gift",
      "The item is nice but I thought it would be bigger for the price. To be fair, it’s my fault for not double checking the size before ordering."
    ]
  },
  {
    "productId": "ZBwpaPLAHs",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=fece19accd4cdbdbe7c17b026ff378052ca4d39a%3A1115114382&click_sum=4544adf1&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!",
      "They are going to love them"
    ]
  },
  {
    "productId": "RBmcfXiuPD",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=b6afa862e89b2ff22e8516d2eda068ae42ebd017%3A654638870&click_sum=8dfc65a3&ref=search_recently_viewed-3",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "gCEpmjhKvQ",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=c19061222a7eefe21432d3ee34c2d927781b1b30%3A1355783916&click_sum=1d1cc59e&ref=search_recently_viewed-4&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!",
      "This amazing hand sketch really captures the soul and spirit of the loving couple - thanks to the wonderful work of M Gokhan who was able to  catch every nuance of expression in the original photo  - a beautiful memory to cherish!!"
    ]
  },
  {
    "productId": "GUvgsFqCAy",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=00f2fae5a47213dd0d1e185d62faaebeb357962b%3A1411614241&click_sum=ca357392&ref=search_recently_viewed-5&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!",
      "Beautiful product.  Arrived early.  Highly quality"
    ]
  },
  {
    "productId": "uVCDcKdLIA",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=b7dd1aca18b2162de2a0144da12a5db8f4f981d0%3A999136086&click_sum=9fce337d&ref=search_recently_viewed-6",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  }
]
