[
  {
    "productId": "YgroVRZytD",
    "url": "https://www.etsy.com/listing/1557396092/14k-gold-egypt-cartouche-necklace-egypt?click_key=25d70500311d4c456738dcd85f8355068612560e%3A1557396092&click_sum=e0dfe288&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-1&pro=1&frs=1&bes=1",
    "title": "14K Gold Egypt Cartouche Necklace, Egypt Name Necklace, Personalized Gifts for Her, gyptian Hieroglyphic Cartouche Jewelry, Ancient Symbol",
    "description": "DETAILS• Materials : High Quality Solid 925 Sterling Silver• Finish : Sterling Silver / 14k Gold / Rose Gold- Not Tarnish problem. Definitely not gold plated or gold filled.• Chain Types : Standart / Vine / Box / Figaro / PaperclipChains have patents and stamps. (925K)CHAIN LENGHT14 inches (36 cm) - Age 5 years or Under15 inches (38 cm) - Choker16 inches (41 cm) - Age 6-18 years18 inches (46 cm) - Most popular size for women• Check the infographics for your model choice and necklace length.• The length option is the TOTAL chain length (including the charm). If you order an 16\" chain, the piece will come as CHAIN + NAME = 16\"• All jewelry is designed with +2'' cable chain extender. You can be flexible when it comes to finding the necklace length that suits you best.BEST GIFT• Ours jewels can be a special gift for your lover, boyfriend or girlfriend, best friend or family. Each jewelry will be packaged in a beautiful gift box, suitable for Birthday, Graduation, Anniversary, Christmas, Thanksgiving Day, Party Wedding and Valentine's Day.PACKING• All items are nicely packaged ready to gift in elegant jewelry boxes.SATISFACTION GUARANTEEYour satisfaction is always our priority. Please feel free to contact us if you have any questions or requests regarding your jewelry.NOTEIf you can't find the information you need or need some advice for your design?Feel free to contact us.HOW TO ORDER• Choose the finish you prefer• Choose the necklace length and chain style you prefer•  Please review the Egyptian alphabet table. Please tell us the name you want in the personalization section. Max 9 letters.FOR MOREhttps://www.etsy.com/shop/UXVJewelry",
    "reviews": [
      "Love!!!!! Item as described. Perfect",
      "Beautiful item, just as described!",
      "Thank you very much 🧡",
      "It was a gift so I didn’t see it, but the gift receiver is happy with it.",
      "Thank you very much 🧡",
      "Exactly what it looked like online!",
      "Thank you very much 🧡"
    ]
  },
  {
    "productId": "pobUsIZGih",
    "url": "https://www.etsy.com/listing/1478828224/gift-for-dad-magnetic-knife-block?click_key=07641f67bbef3faef8c56995c1d079d55b2bc1ef%3A1478828224&click_sum=b0e3a312&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-2&pro=1&frs=1&bes=1&sts=1&search_preloaded_img=1",
    "title": "Gift for Dad, Magnetic Knife Block, Father's Day Gift, Birthday Gift for Dads, Personalized Gift for Men, Engraved Knife Stand, Gift for Him",
    "description": "-------------------------PRODUCT DETAILS--------------------------- Holds up to 14 knives (this number can vary if larger knives or other cutlery pieces are being used.- Using a knife block protects the end of the knife and keeps it sharp.- High quality walnut wood.- Measures 12\" x 9\" and weighs approx. 6lbs.- Base measures 12.5\" x 4\" x .75\".- Reduces clutter and preserves counter space in the kitchen!- Easy to clean! Just wipe with a damp cloth.- Light assembly required- Not every knife block will look exactly the same. Naturally occurring shade color and wood grain variations (including knots, notches, swirls) are inherent to the material.- Knives are NOT included with your purchase.- FREE SHIPPING on orders $35+- RUSH ORDERS available:https://etsy.me/2XbpDlk-----------------------PERSONALIZE IT!-----------------------We'll personalize the knife block by laser engraving either your own custom text or the recipient's name/initials Choose one of our 3 designs or you can receive the knife block blank with no personalization.If choosing to personalize with two lines of custom text, please note that it is up to you to indicate which text is on line 1 and on line 2. If we don't receive instructions, we will use our best judgement on what best fits the engravable space.We also offer the ability to customize with a company logo or custom design. Contact us to discuss our corporate gift program.-----------------------------------------TIMELINE AND RUSH ORDERS-----------------------------------------We laser engrave the magnetic knife blocks in the Kansas City area and they'll be ready to ship 2-4 business days after your order is placed.In a hurry? Our optional rush upgrade is $14.95 regardless of the size of your order. This service guarantees that your order ships by the end of the next business day, shaving 2-3 business days off of our production time. Read more and add to your cart here:https://etsy.me/2XbpDlk.-------------------------------YOU MIGHT ALSO LIKE-------------------------------Wooden Desktop Speaker:https://etsy.me/45AfwspWine Chiller Tub:https://etsy.me/42cJMH4Custom BBQ Set:https://etsy.me/3C0qpX5------------------------------------------------------------A UNIQUE FATHER'S DAY GIFT FOR FOODIES-------------------------------------------------------------Our Personalized Magnetic Wooden Knife Block is a one-of-a-kind Father's Day gift that will be the perfect addition to his kitchen or cooking station!  We'll engrave your custom text -- or the recipient's initials or monogram on the front of the block (middle center). This engraving placement is positioned to be visible even when knives are placed on the stand.This custom piece is more than just a handsome centerpiece -- it's a much needed kitchen décor accessory that will keep your knives organized and accessible while keeping them sharp and for the next night of cooking. The block is crafted from beautiful walnut wood (with each piece boasting its own unique wood pattern).  Inside the wood block are powerful magnetic strips that will hold your knives, scissors and other cutlery accessories  in place. The size of the knives doesn't matter as the magnets are powerful enough to prevent sliding.Add this piece to your kitchen today -- or present to dad the next time you need a great personalized gift for him that's sure to impress",
    "reviews": [
      "This was a beautiful item.",
      "Perfect gift, high quality wood and strong magnets.",
      "I got this as a Christmas gift for my parents since they were tired of typical plastic and wooden knife blocks. This helped make the kitchen look cleaner amd overall much cleaner.\nWe've gotten a few tiny scuffs over the last few months due to family members not being careful, but nothing beyond normal wear and tear. \nThis was an absolutely lovely purchase.",
      "He really loves the quality!"
    ]
  },
  {
    "productId": "zOlmCiFvcN",
    "url": "https://www.etsy.com/listing/1531902969/dog-name-necklace-personalized-dog-ears?click_key=6537b7e621bc5093693bbc805a39daad86b6e7ba%3A1531902969&click_sum=b31eff8e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-3&pro=1&frs=1&bes=1&sts=1",
    "title": "Dog Name Necklace | Personalized Dog Ears Necklace | Custom Pet Jewelry | Pet Name Necklace | Pet Memorial Gift, Gift for Her,Christmas Gift",
    "description": "Dog Name Necklace, a personalized piece of jewelry that celebrates the special bond between you and your beloved furry friend. Crafted with love and attention to detail, this necklace is the perfect way to keep your pet close to your heart wherever you go. Each Dog Name Necklace is custom-made with your dog's name beautifully engraved on a dainty nameplate pendant. With 925 sterling silver, create a necklace that suits your style and preference. Our skilled artisans carefully handcraft each necklace to ensure the highest quality and craftsmanship. The attention to detail is evident in every curve and line, making each piece a unique and cherished keepsake. The Dog Name Necklace is not only a wonderful way to honor your furry friend but also a meaningful and thoughtful gift for any dog lover. Surprise a friend or family member with a personalized necklace featuring their pet's name, and watch their face light up with joy. Wearing the Dog Name Necklace is a beautiful reminder of the love and joy that our pets bring into our lives. It's a conversation starter and a way to share the story of your beloved pet with others.💎 All our dainty jewelry are handmade with love!➜ Material: REAL 925 STERLING SILVER➜ Finish: STERLING SILVER • 18K GOLD • ROSE GOLD❤ P E R F E C T    G I F T   C H O I C E ❤🐶 Dog Name Necklace İs packed in a delicate gift box.  This Necklace is perfect for gifting on any occasion, whether it's for a birthday, anniversary, Christmas, Mother's Day, Valentine's Day or just because. It's a thoughtful way to show your loved one how much you care, and it's something they can cherish for years to come.⚠️ If you do not add font, I will create it with F-2. Please ensure to take note of this while completing the order. !!!!Dog Ears:Ear 1 - AkitaEar 2 - Alaska MalamuteEar 3 - Australian CattleEar 4 - Australian ShepherdEar 5 - BeagleEar 6 - Belgian SheepdogEar 7 - Bernese MountainEar 8 - BichonEar 9 - Boston TerrierEar 10 - Basset BoundEar 11 - BoxerEar 12 - Border CollieEar 13 - BulldogEar 14 - Bull TerrierEar 15 - Cane CorsoEar 16 - Charles SpanielEar 17 - ChihuahuaEar 18 - ChowEar 19 - Cocker SpanielEar 20 - CollieEar 21 - CorgiEar 22 - DachshundEar 23 - DobermannEar 24 - Dogo ArgentinaEar 25 - DalmatianEar 26 - English PointerEar 27 - English MastiffEar 28 - French BulldogEar 29 - German ShepherdEar 30 - Golden RetrieverEar 31 - GreyhoundEar 32 - Great DaneEar 33 - HuskyEar 34 - Jack RussellEar 35 - Labrador RetrieverEar 36 - Miniature PinscherEar 37 - MatteseEar 38 - PugEar 39 - PomeranianEar 40 - PoodleEar 41 - RottweilerEar 42 - Saint BernardEar 43 - SchnauzerEar 44 - SamoyedEar 45 - Staffordshire TerrierEar 46 - Shih TzuEar 47 - Shiba InuEar 48 - Staffordshire BullEar 49 - Tibetan MastiffEar 50 - Yorkshire TerrierNotice:> Our products are small.> Check out the wearing photos.> It is a small piece of jewelry with meaning.> Although plating products have advantages, they also have disadvantages.> Stay away from water and soap.> If the color is discolored, try removing it with a silver cleaner or toothpaste.➤Production TimeAll items are custom made to order. Production Time is about 3 - 5 business days. This can change during peak seasons.😊 Thank you so much choosing me.ABOUT LIBRAMINIMALISThttps://etsy.me/3VhKTmKFor other jewelry in my store, please CLICK:➤https://etsy.me/3VkEoQ0",
    "reviews": [
      "Great customer service. I purchased the Cattle dog ear style and they accommodated having it not personalized. It’s a very cool necklace.",
      "Exactly as pictured, absolutely adorable!!!!",
      "Ordered as a gift for myself after my little guy passed away. Arrived on time and I haven't taken it off since. Great price - love it!",
      "a great gift for any dog lover :)"
    ]
  },
  {
    "productId": "gThNtbmasb",
    "url": "https://www.etsy.com/listing/1340787406/personalized-genuine-leather-belt?click_key=39b6f6526f76896460f65dda1c82aa05505886f7%3A1340787406&click_sum=10793478&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Genuine Leather Belt, Valentines Gifts for Him, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Bronze Gifts for Men",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Personalized Genuine Leather Belt, Christmas Gifts for Him, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Bronze Gifts for MenThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Personalized Genuine Leather Belt, Father's Day Gift, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Gifts for Him, Long Distance",
    "reviews": [
      "great gift to my husband he wears it all the time!",
      "Beautiful work and great service from the seller!",
      "Such a beautiful belt! The lettering is perfect! Thank you!",
      "Excellent gift for my fiancé it looks perfect!"
    ]
  },
  {
    "productId": "n7SM8dBUlG",
    "url": "https://www.etsy.com/listing/1351031649/personalized-mens-bracelet-in-custom?click_key=c90b9a9e435e64a7b4ec185ada492e511d3fb030%3A1351031649&click_sum=be726d1b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-1&pro=1&etp=1&sts=1",
    "title": "Personalized Mens Bracelet in Custom Size, Handmade Leather Jewelry with Silver Beads, Christmas Fathers Day Gifts For Him Kid Dad Boyfriend",
    "description": "Handmade jewelry! A perfect gift for him!This handmade personalized bracelet is made of high quality leather and customizable silver beads, making it a unique and thoughtful gift for your spouse, a friend, or a member of your family. Additionally, these are wonderful presents for birthdays, anniversaries, Christmas, Valentine's Day, Mother's Day, Father's Day, and other special occasions.This personalized bracelet features a handsomely braided band that fastens with a sturdy  magnetic clasp.★IMPORTANT NOTES:*If the existing sizes are not suitable for you, we can make bracelets in any size. Simply include the size in the notes to seller or personalization box, or message us.* Generally, adult men sizes range from 7.5 to 8.5 inches and the most common size is 8 inches.★ ABOUT THIS ITEM:Material: 925 Sterling Silver + High Quality genuine leather braid wrist bandSize: From 6\" to 8.5\" Just let us know if you need different size other than those provided above.★INSTRUCTIONS FOR CUSTUMIZATION:Choose the Number of Beads (up to 15 beads)Write a phrase (up to 15 characters) on each bead and select your symbols from the symbols photo.Example: 1- Neil 2- Tara 3- Lionel (symbol 3)Please double-check your grammar and formatting because we will personalize everything exactly as it appears on the screen.★IS THIS A GIFT?Don't worry; it is packaged beautifully and is prepared for gift-giving!If you place multiple orders, we'll bundle everything in a single gift box. If you would like them to be packaged separately in individual gift boxes, please send me a note at the time of purchase.",
    "reviews": [
      "I got this for my husband's birthday with his mom, dad and his name.  He loved it",
      "My husband loves the bracelet. The quality exceeded expectations.",
      "Got this for my husband for our anniversary and he absolutely loves it!",
      "Product was as advertised and the quality is really nice! I needed help with my purchase and they were very prompt in responding and so helpful!! I would definitely purchase from here again!"
    ]
  },
  {
    "productId": "fRGmcLmap1",
    "url": "https://www.etsy.com/listing/1442056111/personalized-gift-for-bride-bride?click_key=eea0762cd2ac78685364717db4f346d027d7d15c%3A1442056111&click_sum=6940e960&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-2&pro=1&frs=1&pop=1&sts=1",
    "title": "Personalized Gift For Bride, Bride Sweatshirt, Initial Heart Sleeve, Engagement Gift, Unique Bridal Shower Gift, Future Mrs Sweatshirt",
    "description": "Our bride sweatshirt is the perfect engagement gift to bring to a bridal shower! The future mrs will be cozy yet chic while wedding planning in this minimalistic, embossed style sweater. Personalize the left sleeve with the initials of the couple to make it even more special when the bride to be looks at her engagement ring.I T E M ∙ D E T A I L S• Crewneck Sweater, 50% cotton, 50% polyester• Unisex Sizing: S, M, L, XL, 2XLCare Instructions: Machine wash cold. Tumble dry low or hang to dry. Wash inside out. Do not iron or dry clean.P R O C E S S I N G ∙ & ∙ S H I P P I N G• All items are custom made to order with love and care in our California workshop.• Orders are typically processed and shipped within 1-3 business days. This may change during the holiday season, please view current posted processing times!• Need it by a specific date? Please contact us to check if we can meet your deadline. We also have expedited shipping options available at check-out!R E T U R N S ∙ & ∙ E X C H A N G E SSince items are made to order we do not accept returns or exchanges. Please make sure that your personalization information is correct and reach out if you have any questions.In the rare event that you receive an item with the wrong personalization or it arrived damaged please do not hesistate to message us with a photo of the item for a free replacement!---S H O P ∙ M O R Ehttps://www.etsy.com/shop/LoveSuna♡ Handmade with Love, Suna",
    "reviews": [
      "Arrived quickly and was exactly how was described.",
      "Great sweatshirt. Nice quality and weight.",
      "This was great gift.  Seller was amazing",
      "Love the shirt - my daughter will love it too."
    ]
  },
  {
    "productId": "vthSvLghXC",
    "url": "https://www.etsy.com/listing/236276178/copper-rose-7th-anniversary-personalized?click_key=a78785100280330b08ce30de1a2fd252a66c8fb9%3A236276178&click_sum=783f0a05&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-3&pro=1&frs=1&etp=1&sts=1",
    "title": "Copper Rose - 7th Anniversary Personalized Wedding Gift",
    "description": "For a 7th anniversary gift with class, our hand-forged copper rose is a timeless piece designed to capture the timeless beauty of your love.Whether it be 7 years of wedded bliss, 7 marvelous years of motherhood, or 7 years of fabulous friendship, this carefully handcrafted and unique gift will outlast other trinkets and is the perfect way to mark your milestone with your wife, mother, or friend!For an extra special touch, add her name or a special day using our unique personalization feature.- This sculpture is approximately 8.5\" tall.- All sculptures are made with pure iron, with no flimsy or cheap fillers.- All sculptures are powder coated for an elegant, glossy, and long-lasting finish.- Every sculpture is handcrafted in an authentic blacksmith shop in Quebec, Canada.S H I P P I N GFor US and Canada: please allow 4 to 8 business days (processing + shipping) to receive your order.Faster shipping is available upon request. Please notify us before your order is placed so we can adjust the invoice for the additional cost.We can't guarantee a delivery date - even with expedited shipping - but we will do everything we can to get your item to you on time.For international orders: please allow 2-4 weeks for delivery. All customs and import fees are the responsibility of the buyer.Follow us on Instagram for more updates! https://www.instagram.com/alainsblacksmithshop/",
    "reviews": [
      "Beautiful, my wife loved it.",
      "Quick shipping and a great product, seamless experience",
      "This item is absolutely stunning and my partner loved it as an anniversary gift. Beautiful detail. Arrived quickly from Canada and was well packaged. Would definitely recommend to anyone else looking for an original gift"
    ]
  },
  {
    "productId": "DyUZFtgtoN",
    "url": "https://www.etsy.com/listing/1510963384/personalized-jewelry-box-bridesmaid?click_key=cfddccf1581f66c847ccfa80843860cc233e20c5%3A1510963384&click_sum=27f79247&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-4&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Jewelry Box, Bridesmaid Gifts, Wedding Favors, Custom Velvet Jewelry Box, Travel Jewelry Case, Mother's Day Gift, Gift for Mom",
    "description": "💕Personalized jewelry boxes are a cute gift for women. It’s a practical and memorable gift for them.  This gorgeous Jewelry Box is also a perfect proposal gift, thank you gift, birthday gift, maid of honor gift, mother's day gift, and much more... It can be used to store several rings, earrings, and dainty bracelets or necklaces and is perfect for travel!Want it faster? Expedited Production & Expedited Shipping Service is available.See this link:https://www.etsy.com/listing/1373117202- Size : 3.2''x3.2''x1.6'' (8.0cm x 8.0cm x 4.0cm)  Weight : 0.17Ib (77g)- Font color  (Gold by default)- Permanent Heat Stamp (Not just a sticker)- Material: Italian Velvet- The Box has a zip close with square embellishmentEach box is personalized with the name of your loved one, top quality guaranteed.",
    "reviews": [
      "Amber is amazing to work with",
      "The jewelry box I ordered looked as pictured.",
      "This Item was as expected",
      "The perfect case for jewelry!"
    ]
  },
  {
    "productId": "xGApdYGsxd",
    "url": "https://www.etsy.com/listing/933297264/personalized-water-bottle-custom-water?click_key=4a113fd7ba47511987098b08a22de45c58d00879%3A933297264&click_sum=f791a6e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-5&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Water Bottle, Custom Water Bottle, Personalized Gifts for Her, Engraved Insulated Water Bottle & Straw Lid - Name Bottle",
    "description": "Water Bottle Personalized w Logo or Design - Custom Water Bottle, Stainless Steel - Personalized GiftsOur Bulk Prices--------------------------------18OZ - 2PC $54.9518OZ - 3PC $74.9518OZ - 6PC $129.9518OZ - 10PC $199.95--------------------------------24OZ - 2PC  $59.9524OZ - 3PC  $79.9524OZ - 6PC  $149.9524OZ - 10PC  $229.95--------------------------------32OZ - 2PC  $62.9532OZ - 3PC  $84.9532OZ - 6PC  $159.9532OZ - 10PC  $239.95--------------------------------40OZ - 2PC  $69.9540OZ - 3PC  $87.9540OZ - 6PC  $164.9540OZ - 10PC  $249.95Our bottles are BPA-free but not dishwasher safe.****If you need a custom design please contact us before placing your order.****PREMIUM INSULATED WATER BOTTLE - Stay hydrated in style with a sleek bottle that takes care of your favorite drink. 18, 24, 32, 40 oz. powder coated water bottles are made of stainless steel and have double-walled insulation, which means your beverage will stay hot for 12 hours and cold for 24 hours. Easily fill your bottle with ice and clean it through the wide mouth opening.CUSTOMIZE ON YOUR OWN - Select your size, color & design then enter your customization which fits with your selective design. Laser engraving will remove the paint on the tumbler, exposing the smooth stainless steel. Our products are crafted to be as unique as you are, and designed to inspire the community with others. Choose your color and design to create your own bottle that is perfect for your lifestyle.MULTIFUNCTIONAL - Note: Fits any cup holder. For sports, fitness, gym, traveling in your car, staying hydrated at work, drinking soup while camping, enjoying hot, piping coffee, iced cold water, and so much more.ECO-FRIENDLY - Safe, healthy alternative to plastic bottles and cups. Reusable, unbreakable, and easy to wash. Eliminate single-use cups and waste and buy this cup that lasts a lifetime. Help save the world!!!! KINDLY NOTE: HANDWASH ONLY !!!FAST SHIPPING: We ship orders in 2 Business days. If you have any questions, please contact our customer service and we will reply shortly.",
    "reviews": [
      "GOOD QUALITY. Fast shipping. As descrive.",
      "It was perfect, worth every penny!",
      "I love so much ❤️"
    ]
  },
  {
    "productId": "hpaSxrkvTn",
    "url": "https://www.etsy.com/listing/725632748/leather-bracelet-with-heart-charm-custom?click_key=faf3b298b7a1f862d4ef0687cabc9a2604a17c94%3A725632748&click_sum=a838f572&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-6&etp=1&sts=1",
    "title": "Leather Bracelet with Heart Charm - Custom Engraving - Adjustable Strap - Multiple Colors - A Perfect Gift for Her - A164",
    "description": "This chic bracelet is crafted from premium Nappa leather, offering a skin-friendly and comfortable fit. Adjusting its size is a breeze with a simple tug on the two knots. Personalize it with an engraving of your choice on the heart-shaped charms to make it uniquely yours.✧ Specifications • Leather band thickness: approximately 0.25 cm • Charm size: about 1 cm • Bracelet length: adjustable from 4 to 8.5 inches (fits nearly all wrist sizes)✧ Colors/Materials • Nappa leather (Genuine leather) • Silver - Polished stainless steel • Gold - 18k gold-plated stainless steel • Rose gold - Rose gold-plated stainless steelOur high-quality plating is durable and resistant to fading. Stainless-steel jewelry is robust, rust-free, nickel-free, and hypoallergenic, making it unlikely to cause allergic reactions. It also resists tarnishing and discoloration.✧ Engraving Details • Maximum of 10 letters or one symbol per charm • Engraving examples:Charm: Anna (G03)Charm: \"C4\"✧ Engraving Ideas • Name • Word • Date • Initials • Symbols • Or even without engraving✧ How to OrderSelect your desired options from the drop-down menuIn the note box, specify your engraving request and font styleAdd to cart and proceed to checkout✧ Important Notes • If no font preference is provided, we will choose one for you. • Please understand that personalized or custom-made products are not eligible for exchange or return. • Follow the included care instructions to ensure the longevity of your jewelry.✧ About VIVIANNA • Each piece of jewelry is lovingly handcrafted to your specifications in the VIVIANNA workshop in Hamburg. • We do not mass-produce; each product is made just for you. • We commit to using only high-quality materials.",
    "reviews": [
      "The product is very good.",
      "Great and shipped quickly. Thanks",
      "Super fast and friendly transaction :)"
    ]
  },
  {
    "productId": "ioXKeTGPIo",
    "url": "https://www.etsy.com/listing/888004774/farmhouse-monogram-throw-personalized?click_key=7aa41e2266aaa55e44c718e2bd1803f24d818a05%3A888004774&click_sum=f0fe10a4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-7&pro=1&frs=1&etp=1&sts=1",
    "title": "Farmhouse Monogram Throw - Personalized Blanket with Name - Personalized Gift - Corporate Gift - Soft Herringbone Stripe Blanket with Tassel",
    "description": "--- PERSONALIZED  BLANKET ---This cozy-soft, Farmhouse Throw is 67\" x 51\" and comes with a personalized laser engraved leatherette patch. You choose the throw blanket color and leatherette patch color. These throw blankets make great gifts for anniversaries, weddings, housewarmings, Christmas and many more special occasions. Tell us the information you would like engraved on the patch in the Personalization area at checkout.--- BLANKET DETAILS ---- Soft Throw Blanket with tassels- Patch Location: Corner- 100% polyester- Dimensions: 67” x 51”- HAND WASH & AIR DRY--- PILLOW COVER DETAILS ---- Herringbone (on both sides)- Zipper closure- Patch Location: Corner- 100% polyester- Dimensions: 12” x 20”- Pillow cover only (insert not included)- HAND WASH & AIR DRY--- Add WRAP---- Gift wrapped in a canvas bag with our signature bow and handmade wood tag.",
    "reviews": [
      "We received this item just as promised.  We were able to preview the monogram before completion to ensure it was exactly what we were looking for.  100% satisfied!",
      "My fiancé and I bought these for one of our parents wedding gifts. We love them! They are perfect and we will def be ordering more from this shop 💕\nAdditionally the shipping was great. We’ve been ordering a lot for our big day and this was the easiest and most timely delivery thus far.",
      "Great blanket! I love the quality!"
    ]
  },
  {
    "productId": "gmMHArkbYu",
    "url": "https://www.etsy.com/listing/1045257406/mysterious-heart-anniversary-gift-hand?click_key=297f96336f002a5d7fddcfff4b8b7df51a2e4439%3A1045257406&click_sum=f21a2272&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-8&frs=1&etp=1",
    "title": "Mysterious heart | Anniversary gift hand forged heart gift with Personalization, Personalized gift, Unique love decoration, 6th anniversary,",
    "description": "Looking for a unique and personalized gift that will steal your loved one's heart? Look no further than the Mysterious Heart, a hand-forged heart-shaped decoration that will make any occasion special!Are you struggling to find the perfect anniversary gift for someone special in your life? Do you want to give them something that shows how much you care, but nothing seems quite right?It can be tough to find a gift that is both meaningful and unique. You want something that stands out and captures the essence of your relationship. And let's face it, most gifts end up collecting dust on a shelf or in a closet.But fear not more! The Mysterious Heart is the perfect solution. This hand-forged heart-shaped decoration is a beautiful and personalized gift that will show your loved one just how much they mean to you.With its customizable personalization, the Mysterious Heart is a one-of-a-kind gift that will be treasured for years to come. It's the perfect way to express your love and appreciation for your partner, mother, or any other special person in your life.Hand-forged with care and attention to detailPersonalized with your chosen text or messageMade from high-quality materials that will last a lifetimeCan be used as a decoration in any room of the houseComes in a beautiful gift box for easy giftingWorried about the quality of the product or the personalization process? Don't be! The Mysterious Heart is made with the highest quality materials and crafted with care to ensure it meets your expectations. And our easy-to-use customization process ensures your message will be just right.Don't wait too long to order the Mysterious Heart! Because it's handmade and personalized, we have limited stock available. Order now to ensure you get yours before they're gone!Ready to give the gift of love with the Mysterious Heart? Click \"Add to Cart\" now to start the customization process and give your loved one a gift they'll never forget!Dimensions of the heart:Height : 12cm/5.5 inch maximum letters: 21Width :  10cm / 3.9inchThe base has 2cm/0.8in.",
    "reviews": [
      "We loved it and couldn't be happier!",
      "Blah blah blah blah blah",
      "a very unique 6th anniverary gift for my husband that is personalized",
      "Great item!\nGreat communication from seller!!\nFAST shipping!!!!"
    ]
  },
  {
    "productId": "vXYdvhZOGY",
    "url": "https://www.etsy.com/listing/1304367412/personalized-duffle-bag-dopp-kit-bag?click_key=907054effaadc9799d75ae03c176bf52ca71bbe6%3A1304367412&click_sum=5467a975&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-5&pro=1&frs=1&bes=1",
    "title": "Personalized Duffle Bag Dopp Kit Bag Luggage Tag Combo Gift, Best Groomsmen Gift, Christmas Gift, Leather Toiletry Bag, Leather Duffle, Gift",
    "description": "DETAILS:Premium Quality Handmade X-Large Leather Dopp Kit/Toiletry Bag, Duffle Bag and Luggage Tag Combo GiftMade with best quality full grain real leatherOne zippered pocket inside of the bag and 3 other small pockets in duffle bagDuffle bag has shoe compartment.Includes: 1 XL Duffle Bag with Shoulder Strap, 1 Luggage Tag for Duffle Bag, 1 Toiletry/Dopp Kit BagPerfect gift for every occasion. Anniversary, Birthday, Wedding, Engagement, Graduation, Mother's Day, Father's Day, Thanksgiving,Christmas, Valentine’s Day, New Year, Groomsmen GiftSHIPPING:Free ShippingSame Day ProductionFast Shipping ( Usually being delivered in USA in 3-5 business days )BAG SIZES:XL DOPP KIT:9.5” x 4.5” x 4.5” InchesXL DUFFLE BAG:21” x 11” x 11” InchesLUGGAGE TAG:3.2” x 4.25” InchesCOLOR OPTIONS:Black, Dark Brown, Light BrownPERSONALIZATION:We will emboss your requested personalization to the front right bottom corner of the dopp bag and front center of the luggage tag for the duffle bag.Please specify your personalization text to the personalization section!You can use letters A-Z, a-z, numbers 0-9, symbols ❤️ , . : ’ ! , & -Initial: Max. 4 CharactersName Max. 10 Characters",
    "reviews": [
      "This was a gift for my son in law and he loves it.  Very high quality and well made.",
      "Smells great! So excited to give it to my boyfriend. He really needed a nice leather good. ((:",
      "Received the bag in record time!  Beautiful leather",
      "This bag is wonderful and sturdy. I bought the bag as a gift. The quality is really nice. However, it took the bag a bit longer to arrive than originally expected. Overall great purchase!"
    ]
  },
  {
    "productId": "LehegFjpDV",
    "url": "https://www.etsy.com/listing/1536133569/personalized-engraved-whiskey-barrel?click_key=22dab9ff8c07e394e347a7462cdfad99ca7f72ae%3A1536133569&click_sum=f7273783&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-6&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Engraved Whiskey Barrel Mini Wood Whiskey Barrel | Wedding Gift | Groomsmen Gift |  Birthday Gift | Wood Barrel | Gift for Him",
    "description": "This is a perfect gift for groomsmen, for a wedding party, or for Father's Day, or for many other occasions!This whiskey barrel is fully functional and can be used to store whiskey or whatever drink of your choice! The inside is lined with a plastic bag, fillable through the spigot, to help keep your barrel clean and to last a long while.This is a steel banded Barrel/Cask and it comes with its own stand (optional), removable spigot and removable bung.Dimensions:3L  - 9 1/4\" long by 6 1/4\" wide, 2 pounds1.5L  - 8 1/8\" long by 5 3/8\" wide, 1.6 pounds",
    "reviews": [
      "The barrel came in extremely quickly and is absolutely gorgeous. The quality is amazing and the etching was correct first time go. My to be wife and I will be filling it on our wedding day. I accidently ordered one that was smaller than I anticipated, but it is so pretty that my partner insisted keeping the size as she wants to display it full time after the ceremony and I have to agree. Couldn't be more pleased.",
      "Looks great haven't got to use yet",
      "My husband loves it, can't thank you enough!",
      "Shipping was very quick. Thank you very much!"
    ]
  },
  {
    "productId": "yosTUcCOnb",
    "url": "https://www.etsy.com/listing/1547143565/handmade-damascus-steel-pocket-gift-for?click_key=28b2149f6740fb8f66e81609f1a52ff04c148622%3A1547143565&click_sum=a5cba1ef&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-8&frs=1&sts=1",
    "title": "Handmade Damascus steel Pocket Gift For Men Groomsman Personalized Gift Wedding Anniversary Gift for Boyfriend Personalized Valentine's day",
    "description": "This is Handmade  steel Damascus Steel Pocket Gift with Leather Pouch-Totally Handmade-Razor Sharp-Personalized Gift-Wedding Gift-Anniversary Gift-Groomsman Gift-Mother's Day Gift-Father's Day Gift-Boyfriend Gift-Husband Gift-Valentine's Day Gift-Thanksgiving Gift-Christmas Gift-New Year Gift-Halloween GiftBirthday GiftProduct Details :Total Length : 7.5\"Blade Length : 3\"Handle Length : 3.5\"Handle Material:Red & Grey steel Clip Inlay & BolsterInclude Leather StrapAbout Product & Services ReviewHonourable Buyers! before leaving a 1 star Review or opening a case against our product and services Please you must send us the message about the problem you have faced with us.We will try to assist you with in no time to make you happy .Age Restriction :You must be 18+ to buy this Product.",
    "reviews": [
      "Great product, very quick delivery, would recommend.",
      "It came exactly as advertised",
      "Great quality nice to hold. Arrived really quickly! Will be great to give next month for our anniversary ❤️",
      "Item is alright but a bit ‘cheap’"
    ]
  },
  {
    "productId": "riazWWhbzb",
    "url": "https://www.etsy.com/listing/841369872/wedding-song-lyrics-engraved-wooden?click_key=fa25b07dec754512fc850a1f2f3ff4fb7775ee04%3A841369872&click_sum=ceb1cfae&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Wedding Song Lyrics Engraved, Wooden Anniversary Gift, First Dance Lyrics, 5th Anniversary, Wood Anniversary, Wedding Gift, 1st Anniversary",
    "description": "Wedding Song Lyrics Engraved, Wooden Anniversary Gift, First Dance Lyrics, 5th Anniversary, Wood Anniversary, Wedding Gift, 1st AnniversaryThis custom engraving made with your own wedding song lyrics or vows makes a great gift for an engagement, an anniversary, or a wedding!  These plaques are engraved with your wedding song.  Perfect gift for the 5th year \"wooden anniversary.\"Maybe you're a bridesmaid or a maid of honor looking to give a very special gift to the bride & groom.. look no further!  We have them!Made to order with your own text, vows or song lyrics!Item pictured is approximately 9\"x12\"x3/4\"I will do my best to send you a proof within 24 hours of your request.This is 3/4\" hardwood Walnut, Maple or Cherry that is engraved with your desired wedding song or other text.These are not cheap plywood pieces, these are hardwoods and will last a lifetime and can be passed on to family members over time.Each and every wedding song will be triple sanded and then cleaned and then an oil will be applied.  There is no stain used in this process.  This is the natural appearance of the wood once our oil is applied.Please send us a message if you have something else in mind that you would like engraved and we will be glad to see if we can accommodate whatever that may be.Please keep in mind that each piece of wood will be unique.  Item received may not look identical to what is pictured.",
    "reviews": [
      "Beautiful job! Nice customer service as well as quick shipping!",
      "Beautiful piece of artwork! I loved this gift to my husband, he was amazed! Thank you!",
      "A beautiful piece.  Shipped quickly. I was able to double-check the lyrics and our names and date in the format it would show on the product so I knew it would be right during the unwrapping."
    ]
  },
  {
    "productId": "RGduoavyYV",
    "url": "https://www.etsy.com/listing/1319609800/multiple-name-necklacefamily-name?click_key=48fa0bf52f37c7cc4d85e0d47253be223d4291b3%3A1319609800&click_sum=6ee1b39f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-10&pro=1&etp=1&sts=1",
    "title": "Multiple Name Necklace,Family Name Necklace,Personalised,Children Name Necklace for Mom,2-3-4 Names Necklace, Jewelry, Bridesmaid Gift",
    "description": "To our valued customer, We are recommending 12\" inches for the kids.Handmade item SilverClosure. : BuckleChain style: RoloAdjustable length: Can be personalisedPERSONALISED - CUSTOM - NAME- LETTER - NECKLACEHandmade itemAdjustable length* Can be personalised up to 10 characters/Letters* Maximum wide of the text up to 40mm and text dims changeable depending on the name letters.* for initial characters maximum high 8mm.* for small characters maximum high 5mm. / depend on the name letters.Material: Sterling Silver Solid with colour platedAvailable in Gold colour - Sterling Silver - Rose Gold coloursAll our Jewellery is custom made love and care in our workshop.You can write up to 12 characters, even emojis like ❤️ (heart) and ⭐️( star) ♾️( infinity )Please do ask us if you would like to use any emojis before you purchase.Just remember to write how you want it to appear on your jewellery. For example upper case for the first letter.IMPORTANT: If we are sending a visual to confirm to start to process your order and if you aren't able to reply to this message within 12 hours then your order may have gone through processing.Could you please make sure, when we are sending visuals which they are %90 same with a real productPersonalised Name Necklace - Silver Name Necklace - Gold Name Necklace - Custom Name Necklace - Gift for Her - Christmas GiftIt comes with a Gift Box 🎁🧧🤗C A R E T I P S-Avoid contact with perfumes, body oils, other chemicals, household cleaners.-Keep it dry and cool-Polish with a soft nonabrasive cloth such as lint-free flannel, microfiber-Please don't wear it when bathing, sleeping or doing exerciseREFUND AND EXCHANGES:We don't accept Refunds. If you have any problem with your order, please contact us. If we will agree to replace with a new one. We will send a return label and once we have received the item you have sent to us then we will dispatch the new one.",
    "reviews": [
      "Thank you so much I love it😍",
      "great quality product, would reccomend",
      "Love this item thank you",
      "Superb item and great customer service. thank you"
    ]
  },
  {
    "productId": "fEZcrUyCOO",
    "url": "https://www.etsy.com/listing/888881112/personalized-song-plaque-anniversary?click_key=97ca6de61869895e0eddd14162ae95696d0584f6%3A888881112&click_sum=6738195c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-11&pro=1&pop=1&sts=1",
    "title": "Personalized Song Plaque Anniversary Gift For Him, Anniversary Gift For Boyfriend, Acrylic Music Plaque, Gift for Her, Custom Album Cover",
    "description": "Best Personalized Christmas Gift! A custom made song plaque gift for boyfriend, a personalized special gift for him or gift for her. This gift will put a smile into your loved ones. Memorize your special moments like anniversary with a song or photo acrylic, send a private message! Great gift for special days as celebration, home accessory, new decor! Get your Acrylic Photo Glass Gift Now!Perfect anniversary gift for boyfriend, husband, girlfriend, wife or partner. It is a great gift to celebrate your engagement or wedding anniversary, cherish the special song, remind the first dance song of your special day. This anniversary gift can be used for first anniversary, second anniversary, 5th anniversary or 10th anniversary, it fits for every anniversary because sentimental songs never get old. Just choose your song or instead you can put your special message to be displayed where you and your special one is put as singer, just like a real album cover. It is a perfect personalized gift for Christmas as well.All product photos and product descriptions are copyright of PixArts, they can't be copied and used without our permission. All product photos taken by our employees or our outsourced agencies that represent PixArts.• Manufacturing Times: 1 - 3 business days• Standard Shipping Times : 6-8 Days Delivery• Express Shipping Times : 1-3 Days DeliverySend messages and add meaning in your gifts. Add value to this product with a personalization unique to you, which can be used as a family gift, friend gift, anniversary gift, boyfriend gift or girlfriend gift.For the photos, make sure you send it out a quality version of your photo and in square format. In case the photo is not in square format and processed like that, it is not our fault and the customer is responsible for sending out photos in the required format and in high quality.You can read below for the rest of the details.★ ★ ★ ★ ★We can prepare any photo, message or special moment in any color of high quality Acrylic Plexiglas.You can share with us the details of the photo, profile page or album you want to see on Plexiglass. We accept customization.Customizations such as 'name' or 'date' that you want to add extra to standard templates will be free of charge! Just contact us please.Our products are packed in a scratch-proof way. In 1 - 4 business days, your order will be prepared and shipped to you. Your order will be delivered within 3 - 10 business days in total depending on your shipping choice.★ CUSTOMIZATION ★Add your personalization in this format:- Text Color: Black, White or any other color you want- Main Message or Song Name- Second Message, Location or Artist Name- Add your photo link or send us on Etsy messages as soon as possible- Left Time: Song Second or Date- Right Time: Song Length or Infinity Sign- QR Code Url (Optional)Be creative! Send us your photos or photo links as soon as possible.★ ★ ★ ★ ★▻  Sizes8 x 12 inches = 20 x 30 cm8x10 inches = 20 x 25 cm6 x 8 inches = 15 x 20 cm4 x 6 inches = 10 x 15 cm▻  CustomizationYour message title or artist, message content or song title, photo or album cover, colors in the song plaque are fully customizable.▻ Custom PhotosPlease send us your custom photo after your order, we can review its suitability and get back to you as quickly as possible. You can send the photo through Etsy messages feature, please don’t e-mail it, we might miss it through all the e-mails we receive.▻  CancellationPlease let us know if you want to cancel your order. If production has not started for your order, we would gladly cancel and provide you full refund.▻  ReturnBecause each product is custom made, it is not possible to accept returns for this product. In case you face any issues, please contact us so we can assist you.★ IMPORTANT NOTES ★• For this item, send us your photos in square shape. If you send us in another shape, your order will be processed with that photo. Please share with us the exact photo you want on your product.• Make sure your photo is not far from camera or has too much details, especially for 6x4in item size. Printed photos will not be as clear as the digital versions due to nature of the printing technology. Therefore we recommend colorful photos that is closer to the camera with not too much tiny details.• Due to nature of this product and printing activity, there might be minor differences in the printed photos and its colors. If such thing happens in your order, please get in touch with us so we can check for you if it is an unexpected case.• This is NOT an electronic item, therefore it will NOT play any song, video or recording by itself.",
    "reviews": [
      "This turned out so cute and I truly couldn’t be happier with my purchase!!",
      "Well pleased with gift for my boyfriend. A special song that we both love.",
      "It was really cute and worth the wait",
      "I absolutely love it! A super cute gift idea!"
    ]
  },
  {
    "productId": "mmO3hpFVWr",
    "url": "https://www.etsy.com/listing/711866584/personalized-metal-family-bar-and-grill?click_key=b592cb76419db2197dfe0f90ceabcf5ac8dae74b%3A711866584&click_sum=671b61ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-12&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Metal Family Bar and Grill Sign - Personalized Decor - Wall Art - Personalized Gifts - Custom Metal Art - Best Gifts",
    "description": "This personalized metal family bar and grill sign is the perfect piece to decorate your home bar or personal grilling space! Celebrate your favorite mixologist or master chef with a sign that shows off their impressive skills.Personalize this sign with up to three lines of text! **PUT YOUR EXACT TEXT FOR ALL THREE LINES IN THE PERSONALIZATION BOX - THIS SIGN DOES NOT HAVE STOCK TEXT***Please keep in mind, the size of the sign will determine how many characters can fit on each line. Send me a message if you have any questions about your personalization! You can add your custom text in the personalization box.ATTENTION: If you want to change anything about this design other than the lines of text, there is a $35 design fee (adding images, changing the font, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.-Dimensions18\" wide x 11\" tall x 16g steel24\" wide x 14.5\" tall x 16g steel30\" wide x 18\" tall x 16g steel36\" wide x 21.75\" tall x 16g steelCustom sizes can also be done. Contact me for any size up to 5 ft x 10 ft!-Mounting1/4\" Mounting Holes for easy surface mounting*PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.*-FinishesRAW STEEL -DARK (EVEN BLACK) - Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Left untreated, the Raw Steel will rust and develop a natural patina completely unique to your environment.INDOOR FLAT CLEAR -DARK (EVEN BLACK) - The Indoor Flat Clear finish is an oil-based matte clear coat that makes the steel darker, sometimes even black. This finish will hold up well inside and is easy to clean.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.ALUMINUM - The Aluminum finish is the best option if you want the look of shiny metal or stainless steel on a budget. This finish is rust-proof and weather-proof (great for marine environments) and is lightweight. Aluminum is also a soft metal and scratches easily, so please be careful when opening your package.ALUMINUM POWDER (GLOSS CLEAR, FLAT BLACK, GLOSS WHITE, GLOSS RED) - These Aluminum powder coat finish options will help prevent chips and scratches and give you more color choices. These UV protected finishes will protect the Aluminum in the toughest conditions and help prevent oxidation over time.GALVANIZED - Galvanized refers to a process in which steel is coated with a layer of zinc to protect it from corrosion. The appearance of galvanized metal is characterized by a shiny, silver-gray surface. The coating gives the material a distinct metallic luster. Over time, the zinc coating may develop a matte gray patina as it weathers, but the initial appearance is typically bright and reflective.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about these options? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!personalized gifts, wall decor, wall art",
    "reviews": [
      "Perfect. Just the way we ordered it. Smooth and not rough. Great job!",
      "Love the sign! We put a light behind it to add to the sign if we want",
      "Quick shipping and customer service",
      "LOVE IT! I am giving it at a gift later in the year and may order others. Thank you!"
    ]
  },
  {
    "productId": "bfaXIKxAOB",
    "url": "https://www.etsy.com/listing/963924694/married-ornament-wedding-gift-wedding?click_key=fc969321c92a600c0264cd94b29f00d6f17743aa%3A963924694&click_sum=a56d25f2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-13&pro=1&etp=1&sts=1",
    "title": "Married Ornament, Wedding Gift, Wedding Date ornament, Calendar, Anniversary Gift, Our First Christmas, Newlywed Gift, Engagement Gift",
    "description": "Married Calendar Ornament. Personalized gift for newlyweds or newly engaged couple.Each ornament is beautifully crafted from glossy porcelain ceramic, measuring  3\" wide and 2.75\" tall, and includes satin ribbon for hanging. Your keepsake will come packaged in its own gift pouch ready to be presented to the recipient. If you are sending directly to the recipient, there is an option to add a gift note during check out.Please feel free to reach out with any questions or special requests.Thank you for visiting our shop!",
    "reviews": [
      "Very pretty and nice quality",
      "Loved it! Perfect addition to our family collection.",
      "I had a special request for the text and the seller was quick with her response and delivered exactly what I wanted. This is the second time I’ve ordered. This is my new go to gift.",
      "The best wedding present! I have purchased multiple of these for all my friends getting married and they love them. They are good quality and it's such a cute idea to me that my whole college friend group will have one of these on their tree"
    ]
  },
  {
    "productId": "Ihl1vogcyw",
    "url": "https://www.etsy.com/listing/1297240294/newly-wed-gifts-two-locations-heart?click_key=0ce1e28f9ba9ad06f981209afa788dbfdd36644c%3A1297240294&click_sum=bb51c1d8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-14&pro=1&frs=1&etp=1&sts=1",
    "title": "Newly Wed Gifts, Two Locations Heart Puzzle Map Wooden Framed Wall Art, Custom Wedding Shower Gift for Couple, 1st Anniversary Gift for Wife",
    "description": "Engaged Married Heart Puzzle Map Wooden Framed Wall ArtThoughtful and personalized gift for a wedding, anniversary, engagement, or housewarming party.A unique layered wooden map that combines two locations.💙💛 Our family business is located in the safe western part of Ukraine.✈ International delivery takes 8-14 business days to the US and Europe.-----------------------------------------------------------------✔️Our maps can display any place in the world, just indicate your address or coordinates. The map shows the nearby area around your location with public roads, lakes/rivers/oceans✔️ Comes already framed, ready to hang.✔️ Customize your wooden map with personal information and choose a particular color to match your style!❓ As this is a personalized product - We always are sending digital proofs via Etsy messages before manufacturing the product!If the customer doesn't answer and doesn't approve it for 2 days - we have to make and send the product, according to deadlines.-----------------------------------------------------------------❓ LOOKING FOR 3 LOCATIONS MAP - we also have it!!Please follow the link - it is so amazing!https://www.etsy.com/listing/1451950882/three-locations-heart-puzzle-map-wooden/-----------------------------------------------------------------🛒 HOW TO ORDER:1) Choose possible options:· Style:BLACK STYLEWHITE STYLEGUNSTOCKNATURAL & GUNSTOCKEARLY AMERICANNATURAL & EARLY AMERICANSAGENATURAL & SAGEDARK WALNUTNATURAL & DARK WALNUTEARL GREYNATURAL & EARL GREYBARN REDNATURAL & BARN REDCARBON GREYNATURAL & CARBON GREY· Size of the product- S - 6,3 х 7 inches (16x17,5 cm)- M - 8,6 х 9,6 inches (22х24,5 cm)- L - 11,4 х 12,6 inches (29х32 cm)- XL - 17 x 15,5 inc (39x43cm)2) In the notes to the seller, leave the following information (PLEASE CHECK IT CAREFULLY):· Full address for 2 LOCATIONS (where we put red pin icon)· Any text for the framewhat we put on top - max. 2 lineswhat we put under each location - max. 2 lines-----------------------------------------------------------------📎 MATERIALSHigh-quality birch plywood + acrylic glass.All parts are carefully crafted, detailed, sanded, and hand-painted with oil-based stain which is environmentally friendly (it doesn't emit VOCs and also doesn't produce harmful fumes and odors)-----------------------------------------------------------------📦 RELIABLE PACKAGE:~ It comes ready to gift.~ Brown box with our logo on the cover with a string bow. Wooden map in a protective case wrapped in craft paper and wooden gift card inside.🎁 You may add gift wrapping during checkout: mark the order as a gift and select the option \"add gift wrapping\"-----------------------------------------------------------------⌚ Orders Processing time - 1-3 business days✈️ ESTIMATED SHIPPING TIME:STANDARD SHIPPING10-14 business days for the United States, North America10- 14 business days for Europe, Germany, United Kingdom, Ireland, France, Switzerland, Netherlands10-15 business days for Canada, Australia, New ZealandUPS EXPRESS (35$) - 8 business days-----------------------------------------------------------------💳 PAYMENT OPTIONSAll payment methods are available--------------------------------------------------------------------------❤️ Follow the links and check our other bestsellers:🏠 The Best Housewarming Giftshttps://www.etsy.com/shop/MurLight?ref=profile_header§ion_id=33828769💍 Wedding & Engagement Wood Mapshttps://www.etsy.com/shop/MurLight?ref=profile_header§ion_id=32648390👩‍❤️‍💋‍👨 Where We Met Custom Maphttps://www.etsy.com/shop/MurLight?ref=profile_header§ion_id=36960140--------------------------------------------------------------------------⚠️ ADDITIONAL FEES & CUSTOMS DUTIES ⚠️In the case of ordering big-size maps, due to the dimensions of the package, you may pay customs and import taxes.The amount of taxes depends on your country's laws, and we are not responsible for that.The US does NOT pay customs and import taxes.Some EU countries' laws may demand to pay customs and import taxes.UK, Cyprus, Malta, Bosnia and Herzegovina, Switzerland, Norway, Iceland, SerbiaYou can check the approximate customs fee on the linkhttps://www.simplyduty.com/#calc--------------------------------------------------------------------------Newly Wed Gifts Met Engaged Married/ Where It All Began Map, Engagement Map Wooden Framed Wall Art, Personalized Engagement Gifts for Her, Housewarming GiftEngagement Gifts for Couple, Hello Will You I Do Map Wall Art, Custom Engagement Location Wood Map, Met Engaged Married Map, Gift for Bride, wood map, custom wood map with heart location, wooden wall Where It All Began/Where We Met Map, Location Map Wooden Framed Wall Art, Custom Wedding Anniversary Gifts for Couple, Valentines Day Gifts Engagement Location Map, Engaged Married Heart Puzzle Map Wooden Framed Wall Art, Wedding Gifts for Couple, 1st Anniversary Gift for Wife",
    "reviews": [
      "Every piece of this has been top notch, from the review process and communication, down to the tiniest detail in packaging. Thoughtful and beautiful, I can't wait to give this as a gift!",
      "I cannot express how amazing the quality and work is!!! Thank you so much for your speedy response, work, and care into my order! I am so excited to gift it and will definitely order again from you soon ❤️",
      "Exactly what I ordered. It’s perfect.",
      "Really good quality and nicely made!"
    ]
  },
  {
    "productId": "OimvXBofBs",
    "url": "https://www.etsy.com/listing/1312234939/copper-personalized-bookmark-book-lover?click_key=f82e6f359f87d3197f0d8e6b1cdb162d3c0e38ea%3A1312234939&click_sum=c7df9146&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-15&etp=1",
    "title": "Copper Personalized BOOKMARK Book Lover Gift Custom Quote Book Mark With Tally Marks 7th anniversary copper anniversary gift for couple",
    "description": "📚 Distinctive Features:▪ Warm Elegance: Crafted from copper for a rustic and sophisticated look.▪ Durable Patina: Copper's natural aging process adds unique character, enhancing its beauty over time.✨ Customizable Engraving:▪ Personalization Options: Choose to engrave one or both sides to make it uniquely yours.▪ Font Selection: Browse our range of fonts displayed in the product images. Custom fonts from fonts.google.com also available for an extra touch.▪ Visible and Durable: Engravings on copper are clear and long-lasting, ensuring your message or design endures.🔧 Product Specifications:▪ Dimensions: Measuring 1\" x 5\", it’s the perfect size for any book.▪ Ribbon Choices: Customize with our selection of ribbons. If not specified, we'll use option 1 by default.🎁 Ideal for Any Occasion:A unique present for birthdays, holidays, and special occasions.🔗 Explore More Varieties and Designs:Gold/Brass, Copper, and Aluminum Bookmarks:Find More Here...https://www.etsy.com/shop/BestEngravings?section_id=39690966💡 Good to Know:▪ Natural Patina: Copper develops a rich patina over time, adding to its charm. This natural process can be polished to maintain or restore its original shine.",
    "reviews": [
      "An anniversary gift for my husband. It is very nicely done!",
      "Great 7th anniversary gift for husband",
      "All good, shipping was fast and the product is great!"
    ]
  },
  {
    "productId": "EnoccRLpqx",
    "url": "https://www.etsy.com/listing/1246399079/twist-chain-name-necklace-by-caitlyn?click_key=4b8e55ac99388696a42b5d065ac890760852369d%3A1246399079&click_sum=e009facd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-16&pro=1&frs=1&etp=1&sts=1",
    "title": "Twist Chain Name Necklace by Caitlyn Minimalist • Personalized Necklace, Handmade Jewelry • Perfect Gift for Best Friend & Sister • NM100F97",
    "description": "S I N G A P O R E ∙ C H A I N ∙ N A M E ∙ N E C K L A C ESparkle and shine like you are meant to with our Singapore chain nameplate necklace. The twisted chain adds extra dimension to a classic name charm necklace, making it one-of-a-kind. Easily layer with multiple chains to create an effortless elevated look or wear on its own for a subtle style.• Material: High Quality Solid 925 Sterling Silver• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• Dimensions: Depending on your font choice, height sizes range from 3mm to 4mm lowercase.• All our jewelry is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Simply use the 'PERSONALIZATION BOX' to let us know the NAME and the FONT NUMBER that you would like. (Any font is available, not just our featured fonts)NAME + FONT NUMBER ♡• Listing necklace features FONT #97. If a font is not given, you will receive the font that is pictured.O T H E R ∙ I N F O R M A T I O N• The length option is the TOTAL chain length (including the charm). If you order an 18\" chain, the piece will come as CHAIN + CHARM = 18\". All pieces will come with a 1\" extension chain so you can FINE TUNE the fit.• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• All items are custom made to order. Our turn around time is about 6 - 10 business days. This can change during peak seasons. Please check our home page for the most current times.• Rush your order: Please contact us to see if we can meet your deadline. You can also expedite your shipping in the drop down menu upon check out. This does not change production times (see above)O U R ∙ P O L I C I E Shttp://etsy.me/2cuqINvA B O U T ∙ C A I T L Y N M I N I M A L I S Thttp://etsy.me/2cYBUSpM O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/CaitlynMinimalistI N S I D E ∙ S C O O P• IG: @CaitlynMinimalist• FB: https://www.facebook.com/CaitlynMinimalistThank you so much for visiting and hope you enjoy shopping with us ♡Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "Loved the necklace!! It was so beautiful and great quality! Owner was very fast to respond to me and sent me picture of the different fonts available in my daughter’s name so it was easier to choose a font!",
      "Very pretty clasp with a heart. The box it comes in has such nice detail. I will order more.",
      "I love the two necklaces I ordered. Customer service was very prompt, kind and professional. The necklaces were sent regular usps ground and came pretty quickly. I would order more necklaces. They make great gifts.",
      "My girlfriend loved it!!! Thanks"
    ]
  },
  {
    "productId": "fjEGOvKqoE",
    "url": "https://www.etsy.com/listing/1656393606/personalized-baby-gift-basket-baby-gift?click_key=12e007f1e8ea5eadec1da611f928f9b075f2a04b%3A1656393606&click_sum=b4294e7d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-9&pro=1&bes=1",
    "title": "Personalized Baby Gift Basket, Baby Gift Basket, Storage Basket, Baby Name Gift, Baby Gift, Baby Shower Gift Basket, Rope Cotton Basket",
    "description": "The journey of welcoming a new arrival into the family is a special and heartwarming time. A Personalized Baby Gift Basket made from high-quality cotton rope stands out as a thoughtful and customizable way to celebrate this joyous occasion.Size:✨Small- Approximately 11.8\" x 7.8\" x 4.3\"✨Medium - Approximately 12.9\" x 9\" x 5.1\"✨Large - Approximately 14\" x 9.8\" x 6.2\"1. Premium Cotton Rope MaterialCrafted from premium cotton rope, this basket exudes quality and durability. The use of this material ensures a sturdy structure that’s soft to the touch, ideal for a baby's delicate items and creating a safe, snug space for their essentials.2. Personalization: A Unique TouchThe essence of personalization lies at the core of this gift basket. Whether it's monogramming with the baby's initials, adding their name, or customizing it to suit the nursery decor, this basket allows for a truly unique touch, making it an ideal keepsake.3. Versatile Design for Various UsesThis basket isn’t just a singular-purpose item; it's a versatile storage solution. Perfect for nursery storage, a playroom organizer, or even as a stylish baby photo prop, its multifunctional design makes it a valuable and long-lasting addition to a family's home.4. Ideal for Gifting: Baby Showers and Gender RevealsAs a personalized and practical gift, this basket is a wonderful choice for baby showers or gender reveal celebrations. Its customization options allow for a thoughtful and tailor-made present that is both functional and aesthetically pleasing.Return Policy:Due to the nature of customized products, we do not accept returns or exchanges unless there is a misspelling or design due to our mistake, we will send a corrected item at no additional charge.",
    "reviews": [
      "Just like the photo! Perfect daycare bag!",
      "Super cute!!! We love it!!!",
      "I am very pleased with the basket",
      "Nice quality, my niece looked adorable in it. We put it on her when she is painting."
    ]
  },
  {
    "productId": "4EoeTmhTsN",
    "url": "https://www.etsy.com/listing/1559697371/personalized-mama-sweatshirt-with-kid?click_key=d3fb7c6cee0ce2070a608f40e9647f842b353a75%3A1559697371&click_sum=726eb3db&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-10&pro=1&frs=1&pop=1&sts=1",
    "title": "Personalized Mama Sweatshirt with Kid Names on Sleeve, Mothers Day Gift, Birthday Gift for Mom, New Mom Gift, Minimalist Cool Mom Sweater",
    "description": "Our mama sweatshirt is the perfect gift for all moms! The embossed style lettering will leave mama feeling cozy yet chic every day. Personalize the left sleeve with the names of the mother's children and/or loved ones to make it even more special.I T E M ∙ D E T A I L S• Crewneck Sweater, 50% cotton, 50% polyester• Unisex Sizing: S, M, L, XL, 2XLCare Instructions: Machine wash cold. Tumble dry low or hang to dry. Wash inside out. Do not iron or dry clean.P R O C E S S I N G ∙ & ∙ S H I P P I N G• All items are custom made to order with love and care in our California workshop.• Orders are typically processed and shipped within 1-3 business days. This may change during the holiday season, please view current posted processing times!• Need it by a specific date? Please contact us to check if we can meet your deadline. We also have expedited shipping options available at check-out!R E T U R N S ∙ & ∙ E X C H A N G E SSince items are made to order we do not accept returns or exchanges. Please make sure that your personalization information is correct and reach out if you have any questions.In the rare event that you receive an item with the wrong personalization or it arrived damaged please do not hesistate to message us with a photo of the item for a free replacement!---S H O P ∙ M O R Ehttps://www.etsy.com/shop/LoveSuna♡ Handmade with Love, Suna",
    "reviews": [
      "Love this. My absolute favorite sweatshirt",
      "Love! My friend loved her gift. Fast shipping! Amazing quality.",
      "Great sweatshirt, my favorite from my son"
    ]
  },
  {
    "productId": "TVDwjbpcpx",
    "url": "https://www.etsy.com/listing/1218016121/14k-gold-multi-circle-name-necklace?click_key=7de23542e176a8ee11ebd8b21208b3512023efbc%3A1218016121&click_sum=88eabfb4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-11&pro=1&frs=1&bes=1",
    "title": "14K Gold Multi Circle Name Necklace, Silver Family Name Engraved Pendant, Custom Made Jewelry, Moms Personalize Gift, Valentine's Day Gifts",
    "description": "What is the perfect way to dress up any outfit or add your own flair?                                                       Accessorizing with jewelry, of course!From sparkling zircon necklaces and fashionable bracelets to stackable rings, GoldenRatioDesignCo has the perfect jewelry piece to accentuate your wardrobe, your lifestyle and your budget.♥ Our Circle Name Necklace is a versatile, intimate piece that can be worn everyday with your favorite shirts.★ PRODUCT DETAILS;*Material Options: 925k Sterling Silver & Rose Gold Plated & Gold Plated & 14K Gold & 14K Rose Gold & 14K White Gold► HOW TO ORDER;Please select your preferred CHAIN ​​LENGTH and MATERİAL-CIRCLE QUANTITY from the menu while adding to card.Please sort your desired names into the personalization box as in the example:We kindly ask you to consider this order while writing the names...1-Emma2-Robert3-Jessica4-Joseph5-ElizabethWHY ∙ YOU ' WİLL∙ LOVE ∙ IT• It's dainty and can be worn every day...• A special piece you'll treasure...• High quality materials and attention to detail...Attention International Buyers!!!The recipient is the importer of record and must comply with all laws and regulations of the destination country. Orders shipped outside of the United States may be subject to import taxes, customs duties and fees levied by the destination country. The recipient of an international shipment may be subject to such import taxes, customs duties and fees, which are levied once a shipment reaches the recipient’s country. Additional charges for customs clearance must be fulfilled by the recipient; GoldenRatioDesignCo has no control over these charges, nor can GoldenRatioDesignCo predict what they may be.International Returns:You are justified in refunding only the item price",
    "reviews": [
      "Great quality, as shown in the pictures! Perfect for a gift!",
      "Wife loved the item, great Vday gift",
      "Hey Esty..you need a better review section. Buyers should be able to rate their purchases without having to leave a 5 word review.",
      "Beautiful necklace! My mom is going to love it."
    ]
  },
  {
    "productId": "udUQ0waAaF",
    "url": "https://www.etsy.com/listing/1210872642/high-quality-name-necklace-personalized?click_key=ea8c86babc43faa7543515a92705eac308d31f3b%3A1210872642&click_sum=1d293c97&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-12&pro=1&frs=1&bes=1",
    "title": "High Quality Name Necklace Personalized Jewelry Minimalist Handmade Jewelry Custom Name Necklace Christmas Gift Gift for Her - KNN",
    "description": "❤️❤️ EXCELLENT QUALITY NAME NECKLACE ❤️❤️A buyer can return the item for no reason at all⚠️ ⚠️ ⚠️ The photos you see with the review may belong to the  regular (not this item) name necklaces.⚠️ ⚠️ ⚠️❤️❤️100% Satisfaction Warranty for this item❤️❤️A buyer can return the item for no reason at all❤️❤️ This necklace was made in 120 microns thickness and it is one of the thickest and most durable necklaces in the market. ❤️❤️(Normally, name necklaces are made from 60-80 microns so they are thinner, lighter and easily breakable).❤️❤️ We Use only sterling silver OR !4K Gold. Please Select your material ❤️❤️❤️❤️Great choice for athletes and kids ❤️❤️❤️❤️ The photos you see with the review may belong to the regular (not thick) name necklaces.❤️❤️❤️❤️FREE  MOCK UP ❤️❤️If you want to see before how it looks like before purchasing, we can make mock up for you. Please feel free to contact us. Just message me your fonts that you like. Also you can ask me about this item.❤️❤️ MATERIAL ❤️❤️100% 925K Solid Sterling SilverOR100% 14K Solid GoldAll necklaces come with 2 inches extender except 14K Solid Gold options.14K Solid Gold options don't come with 2 inches extender.❤️❤️ UNBREAKABLE ❤️❤️This  item is resistant to the breakage and splits.❤️❤️ NONTARNISH ❤️❤️The impeccable quality compared on other name necklaces at market. Perfect for everyday wear.❤️❤️ WATERPROOF ❤️❤️It can be worn in the water❤️❤️ HIGH QUALITY CHAIN ❤️❤️The chains of these necklaces are also thick and solid. Moreover, they have a delicate design.❤️❤️ NONALLERGIC ❤️❤️We use only 925K Sterling silver OR 14K Gold. They are not allergen metals.❤️❤️ CHAIN ❤️❤️Box ChainFigaro ChainGourmet Chain❤️❤️ Please take a look my store to see my collection ❤️❤️https://www.etsy.com/shop/NorthstormCA?ref=simple-shop-header-name&listing_id=902096615❤️❤️ DISCOUNTS ❤️❤️We are happy to provide special discount for multiple orders such as for bridal parties and as bridesmaids gift sets. Contact me for additional coupon code.⚠️ ⚠️ ⚠️  ATTENTION ⚠️ ⚠️ ⚠️Please double check your shipping address, font, size, material and name for it. If you want I can change your item details in 12 hours of purchasing. Also you can change your shipping address before shipping date. Feel free to message me.14K Solid Gold Name Necklace - Personalized Jewelry - Name Necklace - Name Jewelry - Custom Name Necklace - Sterling Silver - Necklace - Gift for Kids Girl - Gift for Wife - Birthday gift for Wife - Christmas Gift for Kids Young Girl - Christmas Gifts for Baby Girl - 14K Solid Gold Thick Name Necklace - Personalized Jewelry - Name Necklace - Name Jewelry - Custom Name Necklace - Sterling Silver  - - Gift For Kid Girl - Gift For Baby Girl - Birthday Gift for Her",
    "reviews": [
      "Perfect just what I asked for",
      "You're very welcome! I'm thrilled to hear that you're pleased with the service. Remember, I'm here whenever you need assistance or have any questions. Don't hesitate to get in touch. Enjoy your purchase",
      "Prefect customer service and amazing necklace",
      "You're very welcome! I'm thrilled to hear that you're pleased with the service. Remember, I'm here whenever you need assistance or have any questions. Don't hesitate to get in touch. Enjoy your purchase",
      "Absolutely stunning!  The font is perfect and easy for my niece to read !  Quality is amazing!  I will definitely recommend! Thank you",
      "Thank you for your feedback and for expressing your satisfaction with your purchase! We're thrilled to hear that you're happy with your order. If you have any further questions or need any assistance, feel free to reach out to us"
    ]
  },
  {
    "productId": "UXyYglydBY",
    "url": "https://www.etsy.com/listing/1075781367/personalized-handmade-candle-with-wood?click_key=75ef517b832678a678e1d58f7588ff92f60b6879%3A1075781367&click_sum=102eb9e3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-17&etp=1&sts=1",
    "title": "Personalized Handmade Candle with Wood Engraved Picture, Candles Gift For Friend For Bridesmaids, Gift Set for Him for Her, Birthday Candle",
    "description": "Personalized Handmade Candle with Wood Engraved Picture, Candles Gift For Friend For Bridesmaids, Gift Set for Him for Her, Birthday Candle, Personalized Gift for any occasionAustralian Handmade Candles. Hand Poured in SydneyKeep reminding your loved one how awesome he or she is with this beautifully hand crafted candle. A perfectly unique gift idea for your other half. Enjoy the beautiful aromas chosen from our fragrance list. A perfect idea as an anniversary gift also.Custom-designed, no candles are the sameYour picture is engraved on the wooden lidWe offer 3 sizes:Small: 230 g of waxMedium: 283 g of waxLarge: 450 g of waxPls direct message us if you have any questionsOr our social media:FB: https://www.facebook.com/thewoodvillehouseInstagram: https://www.instagram.com/the_woodville_house_by_karen.t",
    "reviews": [
      "Beautiful candle would definitely recommend",
      "I bought this as a gift, and my friend loved it!",
      "Very happy with item. Thanks"
    ]
  },
  {
    "productId": "YSl8ulWPAN",
    "url": "https://www.etsy.com/listing/507901564/iron-anniversary-gift-6th-anniversary?click_key=08a2b26085ff8988a9598cb6208577f49093ddc1%3A507901564&click_sum=8370f595&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-18&etp=1&sts=1",
    "title": "Iron anniversary gift, 6th anniversary key chain. Blacksmith forged personalized key chain gift. Wrought iron customized keychain.",
    "description": "This is a blacksmith hand-forged key chain made from 3/8\" wrought iron.  Each one can be personalized with eight characters front and back. These are made and stamped with antique blacksmithing tools! Because of that, each key chain is one of a kind and shows all the hammer marks that come with being hand hammered. They have a wonderful feel in the hand, unlike anything you can buy in the store! These make a great 6th (iron) anniversary gift. Many people like to include a name, ♥6TH♥, or their anniversary date .These are 2 inches long by 3/8\" square. The brass ring is 1 inch outer diameter. The finish is a light coat of linseed oil.Before you add this to your cart you will be asked to enter exactly what personalization you want. I can fit up to 8 characters (letters, numbers, and the symbols shown in the picture) on the front of the key chain and 8 more on the back. If you want to include periods \".\" or slashes \"/\" they do not count towards the 8. This way you can do ♥6TH♥, ♥H&H♥, Hogan B., 10.12.2012 , 12/12/2012, etc. I can do some other symbols too, just check out the last listing image. Please send me a quick message with the \"ask a question\" button if this is unclear.These qualify for free shipping with an order of over $35!Thanks for looking!",
    "reviews": [
      "Very nice! Thank you very much!",
      "Love! This is my second order!",
      "It came super fast and looked so great. The attention to care showed in the packaging and I would highly recommend for anyone looking for a unique gift for a special person",
      "Really nice quality. I’m very happy with this. Made a perfect gift."
    ]
  },
  {
    "productId": "vXlEcpBTLv",
    "url": "https://www.etsy.com/listing/1105586233/leather-bookmark-personalized-3rd?click_key=16a27d37b80baaee62ec0a3b0ef5cbb199e47810%3A1105586233&click_sum=0f2523e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-19&etp=1",
    "title": "Leather Bookmark Personalized 3rd Anniversary Bookmark To many more chapters together Leather Anniversary Bookmark Leather Anniversary",
    "description": "This custom Genuine Leather Bookmark makes a perfect gift for your leather anniversary.♥ ♥ ♥ I T E M . I N F O R M A T I O N  ♥ ♥ ♥•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••♥ Our bookmarkers are made of Genuine Leather♥ Our bookmarkers measure approx: 6.7\" x 1\" (nice size!)♥♥♥ FREE Gift box included with each bookmark for stress-free gift giving.♥♥♥Click here to visit our shop for more personalize Gifts:https://www.etsy.com/shop/SugarCreekLane?ref=seller-platform-mcnavClick here to see more leather bookmarks in our shop:https://www.etsy.com/shop/SugarCreekLane?ref=simple-shop-header-name&listing_id=1083125244&section_id=35616452♥ ♥ ♥  H O W . T O . O R D E R  ♥ ♥ ♥•••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••1. Choose the total quantity of keychains from the drop-down list.2. In the “Personalization Box\" type your engraving notes. Please include engraving notes for each side of the keychain, you want engraved.3. Click the \"Add to Cart\" button and proceed to check-outPlease feel free to contact us with any questions. We respond quickly Mon-Fri and most Saturdays.",
    "reviews": [
      "Husband loved this - gave it to him as part of his Valentine's Day present and he is so happy with it! Highly recommend to anyone who has a bookworm that they love!",
      "Item was as expected. Thanks.",
      "Awesome gift for my loved one. He absolutely loved it."
    ]
  },
  {
    "productId": "llIpyeZLVH",
    "url": "https://www.etsy.com/listing/1352387931/custom-night-sky-print-rustic-wedding?click_key=9fbaa91de25a2a4a56cd4015af0e32802b8f159b%3A1352387931&click_sum=8ae36f2e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-20&frs=1&etp=1&sts=1",
    "title": "Custom Night Sky Print, Rustic Wedding Gift, Personalized Star Map, Forest Sky Print, Custom Rustic Wedding Gift, Under These Stars",
    "description": "Our night sky print is customized to the date and location you provide. This design features a beautiful watercolor effect and a forest silhouette which is perfect for an outdoorsy couple!◆ HOW TO CUSTOMIZE ◆- Please refer to the \"Add your personalization\" box to see what we need to create your design and enter your information there :)*** If you are not seeing the box, it may not be supported on your browser or app so please put your information in the \"Note to Seller\" section before checkout.- Our swatches and fonts (if applicable) can be found in our product photos.- Have any special requests? Please feel free to include them along with your order information!◆ FREE PROOFS ◆- We will message you via Etsy with a digital proof of your design 1-2 business days after your order has been placed.- Your order will not ship until you have approved the proof :)◆ PRODUCT INFORMATION ◆- All prints are done on professional, heavyweight matte paper using archival inks8x10 Print Only No Mat - 2 inch border around design8x10 Print Only With White Mat - print is 5x711x14 Print Only No Mat - 2 inch border around design11x14 Print Only With White Mat - print is 8x108x10 Framed No Mat & Plexiglass - 2 inch border around design8x10 Framed With White Mat & Plexiglass - print is 5x711x14 Framed No Mat & Plexiglass - 2 inch border around design11x14 Framed With White Mat & Plexiglass - print is 8x10Looking for a larger size? You can find the poster size of this print here:https://www.etsy.com/listing/685940576/custom-constellation-map-poster-night?ga_search_query=star%2Bmap&ref=shop_items_search_4&frs=1◆ SHIPPING & GIFTS ◆- Shipping: US Orders ship in 3-5 business days via USPS Priority Mail with tracking if you approve your proof asap.- Gift Options: Include a gift message at checkout and we'll include a beautiful card for free :) You can also add our premium gift wrapping option for $5 at checkout.◆ HAVE A QUESTION? ◆- We love to help! Just send us a message via an Etsy Conversation by clicking \"ask a question\" above :)- Shop our full line herehttps://www.etsy.com/shop/finchandcotter◆ WHY BUY FROM FINCH & COTTER? ◆We (Niki & Jeff) have been fortunate to put over 50,000 personalized prints & pillows in homes in the USA & Canada. We are so proud of our over 10,000 5 Star Reviews. See what our past customers have to say about our handcrafted products and customer servicehttps://www.etsy.com/shop/FinchandCotter/reviewsFinch & Cotter has been creating handcrafted, personalized home decor since 2012 and all the items you see in this shop are created start to finish in our Grand Rapids, MI based studio. We only use American made materials and eco-friendly materials & packaging whenever possible.◆ FEATURING ◆Personalized Wedding Gifts・1st Anniversary Paper Gifts ・ Anniversary Gifts・Bridal Shower Gifts・2nd Anniversary Cotton Gifts ・ Engagement Gifts・Mother’s Day Gifts・Father’s Day Gifts・Birthday Gifts・Valentine’s Day Gifts・Housewarming Gifts・Baby Shower Gifts・Baby Nursery Decor・Rustic Home Decor・Gift Ideas・Gifts for Grandma・Gifts for Grandpa・Gifts for Grandparents・Gifts for Mom・Gifts for Dad・Gifts for Parents・Gifts for Couples◆ EXCLUSIVE SALES, COUPONS, & GIVEAWAYS ◆INSTAGRAM: instagram.com/finchandcotter",
    "reviews": [
      "good product thank you !",
      "thank you! Beautiful gift! I cant wait for the couple to see it!",
      "Beautiful art work that my sister is sure to enjoy for many years to come. The personal touch and craftsmanship shows through in this high quality product. Thank you so very much."
    ]
  },
  {
    "productId": "CdqXMzfNJI",
    "url": "https://www.etsy.com/listing/881426480/bold-name-ring-old-english-name-ring?click_key=21813ca7da44cb2cdbcf8758bc37c53cf0ff0288%3A881426480&click_sum=96213ffc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-21&pro=1&frs=1&etp=1&sts=1",
    "title": "Bold Name Ring • Old English Name Ring • Custom Name Ring • Statement Ring • Personalized Gift For Her • RM02F69",
    "description": "♡ CUSTOM · NAME · RING ♡| Our Personalized Name Rings are 100% handcrafted with Sterling Silver - perfect for daily wear |» ITEM · DETAILS «——————————◗ Material: SOLID 925 STERLING SILVER◗ Finish (Available in 3 colors): Silver, Gold and Rose Gold◗ Item will come packaged in a cute jewelry box, ready for gifting!◗ Note: Listing is for 1 ring. For multiple rings, simply adjust the quantity as you wish.» HOW · TO · ORDER «————————————◗ Choose the finish and size you would like in the drop down menus.◗ Let us know the  [ name  +  font number ]  you would like in the PERSONALIZATION BOX upon ordering.◗ Note: How names/words/details are typed and provided for us is exactly how your piece will be created.◗ If a font is not specified, we will use the featured font - [ font #69 ] for your design.» MORE · INFO «—————————◗ Production time: All of our items are hand and custom made to order. Our turnaround time is about 2 weeks upon ordering and receiving order information. It is subject to change during peak seasons.◗ Standard shipping within the US takes about 3 - 5 business days. International shipping varies depending on country and location.» MORE · FROM · US «————————————◗ Handwriting Jewelry -»http://etsy.me/2cd8mmw◗ Custom Name Jewelry -»http://etsy.me/2bQ5Zqm◗ Birthstone Jewelry -»http://etsy.me/2bU9GJm◗ Fingerprint Jewelry -»http://etsy.me/2dwmF58◗ Gifts for Him -»http://etsy.me/2bEjODj» BACK · TO · OUR · SHOP «———————————————◗http://SilverHandwriting.etsy.com» VIEW · OUR · POLICIES «——————————————◗https://www.etsy.com/shop/SilverHandwriting/policy♡ Feel free to contact us if you have any questions or concerns! Happy shopping with SilverHandwriting ♡——————————————Copyright © All images by SilverHandwriting. All rights reserved.",
    "reviews": [
      "Nice ring, exactly as described",
      "The rings are nice,but it took a very long time to get them",
      "Very nice,it finally  arrived today",
      "This was exactly as described, beautiful!"
    ]
  },
  {
    "productId": "gQa8faOQmt",
    "url": "https://www.etsy.com/listing/999859523/personalized-beer-glass-18-oz-beer-glass?click_key=9642ce0b9313d81db72c168ddb4826e33a825b2b%3A999859523&click_sum=5425dae7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-22&pro=1&etp=1",
    "title": "Personalized Beer Glass- 18 oz. Beer Glass -pint, camping, outdoor, adventure, Wilde Nomad, beer lover, national park, personalized gift",
    "description": "Any & all wording works! We can have these say whatever you'd like!This custom 18 oz. beer glass is perfect for anyone and any occasion! Sitting on the back deck on a warm day, taking it camping with you in your camper, showing your favorite adventure buddy your appreciation for them! You just let us know who or what you want it to say and we will do the rest!Looking for an idea for a wedding party, maybe a gift for your bridesmaids or groomsmen? How about a wedding favor for all your friends and family to have as a keepsake? We are always personalizing them for major events for people, feel free to reach out if you want to have these glasses be a part of your big day.Care Instructions:HAND WASH ONLYNOT microwave or dishwasher safe.Printed in Denver, CO. These mugs are not made with any sticker material they are sublimated. They will last forever. It is recommended you hand wash them to really make it last for all your adventures.**This glass is 18 oz.** No refunds on personalized itemsAll Sales are FINAL for personalized items. PLEASE MAKE SURE TO DOUBLE AND TRIPLE CHECK YOUR SPELLING AND DATES AS WE ARE NOT RESPONSIBLE FOR TYPOS.If we make the typo we will always make it right , all the glass wraps do not fully wrap, there is a slight  gap but they still look awesome & beer and iced coffee taste amazing out of them!",
    "reviews": [
      "great product. would definitely recommend.",
      "Great product, highly recommended it!",
      "We just Love our custom glasses & will be buying more!!"
    ]
  },
  {
    "productId": "VASwCAPRhU",
    "url": "https://www.etsy.com/listing/1503404402/dainty-name-necklace-by-caitlyn?click_key=508c4d7e846944b44d01e45229058ee48127d175%3A1503404402&click_sum=48d4459e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-23&pro=1&frs=1&etp=1&sts=1",
    "title": "Dainty Name Necklace by Caitlyn Minimalist • Multiple Name Necklace • Personalized Family Necklace • Name Jewelry • New Mom Gift • NM129F51",
    "description": "M U L T I P L E ∙ N A M E ∙ N E C K L A C EShow off your unique style with our Dainty Multiple Name Necklace – a stunning and personalized accessory. Whether it's family, friends, or special someones, wear their names proudly in this beautifully crafted piece!• Material: High Quality Solid 925 Sterling Silver• Dimensions: Depending on your font choice, height sizes range from ~2.5mm to ~7.5mm.• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• All our jewelry is custom made by hand with Love and Care in our workshop ♡H O W ∙ T O ∙ O R D E R• Simply use the 'PERSONALIZATION BOX' to let us know the NAMES and the FONT NUMBER that you would like. (Any font is available, not just our featured fonts)♡ NAMES + FONT NUMBER ♡• Listing necklace features FONT #51. If a font is not given, you will receive the font that is pictured.O T H E R ∙ I N F O R M A T I O N• The length option is the TOTAL length (including the charm). If you order a 18\" chain, the piece will come as CHAIN + CHARM = 18\". All pieces come with a 1\" extension chain so you can FINE TUNE the fit.• All items are nicely packaged ready to gift in elegant jewelry boxes.• If you can't find the information you need or need some advice for your design? Feel free to contact us. We are fast to reply :)T U R N ∙ A R O U N D ∙ T I M E• This item is custom made to order. Our turn around time is about 6 - 9 business days. This can change during peak seasons. Please check our home page for the most current times.• Expedited shipping is available during check out. It will speed up the transit time, but does not change our production time (see above).M O R E ∙ F R O M ∙ U Shttps://www.etsy.com/shop/CaitlynMinimalistIG: @CaitlynMinimalistThank you so much for visiting and hope you enjoy shopping with us ♡Kate ♡----------------------------------------------• All images are copyrighted by CaitlynMinimalist. All rights reserved •",
    "reviews": [
      "My daughter is so happy with her gift!!",
      "Fast shipping, names were spelled correctly. I absolutely love my necklace.",
      "My necklace arrived not exactly like I described it when ordering, so I contacted customer service and they were amazing! So helpful, and sent me a new necklace with the correct specifications. Very satisfied! Highly recommend.",
      "Thank you, it was a gift and she loved it!"
    ]
  },
  {
    "productId": "yLUGAtTHkM",
    "url": "https://www.etsy.com/listing/1254156728/leather-glasses-sunglass-case-for?click_key=13a9e2110dd1a4d0235afbbb9543d6908852e953%3A1254156728&click_sum=3fd86432&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-24&pro=1&etp=1&sts=1",
    "title": "Leather Glasses & Sunglass Case for Women,Minimalist Eyeglasses Case for Her, Personalized Soft Glasses Holder, Mother’s day Gift",
    "description": "You can see all our patterned belts with the link below and add them to your cart. For Germany orders, you do not pay shipping fees when you order 2 or more productshttps://www.etsy.com/de-en/shop/BriseLeather?ref=simple-shop-header-name&listing_id=1282522924&section_id=38468627Madeof soft and high quality leather.You can store your glasses with this minimal design case.Dimensions: Length - 16 x 7,5 cm",
    "reviews": [
      "Beautiful color and very well made product.  I love it.  ❤️",
      "Nice case for glasses. Just as pictured. Good transaction.",
      "Love my eyeglass case, nice quality and came pretty quickly considering it's ship internationally. Thank you!"
    ]
  },
  {
    "productId": "RSVGsevJdI",
    "url": "https://www.etsy.com/listing/865760988/personalized-family-name-metal-sign-last?click_key=25d72d524ce9e3e7bff6ea545ee53e4f22a53a04%3A865760988&click_sum=f5bf7415&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-13&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, Anniversary",
    "description": "01.07.24 Update! Thanks to our amazing clients we had an increase for December of over 50% vs last year! It caused a few delays in shipping with us and UPS but as of 01.10.24 we'll be back to our 24hr shipping as usual!!Personalized Family Name Metal Sign, Last Name Sign, Initial, Metal Monogram, Door Hanger, Housewarming Gift, Wedding Monogram, AnniversaryUSMC Veteran owned/ran shop, cutting and hand finishing steel made right here in the USA from a 200 year old family owned steel mill!Our full line of monograms:https://www.etsy.com/shop/Crosswoodworks?ref=seller-platform-mcnav§ion_id=26441026Monograms are NOT created the same, please, please look at the lines in the design for character, smooth flowing lines, depth of wider areas back to thinner areas. I customize EACH and every one, even tho they look like the others, they are not. When you look at the details, you will see the difference, even in the computer generated version which I'm using first to get these listed for my clients as fast as possible! Multiple fonts coming in block, script, serifs, modern. Hundreds of new designs over all in 2023 for monograms, address plaques, name plaques, ornaments, bottle openers, verses, phrases, all in multiple fonts for each phrase in multiple finishes, all cut and shipped via UPS (the most dependable, fastest, damage free carrier we have ever used) within 24 hours or the following business day when ordered by noon!!NO MORE WAITING FOR WEEKS!! CUTS AND SHIPS SAME OR NEXT DAY WHEN ORDERED BEFORE NOON!! WE ARE CHANGING 95% OF THE FOCUS OF PRODUCTION AT THE SHOP TO STRAIGHT FORWARD METAL PIECES WITH THREE MAJOR DETAILS:1. Extremely fast cut and ship that no one else offers2. 10\" - 96\" sizes that no one else offers3. Focus on excellent quality that our clients have come to expect in every hand finished piece that we touch. We do ourabsolute best to earn your respect, and your business.For Monograms, please ensure that you fill in all of the appropriate info for each style design.Finish note: All finishes except for Rust are sealed with a 20 year uv/weatherproof industrial powder coat for interior/exterior/seaside/desert/ use in any environment you can imagine. Rust is true rust, not sealed.Dark steel patina and rust vary in color on every piece.We cut EVERY single piece out of 14 gauge cold roll carbon steel, from family owned steel mills right here in the U.S.A",
    "reviews": [
      "It looks very nice and will make a fine gift",
      "Great looking sign... very pleased",
      "Item arrived soon than expected and it is just what I ordered and it is beautiful!",
      "Great wedding gift!! Everything was great with this purchase."
    ]
  },
  {
    "productId": "QqmmgOYYMn",
    "url": "https://www.etsy.com/listing/127443913/personalized-whiskey-barrel-1-or-2-or-3?click_key=f3303325f3bfa569c245d2cf1615e114b1fba7f0%3A127443913&click_sum=a2a2716c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-14&frs=1&etp=1&sts=1",
    "title": "Personalized Whiskey Barrel,  1 or 2 or 3 Liter Mini Oak Whiskey Barrel - Groomsmen Gift - Birthday Gift - Engraved Whiskey Barrel",
    "description": "This is the perfect gift for that favorite liquor or wine connoisseur in your life. It makes a great Groomsman, Wedding Party, Father's Day and Birthday Gift.This whiskey barrel is fully functional and can be used to age or store any spirit.This is a steel banded Oak Barrel/Cask and it comes with its own stand, spigot and bung which makes for convenient serving and filling. Each barrel/cask has enclosed directions.1 Liter Barrel measures 6.5 \" x 4.5\" x 4.5\"2 Liter Barrel measures 7.5” x 5” x 5”3 Liter Barrel measures 8.5” x 5.5” x 5.5”5 Liter Barrel measures 10\" x 7.5\" x 7.5\"10 Liter Barrel measures 12\" x 9\" x 9\"This is for one barrelFor other great groomsmen and men gifts click here:http://www.etsy.com/shop/MyPersonalMemories?section_id=13236312Thank you for looking,Kristin",
    "reviews": [
      "My husband absolutely loved this gift and the quality",
      "So I love the custom engraving we got! We planned on using for our wedding the only thing is there’s loose pieces of wood that didn’t come out when we cleaned it, besides that it’s pretty but we hope to figure out how to get those loose pieces out so we can blend our whiskeys!",
      "It was perfect! My husband loved it!"
    ]
  },
  {
    "productId": "nFPMarkoiI",
    "url": "https://www.etsy.com/listing/1617910897/personalized-night-light-customized?click_key=a996dadc496c2abd6e00327026d32c3286b3c266%3A1617910897&click_sum=dbff9d38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-15&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized Night Light, Customized Birthday Gift, Gift for Nursery, Girl, Daughter, Boy, Him, Baby Shower, Dad, Mom, Her, Boyfriend",
    "description": "Christmas Gift, Birthday Gift from Daughter, Personalized Night Lamp, Custom Night Light, Anniversary gift for Him, Her. Gift for kids, boy, girl, son, daughter.Are you looking for a night light to brighten up your child's bedroom? Or a decorative, elegant, and personalizable gift for a loved one? You have come to the right place!Our homemade lights are the perfect gift for your loved ones. Whether it’s for Christmas, Valentine’s Day, Father’s Day, Mother’s Day, Birthdays, Weddings, or any other event, our lights are fit for the occasion!🌸–Light Information–🌸Dimensions of the lights:- Cloud Light = 8\" wide 6\" height- Rectangular and Oval Lights = 6\" wide 8\" height- Heart Light = 6.7\" wide 6.7\" heightThe acrylic is made out of 100% Virgin MMA.The wood is made out of Basswood, more commonly known as Lindenwood.The product comes with:- The acrylic- Wood stand- 3 ft. USB cable with on/off button*Power adapters are not provided with the order*The LED in the light lasts up to 50,000 hours.Made in Canada.There are no harmful ingredients in the lamps.🌻–Personalization Information–🌻We can engrave your personalizations to both the acrylic and the wood to add a personal touch to your orders!- If you only want personalization on the acrylic, please select “No thanks” for the woodpersonalization. Then, write your request in the box provided.- If you want both acrylic and wood personalizations, please select “Yes please” for the woodpersonalization. Then, write your request in the box provided. Please specify whichpersonalization you would like to write on the acrylic and which one you would like on thewood.Personalization Request Example:Acrylic = Michelle & JohnWood = I love you to the moon and back.Acrylic Personalization:We can only engrave with 1 font (examples provided in the pictures).- Cloud Light = Only one name (one word) can be written on the cloud acrylic.- Rectangular and Oval Lights = We can engrave two names, a date, and a sentence on theacrylic. If you would like all 3 on the acrylic, the sentence needs to be a maximum of 6words. If you only want a sentence without names or a date, it can be two lines long.- Heart Light = Maximum two names and one date can be written on the acrylic.Wood:We can only engrave with 1 font (examples provided in the pictures).A maximum of two lines can be written on the wood.Logo Engraving =We can engrave logos on the lights as well. If you would like to engrave a certain logo, please message us through Etsy messages and send the picture you would like.🌷–Shipping Information–🌷We prepare and ship your products in 1 or 2 business days.Normally, Canadian customers receive their orders in 3-10 business days. Whereas, US customers receive their orders in 3-7 business days.*Please note that during the holiday season, there may be delays in shipping. We are not responsible for these delays.*🌹–Light Care–🌹- Before you start using the light, please remove the protective film behind the acrylic part.- In order to keep the light clean, you can use a glass cleaner with a soft cloth to wipe the acrylic part.If you have any questions, please message us through the Etsy messages and we can gladly assist you the best we can!We can make your order in 1-2 days.Canadian customers receive their orders in 3-10 business days.US customer receives their order in 3-6 business days.",
    "reviews": [
      "Had a small problem that was quickly resolved. Love this night light!",
      "Great experience with seller! Would recommend",
      "Great! Just as described and fast shipping",
      "The item matched the description and it’s so cute!"
    ]
  },
  {
    "productId": "ShYqBWjWiu",
    "url": "https://www.etsy.com/listing/1336593575/personalized-makeup-bag-customized?click_key=ad3ceb9b9627ae37c5a6cc8da02ba3a5d899b2ce%3A1336593575&click_sum=edf0877f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765482-4-16&pro=1&bes=1",
    "title": "Personalized Makeup Bag, Customized Toiletry Bag, Monogram Cosmetic Organizer, Gift for Her, Bridesmaid Gift, Maid of Honor, Christmas Gift",
    "description": "Introducing our exquisite Personalized Bridesmaid Makeup Bag, a must-have accessory for creating unforgettable memories with your bridal party!Elegance meets practicality in this stylish, customizable makeup bag, designed to make every member of your bridal party feel extraordinary. It's more than just a bag; it's a keepsake they'll treasure for years to come.Each makeup bag is carefully personalized with the names of your beloved bridesmaids, transforming it into a truly unique and thoughtful gift. Imagine the joy on their faces as they receive their own personalized bag, with their name elegantly displayed.Our makeup bag offers a roomy main compartment, perfect for storing cosmetics, brushes, and all their beauty essentials. Inside, you'll find two optional pockets, ensuring convenient organization and easy access to smaller items.But this makeup bag is more than just storage; it's a symbol of unity and gratitude. Your bridal party will feel a sense of pride and togetherness as they carry their personalized bags, creating beautiful memories together.With an eye for detail, our makeup bag effortlessly blends sophistication and versatility. Its timeless design complements various bridal themes and styles, making it the perfect accessory for any occasion.Whether you're searching for the ideal bridal shower gift or a heartfelt gesture for your bridesmaids, our Personalized Bridesmaid Makeup Bag is the ultimate choice. Delight your bridal party and ensure they feel cherished throughout the journey to your special day.Don't miss the chance to make your bridal party truly unforgettable with these personalized makeup bags. Let us add a touch of elegance and individuality to your celebration, ensuring it becomes a cherished experience for all. Order now and create lasting memories with these personalized treasures.Additionally, our Personalized Bridesmaid Makeup Bag makes for a thoughtful Christmas gift for your cherished relatives. With its elegant design and customizable personalization, it's a versatile present that spreads holiday cheer and warm wishes.Sizes : 20 cm x 11 cm x 9 cm (7.87 inch x 4.33 inch x 3.54 inch)------------------------------------------------------------------------------------------------------------------------------------------Who we are ?At Atelier Yula, we believe that personal style is an expression of individuality and creativity. That's why we offer a curated selection of handmade, personalized bags that are both elegant and functional. Whether you're looking for a unique gift or a stylish accessory, our bags are the perfect choice.We also take the art of personalization to the next level. Each of our bags can be customized with the customer's name or initials, making them one-of-a-kind keepsakes that the customer can treasure for years to come. Our focus on quality and attention to detail means that each bag is made with care and precision, ensuring that every customer is completely satisfied with their purchase.We're a small team of artisanal craftsmen who are passionate about creating beautiful and functional products. Whether you're looking for a stylish tote for everyday use or a unique accessory for a special occasion, Atelier Yula has something for everyone. Shop with us today and discover the art of personalized style!",
    "reviews": [
      "Beautiful item, quick turnaround- no complaints",
      "Fast and accommodating service. Would definitely use it again.",
      "Fast shipping and great quality makeup bags! They are perfect to fit travel sized goodies in and have a loop on the end to hold as you open it, which is a nice option.",
      "My bridesmaids absolutely loved them"
    ]
  },
  {
    "productId": "IinyswWeV1",
    "url": "https://www.etsy.com/listing/1566239851/book-embosser-stamp-rubber-stamp?click_key=9b74d62917ffab729c9b30579d267a97fabc4f04%3A1566239851&click_sum=6d280c2a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-25&pro=1&frs=1&etp=1&sts=1",
    "title": "BOOK EMBOSSER STAMP | Rubber Stamp | Personalized Stamp for Book Lovers | Wood or Self Inking Option | 5 Designs to Choose | Book Stamp",
    "description": "Turn your Library Stamp into a beautiful fine stamp. This beautifully made library stamp will last for years. We have supplied these to some of the biggest names in the craft market and we are sure they will help your brand stand out too.♥ WELCOME TO STAMP BY ME ♥We create custom, hand-made rubber stamps from our shop to your home.➤ The perfect gift for book lovers, or for yourself! The \"from the library of\" text can be changed if desired. My designs are 100% customizable as you desire!You will receive:○ Book Stamp customized with your name/text○ Beautiful paper bag for your stamp.♥ STAMP INFORMATION ♥1. WOOD STAMP SIZE: wood hand stamps are a 1 3/4\" x 1 3/4\" impression area.2. SELF INKING STAMP SIZE: self inking stamps are a 1 1/2\" x 1 1/2\" in diameter impression area.3. The self-inking stamps are Colop models - which will last, literally, for thousands and thousands of impressions.4. Wood stamps do not come with an ink pad unless that stamp type is chosen in the drop down.○ Wood stamps are made from maple wood and laser-etched renewable resource grey rubber.○ Self-inking stamp is available with different color ink. Self-inking stamps are made from post-consumer recycled plastic, and laser-etched renewable resource rubber.DO YOU NEED AN ADDRESS STAMP?https://www.etsy.com/listing/692908969/custom-address-stamp-personalized?ref=shop_home_feat_1&frs=1DO YOU NEED A WEDDING STAMP?https://www.etsy.com/listing/680914911/wedding-stamp-custom-wedding-stamp?ref=shop_home_feat_2&pro=1&frs=1♥ My team and I are working hard to ensure you get your order on time. We pride ourselves on fast shipping, so in order to adhere to Etsy's ship-on-time expectations we currently are not offering proofs. ♥Please be sure to include all your details and information needed with your order. Our team is carefully customizing your products and making sure there are no errors with your selections and/or artwork before shipping. If there happens to be an issue, we will provide you with a digital mockup and place your order on hold for up to 24 hours. During this time, please review and communicate any changes you would like to make.If we can not resolve any issues within 24 hours, we will cancel and refund so that you can place your order again when you have all the required information. If you have any concerns about how your order will look, you are more than welcome to send us a message before purchasing!➤ SHIPPING: Please let us know if your item takes longer. We also offer an upgraded tracked service please see shipping details.FAST (WITH TRACKING NUMBER):USA: 3-7 working daysEurope: 3-5 working daysRest of the world 5-8 working daysEXPRESS (WITH TRACKING NUMBER):USA: 1-3 working daysEurope: 1-3 working daysAustralia: 3-7 working daysRest of the world 2-4 working days▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬",
    "reviews": [
      "Perfect! I love my stamp :)",
      "works. pad is not the fanciest, but it is servicable",
      "This was a gift and it turned out perfectly"
    ]
  },
  {
    "productId": "UqgoPBGbSJ",
    "url": "https://www.etsy.com/listing/1422630067/personalised-leather-glasses-case?click_key=354d9560bda5c56be2f0217da21a9887780b45e7%3A1422630067&click_sum=ff75cd41&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-26&etp=1",
    "title": "Personalised Leather Glasses Case, Monogram Leather Sunglasses Case, Custom Sunglasses Case, Leather Case for Glasses, 50th Birthday Gift",
    "description": "Our personalised leather glasses case in a choice of vibrant colours makes a stylish gift for anyone who wears glasses. A lovely colour pop but also extremely useful gift.Monogrammed by hand in our Devon studios the leather glasses case is hand foiled with the initial letters of your choice in either silver or gold foil (with up to 4 initials.) on the front of the case.The leather glasses case is contemporary and lightweight being made from textured Italian leather with a gold stud to secure the strap fastening - a stylishly practical way to keep her eyewear scratch free.Perfect for  every day, reading or driving glasses or sunglasses which can be stored safely in a bag, briefcase, on her desk, in the car or in a travel bag.The glasses case is presented wrapped in crisp white tissue. We also offer a luxury gift wrap upgrade for a lovely finishing touch.Dimensions:16.5cm x 8cm x approx 3 cm with gold stud fasteningVisit our Etsy store for our full range of beautifully designed and made jewellery and personal accessories:https://www.etsy.com/shop/penelopetom",
    "reviews": [
      "Superb, quality item. Would recommend.",
      "This is so nice-I can find the bright color in my bag easily and the case fits my larger sunglasses.  I get lots of compliments on it.",
      "Nicely crafted and the color is perfect.  Will definitely buy more and give as a gift.",
      "Gorgeous, thank you so much! Such lovely quality and fast postage"
    ]
  },
  {
    "productId": "XmQiTspsia",
    "url": "https://www.etsy.com/listing/1477944561/personalized-whiskey-decanter-decanter?click_key=ad862eb4ede079a6935db5b093c4693e67273a57%3A1477944561&click_sum=c3d0aac9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-27&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Whiskey Decanter, Decanter Anniversary Gift for Him, Boyfriend Gift, Fathers Gift,Best Man Gift, Groomsman Gift, Wedding Gift",
    "description": "Looking for a unique and unforgettable gift?Our personalized whiskey glass sets feature laser-engraved designs that are permanent and one-of-a-kind. Perfect for special occasions like groomsmen gifts, Father's Day, and anniversaries, these whiskey glass sets are sure to impress and make lasting memories.♥ DETAILS:Decanter measures 3 1/2'' x 9'', holds 32ozSmall glass measures 3'' x 3'', holds 6ozLead-free glass, dishwasher safe♥ HOW TO ORDER:There are a variety of different combinations in the list, please choose the set you want to orderPlease leave your personalized content in the personalization box.If you would like to purchase more than one, please enter all personalized content into 1 personalized box, then select the quantity and add to the basket and checkout together.If you have any questions please feel free to contact me and I will get back to you within 24 hours. Weekend hours may be longer.",
    "reviews": [
      "lovely gift for my dad! loved how it turned out",
      "It did take pretty long for it to ship and get delivered but I was satisfied with the product. The packaging was very well protected and the box and glasses are great quality! The engraving was perfect. Gifted this to my boyfriend for his birthday!",
      "literally so amazing. i love it",
      "Excellent quality and timely shipping."
    ]
  },
  {
    "productId": "siSgCbgq4t",
    "url": "https://www.etsy.com/listing/1340787406/personalized-genuine-leather-belt?click_key=620187ceb4abcfb7bec23974cef2ea05792a230e%3A1340787406&click_sum=a380e6a8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-28&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Genuine Leather Belt, Valentines Gifts for Him, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Bronze Gifts for Men",
    "description": "🎁🎁 UNIQUE LEATHER PIECES FOR YOUR LOVED ONES! 🎁🎁Personalized Genuine Leather Belt, Christmas Gifts for Him, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Bronze Gifts for MenThese customizable leather goods are perfect for special occasions. They’ll make a perfect third-year anniversary gift. You can bring joy with these as a Christmas gift. Your dad will love this durable leather belt as a Father’s Day gift. And many more other special days and occasions…⚜We use top-grain bovine leather for a sturdy, long-lasting finish. This belt matches beautifully with your dress pants and suits. It creates a neat, stylish look.⚜We offer two engraving placement options—inside and outside. You can choose both if you like.‼ PRODUCT DETAILS ‼⚜1 5/8 inches wide.⚜Top-grain bovine leather.⚜Sizes from 32 to 44.⚜Colors: Black, Brown, Tan, Blue, Green, Gray⚜Personalization:- Outside - Perfect for names, monograms, and logos.- Inside - Long messages look best inside.- Please keep in mind that the longer the text the smaller the font will be.⚜Plenty of personalization styles for your convenience. You can find the chart in the product images.‼ HOW TO ORDER ‼⚜Choose the color you love.⚜Choose the engraving placement.⚜Add your personalization into the personalization box. Please make sure to specify the style you want.E.G-1(Outside - Style 3)DANNYE.G-2(Outside - Style 9)ROBERT(Inside - Style 10)Three years down, forever to go!‼ If you’re purchasing the No Engraving option, please write No Engraving or N/A. ‼Personalized Genuine Leather Belt, Father's Day Gift, Custom Engraved Mens Belt, Anniversary Gifts for Husband, Gifts for Him, Long Distance",
    "reviews": [
      "great gift to my husband he wears it all the time!",
      "Beautiful work and great service from the seller!",
      "Such a beautiful belt! The lettering is perfect! Thank you!",
      "Excellent gift for my fiancé it looks perfect!"
    ]
  },
  {
    "productId": "seZHQkDWcS",
    "url": "https://www.etsy.com/listing/1112907071/personalized-blanket-for-adults?click_key=0ff9df0b49cd72407c706b0c92e6d3e9aa40bbc6%3A1112907071&click_sum=439cf169&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-29&pro=1&etp=1&sts=1",
    "title": "Personalized Blanket for Adults Wholesale, Monogram Custom Throw Blanket, Couples Gift Blanket, Wedding Favors, Cotton Anniversary Gift",
    "description": "What better way to bring into your life than by wrapping yourself in one of these gorgeous personalized throw blankets, the perfect addition to any cozy decor! Made with 100% cotton and measuring a comfortable 70 x 54 inches, this custom throw blanket is perfect for snuggling up on the couch, reading a book, or enjoying a movie night. Our personalized blanket for adults is available in a range of colors and designs, making it a unique and stylish addition to any home.Crafted with high-quality materials and attention to detail, our custom throw blankets are perfect for wholesale purchases, corporate gifts, and special occasions. Give a housewarming gift, new home gift, anniversary gift, or bridal shower gift that will be treasured for years to come. Whether you're looking for a cozy addition to your own home or the perfect gift for someone special, our personalized throw blankets are the perfect choice.Our personalized throw blankets can be embroidered with a special message, monogram, or custom design, making them a truly one-of-a-kind gift. These blankets are also a great choice for businesses looking to create custom corporate gifts. Add your company logo or special message to create a unique gift that employees and clients will appreciate. With its cozy and stylish design, our custom throw blanket is sure to become a go-to accessory for any home or office. Make a statement with our personalized throw blankets today!*Designs are optional. You can add a design amongst the text. Example: Katie (Love)🧶MATERIAL  100% Turkish Cotton🧵PERSONALIZED GIFT  Get your friends and family a custom throw blanket for one-of-a-kind gift✔SIZE  54 x 70 inches, 135 x 175cm👌WEIGHT  24oz, 660gr💦CARE  Wash at 40ºC, low cycle, medium iron◄ HOW TO ORDER ►1. Select your throw blanket color and quantity.2. Select if you want personalization. Type the text you want. We can embroider MAXIMUM 40 CHARACTERS.*Designs are optional. You can add a design amongst the text. Example: Katie (Love)3. Choose your font style.4. We will use black thread for embroidery, if you need another color please write it to us.5. Please provide us with your date-needed-by. If you need more room to write, please use the \"notes to seller\" section during checkout.We love chatting with our customers! Please send us a Convo if you have any questions.◄ RETURNS ►No returns are accepted for personalized items; however, we would be happy to accept return for up to 30 days of the original shipping date, provided that the item is: 1) not personalized and 2) in new, unused, unwashed condition. If we make a mistake in shipping or personalizing your order, we will fix it at no cost to you. No personalized items can be returned, so please be sure to double check an order before you place it.",
    "reviews": [
      "Fantastic service again! I have now bought three for gifts and they are always loved!",
      "Blanket is well made but a little light weight. Embroidery was perfectly done.",
      "Our friend was so surprised and loves it so much"
    ]
  },
  {
    "productId": "VpyWnHindi",
    "url": "https://www.etsy.com/listing/1575060246/custom-bar-bracelet-paper-clip-with-mini?click_key=6bb3a1e74f747bfaf02bc4ca49a7e0e4b290be2b%3A1575060246&click_sum=f4f65ed6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-30&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Bar Bracelet, Paper clip with mini bar, Kids Name Bracelet, Mom Bracelet",
    "description": "Custom Bar Bracelet, Paper clip with mini bar, Kids Name Bracelet, Mom BraceletThe tiny multi bar bracelet with a paper clip chain is one of the newest jewelry pieces in the chain.It matches any style and almost any occasion.. . . . . . . . . . . . . . . . .★ Detail- 14K Gold Filled, 925 Sterling Silver, or 14K Rose Gold filled- Bar size:15mm*4.5mm★ How to OrderStep 1,Choose \"metal color\" and \"# of bar \" in the 1st drop-down box.Step 2,Choose chain \"Length(wrist size)\" at the 2nd drop-down section.In the personalization box:1. font style(see font selections in the picture):2. write a name/symbol/initials for each barBar 1:Bar 2:Bar 3:** How do I determine my bracelet size?Step 1: Measure your wrist just below the wrist bone,where one would normally wear a bracelet,with a flexible measuring tape or a strip of paper.Step 2: If you are using a plain strip of paper,then measure that paper strip with a ruler to determineyour wrist size.Step 3: Add 1/4 inch to 1 inch (average is 1/2 inch)to your wrist size, depending on whether you would likea snug, comfort.★ Each item will come with a gift box, an anti-tarnish bag for storage, and a polishing cloth.* * About 14K Gold FilledI use Double-Clad 14K Gold Filled which is the next level and is an amazing, quality alternative to solid gold. Gold plating is the lower level; these items tend to tarnish and can often turn the skin green. But, Gold Filled is more durable and tarnish resistant. Gold Filled: Gold filled is an actual layer of gold-pressure bonded to another metal.* Each item will come with a gift box and an anti-tarnish bag for storage.Please follow us on Instagram: #LuvLaceJewelsThank you",
    "reviews": [
      "Very nice piece. Great gift.",
      "I Love it so pretty!",
      "This was a gift for my friend and she loved it! Thank you!"
    ]
  },
  {
    "productId": "nNNWdw4dLq",
    "url": "https://www.etsy.com/listing/1299945364/custom-ceramic-mugs-custom-pottery-mug?click_key=a3cd26db08df1882f761c72b02f85146b528423b%3A1299945364&click_sum=1ad1d84a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-31&pro=1&etp=1",
    "title": "Custom Ceramic Mugs, Custom Pottery Mug, Custom Gift, Personalized Red Mug, Personalized Gift, Custom Pottery",
    "description": "If you are unsure of what to get family members or colleagues to celebrate a birthday or even a special day for you, consider ordering personalized coffee mugs. Custom mugs are very versatile and make incredible gifts in any situation, particularly for mothers or children.A great reason to give mugs as gifts is because they are incredibly versatile. Almost anyone would be excited to receive a mug, because they are very useful and are great to keep either at work or at home for hot drinks. Your friends will likely be happy to have a gift mug to keep at home.12 oz. for other colors;https://www.etsy.com/listing/1179605879/Use:-Food safe glaze.-Hand washing is always preferred for any handmade clay piece.Condition:These images give a good idea of the one you’ll receive. Each cup is unique. This is why color, motives and format can vary from one to another. See it as the pledge of a work done by hand.",
    "reviews": [
      "The mug turned out perfectly! Beautiful quality.",
      "Gorgeous! So well made and so special to have it personalized. Thank you so much, what a wonderful gift!",
      "Adorable mugs! Would definitely buy from here again!",
      "I ordered a mug as a gift for a friend and she absolutely loved it! The quality is amazing!"
    ]
  },
  {
    "productId": "oDDmyLxOMV",
    "url": "https://www.etsy.com/listing/1095910732/birthstone-necklace-for-mom-family?click_key=b53d058f6a7e35cc9a65a6e757c26df2521a49eb%3A1095910732&click_sum=f43dec37&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-32&pro=1&frs=1&etp=1",
    "title": "Birthstone Necklace for Mom  Family Birthstone and Initial Necklace Mother's Day Gift   Personalized Gift for Grandma Mom Gift From Son",
    "description": "This beautiful cascading birthstone necklace makes a perfect Mother's Day gift for any mom in your life!  Help them keep their loved ones close this Mother's Day!Upgrade to USPS Priority or USPS Priority Express during checkout for faster shipping!The list of available stones is listed below (also see pictures).  You can add leaf charms that are hand stamped with the initials of your loved ones.Add gift wrap at checkout to make your mom, wife or grandma feel extra special!  Please reach out to me on Etsy messaging if you have any questions!Your necklace can grow with your family!  Families grow and change, so I want to make sure your family birthstone necklace stays reflective of your family.  In the future, if you need adjustments to your necklace please reach out to me on Etsy and I can create a custom listing to add stones and adjust your necklace as needed.When ordering, please choose your birthstone colors (options listed below), chain metal, and chain length.Please note:1st drop-down menu:Select the number of BIRTHSTONES for your necklace.  The birthstones are approximately 9mm x12mm.2nd drop-down menu:Select the METAL (Gold-Filled or Silver) & LENGTH for your necklace.Please add a note in the customization message box to tell me the color of BIRTHSTONES you would like and in what order you would like them placed.  If ordering initial charms, please include that information as well.  List the stones and initials from top to bottom (ex. 1-June(A), 2-May(B), 3-December(H)).  If you order a necklace with initial leaves, but do not list them in the personalization box, I will include blank leaves on your necklace.ADD LENGTH TO NECKLACE (BEYOND 24 INCHES)If you would like a longer necklace, please use this listing to add length to your necklace.  Select the number of inches you would like added to your necklace (on top of the first 20 inches):https://etsy.me/2T7itdHADD EXTRA LEAVES TO YOUR NECKLACEIf you would like to add extra leaves to your necklace, please use this listing:https://www.etsy.com/BedrockBijoux/listing/779948819Please leave detailed instructions in the personalization box to tell me where the extra leaf(ves) should be added.ADD BLACKENED LETTER LEAVES TO YOUR NECKLACEIf you would like leaves with blackened letters, please use this listing to purchase your necklace:https://www.etsy.com/BedrockBijoux/listing/684954506CUSTOM LISTINGPlease message me if you would like a custom necklace.  I am happy to make a custom listing for whatever you may desire.BIRTHSTONE COLOR OPTIONS:1. Garnet - January2. Amethyst - February3. Aqua Blue Chalcedony  - March4. Clear Quartz - April5. Raw Emerald - May6. Green Onyx - May7. Moonstone - June8. Alexandrite - June9. Ruby (Clear) - July10. Ruby  (Opaque) - July11. Peridot  - August12. Sapphire - September13. Lapis Lazuli - September14. Opalite - October15. Pink Chalcedony - October16. Pink Tourmaline - October17. Citrine - November18. Blue Zircon - December19. Tanzanite - December20. Turquoise Howlite - DecemberPlease note that the stones may vary slightly in size, shape, and color and natural stones may sometimes contain natural inclusions.  All stones are hydro quartz with the exception of Raw Emerald, Lapis Lazuli, and Turquoise.MATCHING BIRTHSTONE EARRINGSMatching Birthstone Earrings are available here for an additional cost:https://etsy.me/2O83W0kMATCHING BIRTHSTONE BRACELETMatching Birthstone Bracelet is available here for an additional cost:https://etsy.me/2GaWqhHMATERIALSThe chain is 14k Gold Filled or Sterling SilverThe stone bezel is Gold Vermeil or Sterling SilverThe birthstones are approximately 9mm x12mmThe leaves are plated in gold or silverProduction Time:  Check shop announcements for current production times!",
    "reviews": [
      "I bought this as a gift for my mom for her 40th birthday and it was perfect!!! I also ended up requesting a different stone for one of the charms so that all of the colors would work together a little better and the seller happily made the change. Thank you Brit!!!!",
      "Lovely necklace delivered quickly and just as described.",
      "Daughter love it so pretty",
      "I’m excited to have received the birthday stones necklace I ordered from your shop. It’s very pretty, perfectly made, and looks exactly as I hoped. It’s a birthday gift for my daughter, and I know she is going to love it. Thank you so much."
    ]
  },
  {
    "productId": "mJarTO4Dbp",
    "url": "https://www.etsy.com/listing/846327639/handmade-personalised-leather-bookmark?click_key=bfdfd6a5488272864fc5551c2839f0d4e2fc8a0e%3A846327639&click_sum=0c66b273&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-33&etp=1&sts=1",
    "title": "Handmade Personalised Leather Bookmark, Gifts For Him and Her, Teacher Gift, Mother's Day, Wedding Gift , Reading Gift, Anniversary Gift",
    "description": "Are you tired of dog ears pages in your book and not knowing where you left off when you are reading? We were too, so we decided to fix that by creating the most DESIRED and compelling personalised leather bookmark on the market. With our personalised Leather Bookmark, you are guaranteed in not losing your place in a book or resorting to folded corners.Nothing beats a freshly designed sleek personalised leather bookmark to help you keep track of the pages when reading.Whatever your style is, we designed a versatile enough personalised bookmark to handle it.HOW TO ORDER1. Please make your leather colour selection, then select your loop colour2. In the personalisation box, please enter the personalisation style of your choice, then your messageWe emboss in capital letters and numbers, and we also have available the following symbols: @ # & . ♥ ♡☆ % ? ! \" \" / 'LEATHER COLOURWe have a variety of 7 premium leather colours for you to choose from for both bookmark and loop colour.PACKAGINGWe take pride in our packaging to safely deliver your products to you so we offer a stylish and elegant bookmark box for those magical special gifts, please add that from the drop-down menu when selecting your leather.DIMENSIONS / SIZELength : 18cmWidth: 2.1 cmLeather : PremiumLeather Type: Vegetable Tanned ( no chemicals )Origin: ItalyPERSONALISATIONEngrave the recipient's name, a heartfelt message, or a meaningful quote, that will transform this bookmark into a one-of-a-kind special memory to be treasured for a lifetime. Whether it's for a bookworm, a student, or a special person in your life, our personalised Leather Bookmarks make an unforgettable gift that celebrates their individuality and love for reading.EMBOSSED- OPTION 1: GOLD FOIL - Max 3-15 letters/numbers, we can only emboss capital letters- OPTION 2: SILVER FOIL - Max 3-15 letters/numbers, we can only emboss capital letters* if your personalisation is over 15 characters we will automatically progress with laser engraving.LASER ENGRAVED ( BLACK WRITING )- OPTION 1 : Cursive text - maximum 2 sentences 5/6 words each sentence- OPTION 2: Arial text - maximum 3-4 sentences 5/6 words eachI engrave my creations to make bespoke items especially for you or your loved ones, I am always happy to try and help if something is unsuitable.I also offer other models, click the link below:https://www.etsy.com/uk/shop/LucianLeatherGoodsUK :  Shipped by Royal Mail 1st Class  ( 1-2 working delivery days )International : Sent by Royal Mail Standard , which aims to deliver in 10 working daysInternational : Track and Signed recommended - Upgrade available at checkout.Occasions this would be suitable for :Father's Day Gift, Valentines Day Gift , Christmas Gift, Birthday Gift, Anniversary Gift, Third Wedding Anniversary Gift, Guest Gifts, Engagement Gift, Housewarming Gift, Graduation Gift, New Car Gift, New House Gift, Mother's Day Gift, Wedding Favours, Wedding Day Gifts, Baptism Gift, Corporate Gifts and Social Events Gifts.",
    "reviews": [
      "Once again, another fabulous buy from Lucian. \nGreat product and great service. \nThank you :)",
      "A great product, great price and delivered quickly.",
      "Beautiful item would definitely recommend",
      "Thanks",
      "Third time I've bought from this seller - lovely items and really fast too",
      "Thank you Lisa"
    ]
  },
  {
    "productId": "VSeJTvVCkC",
    "url": "https://www.etsy.com/listing/613708533/personalized-leather-padfolio?click_key=b852a27cf1d40ec33ad6207abbf1b71f0d7d0780%3A613708533&click_sum=e8e0c105&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-34&pro=1&frs=1&etp=1&sts=1",
    "title": "PERSONALIZED Leather Padfolio Monogrammed Leather Portfolio Cover Custom Corporate Gift Monogram Initials For Him and Her | Marshall",
    "description": "All your meeting essentials in one place.A distinguished leather padfolio sure to leave an impression.By using the top 3% of all cowhides, we ensure you're getting the best leather money can buy. Every craft sold sponsors a day of education for a child in need.● A4 pocket, business card holder, pen & legal pad holder.● 9” x 12”● Designed for use with 8.5” x 11.75” standard legal pads.● Legal pad not included.● Authentic PEGAI full-grain leather● PEGAI Marshall Padfolios Gift Box Link:https://www.etsy.com/listing/1441724934/FAQ■ Does this include a legal pad?No. This padfolio will accommodate standard legal pads of 8.5” x 11.75” .■ What are the product dimensions?Our full size padfolio measures: 12.5” x 9.5” x ¼”■ What makes Pegai leather special?At Pegai, we only use the top 3% of hides. This is the best leather your money can buy.We only work with minimal leather finishes to accentuate the hide grain's natural beauty and embrace the imperfect elegance of nature's intention.These finish types do NOT cover any imperfections such as bug bites, veins, fence scratches, and other markings that tell a story about the bull’s life.To us, leather is a living object, and it has to be treated with respect at all stages of this crafting process, which is why PEGAI opts for a more “raw” look of leather with very few treatments.■ How do I care for my leather?Little to no maintenance needed.Our leather is treated with oils and waxes to make it maintenance-free. It is not considered waterproof even though it has a small amount of water repellent waxes in the mix.nally, we achieve this minimally finished full grain aniline hide that will age into a darker shade as it develops a unique patina through human interaction. Enjoy and embrace the nature of leather that hasn’t been scrapped of its character for the sake of standardization and mass-manufacturing!PERSONALIZATION INSTRUCTIONS1. Please enter your request exactly as you’d like it to appear. 8 characters MAX, including spaces and special characters.No inside engraving.2. Accepted Characters:All Latin UPPER and Lowercase Letters (ABC abc)All Numbers (0123)Special characters: , . ! @ # $ % & * ( ) - + ? ♥ “No accents or emoji3. Firebranding is Times New Roman font only.4. For company logo engravings, please reach out for further assistance.- 𝐰𝐡𝐢𝐜𝐡 𝐢𝐭𝐞𝐦𝐬 𝐚𝐫𝐞 𝐫𝐞𝐭𝐮𝐫𝐧𝐚𝐛𝐥𝐞 -✳ 𝑢𝑛𝑢𝑠𝑒𝑑, 𝑛𝑜𝑛-𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑒𝑑 𝑖𝑡𝑒𝑚𝑠ෆ These items can be returned within 30 days of delivery. The customer will be responsible for their own return shipping method.✳ 𝑛𝑜𝑛-𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑒𝑑 𝑖𝑛𝑐𝑜𝑟𝑟𝑒𝑐𝑡 𝑖𝑡𝑒𝑚ෆ The team will send a pre-paid label so we can get the item back in the workshop. We will then replace it with the correct item or offer a full refund (whichever the customer prefers).✳ 𝑑𝑎𝑚𝑎𝑔𝑒𝑑 & 𝑑𝑒𝑓𝑒𝑐𝑡𝑖𝑣𝑒 𝑖𝑡𝑒𝑚ෆ Kindly send a picture of the damage or defect via Etsy messages so that we may further assist with repairs and replacements.✳ 𝑟𝑒𝑚𝑖𝑛𝑑𝑒𝑟𝑠ෆ Please note that personalized items that were correctly fulfilled and are not damaged nor defective are non-returnable and non-refundable.ෆ Shipping fees and customs fees (if applicable) are also non-refundable.ෆ Please note that due to the nature of our leather, we do not consider natural markings as item defects. This is simply because we only work with minimal leather finishes to accentuate the hide grain's natural beauty and embrace the imperfect elegance of nature's intention. These finish types do not cover any imperfections such as bug bites, veins, fence scratches, and other markings that tell a story about the animal's life.",
    "reviews": [
      "I really liked it a lot",
      "The shipping was fast and the folio was better than it looked in the pictures.",
      "Great customer service, let me change shipping info after order was placed. Great gift for my soon-to-be lawyer sister, she loved it!"
    ]
  },
  {
    "productId": "Jt3ncqIbvh",
    "url": "https://www.etsy.com/listing/1209132189/mens-bracelet-personalized-sailing-rope?click_key=64a2ce2c36f4ba3e4bf3a08040e5275b063ede96%3A1209132189&click_sum=8e0400ae&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-35&etp=1&sts=1",
    "title": "Mens Bracelet - Personalized Sailing Rope Bracelet - Engraving - Surfer Bracelet - Partner Bracelet - Stainless Steel A184",
    "description": "Discover the essence of nautical elegance with this simple yet sophisticated bracelet, crafted from premium-grade sailing rope. Its skin-friendly material and comfortable design make it a delight to wear. The bracelet's size can be effortlessly adjusted with a gentle tug on the knots, ensuring a perfect fit for any wrist.Elevate this accessory to a personal treasure by opting for a custom engraving on the stainless-steel bead, tailored to your desires. This bracelet is not only durable but also completely waterproof, making it an ideal companion for your showers, swims, and active pursuits.Specifications:- Rope thickness: approximately 4 mm- Bead dimensions: roughly 10x20 mm- Adjustable bracelet length: 5.5 to 9 inches.(suitable for nearly all wrist sizes)Color/Material Options:- Sailing rope available in 12 distinct colors, made from high-grade, enduring material sourced from the USA.- Custom Pearl• Silver - High-polished stainless steel• Black - Matte black stainless steelOur superior plating technique ensures lasting color retention. Stainless-steel jewelry is exceptionally sturdy, rust-free, nickel-free, and hypoallergenic, significantly reducing the likelihood of allergic reactions. It maintains its luster without tarnishing or discoloring.Engraving Details:- Engraving available on both sides.- Maximum of 12 characters or 2 symbols per side.- Mix and match text with symbols.- Schwarz 1-seitig means that the pearl is engraved and black on the front side.- Silber 2-seitig means that the pearl is engraved and silver-colored on the front and back sides.- Engraving examples: Anna (G03), on the reverse: H10, or Anna (H01) LucasEngraving Inspiration:- Names- Words- Dates- Initials- Symbols- Symbols with text- Or opt for no engraving for a classic lookOrdering Process:1. Select your desired options from the drop-down menu.2. In the note box, specify your engraving wishes and font choice.3. Add to cart and proceed to checkout.Please Note:- If no font preference is specified, we will choose one for you.- Understand that personalized or custom-made products are not eligible for exchange or return.- To ensure the longevity of your jewelry, we recommend following the included care instructions.✧ About VIVIANNA• Every piece of jewelry is lovingly handcrafted to your specifications in our Hamburg workshop.• We don't do mass production; each product is made exclusively for you.• We commit to using only high-quality materials.• Your jewelry arrives ready to gift, complete with elegant packaging and care instructions, delivered right to your door.",
    "reviews": [
      "Quick shipping and top quality!! Highly recommend this shop!!",
      "So perfect!! Exactly as expected! Extremely high quality!",
      "My boyfriend really likes the bracelet. Quick delivery!"
    ]
  },
  {
    "productId": "zEqyIgSbui",
    "url": "https://www.etsy.com/listing/888013674/personalised-cuff-bracelet-personalized?click_key=fb0260464ad16fd8b51ec4732f8c7b8ec60fda96%3A888013674&click_sum=a0a3658f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-36&pro=1&etp=1",
    "title": "Personalised Cuff Bracelet, Personalized Jewelry, Engraved Bracelet, Gold Cuff Bracelet, Bracelets for Women, Graduation Gifts for her",
    "description": "Personalised Cuff Bracelet, Handmade Jewelry, Bridesmaid Gift Ideas, Christmas Gifts  Silver Bracelet, Bracelets for Women, Personalized Name JewelryModern Minimalist Jewellery for your loved ones!Choose from Rose Gold, Gold, Silver, Steel Finish. Choose the sides to be engraved.How to order:***************- Choose the options (Number of sides to be engraved AND Finish) from the drop-down- Enter your engraving requirements in \"Add your personalisation\" box ( phrase, date, roman numeral, text, quote, coordinates of a special place)- Max 40 characters on each side including spaces and symbolsFonts:********There are various fonts available for you to choose from.Number of sides to be engraved:************************************Choose from the drop-down provided and please mention very clearly at the check out page what needs to be engraved on what side (front or reverse)Material: Silver Plated Stainless Steel******************************************Stainless steel is a non-tarnish metal and will maintain it's shine and colour for many years. Stainless is usually not skin-reactive and is hypoallergenic.Video Help to understand sizing of the cuff bracelet**********************************************************If you need help understanding how to wear and un-wear this bracelet, please go to our video -www.youtube.com/watch?v=sMVkyd3regESize:******Our stainless steel cuff bracelets measure 6” end to end with a 1” gap to slide on and off the wrist. The metal is somewhat pliable so that it can be squeezed tighter, or opened up wider if needed. Our cuff bracelets generally fit most wrists measuring 5.5” – 7”.Gift Box:**********It arrives in a beautiful HKS Brand gift box ready to be gifted.Shipping:***********All packages are sent by Royal Mail (UK) & Royal Mail International Standard (Rest of the world)To go back to the shop, please click here -https://www.etsy.com/uk/shop/HKSJewelleryByBhavna#itemsThanks for visiting and shopping with us. For any further details, please let us know if you have any queries.",
    "reviews": [
      "It’s nice, met my expectations and the customer service was good!",
      "Just Perfect, exactly what I wanted.",
      "Exactly as described. Lovely bangle.",
      "Very pretty and nice quality!"
    ]
  },
  {
    "productId": "pKVYIzFSWT",
    "url": "https://www.etsy.com/listing/1600493397/floral-personalized-ring-dish-custom?click_key=84c25ffa17fea4825014cb0828b316f386ec564c%3A1600493397&click_sum=4aa7c405&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-37&etp=1",
    "title": "Floral personalized ring dish, custom ring holder, flower garden engagement gift, wedding gift, clay ring dish, initials, dates, names",
    "description": "Beautiful sunflower personalized ring dish, made of high quality polymer clay, gold paint. 100% handmade from scratch from our studio.Size: 3.5 inchesPersonalization example:A&K (heart needs to be specified , example N heart M)11.22.23Fast 1-3 business days processing time.Check out more styles:https://mylandesign.etsy.comEach dish will be packed in a cute drawstring bag, easy to gift.Need no gold rim, more customization or have a question?Please feel free to reach outThank you for visiting our shop!",
    "reviews": [
      "beautiful ring holder, bride to be loved it",
      "Beautiful gift for my engaged friends! They loved it.",
      "Perfect gift for my gf!!",
      "Looks just like the photos. Sent it to a friend as a gift and she absolutely loves it."
    ]
  },
  {
    "productId": "pOotZsfMnl",
    "url": "https://www.etsy.com/listing/521412928/personalized-dainty-bracelet-jewelry?click_key=4a11a360bdc60643490b5310ac6d4427e6c97eae%3A521412928&click_sum=e9f1e577&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-38&pro=1&etp=1&sts=1",
    "title": "Personalized Dainty Bracelet, Jewelry Best Friend Gift, 21st Birthday Gift For Her Youre My Person Bracelets 30th Birthday Gift For Her Cuff",
    "description": "Made to order♡♡♡♡♡this bracelet can be completely customized especially for you. Just leave the quote (up to 40 characters) you would like stamped on your bracelet in the notes to seller section on the checkout page. ♡♡♡♡6\" cuff is 1/8\" wide and has approximately 1\" opening to fit on your wrist.Cuff will fit 5\"-7\" wrist.*****NuGold  and copper will oxidize****》》》please note hand stamping is an art all of its own. I make letters as straight as possible, but there will be variations including the depth and alignment from letter to letter.Thank you so much for checking out my shop, Scripted Splendor!Personalized  Dainty Bracelet Jewelry Best Friend Gift 21st Birthday Gift Youre My Person Bracelet Bestfriend Bracelets 30th Birthday Gift For Her Thin Cuff",
    "reviews": [
      "Product arrived on time as described. Great customer service. Would use this shop again.",
      "Loved it, thank you very much",
      "absolutely stunning and arrived fast"
    ]
  },
  {
    "productId": "Wjq0TScYjg",
    "url": "https://www.etsy.com/listing/1481887739/personalization-pet-cufflinks?click_key=2981dcba63580faaf8ce35473f33ab981c1b83a4%3A1481887739&click_sum=ea9e50db&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-39&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalization pet cufflinks, personalized souvenir cufflinks,engraved gift boxes available, custom cufflinks gift for groom on wedding day",
    "description": "Our personalized pet portrait cufflinks are engraved from a real photo of your pet provided by the customer! Keep your pet with you or your loved one forever.These keepsake cufflinks are made of stainless steel. Custom pet cufflinks for your boyfriend or husband. This is also a perfect groomsmen gift, pet lover gift or keepsake.The metal cufflinks are 20mm in diameter and come in a square walnut gift box (1.8 × 1.8 × 1 inch). The cufflinks are 20mm in diameter for a clearer pattern and more comfortable to use.Product ordering process:1, choose the color of cufflinks you need2, choose if the box needs engraving and design3, send a clear photo, you can also send us if you need handwritten personalized content (send me the photo through Etsy message)I will send you a mockup via Etsy Inbox - you can modify it until you are satisfied4, After the design mockup is approved, we will produce and ship within 3-5 business days (except weekends)Box OptionsPlease choose the \"blank box\" without any customization or choose the \"engraved box\" for a personalized solid wood gift box.",
    "reviews": [
      "Quality is good. \nI put each pet on a link the engraved box really made it above and beyond. \n\nGet the box!!",
      "I was so incredibly impressed with the pet cuff links. I had requested two pets (one on each) and I was treated with such patience to ensure I was happy with the design before production. When it had arrived, I was blown away by the quality and how great it looked. Definitely exceeded my expectations.\n\nI can’t wait to surprise my husband-to-be with these. Thank you so much.",
      "The cufflinks and engraved box are amazing quality and the service Frank gave with all my enquiries and requests were brilliant and all answered quickly and promptly and he managed to do everything I wanted. Excellent service"
    ]
  },
  {
    "productId": "dDPqNqrlTk",
    "url": "https://www.etsy.com/listing/1288592468/personalized-knit-baby-blanket?click_key=5ca074cd944e5ad0286d9fe21149a0f331448fc4%3A1288592468&click_sum=06b91d3c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-40&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Knit Baby Blanket | Embroidery Gift for Baby Shower | Stroller Blanket | Monogrammed Newborn Baby Gift | Pink Soft Cotton Knit",
    "description": "To preview the font and thread color with this link:bit.ly/rosanbellaABOUT NAME SIZE:The size of the embroidery name will vary based on the number of letters it contains. Generally, a shorter name will result in a larger embroidered name. The embroidery area available for the design is 18x13cm (7x5 inches). To make the most of this area, if you have two or three names, they can be divided into two lines. However, if you prefer to keep the name in one line, please let me know.The 100% cotton knitted baby blanket is soft and breathable, and it can be personalized with a name embroidered in a high-quality thread in your choice of color. The personalized element gives the baby blanket many personalities. making them the ideal one-of-a-kind gift for babies and toddlers. It's also suitable for use in the nursery, on a receiving blanket, in a car seat, or in a stroller.Materials: CottonSize: 80x100cm (30x40 Inches)",
    "reviews": [
      "This is the perfect gift for new babies!",
      "Super cute and amazing. Just as described",
      "Beautiful blanket, looks exactly as pictured. Good quality",
      "Super impressed. I hesitated because this comes from China and I didn’t want to support mass production but this came so fast and is high quality. I have nothing bad to say about it and the price is amazing."
    ]
  },
  {
    "productId": "JYVKwgVITV",
    "url": "https://www.etsy.com/listing/1079497190/gamertag-led-night-light-16-colors?click_key=4832d4a0a44a1f326b69753254afc2d22f4c7b25%3A1079497190&click_sum=6969ccbf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-41&pro=1&frs=1&etp=1",
    "title": "Gamertag Led Night Light, 16 colors, remote control and FREE SHIPPING",
    "description": "Gamertag Led Night Light, 16 colors, remote control and FREE SHIPPINGOur Lights can be controlled by the base with a swipe of the finger for up to 7 colors or by the remote (short distance) to go up to 16 led colors including strobe, fade, flash and smooth mode.Comes with:Custom engraved Acrylic Insert.1-LED Base Stand- Black1-USB Micro Power Cable. Stand can be powered by the included USB cable or by 3 AA Batteries for each base. (Batteries not included)1-Remote ControlPlease make sure to provide us with font choice and name you would like - proof can be provided - just send us a messageLED Base Dimensions: 3.8\" Wide x 1.6\" High",
    "reviews": [
      "Looks really great. My son will love it",
      "Flawless transaction. Great quality. Thank you!",
      "Great gift for my gamer bestie. He loved it!"
    ]
  },
  {
    "productId": "OfBzrPaXrS",
    "url": "https://www.etsy.com/listing/1124971485/name-necklace-with-birth-flower-floral?click_key=dbc05bfa2c59f9fb0fd3ef0248ee33b00c829e7d%3A1124971485&click_sum=721e1bed&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-42&pro=1&frs=1&etp=1",
    "title": "Name Necklace with Birth Flower, Floral Name Necklace, Custom Name Necklace for Bridesmaids, Christmas Gifts, Birthday gift, sterling silver",
    "description": "Name Necklace with Birth FlowerThis is a Personalized Birth Flower  Name necklace. You can choose it for you friends, your family and also for yourself in some special day.• MATERIAL: High Quality Solid 925 Sterling Silver• FINISH: Sterling Silver – Gold Plated – Rose Gold Plated• made of 100% 925 sterling silver• Dimensions: Depending on your name, Height sizes range from 5cm to 7cm.∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ N E C K L A C E ∙ L E N G T H ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙Chain Length:  14, 16, 18, 20, 22 inchAny other length upon requestWith adjustable lengthAll pieces will come with a 2\" extension.∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ H O W ∙ T O ∙ O R D E R ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙1- Select FINISH and length from the menu2- Simply use the 'PERSONALIZATION BOX' to let us know the select the flower (or month) from our flower list then leave the name that you would like.3- Complete your orderFor example:1-Flower: Daisy2-Name: Amelia∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ P A C K A G I N G ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙- All items are nicely packaged ready to gift in elegant jewelry boxes.∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ T H E ∙ P E R F E C T ∙ G I F T ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙ ∙This name necklace can be a great gift for a girlfriend, family member or for yourself.In our shop, find something perfect for her occasion, be it Bridesmaid gifts, best friend gifts,graduation gifts, Mother's Day gifts, Christmas gifts or just to pamper around.Visit our shophttps://www.etsy.com/shop/GoldAndPiecesThank You",
    "reviews": [
      "I bought it for my granddaughter. She said she likes it.",
      "I love my necklace it’s perfect!",
      "Great product. My cousin loved it."
    ]
  },
  {
    "productId": "rngFpmwxuY",
    "url": "https://www.etsy.com/listing/1550566312/custom-constellation-map-lamp-night?click_key=3688bcbd46f46f24da82550418dbd0b0546416fa%3A1550566312&click_sum=ad3b0927&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-43&pro=1&etp=1",
    "title": "Custom Constellation Map Lamp, Night light Gift, Couples Gift, Anniversary Gift, Engagement Gift, Valentine's Day Gift",
    "description": "✨Constellation nightlights are unique and enchanting, as they imprint the mystique beauty of constellations onto the surface of the nightlight, infusing your space with a one-of-a-kind inspiration. These nightlights are not merely lighting fixtures but also works of art that seamlessly blend the wonders of constellation patterns into your daily life, allowing you to appreciate the beauty of constellations in the darkness while adding a touch of mystery to your room.💛Constellation nightlights come in two exquisite styles. One is the dome-shaped design crafted from high-quality acrylic. Acrylic boasts outstanding durability and transparency, ensuring that the constellation patterns are vividly visible. The other style is square-shaped, also fashioned from acrylic  material, presenting a modern and refined appearance. Acrylic glass not only offers sturdiness but is also resistant to damage, guaranteeing the durability and aesthetics of the constellation nightlight.🎁Constellation nightlights are suitable for various occasions and holidays, whether it's an anniversary gift, a birthday present, a Valentine's Day surprise, or a wedding gift.-On anniversaries, they symbolize the enduring companionship between you and your loved one, infusing the celebration with the romantic ambiance of the constellations.-As birthday gifts, constellation nightlights convey blessings and well wishes to your friends and family, allowing them to feel the celestial protection every night.-On Valentine's Day, this special gift ignites the flames of romance, enhancing intimacy in your relationship.-At weddings, constellation nightlights serve as a meaningful gift, representing the beginning of a new life for the newlyweds and sharing the blessings of the constellations with them.🛒I am committed to providing high-quality constellation nightlights.However, if you encounter any quality issues or damage during the purchase or transportation process, there's no need to worry. You can contact me anytime, and I will provide you with answers and after-sales service around the clock, ensuring your satisfaction and a delightful shopping experience. I value each and every customer and am dedicated to offering you the best support to ensure you receive the perfect constellation nightlight.💥Please note that the name you provide will be displayed with the first letter capitalized and the rest in lowercase.",
    "reviews": [
      "The product itself is great and exactly as advertised. But I especially want to highlight the seller. Even through some technical difficulties, they were incredibly gracious and responsive. I would happily purchase from them again!",
      "It arrived a little later than expected, as it was estimated to arrived before Valentine’s Day (it was a gift for my husband). It arrived after Valentine’s Day, however it is beautiful and my husband loves it. We have it on display in our kitchen and it’s a lovely addition.",
      "This was an amazing gift for my girlfriend for Valentine's Day",
      "Wonderful item exactly as expected"
    ]
  },
  {
    "productId": "2NEIwtWTdI",
    "url": "https://www.etsy.com/listing/1354082081/personalized-blanket-for-kids-baby-3?click_key=0d9f985a81c668db1802888c92e5a2bcd70ff7e6%3A1354082081&click_sum=486b9c72&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-44&pro=1&etp=1",
    "title": "Personalized Blanket for Kids, Baby - 3 Sizes and 30 Plus Colors, Custom Name Nursery Blanket for Newborn, Kids, Swaddle Gift Purple Bedding",
    "description": "**Once an order has been placed we CANNOT accommodate changes due to our quick turnaround time. Please confirm all of your selections and spelling PRIOR to purchase**Our buttery soft name blankets, available in 3 sizes, are perfect for nap time, sleep overs, long car rides or cuddling on the couch with your loved one. It's the perfect gift for baby showers, birthdays, holidays and any special moment in between!|LISTING EXAMPLE|Colors in order from left to right: Powder, Baby Blue, Coastal, Ocean, Denim, NavySawyer, Jaxson & Benjamin blankets are in the Oliver fontJackson & elijah blankets are in the Charlie font|CUSTOMIZATION|1.  Choose your size from the drop down menu2. Choose your color from the drop down menuPLEASE NOTE: only the front of the blanket will be this color, the back and text will be white.3. In the personalization box, please write the following:- the NAME for the blanket-FONT optionPlease refer to the infographics in the listing pictures for more details on sizing, colors and fonts******IF NO FONT IS LISTED IN THE PERSONALIZATION BOX WE WILL PROCEED WITH EITHER THE LISTING FONT OR A FONT OF THE DESIGNER'S CHOOSING.*****PLEASE NOTE: The way you type the name is the way we will put it on the blanket. Example- Brittany vs brittany vs BRITTANY. Please note some fonts only come in all capitals or all lowercase.|FONT PREVIEWER|Unsure what font you want your name in? Torn between colors? Checkout our font previewer at the link below to see your name in every font we offer on every color background available!http://customblanketdesigner.previewmyfont.com/|SIZING|30x40 - for babies, toddlers or beloved pets50x60 - for toddlers and kids60x80 - a throw blanket for all agesPlease refer to the infographic in the listing pictures for more details on sizing!|DETAILS|This item has a printed color background with white text on one side, the opposite side is solid white.Vibrant colors will not fade from our plush minky blankets as long as care instructions are followed.Due to monitor differences, actual colors may vary slightly from what appears online.We hand press each blanket to order in our facility in Lancaster County, Pa|PROOFS|Proofs are available upon request only, after a purchase is made.If a proof is not approved within 36 hours of it being sent your blanket will be moved into production to ensure our quick turnaround times.Please DOUBLE CHECK the spelling of the name entered in the personalization box.|SHIPPING|FREE SHIPPING within the U.S on orders above $35Please allow an additional 2-5 business days for delivery with USPSUpgraded shipping to Fedex 2 day air is available at checkout. Please note, this does not change the production timeline, only the shipping time.Please make sure your address on file with Etsy is current. We will not be responsible for any outdated or incorrect shipping information provided.|CARE INSTRUCTIONS|Machine wash in cold waterTumble dry low or air dryDo not bleachDo not iron100% polyesterPrinted & Pressed in the U.S. with imported goods",
    "reviews": [
      "This was a gift for my niece. It was PERFECT🩷",
      "Super cute and really soft. I love the color of the sky blue",
      "Great quality. The color is beautiful. The blanket is very soft. It’s the perfect size for my grandson who is 8 months old. The price was very reasonable.",
      "Ordered 2 and Absolutely love them!! Came I think less than a week!!"
    ]
  },
  {
    "productId": "QIEJAhuLuo",
    "url": "https://www.etsy.com/listing/1109609416/custom-pet-pillow-personalized-pillow?click_key=ebca4946c35148eb26e8d00f3ad7722f7b7eb03c%3A1109609416&click_sum=3c92e8fc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-45&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Pet Pillow | Personalized Pillow | Pet Memorial Gift | Custom shaped pillow | Dog Pillow | Cat Pillow | Pet Lover Gift",
    "description": "Customization Process1.  After purchase send photo + order number by ETSY chat window.2.  Customer service will reply you， whether the picture can be customized!  ( about 1 day).3.  Our designer create your renderings，And will arrange the factory to produce!  ( about 1 days).4.  Delivery, you wait for receiving.Hint: 12cm(4.72in) and 20cm(7.87in) are smaller.   Comes with a key chain!",
    "reviews": [
      "Looks fantastic for such a great price.",
      "The pillow came out awesome!! I would definitely purchase again for other pets.",
      "Seller is very kind and communicative. My best friend lost her two dogs within the same month and these pillows brought her and her family comfort",
      "It's so adorable! The quality of the photo on the pillow was fantastatic, and they perfectly followed my instructions on how to crop my dog. Shipping was surprisingly fast, even though it came all the way from China. Would definitely recommend. Thank you!"
    ]
  },
  {
    "productId": "JrbynNGBoa",
    "url": "https://www.etsy.com/listing/1101673645/personalized-vinyl-record-song-with?click_key=ebe46a618ca5dac0259b059774594ccde12be8ff%3A1101673645&click_sum=735b947c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-46&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Vinyl Record Song with Lyrics on Acrylic with Wood Stand, Mother's Day Gift for Her Personalized",
    "description": "Give this personalized acrylic song record for a memorable gift for Valentines day, a wedding, anniversary, or birthday gift.  This modern and eclectic design will fit in with any space in your home. Let us know your special song and we'll put the lyrics and other custom info on the acrylic for you!*𝐭𝐡𝐢𝐬 𝐩𝐫𝐨𝐝𝐮𝐜𝐭 𝐢𝐧𝐜𝐥𝐮𝐝𝐞𝐬 𝐬𝐢𝐠𝐧 𝐚𝐧𝐝 𝐬𝐭𝐚𝐧𝐝*Please note that the dimensions for the size are for the acrylic itself. Our sizes represent the acrylic piece as a whole. Please note that it will sit inside of the wood stand in order to hold it.For white designs in styles 2 and 4, lyrics will be clear. For all other colors in styles 2 and 4, lyrics will be printed in white.For white designs in styles 1 and 3, middle text will be printed in black. For all other colors in styles 1 and 3, middle text will be printed in white.We include custom text of your choosing!*It will be formatted as pictured unless otherwise requested. If no date or custom text is given, we will leave it blank on your design. Message me before purchasing if you want to customize it in a different way than already offered! We do custom projects all the time.PRODUCT DETAILS- Acrylic is a high quality, guaranteed defect-free, 1/4\" thick acrylic- Wood Stand: Blonde is Solid Oak Wood and Walnut is Walnut- All sizes will be in vertical orientation unless otherwise requested》𝐀𝐥𝐭𝐞𝐫𝐢𝐧𝐠 𝐭𝐡𝐞 𝐃𝐞𝐬𝐢𝐠𝐧 《If you would like to change the design configuration or text styles, please note it will be a custom design which is $25-$100 depending on complexity. Please do not order yet until you've messaged us about your extra changes you're wanting.》𝐄𝐯𝐞𝐫𝐲 𝐂𝐢𝐫𝐜𝐥𝐞 & 𝐒𝐪𝐮𝐚𝐫𝐞 𝐝𝐞𝐜𝐨𝐫 𝐏𝐮𝐫𝐜𝐡𝐚𝐬𝐞 𝐡𝐚𝐬 𝐚 𝐏𝐮𝐫𝐩𝐨𝐬𝐞《Each month, we're blessed with you - our loyal and new customers. So each month we donate a portion of our proceeds towards a good cause! Want to see your impact? Follow us on instagram or facebook!IG: https://www.instagram.com/circleandsquare.decorFB: https://www.facebook.com/circleandsquare.decor》𝐑𝐞𝐭𝐮𝐫𝐧 𝐏𝐨𝐥𝐢𝐜𝐲《I can accept returns on new, unused items if there is no personalization or customization on the item we made for you. Keep all original packaging. Customers are responsible for return shipping and order processing costs ($25+ usually). If the item is not returned in its original, new condition in original packaging, the customer is responsible for any loss in value.》𝐈𝐧𝐭𝐞𝐫𝐧𝐚𝐭𝐢𝐨𝐧𝐚𝐥 𝐎𝐫𝐝𝐞𝐫𝐬《Please note that per Etsy policies - the customer is responsible for any applicable duties/import taxes.》𝐄𝐱𝐢𝐬𝐭𝐢𝐧𝐠 𝐎𝐫𝐝𝐞𝐫 𝐂𝐡𝐚𝐧𝐠𝐞𝐬《If you are wanting to change anything on an existing order (ie: titles, color, address), contact us immediately. We cannot guarantee you'll catch us in time (we're fast!), but we will try our utmost best to accommodate the requested change.All Designs, Artwork & Illustrations are © Circle & Square decor. All rights reserved.",
    "reviews": [
      "Beautiful gift for my friend. She loved it..",
      "Ordered 4 total and gave a detailed review in the first two. Thank you C&S!",
      "Ordered 4 total and gave a detailed review in the first two. Thank you C&S!",
      "Ordered 4 total. This is a continuation of the first review:\nWhen I placed the order, Circle and Square checked back on one of the songs to make sure it was right one. Also, I placed the order just 4-5 days before my daughter's anniversary date (I was feeling regret for not ordering earlier).  The C&S team shipped all 4 orders in one package, and they arrived ON THE ANNIVERSARY DAY! Just in time! My daughter and son-in-law were so surprised and loved the 4 plaques. We started tearing up again. Thank you C&S for all of your work and personalized efforts!",
      "We loved creating something so special for your daughters anniversary!  (: Thank you for trusting us with this project!"
    ]
  },
  {
    "productId": "OBA7xilHYo",
    "url": "https://www.etsy.com/listing/1570707929/personalized-hand-embroidered-apron?click_key=8cfdea62f7b58defe01640046a25da5087d2ec67%3A1570707929&click_sum=03e58a5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-47&pro=1&etp=1&sts=1",
    "title": "Personalized Hand Embroidered Apron Women, Floral Garden Embroidered Apron, Linen Apron, Gardening Apron,Kitchen Apron,Bee Apron,Daisy Apron",
    "description": "We can embroider anything you want. Please message us if you need a personalized design!📍 About the hand embroidered apronPersonalized Hand Embroidered Apron Women, Floral Garden Embroidered Apron, Linen Apron, Gardening Apron,Kitchen Apron,Bee Apron,Daisy Apron, Gift for Mom, Gift For Her.This special apron will make you love cooking, gardening more than ever.They are 100% handmade from linen, cotton and completely hand embroidered.Pattern: flowers, daisy, bee, mushroom and embroidered text according to your request, can be your name or any texts you like.Measurements: 35\" (89cm) length and 31\" (80cm) wideSize: free size and it comes with  an adjustable back strap to fit your body well. We also make children size and oversize📍Shipping- They are hand-made and take time. You will receive a notification email with tracking information when your order is on its way to you.- Your purchased item will arrive in 2-3 weeks after successfully placing orders.📍Customer ServiceIf you have any requirements, please state in the notes when ordering and don’t hesitate contact me!Thank you!👉 You can see more aprons at this link:https://www.etsy.com/shop/lanahomecraft/?etsrc=sdt§ion_id=42079069👉 Shop link:https://lanahomecraft.etsy.com",
    "reviews": [
      "Exactly as shown - beautiful!",
      "Very cute and came on time!",
      "Love it, thanks so much! ❤️",
      "It’s perfect in every way imaginable. The size, the fit, and the attention to detail is immaculate."
    ]
  },
  {
    "productId": "SbXQNdeaGm",
    "url": "https://www.etsy.com/listing/956713937/adventure-book-scrapbook-valentines?click_key=371bf62f5e974a2a8a9c674d86b0083982715a20%3A956713937&click_sum=a6404fe7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-765483-4-48&pro=1&frs=1&etp=1&sts=1",
    "title": "Adventure Book Scrapbook valentines Scrapbook Gift for him and her Adventure Album valentines gift",
    "description": "Our Adventure Book is the perfect keepsake gift for Dad, Step-Dad, or Grandpa this Father's Day!Designs are laser engraved with YOUR unique details, every book is one-of-a-kind!I N C L U D E S• Vegan Leather Fabric Binding Book (6\"x9\"  OR  8.5\"x11\")• Cherry or Maple wood covers• Customization of the text that you see above• Your choice of 30, 45, or 60 sheets of acid-free paper- 28lb Standard Paper option includes BLANK white sheets- 65lb Cardstock Paper option includes BLANK black, cream, or white sheets (recommended for use with photos)*Wood color and grain will vary naturally from the example photo. Wooden covers are coated with a lacquer finish to prevent scratches and to provide a water-resistant coating.H O W  ∙  T O  ∙  O R D E RFrom the drop-down menu:• Select a book size• Choose a type of wood, sheet quantity, & paper typeIn the \"Personalization\" section leave us the following details:1. Screw Color- Silver, Gold, Black, or Copper2. Fabric Binding Color3. Your TEXT to be engraved- Line 1:- Line 2:*Any other details such as timing deadlinesO P T I O N A L  ∙  U P G R A D E S• PRINT SERVICES (sold separately)Add printed lines to your book pages for a journal-like setup!Click the link below to see our available templates and to learn more:www.etsy.com/listing/198626935Check out our shop page for more designs!www.RedBerryGuestBooks.etsy.comT U R N  ∙  A R O U N D  ∙  T I M EIn order to provide a quick turn around on orders, we do not send proofs of the design unless requested in the notes at checkout.Once the order is received, your book will be sent to production and ready to ship out within about 3 business days. From there, transit time will depend on the shipping method that you select at checkout.………………………………….………………….………………………………Please message us with any questions or for custom requests.We look forward to working with you!© RedBerryGuestBooks*PLEASE NOTE: Wood is a natural product. Knots, dark spots, and grain of the wood will vary naturally. While we do our best to select the best wood pieces for your books, we can not guarantee that the book will be free of these natural occurring variations.",
    "reviews": [
      "Great quality and so cute. My boyfriend loved it and we’re going to start filling it right away",
      "Great quality and an amazing gift, worked with the seller to customize it to my liking.",
      "It’s perfect! The seller has no problem getting exactly what you want if the first look isn’t quite it. Great quality, quick to ship!",
      "The book came out so good!! Very impressed with the quality and the super fast shipping. Thank you so much!"
    ]
  },
  {
    "productId": "oYaDMSiDkR",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=d7a0be7a5a9e62715e814a2ad821e7bf5435ece6%3A1115114382&click_sum=4508940a&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "WYcWjigTjO",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=70af08d01d994a099cd614314c3cd42c3f3c0343%3A654638870&click_sum=455832c6&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "QgyabMfHCF",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=22a4985c1782ad797d14cd5108cc2bbf3792a920%3A1355783916&click_sum=20bcdc03&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "zaVWjHcocB",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=170c5eb8270453f5b0284e44af40084407cb581a%3A1411614241&click_sum=7e6931bb&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "wPnSLRAAoM",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=059535cff174f49978b558f6586b483e4b24ab40%3A999136086&click_sum=dbdd4b78&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "UYUkgcuMut",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=4b555e672bb5ae1b15b0d26f0e90cf714700e614%3A1440285597&click_sum=508a6584&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!",
      "Just as described. Would order again."
    ]
  }
]
