[
  {
    "productId": "JvugiAWJsB",
    "url": "https://www.etsy.com/listing/659617200/metal-hand-painted-cardinals-on?click_key=24bb6374689fd98bbd694496988f7a96bb2816f0%3A659617200&click_sum=ad10c026&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-1&pro=1&etp=1",
    "title": "Metal Hand Painted Cardinals on Flowering Dogwood Garden Art | Cardinal Silhouette | Dogwood Flower | Rusted Yard Art | Garden Gifts | B782P",
    "description": "The Cardinals on Dogwood design is a beautifully curated piece of metal garden art designed with nature in mind. It is handpainted by our artists to accentuate the iconic bright red color of the cardinal, as well as the beautiful pastel yellow and white hues of a dogwood bloom in springtime.The Cardinals on Dogwood tabbed metal garden art is made of recycled steel and pre-treated to create our signature rusted texture and vintage look. Display it in your garden and you might just spot a real cardinal perched near your garden art!The Northern Cardinal resides in the eastern United States, Canada, and Mexico. This stunning bird is known for its bright red color, although females have brown feathers, as shown through the rusty details in this design. If you’re a Virginian, Cardinals on Dogwood is an excellent choice for your garden, as the dogwood is the state flower of Virginia, and the cardinal is the state bird.Dimensions: 10\" x 11\".",
    "reviews": [
      "My wife loves this artwork so much. It's perfect! She's a big fan of dogwood trees where she grew up and loves to see the cardinals where we live now. Just as pictured and described. Very intricate work. Shipped quickly and arrived safely. It was packaged carefully. Very happy with the purchase. I'm so glad I found it and such a great surprise for her. Thank you very much!!",
      "I’m pleased with my purchase and this seller.",
      "Thank you for the quick shipment of the nice metal bird art.",
      "The Stars Speak for Themselves."
    ]
  },
  {
    "productId": "wUsxLuUyot",
    "url": "https://www.etsy.com/listing/1037854326/patio-decor-pool-decor-or-patio?click_key=997761b63ed6830fa5cec82250a0048169f26dc3%3A1037854326&click_sum=98d00a65&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-2&pro=1&frs=1&etp=1&search_preloaded_img=1",
    "title": "Patio decor, pool decor, or patio furniture personalized cooler",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Loved the product and so did the couple I gave it to",
      "LOVE this custom cooler! So well made!",
      "Quality superb. So lightweight but so sturdy. Love that there’s no assembly! Sent ASSPCIATES upon request. I am ordering another."
    ]
  },
  {
    "productId": "koyEeMCFLu",
    "url": "https://www.etsy.com/listing/1643047522/beautiful-mosaic-table-handmade-white?click_key=4df7d0af48891c897a8315b15686b469477de63a%3A1643047522&click_sum=23ad7b38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-3&pro=1&frs=1&sts=1",
    "title": "BEAUTIFUL MOSAIC TABLE, Handmade White Round Table, Traditional Custom Made Design, Outdoor Patio Furniture To Elevate Your Home Decor",
    "description": "These Great Moroccan Mosaic tiles table tops are made of a multitude of ceramic reclaimed tiles laid to create a complex colorful pattern with traditional Moorish Andalusia geometric solid white color. A unique and vibrant piece of furniture that can add a touch of exotic charm to any living space.The table top features a mosaic design made up of small square tiles in various shades, creating a warm and inviting look.The mosaic pattern on the table can be made in a variety of colors, including vibrant blues, greens, grey, orange, and off white and other custom made colors, arranged in an eye-catching geometric pattern. Due to the natural handmade nature of the mosaic tiles, the colors may have some slight shade variations, adding to the table's unique charm and character.Designing your room or garden with a unique Zellige table will leave a space warm and glowing. Wether you go for square tiles to make a classic look with natural variations standing out as a feather, or opt for a horringbone tiles design to mix things up, there's a lot of different options available.📋📋DETAILS📋📋********************+ Standard Height Of The Table : 29 inch = 75cm ( For custom height, please do not hesitate to contact us )+ Material : Mosaic.+ Condition: Authentic and clean.+ Processing Time : 1 to 2 weeks.+ Delivery Time: 3 to 5 business days.+ FREE SHIPPING.+ DUTY FREE TO THE US.🚀SHIPPING POLICY🚀************************Orders are typically processed and shipped within 2 Weeks. Once an order has been processed and shipped to you through Expedited shipping you will receive an email confirmation that contains a tracking number. Shipping takes:Between 2 to 4 business days to Europe.Between 3 to 5 business days to the USA and Canada.Between 4 to 8 business days to Australia.📇 RETURNS 📇*****************We offer a 30-day return policy for this table.Buyers pays for return shipping.We stand behind our products & service with confidence!We offer timely customer support to all buyers. We will respond to you within a few minutes. Our working hours are from 24h/7d.GET YOUR IRON CHAIRS TO GO WITH THIS BEAUTIFUL TABLE  :https://www.etsy.com/listing/1645111013/set-of-handmade-iron-chairs-moroccan",
    "reviews": [
      "The customer service really helpful. Very pleased with the response. Definitely will recommend this company to purchase item. Beautiful tables.😘",
      "Great chair, looks nice outdoors",
      "Very nice and helpful seller!Beautiful side table, perfectly made to measure and in customized colours, well packed and fast shipped. 👍👍👍👍"
    ]
  },
  {
    "productId": "EkfNhELTFO",
    "url": "https://www.etsy.com/listing/795281454/colorful-outdoor-patio-throw-pillows?click_key=a6e4eb91c71f878f5a693dce762604f5a60e1adc%3A795281454&click_sum=296504b0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-4&pro=1&frs=1",
    "title": "Colorful Outdoor Patio Throw Pillows Floral Flowers Art Outdoor Home Decor Boho Designs Outside Bohemian Artwork Colorful Garden Painting",
    "description": "FREE SHIPPING!\"Garden Party\" is one of my original mixed media paintings transformed into unique outdoor throw pillows and other home decor accessories. The outdoor pillows have UV protection, and are waterproof / mildew resistant.➤ C.Cambrea Art printed on both sides.➤ The pillow is filled and sewn shut.➤ Durable 100% spun Polyester Poplin fabric.➤ Tumble dry low, do not bleachAVAILABLE SIZES:➤ 16\" x 16\"➤ 18\" x 18\"➤ 20\" x 20\"🌸SHIPPING: These pillows are made to order so kindly allow 4-6 business days for printing and shipping prep.🌸  This design is also available as an indoor pillow:https://www.etsy.com/listing/806304007/colorful-floral-boho-art-flowers-designLETS CONNECT:➤ Fav my shop if you like this. Etsy will notify you when i post new work :)🌸 Read more about my products: http://www.sincerelyjoy.com/🌸 Connect on Instagram:@ccambrea🌸 Connect on Pinterest:https://www.pinterest.com/SJstore/© C.Cambrea ArtSincerely Joy",
    "reviews": [
      "Oh my gosh! I love the art work on this pillow!!!! A lot of fun! Its  totally met my expectations!",
      "The pillows arrived and are beautiful!!",
      "Very happy with my purchase!",
      "Love it so much! Awesome"
    ]
  },
  {
    "productId": "VFmrBhNqKB",
    "url": "https://www.etsy.com/listing/1201018840/custom-bee-garden-metal-stake?click_key=765ecf089a4875b5fd070ce483c51c594754af16%3A1201018840&click_sum=b114ad1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-1&pro=1&frs=1&sts=1&content_source=4fd0fd732f63e095d6fcf933cd76c3d94dadf764%253A1201018840",
    "title": "Custom Bee Garden Metal Stake, Personalized Garden Sign, Garden, Garden Art, Metal Yard Art, Outdoor Sign, Metal Garden Sign, Honeybee Sign",
    "description": "Custom Bee Garden Metal Garden StakeSizes (inches):15\" W x 15\" H = $3917\" W x 17\" H = $5920\" W x 20\" H = $7923\" W x 23\" H = $9926\" W x 26\" H = $149Text 20 character limit***All text will be centered***Powder coated for weather resistance - made for the outdoorsDesigned with a stake that will easily stake into the groundHigh quality 14 gauge steel sourced in the USAHandmade in Wrens, GAIMPORTANT POLICIESIMPORTANT NOTE FOR ALL CUSTOM AND CUSTOM NAME SIGNS:Your text will be entered onto your sign exactly as you typed it.   We are not responsible for typos or customization errors.IMPORTANT REGARDING CANDY AND TRANSPARENT COLORS:Candy colors and transparent colors are fully transparent. Any flaws that exist in the metal underneath the color will show through the color and be visible. This includes scratches, blemishes, cut marks, burns from the cutting process, etc.------------------------------------------------------------------MORE PRODUCTS:https://www.etsy.com/shop/LewisDesignCompanyGA* You are ordering the sign displayed in this listing. Please checkout our shop to see all available options or send us a message if you have a custom request!Thank you for shopping with us!",
    "reviews": [
      "Very nice.  This will make a great gift.",
      "Exactly what I was looking for!",
      "Came on time and looks beautiful …. Thanks",
      "Absolutely beautiful!! Exceeded expectations. Shipping was right on time. Communication was precise and prompt. Highly recommend!"
    ]
  },
  {
    "productId": "ikffwpfwyv",
    "url": "https://www.etsy.com/listing/189404583/cat-garden-decor-kitty-yard-art-outdoor?click_key=6b23506d6c6a504e5a3264c7d7d3bfef3373c5c6%3A189404583&click_sum=6f81b149&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-2&pro=1&frs=1&etp=1&content_source=29156fce37a6b6c55e2b16b3e2938ac3ea62e0c8%253A189404583",
    "title": "Cat Garden Decor Kitty Yard Art, Outdoor Gift for her",
    "description": "Cat Garden Sculpture Kitty Yard Art, Zen Garden Gift for herThis Peeping Tom Cat lives in your garden - in the ground, in a plant pot or screwed to a fence or balcony.It's a perfect garden folly or even cat memorial!Whether you're a crazy cat lady, a cat lover or meow-sician this peeping tom garden cat is purr-rect to brighten up your outside space.I'm not kitten you !So paw-lease, no pro-cat-stination, just cease the meow-ment!Don't wait till Cat-urday !Be Paw-sitive and respect my amazing powers of Purr-suasionOK - that's enough ... I need a cat nap !>'.'<This metal cat ornament is made from 3mm powder-coated black steel and is suitable to go in the earth between the flowers or into the lawn.The cat has 2 screw holes, so he can also live on top of a fence, a gate or a post box. (no screws supplied)Naturally, this Tom cat provides 24 hour high security for your gardenSize:approx. 20.5 cm x 15 cm x 0.2cmapprox. 8\" x 6\"0.25 KgPlease note : this is NOT a toy. As with anything sharp, it should be positioned or stored in a safe place where it can cause no harm.You can view more items in my shop :www.etsy.com/uk/shop/JolyonYatesExpress Shipping : Discounted 2-3 Working Day Worldwide is available on this item : Select Express Shipping option at Checkout.",
    "reviews": [
      "Good quality product. Will be a fun feature for the garden.",
      "Great item and fast shipping.",
      "Amazing service and quality workmanship!! Jolyon was very kind with getting my order just right! He sent it out on the same day which arrived quickly to my address in Canada. Thanks, I love my peeping black kitty which enjoys hanging above my fence and checking all the action and passersby in the neighbourhood!!!"
    ]
  },
  {
    "productId": "PZnWEmGQO0",
    "url": "https://www.etsy.com/listing/952454408/elements-yard-art-real-stained-glass?click_key=3621fe2dce0b65bef7d5124b2e06c42ea5d8cd6f%3A952454408&click_sum=e7172019&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-3&pro=1&frs=1&content_source=b290c8377ff10f8f376562f352c6581aeada85ea%253A952454408",
    "title": "Elements Yard art. Real stained glass & copper garden stakes Pastels Free shipping",
    "description": "Color PastelsThis is real stained glass like the glass that has been used in stained glass windows for 100’s of years.Each circle is wrapped in real lead came and the frame is real 1/2 copper tubing and soldered together.Large frame is 9in x 34inSmall frame is 6in x 32inFree Shipping on any of them.We will also do custom colors in any colors you like.My unique mounting system of 2-  steel stakes that you pound into the ground and slide the copper frame.   over them it will insures they will withstand it wind. outdoorsThey have a copper frame to protect the glass and give it a look of elegance.",
    "reviews": [
      "Excellent design and craftsmanship, really enjoy it!",
      "This art piece is so beautiful. I’m excited to feature it in our remodeled backyard space!",
      "Just lovely - put in my garden."
    ]
  },
  {
    "productId": "FTIOSTwgG9",
    "url": "https://www.etsy.com/listing/1010245713/set-of-3-upcycled-birch-plywood-indoor?click_key=df149151145944e1bddff910051ba9af553929b0%3A1010245713&click_sum=6c701884&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-4&pro=1&etp=1&content_source=3e7e7e4617e03f1d83c367f30c1fc00ff840e63a%253A1010245713",
    "title": "SET of 3 Upcycled Birch Plywood Indoor Plant Stands - Flowerpot Holders - Tiered Plant Stands and Home Decor - Perfect Gift for Plant Lovers",
    "description": "Introducing our set of 3 indoor plant stands, perfect for any plant lover! Made from upcycled birch plywood, these flowerpot holders are not only functional but also sustainable.Simply stick the two individual parts together, and you're ready to display your plants in style!Our birch plywood flowerpot stands to bring a unique and trendy twist to any room in your home, from the living room to the kitchen to the bedroom. They're also versatile enough to fit into any interior design.Redefining Green Living with RARE Upcycle!",
    "reviews": [
      "I can only say that the plant stands were 'okay' as the quality of the largest of the three plants stands wasn't so good.\nOverall I was a little disappointed.",
      "Even better than I imagined! Looks great.",
      "Thank you for choosing RARE Workshop❤️",
      "simple, functional, what i needed!",
      "Thanks❤️"
    ]
  },
  {
    "productId": "hLRNkwuMcq",
    "url": "https://www.etsy.com/listing/1504721950/skull-stained-glass-wind-spinner-pastel?click_key=7674b2905f07deb602f02863bb4031d4439d3e52%3A1504721950&click_sum=3d3309b4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-5&pro=1&sca=1&content_source=8bfab80b3c73788cc663a1cfb5b1c9fbd1d2d847%253A1504721950",
    "title": "Skull Stained Glass Wind Spinner, Pastel Goth Garden Decor, Yard Art Metal, Outdoor Garden Decor, Gifts For Her, Skull Gifts For Women",
    "description": "These metal spinners open up into a beautiful piece of art that moves and spins in the windThe pictured design will be printed double sided onto aluminum. Suitable for indoor or outdoor use, e.g. yard, garden or in a windowCharms or additional spinners can be hung from the bottom for extra personalization (not provided)Please note that the stained glass image is printed onto the surface of the metal - the spinners don't contain any actual glass!..........................SIZING AND MATERIALS8\" x 8\" (203mm x 203mm)Made from .045'' (1.15mm) thick aluminumDurable, scratch-resistant and waterproofHardware included for hangingShipped flat and easily assembled - see listing photo for instructions........................................................FURTHER INFORMATIONPlease note that colours shown on your monitor/phone may appear slightly different from the finished productDesigns are transferred using a dye sublimation printing process which produces a permanent, high quality image that won't scratch, peel or fade away with timeAs all of my items are made to order, I can provide extra personalization if needed. Simply send me a message before ordering and I will do my best to meet your requirements!........................................................SHIPPINGFree shipping to Canadian addresses are sent using Canada Post Lettermail and I am unable to provide any tracking information for this service. You can also choose Upgraded shipping which includes trackingOrders to USA are shipped using USPS and tracking will be providedPlease check out the other items in my shop athttps://www.etsy.com/ca/shop/MortalFrogGifts",
    "reviews": [
      "Just Beautiful! My Daughter Will Love It!",
      "This was so beautiful! I love the structure and the colours.",
      "It’s not what I assumed it would be. It says stain glass, but all I got was a metal piece. If you’re looking for something that says it’s stain glass. It should be glass not a metal surface with paint on it"
    ]
  },
  {
    "productId": "VG0vo7w1zc",
    "url": "https://www.etsy.com/listing/543141369/saw-whet-owl-on-pine-branch-pine-tree?click_key=2e8495e66ba107c68e9e44f9ebd8f36d998e42f9%3A543141369&click_sum=34a06876&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-6&pro=1&etp=1&content_source=47e5fd3ec50594be79eb270e57e3e296f95963ef%253A543141369",
    "title": "Saw-Whet Owl on Pine Branch, Pine Tree Metal Art, Pine Cone Metal Art, Garden Gift, Outdoor Metal Accent Piece, Pacific Northwest Art | M422",
    "description": "Saw-Whet Owl on Pine Branch, Pine Tree Metal Art, Pine Cone Metal Art, Garden Gift, Outdoor Metal Accent Piece, Pacific Northwest Art | M422Perfect as an outdoor Christmas decoration.Dimensions: Approximately 11.5 x 11.5 x 0.5 inchesSKU# M422Favorite our Etsy shop and check us out on Social Media for more nature inspired home decor!Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/Twitter: https://twitter.com/rustybirdsegd",
    "reviews": [
      "Absolutely beautiful!\nI love this item. \n\nI purchased after ordering other things for a friend’s birthday. \n\nShipping for me took awhile while my friend received more quickly. \n\nNo worries just be aware if you need it at a certain date.",
      "Got this for my mom for Christmas, she loved it!",
      "I bought this for a friend as a gift. She loved it! She commented that it’s very nice quality, and she was very happy with it.",
      "My friend fell in love with this gift."
    ]
  },
  {
    "productId": "cZBseVqGpi",
    "url": "https://www.etsy.com/listing/1584738252/rustic-iron-hanging-pine-cone-wind?click_key=4ba62ea395155de831b89fe6460db8255ecf62bf%3A1584738252&click_sum=700e92c1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-7&pro=1&frs=1&sts=1&content_source=10177d9cfa96535d76ccd98e139a19fadd6e5a63%253A1584738252",
    "title": "Rustic Iron Hanging Pine Cone Wind Chimes, Vintage Metal Pine Cone Garden Decoration, Hanging Iron Wind Chime, Gardening Gift For Dad Mum",
    "description": "🎄 Rustic Iron Hanging Pine Cone Wind Chimes 🎄🎁 WHAT YOU RECEIVE 🎁✿ 1 x Rustic Iron Hanging Pine Cone Wind Chime✿ Free Money Back Guarantee For 30 Days✿ Free Shipping World Wide✿ Fast Customer Service✨ DETAILS ✨✿ Handmade item✿ Delivery from a small business in United Kingdom✿ Materials: Iron Metal✿ Dimensions: 108cm long x 5.5cm wide✿ Made to orderElevate your garden's charm with our Rustic Iron Hanging Pine Cone Wind Chimes. Handcrafted with precision and passion, this decorative Iron wind chime adds a touch of nature's beauty to your outdoor space.Designed for easy installation, simply hang it on a tree branch or any suitable structure, and let these charming bells serenade your outdoor space.The perfect Christmas gardening gift, whether for yourself or a fellow garden enthusiast, this Vintage Metal Pine Cone Garden Decoration is a thoughtful and charming gift.⭐ CUSTOMER  SERVICE ⭐Your satisfaction is paramount. If you encounter anything less than a five-star experience, please reach out for prompt support.We value and appreciate all feedback and are committed to addressing problems promptly.Thank you for supporting our small business. For further inquiries, feel free to connect.🔥 MORE PRODUCTS LIKE THIS 🔥✿https://www.etsy.com/uk/shop/AsIfByMagicGardens✿  Thank you for visiting☺  I hope you enjoyed shopping with As If By Magic Gardens!📣 These products are 100% handmade. Sometimes there are very small imperfections - this does not mean the item is damaged. I check every single item carefully before I send it.",
    "reviews": [
      "I love the way these pinecones look, they are lovely. Thank you so much!!",
      "Love my Pine Cone Wind Chime, excellent quality!",
      "Thank you Karen",
      "Darling little fairy for my garden",
      "Seller did a great job with a question. Second item purchased from here. Darling little fairies for my garden"
    ]
  },
  {
    "productId": "MOncHZCPYU",
    "url": "https://www.etsy.com/listing/673497658/head-planter-wall-porch-decoration-head?click_key=8586c60af886ec098774e779d48b198446a26075%3A673497658&click_sum=2342f40c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-8&pro=1&etp=1&content_source=c258a3cad149fcb74d56b933ec8b6d3bb591027b%253A673497658",
    "title": "Head planter wall porch decoration head planters face pot indoor planter modern home garden plants wall hanging pot outdoor living room art",
    "description": "Bring nature into your living space in a stylish way. This wall art planter is an exclusive design and make by \"Headplanters\".Choose from a range of colors to match your interior style.Made with care and quality to detail by a plant collector. Simply fill the cavity with succulents, branches or artificial plants of your choice to make your own conversation piece wall art. Ample planting space to plant succulents or medium sized plants. All photos are of my actual plants happily living in our planters.Treat yourself or make a perfect gift to your loved one. This planter would make an exclusive gift for birthday, Easter, housewarming, wedding, Mothers day, graduation, Christmas gift, etc. It will surely get that wow reaction!Don't just take our word for it. Our customers love our planters. Please read reviews and see what they have to say... Don't forget to check other listings in our shop. We have more amazing styles. Be aware. Our planters are addictive, and you will be back for more :-)...Here is a perfect match for this planter, our male pothttps://headplanters.etsy.com/listing/736946655/head-planter-face-wall-planter-man-wallDue to the crafted nature of this item, expect slight variation in the appearance of each unique piece.- hand painted cement- this item is intended for indoor or limited, covered outdoor use- wipe clean with a damp cloth. Do not soak- this item has a drainage holeApproximate size:Height -17 cmWidth - 16 cmDepth - 11 cmDepth of cavity - 13 cmPlease check other listings for more colors and variations.IMPORTANT...Your parcel will be sent by registered airmail and delivery time varies depending on your country.If you need any planting advice, we would be pleased to help.Plants or any objects on the photos are for decorative purposes only and not included in your order.Packed with careI will be glad to answer any additional questions you may have, just ask.",
    "reviews": [
      "Nice quality, very well packaged. Thank you 🙏🏻👍🏻",
      "Such a beautiful statement piece that enhances your space!",
      "Absolutely beautiful just what I was looking for. I hesitate to post the pic bc it’s a work in progress!!",
      "Thank you, Jessica for your kind words! Enjoy your beautiful plants! Welcome back for more amazing styles :-)",
      "Love this planter so much! Purchased this for our bedroom. Looking forward to finding the right plant and hanging it up.",
      "Thank you, Mia, very much for your kind review. I am very happy you love your planter and pleased with your purchase. Happy planting! Will be glad to see you again :-)"
    ]
  },
  {
    "productId": "tFCKMAKLbZ",
    "url": "https://www.etsy.com/listing/1496450543/exquisite-mosaic-table-a-work-of-art-for?click_key=0401bc8fae058d236c3374422e3076bf5903e227%3A1496450543&click_sum=0085ec96&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-5&pro=1&frs=1",
    "title": "Exquisite Mosaic Table: A Work of Art for Your Interior beautiful outdoor dining table the mosaic dining table, patio table, coffee table",
    "description": "Introducing our stunning mosaic table, a one-of-a-kind piece that will bring an artistic and elegant touch to your space. Each table is meticulously handcrafted, creating an exceptional work of art that is sure to impress. With its captivating design and flawless finish, this mosaic table is more than just a functional piece of furniture – it is an artistic statement that will transform your interior into a space of beauty and sophistication.The tabletop is adorned with a meticulously arranged mosaic, composed of tiles in various colors and patterns. Every tile is carefully chosen to create a harmonious and captivating design that catches the eye and adds a unique ambiance to the room. The mosaic is expertly crafted to provide a smooth and tactile surface, adding a dimension of touch to this exceptional piece.Our mosaic table is not only a work of art but also designed to be practical and functional. Its sturdy tabletop offers ample space to accommodate meals, gatherings, or moments of relaxation. Whether you use it as a coffee table in your living room, a dining table for elegant dinners, or an accent table in your outdoor space, this mosaic table will be a beautiful addition to your décor.The quality of our mosaic table is unparalleled. Each piece is meticulously crafted with exceptional attention to detail, using high-quality materials and traditional artisan techniques. The tiles are securely fixed to ensure lasting stability, while the durable finish protects the surface from scratches and stains. You can be confident that this mosaic table will maintain its beauty and shine for years to come.In addition to its functionality, our mosaic table is a true conversation starter. It brings a touch of sophistication and style to any space, whether it's a modern, classic, or bohemian interior. Its versatile and timeless design complements various decor styles and becomes the centerpiece of your space.Add a touch of artistic beauty to your interior with our mosaic table. Explore our collection and find the piece that perfectly matches your style and vision. Treat yourself to a unique experience with this mosaic table that combines functionality and aesthetics, creating a warm and inviting atmosphere in your home.Our Moroccan Mosaic tables are made from natural materials and are hand-stained with a mixture of colors just like the world around us. They were designed and created by hand so every table is truly one-of-a-kind.✅ Infos :-Place Origin : Morocco ( FEZ )-Materials    : Organic CLAY-Color          : Every Table has unique petterns (mosaic tiles ), colors and sizes✅ Take care of your Moroccan Mosaic Table :- Wipe your ceramic table only with a soft cloth or sponge,- Clean your table by hand gently✅ Need Help We are here for you Contact Us :-Please do not hesitate to contact us via etsy. we will get back to all messages with in 24 hours✅ Packaging and Shipping- The Mosaic tables Packed in bubble wrap with other packing materials, placed in a wooden box and shipped withe care.- All of our products are shipped with FedEx.- We ship All the week except for Saturday, Sunday and holidays.- After you have placed your order, you will receive a confirmation message requesting a phone number. We need it for the tracking documents.- We will provide a tracking number once your item is shipped- We take a lot of pride in our items and will always make sure they are very well packed and protected for shipping.- Please be aware of delays on shipping that are out of our control such as Customs holds, Holidays, weather delays or other disruptions.✅ MONEY BACK GUARANTEEYou are covered by the Returns & exchanges policy of our Shop policies.We want all our customers to be completely satisfied!Thank you for visiting",
    "reviews": [
      "Top transaction. Very nice carpet.",
      "The pillow I purchased was even more beautiful in person, and of exceptional quality. Heavy wool with saturated colors. Shipping was super fast and communication was a breeze. I highly recommend this shop.",
      "Beautiful quality, packaged very well and I’ll definitely be ordering from this shop again in the future. Thankyou so much!"
    ]
  },
  {
    "productId": "wChgWBwhul",
    "url": "https://www.etsy.com/listing/1185631385/mid-century-modern-patio-table-custom?click_key=5c26f1e278cebedc318ec29efe5c5227f715aae0%3A1185631385&click_sum=d8bcf712&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-6&pro=1&frs=1",
    "title": "Mid Century Modern Patio Table - Custom Made Zellige Table - Round Outdoor Table - 40\" = 100cm Garden Furniture GIFT - Decor Fully Handmade",
    "description": "Contact me for custom ORDERSthis amazing traditional Moroccan table was handcrafted by A professional worker, it represents the cultural diversity of Moroccan handcrafts and that is because of its design, material and the colors used at the surface of the table. by obtaining such objects you would be helping a dying craft to flourish again so that contact between the past and the present would never die not mentioning the happiness it would bring to poor workers on fields like this .\" Clay\" this material that is found only in Fes City. In a specific place called \" Ben Jellik\". To get started to bring the clay to this place, and we leave it for 20 days in order for it to dry. When it is dry we use a large hummer to break it into small pieces then we leave it to dry again for whole day before we put it in water for two days. Then there are people who work on cleaning the clay from unwanted rocks and any other material to give to another person. This type of activity is only found in Fes city because it has a close relation go the sun.Other workers are in charge for shaping the clay dough into flower vases, jars, plates .... all of these products are handmade. It is an inherited craft work.After we place the handmade products into the oven for 8 hours with 2000°C. The next step is painting the products with colours of the fortunes, dinning tables and the walls.We paint the products with natural based colours that are taken from natural resources. The paint brushes used are made from horses hair. They use different colours such as blue, red, black...When they finish they coat them with a material that makes the products shiny so they can put it back into the oven fir 8 hours to bake on burned woods then the products can be used for our daily use. You can use cold or hot water in them, the paint is long lasting.Moving to Zellige, when it bakes for the first time, and the second time with the paint it is given to Nekkach that decides what kind of pattern will be used on it depends on where Zellige will be put. He spreads them flipped in a geometrical pattern based on ancient references such as Karaouiyn, and the king's palaces...Then we use a material called \" La resin \" or \" cola sima\" and we let them dry. After that we flip them to the front to see the design of the Zellige. That is the workmanship of Clay in the City of Fes.Thank youVisit here for more beautiful MOSAIC goods :https://www.etsy.com/shop/CUSTOmosaicKeywords : coffee table interior design home decor furniture coffee coffee time table interior side table design mosaic working coffee shop coffee lover living room dining table coffee holic furniture design decor coffee lovers living room decor coffee addict mosaic coffee art home coffee house coffee table decorpatio furniture outdoor furniture outdoor living patio decor patio patio design garden furniture furniture outdoor decor outdoor design home decor interior design outdoor living space design garden outdoor patio life furniture design backyard design patio style exterior design outdoor dining backyard summer patio living outdoors garden design modern furniture interiorpatios patio dining home decor ideas outdoor chair architecture teak furniture backyard oasis teak home rattan porch decor bahbel patio time luxury furniture porch life landscape design backyard life backyard party outdoor space back porch backyard bliss rattan furniture decor patio garden my backyard decor patio goals backyard goalsoutdoor furniture outdoor living furniture interior design garden furniture design outdoor design furniture design outdoor outdoor decor patio furniture home decor garden patio architecture interior exterior design outdoors luxury furniture patio decor garden design outdoor dining outdoor living space home design decor modern furniture custom furniture",
    "reviews": [
      "Item is absolutely beautiful and exceeded our expectations. We liked it so well that we immediately bought a second one. Can't wait to get it installed.",
      "The sink is beautiful!  The seller even sent a picture before sending to assure the final product was what I wanted. It will be beautiful in my new wet bar!",
      "Beautiful sink. Can’t wait to use it in my bathroom remodel as a small sink in my makeup area"
    ]
  },
  {
    "productId": "MjeEIgPOsS",
    "url": "https://www.etsy.com/listing/1416146878/saddle-up-plant-stand-lonesome-road?click_key=a06fef2677a450e098d2efe71eeee5218ff782bf%3A1416146878&click_sum=829b1c04&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-7&pro=1&frs=1&etp=1&sts=1",
    "title": "Saddle Up Plant Stand - Lonesome Road - Small 8\" Stand Perfect for Displaying Plants - 3D Printed Aesthetic Apartment Décor",
    "description": "This sturdy little stand reminds me of a horse, she carries a LOT of weight so throw your big plant on Saddle and she'll keep it sturdy with her knocknees. Tested to 60 pounds!Saddle Up Plant Stand are 8 in tall, 10 in wide, and 8 in deep.-------------------------------------------------We are a completely queer owned and operated 3D Print Shop and Design studio, focused on achieving sustainable, equitable pay and the most earth-friendly material sourcing we can manage. We collaborate to build our own printers and design our own models and grow together as a group of creative friends. These are 3D Printed from our home printer farm, we give as much attention as we can to the quality of these prints, striving for smooth surfaces, nice matte finishes, well placed seams, lack of stringing etc. While there may be very small imperfections on some prints, we really try not to ship anything with significant printing flaws. If you do have issues with your print, we are more than happy to work out a return and refund. :)All our prints are made with biodegradable, recyclable corn-based PLA plastic, which will eventually compost many decades from now.",
    "reviews": [
      "Love my table looked so cute",
      "Super adorable little plant stand, brings joy to my day every time I pass by. Will definitely order again from this seller.",
      "Adorably quirky! Lightweight enough to move easily, but sturdy enough to hold your plants. Love the colors as well - exactly as pictured. Definitely recommend!"
    ]
  },
  {
    "productId": "I6gvGSooiN",
    "url": "https://www.etsy.com/listing/1248699687/ships-within-1-business-day-balcony?click_key=afa5ed3f2816033cf2adcb6a3207a6f0999c00fd%3A1248699687&click_sum=64bd5dd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-8&pro=1&frs=1&sts=1",
    "title": "Ships within 1 Business Day, Balcony Table Space Saver, Balcony Bar Table for railing, Wooden Patio bar table, Folding Table for Terrace",
    "description": "Your order will be shipped  within 1 Business Day. FREE&EXPRESS SHIPPINGDo you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.FREE & EXPRESS SHIPPINGFREE shipping & EXPRESS Shipping worldwide.FAST DELIVERYI am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Any questions please message me.",
    "reviews": [
      "This far surpassed my expectation and I LOVE it so much. It is my new writers desk outdoors and is perfect in every way. One of the best things about receiving it was the sweet note by the seller which included a hand embroidered coaster. I cherish this kind of customer service and thank the owner so much for the special touch!",
      "great quality, easy directions, etc \nthank you Omer!",
      "I love it! It was very easy to put together and mount on my balcony (and I normally hire someone to put things together). Great customer service as well. I highly recommend.",
      "Very well made.  Perfect for small spaces.  Very happy with my purchase."
    ]
  },
  {
    "productId": "FLpPaTYUFD",
    "url": "https://www.etsy.com/listing/1032812228/suncatcher-maple-leaf-stained-glass?click_key=094439a5f00b665cbba0df6805296652a02d1119%3A1032812228&click_sum=c2b0f7af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-9&pro=1&etp=1&content_source=c463bc630532b7d70b177b12c5e5916d11170685%253A1032812228",
    "title": "Suncatcher maple leaf Stained glass maple leaf Canadian maple decor Wall art decor Window hangings decor Gifts for plant lovers",
    "description": "Suncetcher maple leaf in three color shades - the original design will appeal to connoisseurs of beauty.Hello dear buyer! Welcome to our authorship stained glass decors store!We are Olha and Daria, founders of this store and people who create beauty for you. We have been engaged in stained glass for over nine years.In this difficult time, work saves us and your smiles warm us. We love our business and do our best to ensure that you are satisfied with the fact that you turned to us.We can also create individual works. If you have an idea that you really want to implement, then we will help you and create a sketch just for your taste.Stained glass art is much more versatile than you might imagine. And we can always create something amazing!We work in tiffany stained glass technique. Each detail is manually cut, sharpened and wrapped in copper foil separately. Next, we lay out all the details on the template and solder with the help of flux and solder.We pack the product with high quality and reliability. We fix the product inside the package so that it reaches you whole. When unpacking the product, please do not pull on the film, cut it carefully with a knife or scissors.On-screen and live colors may differ slightly as different screens may show different shades.Our products are not afraid of the sun and moisture. You can easily get rid of plaque, just rub the product with a dry cloth and it will be like new.Dear customer, we are working as usual. There may be a slight delay in delivery hope for your understanding.The product is made with love in Ukraine.Enjoy your shopping and good mood!Take care of yourself!",
    "reviews": [
      "Really really high quality and im impressed",
      "So pretty! I got one as a gift and had to order more for my bay windows!",
      "See the review I left for the purple one. 😊💕"
    ]
  },
  {
    "productId": "slnSkTdNUY",
    "url": "https://www.etsy.com/listing/1644721149/8-pcs-assorted-solar-tulip-garden-stake?click_key=1a927c071fc041fc8cd67cb20f7c341dd944999c%3A1644721149&click_sum=470fc253&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-10&pro=1&content_source=eb7cf468af90e782b30223adba09957daba9adca%253A1644721149",
    "title": "8 Pcs Assorted Solar Tulip, Garden Stake, Yard Art, Garden Decor",
    "description": "* Dim: 12\" H x 2\" diameter.* Material: Heat resistant plastic.* Create an inviting look at the front of your home or back yard with these Tulip solar LED",
    "reviews": [
      "Fast service but two of the bulbs didn’t work:(. Otherwise, products look great for the price. Would recommend!",
      "They are really cute!!  Love them!",
      "The customer service is great and the shipping was fast. It is beautiful! We love it.",
      "These are so cute and very well made.  Can't wait to hang them up in my garden.  Very adorable!"
    ]
  },
  {
    "productId": "FlrPYGaowC",
    "url": "https://www.etsy.com/listing/968888230/diamond-tinker-bell-garden-stake-rain?click_key=99dd41d03382322a49e37b02bdfda05e8dc94559%3A968888230&click_sum=35000df9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-11&pro=1&sts=1&content_source=880f599b4b231c9c3e3957af215284c9c5e006be%253A968888230",
    "title": "Diamond Tinker Bell Garden Stake | Rain Gauges | Garden Decor | Outdoor Metal Art | Gifts for Gardeners | Gifts for Mom | Garden Stakes",
    "description": "Diamond Tinker Bell Garden StakeA charming geometric ornament for your garden, flowerbed, or favorite potted plant! Our Diamond Tinker Bell provides a touch of cheerful sound whenever the wind blows, and features an iridescent flamed metal finish that imparts a subtle touch of color to your landscape. Like all stakes from Happy Gardens collection, this one is handcrafted, and brings lasting beauty to your lawn or garden.Flamed metal finishDimensions: 5” W x 30” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!",
    "reviews": [
      "Quality and well crafted workmanship. Def recommend!",
      "Super cute. Looking forward to flowers surrounding it outside.",
      "I am sure this garden stake will look lovely in your garden. 💚 Thank you for your business and we appreciate your time in sharing your review :) Take care!",
      "Just put it out  when it gets warmer and I can sit outside I'll see how much I enjoy it like what I see so far",
      "Nicely made, sturdy and beautiful."
    ]
  },
  {
    "productId": "bDGUfskGeb",
    "url": "https://www.etsy.com/listing/1296684883/daisy-stake-rusted-metal-yard-art-garden?click_key=115b3abb4e19d68585df7c58b04c6291ff975241%3A1296684883&click_sum=4a643be5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-12&pro=1&frs=1&etp=1&content_source=e77a63a653036a5bc189e203356b8ecf1fd4cd0c%253A1296684883",
    "title": "Daisy Stake | Rusted Metal Yard Art | Garden Gifts | Metal Garden Art | Garden Bed Decor | Bird Art | Garden Decor | Garden Stake",
    "description": "DESCRIPTIONOur Daisy Stake features a realistic design created to look like a real daisy growing in your backyard! The design features life-like petals, as well as leaves and spikes along the stem, all carefully shaped to create a three-dimensional effect.The Daisy Stake is made of recycled steel and pre-treated to create our signature rusted texture and natural look. It also features hand-painted accents on the flower petals to reflect the color of a real daisy. It would be such a happy and bright nature-inspired accent for your backyard garden!INSPIRED BY NATUREDaisies’ iconic petals close at night and open up during the daylight hours. They also turn to face the sun wherever it may be in the sky. Display our Daisy Stake to serve as a beautiful reminder to always look toward the light and keep the shadows behind you, even in challenging times.SO EASY TO INSTALL & DISPLAYOur metal garden art stakes insert easily into soft ground. Be mindful of rocks and roots that may catch the metal stake, and adjust the depth as needed. To preserve the paint and protect your design for years to come, consider seasonally adding a coat of clear Satin Lacquer to your metal garden art.THE PERFECT SIZESKU# ST916Dimensions: 50\" x 11\" x 5\"LET’S CONNECTCheck us out on Social Media for more nature-inspired home decor!Facebook    Instagram    Pinterest    Twitter",
    "reviews": [
      "Love my daisy. Now I have 3",
      "This was a gift for my mom. It looks exactly like the photos, it shipped fast, and she loved it."
    ]
  },
  {
    "productId": "tXJTWjijOw",
    "url": "https://www.etsy.com/listing/1254513885/walnut-balcony-table-space-saver-balcony?click_key=f4f12f34deea533cd61db8821cfbfef4210956d0%3A1254513885&click_sum=6b1db3de&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-13&pro=1&frs=1&sts=1&content_source=d4c5fb2b9f3afe881113592037f31e0201f698d6%253A1254513885",
    "title": "Walnut Balcony Table Space Saver, Balcony Bar Table Railing, Wooden Patio Bar Table, Folding Table Terrace, Custom Table with Winter Cover",
    "description": "Do you need a folding sturdy table on your balcony or a bar to host your guests. Our product meets all your needs. This handmade product will add a different atmosphere to your balcony. It is compatible with all balcony rails thanks to its specially designed mechanism, include round square.You can check our other balcony bar table in here:https://www.etsy.com/shop/PureWoodesign?ref=seller-platform-mcnav&section_id=38610171Railing/Balcony Wall ThicknessMin: 1\" (2.5 cm)  Max: 6.3\" (16 cm)Dimensions:-----------------XXSmall: 15.7\" Length x 11.8\" Width (40 x 30 cm)XSmall: 21\" Length x 11.8\" Width (53.5 x 30 cm)Small: 24\" Length x 11.8\" Width (60 x 30 cm)Medium: 31.5\" Length x 11.8\" Width (80 x 30 cm)Large: 39.5\" Length x 11.8\" Width (100 x 30 cm)Xlarge: 47.3\" Length x 11.8\" Width (120 x 30 cm)2Xlarge: 59\" Length x 11.8\" Width (150 x 30 cm)3XLarge: 70.8\" Length x 11.8\" Width (180 x 30 cm)4XLarge: 78.7\" Length x 11.8\" Width (200 x 30 cm)5XLarge: 86.6\" Length x 11.8\" Width (220 x 30 cm)6XLarge: 96.4\" Length x 11.8\" Width (245 x 30 cm)Size options can be customized. Please contact me for custom requests.Our Balcony Bar Cover DETAILS :XXSmall: 15.7\" Length (40 cm)XSmall: 21\" Length (53.5  cm)Small: 24\" Length (60 cm)Medium: 31.5\" Length (80  cm)Large: 39.5\" Length (100 cm)Xlarge: 47.3\" Length (120 cm)2Xlarge: 59\" Length  (150 cm)3XLarge: 70.8\" Length  (180 cm)4XLarge: 78.7\" Length  (200 cm)5XLarge: 86.6\" Length  (220 cm)6XLarge: 96.4\" Length  (245 cm)Made with polyester.If you want to confirm whether the balcony rail will be compatible, please feel free to contact us.This model has no flower box.* ADJUSTABLE: Steel brackets adjust in width and secure to both round and flat railings from 1\"-6.3\" inches in width.* EASY SET UP: Brackets arrive assembled.Super easy to assemble. I will share an assembly video and it takes 10-15 minutes to mount.* FOLDABLE: Foldable bar top is convenient for maximizing your outdoor space & for storage.* DURABLE MATERIALS: Static painted stainless steel brackets. My products get their quality from birch, which is one of the strongest tree species that grows in the rich and industrial forests of country, which has 100% quality standards. In this way, our products are long-lasting and resistant to adverse conditions. In addition, special paint and varnish were used to increase its resistance to sun and rain. We trust the quality and workmanship of the materials we use. Relying on this, we proudly give you a lifetime warranty.This handmade Minimalist Balcony Bar Table is for Small terrace and balcony. It is a great space saver product.Each item is hand crafted and every piece of wood is different. Slight variations are to be expected in the wood grain, knots & the color of the stained wood captured in the photos might vary slightly also.Pack Details:We are shipping your furniture with a durable hard box !We can also make a pack free of charge 😊Shipping:We are making your furniture as a custom order and crafted one by one meticulously.As a team, we’re working to serve your ring as soon as possible! Please check current shipping time when you order 😊FREE shipping & EXPRESS Shipping worldwide. 😊I am working with DHL, FEDEX, TNT and it takes 3-4 business days for your order to be delivered. I will send your tracking info after your order is dispatched.Customer Service:We are always here to serve you! Whenever you want to ask something, please do not hesitate to get in touch with usThank you for reading all the details! If so, please click the “Favorite Shop” to follow our new furnitures and to get news about updates and discounts! 😊",
    "reviews": [
      "Wonderful product! And wonderful people to deal with:)",
      "Thank you so much for your lovely feedback and beautiful photo! We're thrilled to hear that you find the balcony bar table wonderful. Your satisfaction means the world to us. Enjoy your patio furniture! It looks amazing on your terrace.",
      "Love it! A gift for the whole family to enjoy during the holidays!",
      "Thank you kind words for balcony bar.",
      "Great ordering experience and product!",
      "Thank you kind words for balcony table.",
      "Exactly as pictured."
    ]
  },
  {
    "productId": "QYZzBFiDCs",
    "url": "https://www.etsy.com/listing/1427382358/rusty-metal-garden-sculpture-i-outdoor?click_key=9abf0703fbaa9172b76f9045a5caec39bc60b495%3A1427382358&click_sum=ad5b9644&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-14&pro=1&frs=1&content_source=51cdd54b23ec656bcf6c88db73f15955f2148e58%253A1427382358",
    "title": "Rusty Metal Garden Sculpture I Outdoor Sculpture Art for Garden I Garden Decor",
    "description": "Handmade garden art. Simple metal sculpture to decorate your garden.Rusty Metal Ring Sculpture - Metal Outdoor Art Rusted Metal Plant Stake - Home and Garden Decor Ornament - Metal Garden Art Furniture - Garden Decor GiftMetal art can be a great statement piece in your garden. Beautiful way to highlight your favorite plants or a contrast to soft, airy grass. Arrange the rusty metal spiral in any formation to create your very own unique piece of affordable garden decor.SIZE and DETAILSThe rings are made from 6mm thickness, 60mm wide mild steel which WILL rust for a unique patina. Complete with four detachable stakes, to enable them to be push securely into the ground.Rust will appear with time, giving the sculpture a unique, natural finish. It won't require any maintenance, and can spend the whole year outdoors.  I can also accelerate the rusting process (please check the product options)....................................................Handcrafted in EU with professional premium materials for quality craftsmanship.Your order is packed very carefully in a multilayered package to ensure it's safety on the way.We are welding legs for your industrial table to order, and it takes couple days to make them.Shipping time:- 2-5 days for EU- DPD with tracking- 3-6 days for the USA, United Kingdom, Australia and Canada- FedEx with trackingUsually it's 2 weeks since order to delivery for standard sizes and 3 for custom sets....................................................WHY US?We make metal table legs and art. That's what we love. That's what we do.Thank you for visiting our shop!...................................................Have a look at other metal furniture legs in our workshop:============================================================https://www.etsy.com/shop/StaloveStudio?ref=hdr============================================================All work and images © Stalove.com. All rights reserved.============================================================",
    "reviews": [
      "I like this sculpture very much.  I ordered two of them, and\nreceived them very quickly.  It was a very smooth transaction.",
      "It’s exactly as pictured, I love it!",
      "This is now my second order and I have to say, everything worked out great again. The tire was shipped very quickly and was again very well packaged. The quality of the tire is again very good. I think this shop is very good."
    ]
  },
  {
    "productId": "jCCXEYLXBk",
    "url": "https://www.etsy.com/listing/1453519981/outdoor-floor-cushion-water-repellent?click_key=309df50e9b58532956251de440c05286773fb1fe%3A1453519981&click_sum=fccb5016&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-15&pro=1&frs=1&etp=1&sts=1&content_source=244766638dd0934f2328b7262968cdc4478462a4%253A1453519981",
    "title": "Outdoor Floor Cushion | Water Repellent Floor Pillow | Large Floor Seating | Montessori Mat | Patio Bench Cushion | Tufted Pillow",
    "description": "Water-repellent patio floor cushions. Can be used as a floor cushion, floor lounger, chaise lounger cushion, sofa padding, floor seating, etc. This comes in many colors and sizes and we make also custom sizes :)These cushions are very versatile, you can use these straight on the floor, on a lounger chair, on a wooden bench, by the pool, indoors.These are made from water-repellent fabric (This article has been tested and resulted in a water resistance average of 1727 mm H2O. This means it is waterproof against rain.)Filling: holofibre, polyester cushion filling.Cushion is tufted.There are multiple sizes available and custom sizes are possible to order by request, usually it takes 1-2 weeks to prepare. Extra colors also by request.**BOTTOM**23\"x39\" / 58x100cm23x47\" / 58x120cm23x55 / 58x160cm23\"x63 / 58x160cm23\"x71\" / 58x180cm23\"x78\" / 58x200cm31\"x47\" / 80x120cm36\"x63\" / 90x160cm31\"x78\" / 80x200cm47\"x71\" / 120x180cm (the first picture of the listing)Round D45\"/ 115cmYou can also order matching pillows for the back, these are tufted in 1 row. If you wish to have more tufting rows, please write a special request with the order :)** BACKREST**16\"x24\" Backrest cushion (40x60cm)16\"x31\" Backrest cushion (40x80cm)16\"x47\" Backrest cushion (40x120cm)We recommend have sets of:31\"x47\" & backrest 16\"x47\"36\"x63\" & two backrests at 16\"x 31\"47\"x71\" & 16\"x47\" Backrest cushion  or 3 backrest cushions at 16\"x24\".This cushion is about 5\" thick. Comes with a zipper.The cushion also has an inner cushion that is not sewn shut, so if needed, there is possibility to add more filling in the future ( there is a zipper too).Check out more of my items:https://www.etsy.com/shop/PatuuLiving",
    "reviews": [
      "Very well made and comfortable - met my needs and hopes for this cushion! It’s even comfortable enough for me to sleep on.",
      "Super nice quality and great service. Had some questions regarding to the size and color.",
      "this item is of great quality"
    ]
  },
  {
    "productId": "uUdmMXjYyd",
    "url": "https://www.etsy.com/listing/1675822599/garden-fairy-metal-outdoor-decor-for?click_key=85bdff9642bf1c4129bb5b95a2fa107dfe09d871%3A1675822599&click_sum=d9003a49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-16&pro=1&frs=1&content_source=71595be0263d9294a0ad99c9667c5201956e3233%253A1675822599",
    "title": "Garden Fairy Metal outdoor decor for your patio and Lawn",
    "description": "❤️Enhance the enchanting beauty of your outdoor space with our Garden Fairy metal decor. The perfect decoration to add a touch of whimsy and magic to your garden.❤️If you have any question please let us know❤️Thank you for your Order🙏",
    "reviews": [
      "Good quality and good shipping. Price a bit too high. But still very nice.",
      "Well packaged and everything exactly as described. In my opinion the price is a bit too high."
    ]
  },
  {
    "productId": "rJkyuiBfOC",
    "url": "https://www.etsy.com/listing/1676321750/wooden-garden-bench-with-steel-legs-and?click_key=d60faeddd8a24ee3cd6392f71d2452e65a5fb7f6%3A1676321750&click_sum=db07cc0a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-9&pro=1&sts=1",
    "title": "Wooden Garden Bench With Steel Legs and Backrest. Rustic Bench for Garden. Reclaimed Wood. Easy to assemble or take apart to store away.",
    "description": "Need a break from the hustle and bustle? Step into your garden and onto your new cosy wooden bench - your new favourite chill spot awaits! Handmade in our workshop in Brighton, East Sussex, this bench is made with solid steel legs and weather resistant finish and it's built to withstand the test of time.Whether you're relaxing or admiring your garden, this bench provides the ideal seating solution. It features high-quality FSC certified reclaimed wood, giving it a charming rustic industrial design with a mix of wood and steel. The weatherproof powder-coated steel legs ensure exceptional durability and weather resistance, while also making assembly a breeze. Plus, when winter rolls around, you can easily disassemble it and store it flat packed.--------------------------------------Details:If you can't find the exact size or finish you're looking for, feel free to reach out for customisation options. Each bench is made to order, ensuring it fits your needs perfectly. The legs measure 40cm tall, while the seat is 38cm deep.--------------------------------------Wood Characteristics:Wood is a living material, characterised by knots, variations in grain, and colour differences. Despite proper drying techniques, wood will naturally expand and contract with changes in humidity. Our benches are crafted and finished with care to accommodate this natural movement. Imperfections such as small cracks, knots, and variations in wood grain are to be expected, particularly in reclaimed wood. These characteristics add to the charm and uniqueness of each bench, without compromising its functionality or structural integrity.Shipping--------------------------------------Important Details:Your garden bench will be delivered flat packed to eliminate the risk of damage during transit. A simple assembly will be required to install the legs. Screws will be provided! You will need a short screwdriver.Buyers are responsible for any customs and import taxes that may apply. Pastos Co cannot control any delays due to customs. Contact us if you would like to have more information on import duties & customs.Find us on Instagram and Facebook - @pastos.co",
    "reviews": [
      "I really like the desk, exactly as described and really good communication between the company and myself explaining the process, I found this helpful and a worthwhile separating themselves from other company. \n\n*5\n\nJon.",
      "Really nice! And Johnny and his team are really helpful! Thank you",
      "The table looks amazing! I totally recommend it. In practical terms, not having the holes for the legs is a downside, but at the same time it ensures the integrity of the table for sure! I love it :)"
    ]
  },
  {
    "productId": "lxOodArPkx",
    "url": "https://www.etsy.com/listing/1501264791/dragonfly-stained-glass-wind-spinner?click_key=cea05402374896e82e17682a1f8a79cc5cc37e67%3A1501264791&click_sum=613528ae&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-10&pro=1&sca=1",
    "title": "Dragonfly Stained Glass Wind Spinner, Garden Art, Yard Decor, Outdoor Garden Decor, Dragonfly Gifts For Women, Unique Gifts For Mom",
    "description": "These metal spinners open up into a beautiful piece of art that moves and spins in the windThe pictured design will be printed double sided onto aluminum. Suitable for indoor or outdoor use, e.g. yard, garden or in a windowCharms or additional spinners can be hung from the bottom for extra personalization (not provided)Please note that the stained glass image is printed onto the surface of the metal - the spinners don't contain any actual glass!..........................SIZING AND MATERIALS8\" x 8\" (203mm x 203mm)Made from .045'' (1.15mm) thick aluminumDurable, scratch-resistant and waterproofHardware included for hangingShipped flat and easily assembled - see listing photo for instructions........................................................FURTHER INFORMATIONPlease note that colours shown on your monitor/phone may appear slightly different from the finished productDesigns are transferred using a dye sublimation printing process which produces a permanent, high quality image that won't scratch, peel or fade away with timeAs all of my items are made to order, I can provide extra personalization if needed. Simply send me a message before ordering and I will do my best to meet your requirements!........................................................SHIPPINGFree shipping to Canadian addresses are sent using Canada Post Lettermail and I am unable to provide any tracking information for this service. You can also choose Upgraded shipping which includes trackingOrders to USA are shipped using USPS and tracking will be providedPlease check out the other items in my shop athttps://www.etsy.com/ca/shop/MortalFrogGifts",
    "reviews": [
      "overall well pleased with product",
      "Nice quality and fast shipping",
      "Just as I expected! Beautiful!"
    ]
  },
  {
    "productId": "lObgtAGoQE",
    "url": "https://www.etsy.com/listing/1453519981/outdoor-floor-cushion-water-repellent?click_key=b463d1bd3f45032622aca4c515f4c37250b5a1e8%3A1453519981&click_sum=78dcc699&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-11&pro=1&frs=1&etp=1&sts=1",
    "title": "Outdoor Floor Cushion | Water Repellent Floor Pillow | Large Floor Seating | Montessori Mat | Patio Bench Cushion | Tufted Pillow",
    "description": "Water-repellent patio floor cushions. Can be used as a floor cushion, floor lounger, chaise lounger cushion, sofa padding, floor seating, etc. This comes in many colors and sizes and we make also custom sizes :)These cushions are very versatile, you can use these straight on the floor, on a lounger chair, on a wooden bench, by the pool, indoors.These are made from water-repellent fabric (This article has been tested and resulted in a water resistance average of 1727 mm H2O. This means it is waterproof against rain.)Filling: holofibre, polyester cushion filling.Cushion is tufted.There are multiple sizes available and custom sizes are possible to order by request, usually it takes 1-2 weeks to prepare. Extra colors also by request.**BOTTOM**23\"x39\" / 58x100cm23x47\" / 58x120cm23x55 / 58x160cm23\"x63 / 58x160cm23\"x71\" / 58x180cm23\"x78\" / 58x200cm31\"x47\" / 80x120cm36\"x63\" / 90x160cm31\"x78\" / 80x200cm47\"x71\" / 120x180cm (the first picture of the listing)Round D45\"/ 115cmYou can also order matching pillows for the back, these are tufted in 1 row. If you wish to have more tufting rows, please write a special request with the order :)** BACKREST**16\"x24\" Backrest cushion (40x60cm)16\"x31\" Backrest cushion (40x80cm)16\"x47\" Backrest cushion (40x120cm)We recommend have sets of:31\"x47\" & backrest 16\"x47\"36\"x63\" & two backrests at 16\"x 31\"47\"x71\" & 16\"x47\" Backrest cushion  or 3 backrest cushions at 16\"x24\".This cushion is about 5\" thick. Comes with a zipper.The cushion also has an inner cushion that is not sewn shut, so if needed, there is possibility to add more filling in the future ( there is a zipper too).Check out more of my items:https://www.etsy.com/shop/PatuuLiving",
    "reviews": [
      "Very well made and comfortable - met my needs and hopes for this cushion! It’s even comfortable enough for me to sleep on.",
      "Super nice quality and great service. Had some questions regarding to the size and color.",
      "this item is of great quality",
      "Two words: SO COMFY!!! I love it so much and it fits perfectly. Have yet to test out it's durability outdoors though, but it's been holding up against my dog's antics"
    ]
  },
  {
    "productId": "XmzgqWfy4C",
    "url": "https://www.etsy.com/listing/254702604/5ft-glider-swing-with-stand-patio-glider?click_key=aaa11254b9975917701203f6ea77d758b13abca7%3A254702604&click_sum=e1f0dc09&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-12&pro=1&frs=1&etp=1&sts=1",
    "title": "5ft Glider Swing with Stand, Patio Glider, Patio Furniture, Wood Porch Swing, Patio Bench for Garden, Memorial Bench",
    "description": "5ft Pine Glider Swing, Handmade in the USA with beautiful pine lumber, sanded and stained with high-quality exterior stain. Minor assembly required. Optional Personalization, High  Back Upgrade, Contour Seat Upgrade, Cup Holder and Stainless Steel Hardware Upgrade are available for an additional charge.STANDARD FEATURES OF 5FT PINE GLIDER SWING INCLUDE:* one individually handcrafted 5ft Pine Glider Swing unit, each glider is hand-made to order* Round-Face Seat (the area behind the knees when sitting in the swing)* all galvanized and coated fasteners resist corrosion, zinc-plated assembly hardware included* sanded for a smooth finish, all parts routered for smooth edges* spacing between slats ensures no water or debris build-up leading to early wood rot* stained with high-quality exterior stain & sealant protection prevents water damage & graying, mildew resistant, UV defense, waterproofing protection* easy assembly instructions, parts will be pre-drilled with pilot holes, fasteners included (we fully assemble each swing to ensure proper fit.) Most of the assembly is already done for you and usually only takes about 15-30 minutes* our swings are built with full-size lumber to support both back and seat* Mechanics of our Gliders are maintenance-free, as all you might have to replace are the chains.No bushings, bearings or mechanical parts to wear or rust out. Easy push allows the swing to glide easily* shipping includedCustomized Options available at additional cost PLEASE SEE EACH LISTING FOR PRICES OF UPGRADES:*Engraved Lettering/Personalization on top back panel of Southern Swing (max of 18characters):https://www.etsy.com/listing/692613178* High Back Option is approximately 2 inches taller:https://www.etsy.com/listing/742669668* Contour Seat Upgradewww.etsy.com/listing/807425310*Stainless Steel Hardware Upgrade: (chain,nuts,bolts,washers,eye hooks and quick links):https://www.etsy.com/listing/679850092* Custom-built Cup Holder that stores in a compartment of the swing when not in usehttps://www.etsy.com/listing/701227230*Custom sizes - Message for Questions or Click on Request Custom OrderPine is ideal for indoor or well-covered areas. Pine used outdoors may need more care and maintenance to extend the life of the wood, such as more frequent reapplication of stain, storage or covered during severe weather seasons or long periods of nonuse. For use outdoors with constant direct exposure to the climate and elements, we recommend our KDAT pressure-treated pine units or our Cypress and  Juniper unitsVisit our shop here on etsy for matching accessories,such as end tables,coffee tables,etchttps://www.etsy.com/shop/TribesSouthernSwings*some pictures may show stain colors that are no longer available, options available for an additional charge, or photo props that are not included. Due to differences in screen settings, photo lighting and the natural variations of wood, stain colors may vary slightly between the sample pictures and physical product.If you are not 100% satisfied, we will refund the purchase price (minus our shipping/handling costs)-see our RETURN POLICY for detailsSWING MEASUREMENTS FOR 5ft GLIDER SWING (approximate):Carriage: length is 70\" x 32\" width x 36\" tallSwing seating depth is 17.5\", seating length is 55\" long, back height is 17.5 inches.Your Southern Swing will ship via FedEx/UPS and includes insurance and tracking number.Total of 3 packages. Due to the size and weight of this 3 package shipment, packages may be shipped separately to reduce the chance of damage during shipment.To view even more pictures and see satisfied customers visit us at facebook.com/SouthernSwingsor call 850-382-1789 if you have any questions",
    "reviews": [
      "I bought this for a retirement gift. I wanted to get it engraved but the shipping was going to take to long if I got it engraved. So I decide to purchase it and do the engraving myself. I told the seller my intentions, so they shipped the swing first so that I could get a early start on the engraving and shipped the rest later. Thank you for th great customer service. The swing was great also and on time. The one thing that can be better is to have the correct length of screws for the assembly. The ones provided stuck out the back side almost half an inch. I had to replace them with shorter screws. The person that it was given to absolutely loved it. I would purchase again.",
      "I cannot recommend this shop more highly. When I ordered, I was looking for a different color and was willing to stain it myself, they immediately adjusted. Also, the assembly instructions were quite good and they clearly care about assembly, I had questions because I am a goof and within a half hour answered… thank you!\n\nGreat product and wonderful folks.",
      "Item came in 3 packages. The instructions were clear and the assembly was very easy to",
      "This seller has absolute phenomenal service!! We received our swing in the timeframe stated. The  packaging was superb!! They took GREAT CARE in making sure our swing arrived safely and in immaculate condition! \nThey have answered all of my questions without hesitation and have gone above and beyond to help me!! I absolutely recommend them to anyone!!"
    ]
  },
  {
    "productId": "ufMlDYqTiG",
    "url": "https://www.etsy.com/listing/1680085990/multi-tiered-plant-stand-handmade-9-tier?click_key=d1d169b95aab95ea3c317c886124657d6775e732%3A1680085990&click_sum=ebaeb202&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-17&pro=1&frs=1&cns=1&content_source=cfe0b6d7fe458e57b4df13dfc672e4ec95e9e703%253A1680085990",
    "title": "Multi-tiered Plant Stand Handmade 9 Tier Carbonized Wood Flower Rack Display Stand Indoor",
    "description": "Material: Solid Pine WoodColor: Stained Medium BrownProduct Dimension: L * W * H 115x25x96.5cm/ 45.3x9.8x38 inchWeight Capacity: 91kg/ 200 lbs in totalTop & Second Tier: EACH 5kg/ 11 lbsMiddle Tier: EACH 15kg/ 33 lbsTiers of on both sides: EACH 3kg/ 6.6 lbsBottom Tier on both sides: EACH 20kg/ 44 lbsPackage Size: 116x28x10cm/ 45.7x11x3.9 inchShipping Weight: 5.45kgPackage Included:1 x Wood Plant Stand1 x Assembly Instruction1 x Screws Accessories- The flower stand parts will be sent by separate and without assembling-You can easily assemble it by following the assembly instructions we will send with the product.- Please note that pots and plants, flowers are not included.- Please refer to the measurement. There may be minor measurement errors, which will not deteriorate the quality and appearance of the product because the products are made by hand.- There might be a little color difference due to the monitor, camera or other factors, please refer to the physical item.Try checking out our page for other amazing items in our store :)",
    "reviews": []
  },
  {
    "productId": "xutLWbCZEk",
    "url": "https://www.etsy.com/listing/162988434/metal-fat-chickadee-garden-art-chickadee?click_key=4ea5bfc66d2cc3f0436eb00e9863d5c92f4aecbf%3A162988434&click_sum=7233f979&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-18&pro=1&etp=1&content_source=e468015177b3e989041308ba18ad7db400df87af%253A162988434",
    "title": "Metal Fat Chickadee Garden Art | Chickadee Bird Silhouette | Rusted Metal Yard Art | Garden Gifts | B708",
    "description": "Please note that the Stump is not included with The Fat Chickadee - It's available to purchase in the miscellaneous categoryAdd some captivating life to your home and garden with this adorable black-capped chickadee!Makes the perfect birthday gardening gift for your loved ones. Great as a Thank You gift and for Mother’s Day to add life to any windowsill, flower pot, fence line or trellis. An elegant addition to any yard or garden!Cut from 16-gauge recycled steel with holes pre-dilled for easy mounting, this little black-capped chickadee has been pre-treated to give it an authentic rusted surface.Naturally occurring oxidation gives this piece of garden art a rustic and charming life about it, complementing the luscious greenery around it.Looking for more charming metal garden art friends to add to your black-cap?Check out our other rusted birds like our Singing Warbler (search ‘B738'), Great Blue Heron (search ‘B740'), or Hummingbird with Flower (search ‘B742')🛠️  SO EASY TO INSTALL & DISPLAYOur metal garden art are easy to mount with a 90° angled tab / flange and pre-drilled screw holes added to each piece. Mount your product to a window, tree branch, pergola, fence, trellis, garden gate, or an old log in the backyard. The possibilities are endless!Your steel silhouette can be gently shaped by hand to add dimension and depth. Simply fold the wings or tail to awaken its life-like appeal!✔️  THE PERFECT SIZEDimensions: approximately 3.5\" tall x 4.75\" wideSKU# B708📦  PROMPTLY SHIPPEDCarefully picked and packaged to ensure safe arrival, your products should arrive within 1-2 weeks.🌱  INSPIRED BY NATUREWe've been setting the scene with playful silhouettes since 2011.As a husband and wife team from the Pacific Northwest, we've always combined superior craftsmanship with iconic design to help our customers bring the beauty of nature home.🔍  DISCOVER MOREVisit our shop home page to discover more ways to add charming inspiration and rustic accents to your yard, garden and home.👋  LET’S CONNECTIf you're inspired by what you see, click the ‘Favorite Shop’ button above and then join the conversation on our social platforms (copy & paste into web-browser)Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/",
    "reviews": [
      "Exactly as expected! Packed well too.",
      "Great product. Looks really nice.",
      "Wonderful item and customer service. Will order again!",
      "all great , just as advertised"
    ]
  },
  {
    "productId": "QTjWEpIyVJ",
    "url": "https://www.etsy.com/listing/979252072/wood-table28x60nc-h13-boho-table-wooden?click_key=74d565a4af3aa1c7f0c6935bb89d0d4efd3cbd4c%3A979252072&click_sum=75dd3a8f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-19&pro=1&frs=1&etp=1&sts=1&content_source=dc102bd328d091f193fcca61e25270c7be3cf20b%253A979252072",
    "title": "Wood table(28x60ınc h)13 boho table, wooden table, low foldable table,low table, boho picnic table,large garden table",
    "description": "Wood table(28x60ınc h)13 boho table, wooden table, low foldable table,low table, boho picnic table,large garden table*This product is completely handmade and very durable.*Each package is carefully wrapped to ensure safe delivery,Boho picnic table,boho beach picnic table***If you want to make special production, please contact**** Europe: 7-14 days;* USA & Canada: 10-17 days;* Australia & everywhere else: 10-30 days***Damaged products are covered by our warranty***",
    "reviews": [
      "Beautiful table! It shipped very fast. Really excited to use it for my daughter's birthday party.",
      "I asked for table wood to run lengthwise and wondered if he could stain them as well… and they are beautiful! I ordered two and they came a few days apart. I am going to use for a birthday party and will submit a photo later. Thank you for the great price and great work!"
    ]
  },
  {
    "productId": "ZqmUoOnKzB",
    "url": "https://www.etsy.com/listing/1002977348/solar-lightslanterns-marie?click_key=ec5def04b6f9276c8d1c25f6c7b469444fde0c83%3A1002977348&click_sum=438503ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-20&pro=1&frs=1&sts=1&content_source=ba4bdc8f2925d71fce0c98fecbfc2f9ec8f37e3e%253A1002977348",
    "title": "Solar Lights/Lanterns \"Marie\"",
    "description": "Add a little ambiance to any patio, backyard, deck, or venue with this unique solar powered iron cage lantern with unique Edison style LED bulb. Fully weatherproof and automatic. 100% solar powered with a large capacity 3.7V 1200mah lithium ion battery. Under ideal conditions up to 4 hours of light is provided at night based on a fully day in the sun charging. The product must be located in an area that receives direct sunlight on all solar cells during the day for best performance. An on/off switch is included.",
    "reviews": [
      "Received the package today, love the solar lamps, exactly what I was looking for. Just have to wait for Winter snow to be gone. We are from Canada",
      "Stunning and different, I tethered them to an outside deck table, it withstood the winds, and I love the quiet, gentle lighting!",
      "We purchased this item to light a stairway on a landing with no outlet. Though it is not suggested by the seller for indoor use, we found it works quite well in a bright window that gets adequate sun to keep the lamp lit at night. The light is the perfect intensity (read: soft warm light that doesn't bleed through door sills) while keeping the stairway lit well enough to navigate at night.",
      "When this lamp came, I couldn't believe how well made it is. It is he perfect size for my outdoor table. Love, love, love this lam!",
      "I’m so happy that you are pleased with your light!  Also, thank you for the nice review.  I really appreciate it!  \nIf you have a chance, I’d love for you to upload a picture. I always like to see where my  customers put them. Enjoy!"
    ]
  },
  {
    "productId": "brnQENHhQt",
    "url": "https://www.etsy.com/listing/986590069/hanging-bells-multicolor-mobile-wind?click_key=75129107489cc1abc2610edf9dd9ae56f830821e%3A986590069&click_sum=71eb7638&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-21&pro=1&sts=1&content_source=cc2c45f19dd831f18903188c598960b414d1dbb4%253A986590069",
    "title": "Hanging Bells Multicolor Mobile | Wind Chimes | Patio Decor | Garden Art | Balcony Chimes | Garden Furniture | Gifts for Mom | Yard Art |",
    "description": "Hanging Bells Multicolor MobileInvite harmony and happiness—and a punch of color!—into your garden with this multicolor mobile. Adorned with unique, jewel-tone inspired bells in ruby red, sapphire blue and emerald green, this wind chime is both mature and marvelous! We love it placed on a patio or pergola where its uniqueness is truly on display. Wherever you decided to show it off, this handcrafted item is sure to make an impression year after year!Dimensions: 6\" w x 6\" d x 25\" hEXPERTLY CRAFTED BY HAND - Our mobiles and wind chimes are carefully constructed by hand using reliable, high-quality materials.FUSS-FREE ASSEMBLY AND CLEANING - Each of our mobiles and wind chimes are easy to assemble and hang, making them great gifts for just about everyone. They’re also designed for hassle-free cleaning, ensuring your decor looks as good in a few years as it did on day one.MAKE NEIGHBORS JEALOUS - We only sell unique, stunning mobiles and wind chimes that are truly different from what traditional retailers stock. That means this item makes a standout gift for family and friends--or a perfect addition to your garden, patio or lawn.UNRIVALED QUALITY - Know that this item has been made with pride using only the finest materials. We have selected this item for our store because it’s both beautiful and durable.BREATHE-EASY 1 YEAR WARRANTY - We back every wind chime and mobile we sell with a one-year, limited replacement warranty. If you have any problems at all with this item in your first year of ownership, just reach out to our friendly customer service team and we will make it right!",
    "reviews": [
      "Large windchime , sounds beautiful , love the colors!",
      "Hi Ellen! We’re thrilled that you're happy with your purchase. Thank you so much for your business. :)",
      "It’s beautiful and bigger than expected in person. It was well packaged and arrived quickly and in perfect condition. I get compliments on it all the time. Another reviewer mentioned it doesn’t make much noise and I agree that it takes extremely strong winds for the slightest movement. It looks great and I am thoroughly pleased. Thank you!",
      "Absolutely love these. Thanks, Lee"
    ]
  },
  {
    "productId": "hmstGzrdFu",
    "url": "https://www.etsy.com/listing/986601053/standing-birds-assorted-colors-garden?click_key=9ddbdcd89d626ede93baca1533cef39acfb04c10%3A986601053&click_sum=b4b89f9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-22&pro=1&sts=1&content_source=f5fc6240b60c5f1202306c6727d8ed885fb7b8ef%253A986601053",
    "title": "Standing Birds - Assorted Colors | Garden Stakes | Yard Art | Garden Decor | Patio Decor | Gifts for Gardeners | Gardening | Garden Art",
    "description": "Standing Birds – Assorted ColorsAdd color, fun and life to your garden or yard with our bright and cheerful standing bird stakes. These statuettes come in assortment of brilliant hues that will really lend character to your outdoor space. Made from terra cotta and metal, each little bird is perched neatly atop a leafy branch which extends to a stake for fuss-free placement.Display your individually handcrafted bird independently, or order several to build a cute, chirpy flock.These are sold on an individual, assorted basis.Dimensions: Approximately 9” L x 5” D x 32” HHANDCRAFTED WITH LOVE - Our garden stakes and rain gauges are handmade by talented artisans who take pride in their work.EASY TO ASSEMBLE AND CARE FOR - You already spend enough time tending to your garden. Thankfully, our decor is a cinch to put together and maintain. No frustrating instructions here! Just simple, intuitive steps to assembling and installing your garden stakes and rain gauges.INSTANTLY ENHANCES GARDENS - Our garden stakes and rain gauges were designed to add that “wow” factor to your outdoor space right away. This item also makes a unique and exciting gift that’s truly different from what big-name retailers sell.TOP-NOTCH QUALITY - Every item you purchase from Happy Gardens is made from fine materials like river stones and steel. Our happy customers enjoy our garden stakes and rain gauges for years and years with no issues.FRIENDLY ONE-YEAR WARRANTY - We are proud to offer a limited one-year warranty. If you ever have any trouble with your purchase, simply call or chat with our customer service team and we will help you out!Don't forget we also have a great wind chime range. Other stakes you may be interested in include:Triple Spinning Heart Garden StakeBell Spiral Garden Stake MulticolorSpice Bird Rain GaugeButterfly Rain GaugeRed Heart Disc Garden StakeHummingbird Garden Stake",
    "reviews": [
      "This was a gift, so I haven't seen it in person, but the recipient was delighted.",
      "That's so sweet. Thank you for your business, Lauren. I am glad the recipient loved it. :)",
      "I’ve had these birdies in my wishlist for a very long time. I was excited to see that they are as brightly and beautiful as pictures. I ordered a trio as I think they look best in an grouping. So happy with my purchase.",
      "Beautiful! We are so happy to know you like it, Alix. Thank you for your purchase and for sharing this lovely photo :)",
      "Love the colors! Beautifully crafted. Love it on my deck garden!"
    ]
  },
  {
    "productId": "tCI4GyuGIP",
    "url": "https://www.etsy.com/listing/1614920451/plant-stand-for-indoor-plant-pots?click_key=093edbaacf4becd06df7950a58e4ffef444919f6%3A1614920451&click_sum=6957e149&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-23&pro=1&frs=1&etp=1&sts=1&content_source=b8b37c6dd4316d5fe13776afcff7e2a522a702e4%253A1614920451",
    "title": "Plant Stand for Indoor Plant Pots - Perfect for House Plants and Plant Lovers, Gift for Plant Lover, Art Deco Planter Stands",
    "description": "A Unique Indoor Bespoke Plant Stand is a great addition for any plant pot with drainage hole to add elevation. This stand can be used as a plant stand, end table, nesting table or even an elevated stool on a countertop for more storage. A sleek and art deco look.Made with high-quality plant based materials that are recyclable and biodegradable, although these will last for years to come. Stylish, Functional and Sustainable!Main image is beige.The Unique saucer feature provides an area for water to drip while also being a cute stand. Functional and Sturdy to hold your heaviest of plants.  Use this stool as a prop in your next video or photography shoot. Lightweight,  small round table is strong and sturdy. Get into your Cottagecore room decor with this beautiful crafted, eco-friendly stand.Mix and Match the color shelf with color legs that you desire. We have provided a picture of most color combinations. Create the perfect aesthetic indie room decor.Dimensions:Small:Height - 3.5 inchesShelf - 5.8 x 5.8 inchesGreat to use as a small centerpiece for table, counter, or island.Medium:Height - 5.5 inchesShelf - edge to edge 6.8 inchesGreat for medium sized plants that you want to elevate from a surface.Large:Height - 6.5 inchesShelf - 9.8 x 9.8 inchesGreat for larger plants to use on the floor.MAX WEIGHT 100 Pounds.Table comes fully assembled and ready to display right out of the box, making this the perfect gift.NoteOur items are 3D printed with PLA - a type of thermoplastic polymer derived from Upcycled materials like Corn, Beets, and Wheat Grass. PLA is 100% biodegradable, recyclable and compostable! This eco-friendly way if manufacturing products may result in some blips or blemishes, keep this in mind when ordering.PLA Is very strong and sturdy. Sudden bumps or falls will not harm these items as they are designed to withstand unexpected life happenings.Our goal is to make sure every planter has minimal layer lines and surface imperfections. We only ship planters we would be proud to plant in.Every End Table is thoroughly tested upon shipment for sturdiness and strength.",
    "reviews": [
      "Great communication. Great product. Fast Shipping!",
      "Super nice, exactly as described. Can't wait to put my Orchid in her new pot.",
      "I am very happy that I purchased this! Very pleased with how it looks."
    ]
  },
  {
    "productId": "OGTObvkIBw",
    "url": "https://www.etsy.com/listing/1180902032/atlantic-outdoor-furniture-patio?click_key=f0fc23ce68516ddcea2807feac9f30ba06106533%3A1180902032&click_sum=30af9af0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-24&pro=1&frs=1&etp=1&content_source=2329194e9d390f9b16cc0ecbd59d4dd8cd131bc0%253A1180902032",
    "title": "Atlantic Outdoor Furniture | Patio furniture, Outdoor Chair, Lounge Chair, Side Table, Outdoor Coffee Table",
    "description": "ATLANTIC- OUTDOOR COLECTIONThere’s nothing like enjoying time outdoors with a nice cup of tea and a book. At MOKU, we create furniture collections that will upgrade your favorite spot in the garden, or home. Each item is designed to be functional, fun, functional and bring you joy during the holidays.The new collection of Outdoor Furniture is made to last for generations. It's built with high-quality materials and craftsmanship that can withstand the harshest elements.We’re excited to give you a first look at our new collection, perfect for summer living and entertaining.Collection includesLove seat2 ChairsCoffee table2 side tablesNo two pieces of wood are alike so please allow slight variations in color and grain shown in product images.Shipping: Included in pricingAdditional shipping fees for Alaska, Hawaii and CanadaCostumers from Europe please contact us for information about processing time before placing order because it's different then for US market.Assembly: Ships assembledGIVING BACK TO NATURENature is our heritage - and our duty is to protect it.It provides us with the finest materials to craft ourfurniture - and it's time to give back what was taken from nature.With every piece of furniture sold - we plant a walnut tree.All planted trees will have unique tags, and we will let you know how strong your trees are growing every six months.Our goal is to give back more than we take!WHY MOKU?We create furniture made to last generations.Our vision is to create a sustainable workflow from a green sprout to supreme-quality furniture. Taking care of every single detail, we dedicated our time to making MOKU furniture flawlessly assembled.Handcrafted for life!NATURE'S DIVERSITYEvery piece of wood has a unique pattern and can't be alike so please allow slight variations in color and grain shown in product images.",
    "reviews": [
      "Stunning quality and great craftsmanship!",
      "100% solid walnut with high-quality blum hardware. The piece looks beautiful and is made well.",
      "Great company with a very well made product. The wood looks good, but won’t blow your mind on quality. Good is a fair way to describe it. Loved their customer service.",
      "Stunning quality and design. This dining table is more like a piece of art than a mere piece of furniture!",
      "Dear Tarik,\n\nI want to express my sincere appreciation for your support. Your loyalty is a true inspiration to us and we are grateful to have you as a customer. We hope to continue to exceed your expectations and provide you with the best possible service.\n\nBest regards,\n\nStevan"
    ]
  },
  {
    "productId": "sT4ueYulZt",
    "url": "https://www.etsy.com/listing/1083213140/the-mabel-planter-in-yellow?click_key=05e228dc0b2b39213afe721e1e0a349ec5a208ad%3A1083213140&click_sum=c6798154&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-13&pro=1&frs=1&etp=1&sts=1",
    "title": "The Mabel Planter in Yellow",
    "description": "These planters are made with a unique honeycomb bottom that allows for superior drainage. Use the listing drop down to choose your size.Planter dimensions (outer):8\" wide x 7\" tall7\" wide x 6.1\" tall6\" wide x 5.3\" tall5\" wide x 4.4\" tallMaterials:All planters in the shop are made with a biodegradable plastic that is sustainably produced with corn starch. They are sturdy and will last for years, but do have a little bit of give.Process:I make each of the planters in my shop with my 3d printer. They start with a 3d model that I edit, edit,& edit some more until it produces a beautiful finished product that goes with all kinds of decor.This listing is one of many colors and designs available in the shop. If you don't see a color that you want, please reach out and ask!A note about imperfections:These pots are designed and created solely by me. Because of this, you can expect some minor imperfections. Every pot has a seam on one side (some pots have a seam that is broken up over ~15% of one side of the pot, due to the nature of the design), and all pots will have some minor stringing. The top may be slightly rough, though I do sand down most pots if the color (some show scratches too visibly) allows.I will never send out a pot that is cracked or shows deformities on more than one side - I assume in most places, these will not be on display from 360 degrees!If you feel the imperfections are too severe, please, PLEASE contact me so we can arrange for either a refund or replacement.Processing times:Processing times listed are current and reflect my full capacity. At this time I cannot offer rush orders.Shipping:All orders are sent via first class mail unless shipping weight requires they be sent priority mail.",
    "reviews": [
      "Love the beautiful yellow color of the pot! Add a much needed pop of color!",
      "Cute planter cheerful yellow. Light weight plastic easy to move around. Ships quickly and packed well.",
      "Such a fan of this planter!  It goes so perfect with my new plant, obsessed with the color.  Thank you!"
    ]
  },
  {
    "productId": "LrkQrqcgiI",
    "url": "https://www.etsy.com/listing/1231795126/bourbon-whiskey-barrel-bar-set-3-piece?click_key=a8fa35a0814ec0a613fee3285964b393932897b1%3A1231795126&click_sum=fbb4a6ce&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-14&pro=1&frs=1&sts=1",
    "title": "Bourbon Whiskey Barrel Bar Set - 3 Piece Pub Set",
    "description": "A pleasant attribute that our pub stools feature is the 180 Degree Memory Swivel which allows you to rotate with ease and self re-position when not in use. The barrel’s old ring is the footrest that adds personality while creating a strong foundation for the base. Highly recommended for home and heavy commercial use.The Bourbon Barrel Pub Tables are designed with style, elegance and charm in mind. The unique hour glass shape gives these pieces a very sleek and attractive appearance that everyone will sure to admire. The barrel hoops add strength and a protecting border along the top while working as a pleasant foot rest at the bottom. A perfect addition to any Bourbon Enthusiast’s home who would love to own a reclaimed and Eco friendly piece.Dimensions:Pub Table: Length – 21″  Width – 21″  Height 42″ | Weight – 30lbs – 40lbsPub Stool: Length – 22″  Width – 22″ Height 30″ | Weight – 30lbs – 35lbs",
    "reviews": [
      "Great stools, sturdy, and looks exactly like we expected based on the pictures. The tag saying which distilleries the wood came from is fun. We’ll get more!",
      "Love it so much ❤️",
      "Great product! Looks great! Wonderful gift!",
      "Would do business with seller in a heartbeat."
    ]
  },
  {
    "productId": "NCcEtVhNoW",
    "url": "https://www.etsy.com/listing/1458549213/garden-table-reach-lacy-decorated-plant?click_key=03e11cefe4b88bebbc7f714331aee3f6714a3ed0%3A1458549213&click_sum=a332f853&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-15&pro=1&frs=1&sca=1&sts=1",
    "title": "Garden Table, Reach Lacy Decorated, Plant Table, Coffee Table, Chorcoal Grey Cast Iron Table, Old Silvery Gray Table",
    "description": "REACH \"LACY\" DECORATED GARDEN TABLE in OLD SILVER GREY COLOR.The table is made of cast iron with attention to details. It can be use as coffee table in the relaxation corner in your garden, as well as a plant table, a base for flower pots or other garden plants, eg. Bonsai trees or a forest in the jar.Dimensions:Height: inch 27.17\" ( 69 cm )Diameter: inch 14.96\" ( 38 cm )Weight: 13 kgSelf-assembly item!* All items are ship Air Priority Shipping Worldwide !* Items are Professionally packed !* If you have any questions I will be glad to help.",
    "reviews": [
      "I'm very pleased with this rooster. It's just what I envisioned,",
      "A b c d e",
      "Vendor was very good with packaging and contacted me about information needed for delivery.  I could not contact the vendor as Etsy communications were not working. \nGot cleared via customs and arrived OK.  \nI'm happy with this item.  Am getting a cabinet soon for my porcelains soon       Thanks.",
      "A work of true art!"
    ]
  },
  {
    "productId": "hiVKmOyUdr",
    "url": "https://www.etsy.com/listing/1180902032/atlantic-outdoor-furniture-patio?click_key=042c3d15b2473f7a6e05763a60813c6ecf4fd4ac%3A1180902032&click_sum=2a71b705&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930932-7-16&pro=1&frs=1&etp=1",
    "title": "Atlantic Outdoor Furniture | Patio furniture, Outdoor Chair, Lounge Chair, Side Table, Outdoor Coffee Table",
    "description": "ATLANTIC- OUTDOOR COLECTIONThere’s nothing like enjoying time outdoors with a nice cup of tea and a book. At MOKU, we create furniture collections that will upgrade your favorite spot in the garden, or home. Each item is designed to be functional, fun, functional and bring you joy during the holidays.The new collection of Outdoor Furniture is made to last for generations. It's built with high-quality materials and craftsmanship that can withstand the harshest elements.We’re excited to give you a first look at our new collection, perfect for summer living and entertaining.Collection includesLove seat2 ChairsCoffee table2 side tablesNo two pieces of wood are alike so please allow slight variations in color and grain shown in product images.Shipping: Included in pricingAdditional shipping fees for Alaska, Hawaii and CanadaCostumers from Europe please contact us for information about processing time before placing order because it's different then for US market.Assembly: Ships assembledGIVING BACK TO NATURENature is our heritage - and our duty is to protect it.It provides us with the finest materials to craft ourfurniture - and it's time to give back what was taken from nature.With every piece of furniture sold - we plant a walnut tree.All planted trees will have unique tags, and we will let you know how strong your trees are growing every six months.Our goal is to give back more than we take!WHY MOKU?We create furniture made to last generations.Our vision is to create a sustainable workflow from a green sprout to supreme-quality furniture. Taking care of every single detail, we dedicated our time to making MOKU furniture flawlessly assembled.Handcrafted for life!NATURE'S DIVERSITYEvery piece of wood has a unique pattern and can't be alike so please allow slight variations in color and grain shown in product images.",
    "reviews": [
      "Stunning quality and great craftsmanship!",
      "100% solid walnut with high-quality blum hardware. The piece looks beautiful and is made well.",
      "Great company with a very well made product. The wood looks good, but won’t blow your mind on quality. Good is a fair way to describe it. Loved their customer service."
    ]
  },
  {
    "productId": "cxKrckSxRe",
    "url": "https://www.etsy.com/listing/1444813966/personalized-cooler-for-dad-outdoor?click_key=e6775c50b677a7c84e49ab87ff0e46fdbc1caa26%3A1444813966&click_sum=6a42dd15&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-25&pro=1&frs=1&etp=1&content_source=d6365d3a9cb877962bd0f7cb6c1a135be09e9e73%253A1444813966",
    "title": "Personalized Cooler for Dad, Outdoor Furniture, Fathers Day Gift, Gift for Him, Custom Cooler, Outdoor Bar, Wooden Cooler",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @friocoolersFollow us on Instagram @friocoolersFollow us on Youtube @friocoolersThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Beautiful!",
      "Parents love it and enjoy it every day in their backyard",
      "Great craftsmanship!!",
      "Outside of a few crafting errors this cooler was pretty good."
    ]
  },
  {
    "productId": "PrAqfTsWrf",
    "url": "https://www.etsy.com/listing/531565480/hand-painted-metal-bluebirds-on-spring?click_key=8a649998d59b4f5adce4f790744ce2130e22e394%3A531565480&click_sum=9c028670&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-26&pro=1&etp=1&content_source=ca7cf1fa2b6470f0f905e79686f3cd6b2be814fc%253A531565480",
    "title": "Hand Painted Metal Bluebirds on Spring Willow Garden Stake | Bluebirds Silhouette | Rusted Metal Yard Art | Garden Gifts | S928P",
    "description": "This hand-painted bluebirds on spring willow branches stake will become a decorative favorite!Makes a great birthday gardening gift for mom and grandma. Perfect as a Thank You gift and for Mother’s Day to add life to any flowerpot or planter. An elegant addition to any yard or garden!Cut from 16-gauge recycled steel and securely welded to a metal garden stake, these little birds have been pre-treated to give it an authentic rusted surface.Naturally occurring oxidation gives this piece of garden art a rustic and charming life about it, complementing the luscious greenery around it. Each piece has been hand-painted and clear coated for protection against the elements.Looking for more whimsical metal garden art to add to your bluebirds stake?Check out our other painted metal yard art stakes like our Bluebirds on Willow Stake (search ‘S928P'), Cardinals on Dogwood Stake (search ‘S934P'), or Black-Capped Chickadees on Berries Branch Stake (search ‘S924P')🛠️  SO EASY TO INSTALL & DISPLAYOur metal garden art stakes insert easily into soft ground when using two hands for support. Be mindful of rocks and roots that may catch the metal stake, and adjust the depth as needed.Your steel silhouette can be gently shaped by hand to add dimension and depth. Simply fold the wings, tail, or branches to awaken its life-like appeal!✔️  THE PERFECT SIZEDimensions: Stake Length – approximately 20” long, Size – 9.75” wide x 12” tallSKU# S928P📦  PROMPTLY SHIPPEDCarefully picked and packaged to ensure safe arrival, your products should arrive within 1-2 weeks.🌱  INSPIRED BY NATUREWe've been setting the scene with playful silhouettes since 2011.As a husband and wife team from the Pacific Northwest, we've always combined superior craftsmanship with iconic design to help our customers bring the beauty of nature home.🔍  DISCOVER MOREVisit our shop home page to discover more ways to add charming inspiration and rustic accents to your yard, garden and home.👋  LET’S CONNECTIf you're inspired by what you see, click the ‘Favorite Shop’ button above and then join the conversation on our social platforms (copy & paste into web-browser)Facebook: https://www.facebook.com/rustybirds/Instagram: https://www.instagram.com/rustybirdsegd/Pinterest: https://www.pinterest.com/rustybirds0325/",
    "reviews": [
      "Fast shipping. Really pretty addition to flower bed!",
      "I have not used them yet. Spring for sure.  Plan to buy one for each of my sisters",
      "My new well painted bluebirds are now living in my flowerpot.  They make me smile."
    ]
  },
  {
    "productId": "UekKSMCjqc",
    "url": "https://www.etsy.com/listing/1382335383/modern-bird-feedero-minimalist-bird?click_key=f133df4c98db705c38844039027a5898d951a981%3A1382335383&click_sum=a76c134e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-27&pro=1&sca=1&sts=1&content_source=e9060d9f4204e43df14b45c807ca6a4da7da9e13%253A1382335383",
    "title": "Modern bird feeder | minimalist bird feeder | bird house | hanging bird feeder | bird lover",
    "description": "A modern and high-quality bird feeder for all nature lovers who appreciate their garden or balcony and enjoy observing nature in all seasons.We manufacture modern, minimalist bird feeders that blend beautifully with your area's nature and beautify your favorite corner of the garden or balcony. You will enjoy watching the birds and feel good knowing that birds in your garden have a reliable, plentiful source of food to keep them well-fed and thriving. Did you know that for birds, feeders can aid survival during migration and harsh winters? Let's help them!The entire shell of our bird feeder is made of powder-coated galvanized steel that will withstand all weather conditions. It is painted in black matte, which gives this bird feeder a sleek, modern, and minimalistic look.The platform is finished with two panels made of Siberian larch, seamlessly connecting it to nature and preventing the seeds from being scattered on the ground. Both front sides of the feeder are open so the bird can land and fly away without feeling threatened.For EU customers: The bird feeder does not need to be assembled, you can hang it right out of the box. You also get 2m of black rope in your package for that purpose.For non-EU customers: The bird feeder is disassembled for shipping reasons. Assembly is very simple; you only need a screwdriver and five minutes of your time. You also get 2m of black rope in your package you can use to hang the bird feeder.Our birdhouse is also a perfect present for Christmas, New Year, birthdays, or housewarming parties. It will be appreciated by your loved ones, your friends, and your neighbors, especially if they love nature and birds.Handmade in Europe, Slovenia.ABOUT•  high-quality materials,•  modern design,•  attention to detail,•  durability,•  handmade,•  a finished product, no assembly needed,•  family production,•  dimensions: 36 x 29 x 29cm (L x W x H),•  Weight 3,5kg•  unique gift for Christmas, New Year, birthdays, housewarming parties...•  If you have any questions, please contact us,•  we ship via DHL Express or GLS.Visit my shop for morehttps://www.etsy.com/shop/LIVIOurbanGarden",
    "reviews": [
      "Very good, although a little expensive 😎",
      "Great quality and very good customer service!",
      "I would happily recommend the feeding house... very nice and stable!!"
    ]
  },
  {
    "productId": "vUAFSNPYuS",
    "url": "https://www.etsy.com/listing/1583842588/custom-portable-beach-table-handpainted?click_key=8599b7b081146a2b3eb119a82e832f6f790a9b63%3A1583842588&click_sum=50bf1e0c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-28&pro=1&frs=1&sts=1&content_source=8a65cd6b5f242c2b84b3ac257dffc4b5fe22783b%253A1583842588",
    "title": "Custom Portable Beach Table handpainted- Blue Crab",
    "description": "Leg 2 ft tall, 18 in table topTwo cup holdersCan be broke down, strap for leg for easy carry.Can be personalized or sports teamPainted or stained",
    "reviews": [
      "Love the sign. It was a gift to someone who is a really big LSU fan. She was thrilled with the product.",
      "My cousin loved this as a gift",
      "Item came quickly and looked great!",
      "Amazing seller! I am a return customer! GO NINERS!!"
    ]
  },
  {
    "productId": "9RHaJIyHVS",
    "url": "https://www.etsy.com/listing/719943537/sun-catcher-garden-art-mirror-strings-w?click_key=49a43610ad9c1d0d2c18b1132effc770fbe12286%3A719943537&click_sum=b1f8cbbf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-29&pro=1&frs=1&sts=1&content_source=6c03a2928bc49f18a2bd458ab13c0e9a6d8139b5%253A719943537",
    "title": "Sun catcher garden art, mirror strings w/ turquoise rhinestones, outdoor decoration, teacher gift, gift for gardener, zen garden, boho",
    "description": "Gorgeous and bright, these turquoise rhinestones with mirrors will give you that pop of color you want in your outdoor space!  Everyone loves turquoise!  Sun catcher garden art, mirror strings w/ turquoise rhinestones, outdoor decoration, teacher gift, gift for gardener, zen garden, bohoFancy Tree Jewelry adds whimsy and fun to any outdoor space year round! Everyone loves the tiny reflections and the bursts of sparkle that scatter and dance when the wind catches and the sun or moon is shining. Tough enough to withstand summer heat and the winter freeze, these unique dangling sun catchers are magical and dazzling.Strings adorned with mirrors,  acrylic rhinestones or glass beads, some with crosses or snowflakes, strung from branches, hanging from your deck or porch will add whimsy to your outdoor space. These catch the breeze as it wafts by and the mirrors scatters the sunlight to create a magical ambiance. Add a bit of whimsy by hanging several strings.Hang your Fancy Tree Jewelry from tree branches, garden hooks, off your deck, anywhere you need a little bling! Leave out rain and shine, summer and winter!  All weather! That's right, you never have to take these inside. These are tough little buggers, and easily handle the extreme cold to the extreme heat!  These are made with #15 fishing line, acrylic rhinestones, glass beads ...  materials that are made to withstand any type of outdoor condition, from the minus 20 degrees of the upper mid-west to the extreme heat of the Arizona summers.Fancy Tree Jewelry would be the perfect accessory to dress up your garden year round, and they would also make the perfect gift!!🩵 MIRRORS: The mirrors are hand-cut, and so this means the edges are very sharp! Please be extra careful when touches, especially those little hands. Each is approximately 1/2\" in size.🩵 FREE HOOK with each string of Tree Jewelry🩵 HOW TO HANG: Each string has a loop at one end. Loop it over a small branch using the hook so that the string can dangle freely.🩵 CARE & MAINTENANCE: You can leave these out year round, through summer heat and winter cold. Every once in a while, you can wipe clean the mirror to make sure they sparkle & reflect!🩵 SHIPPING TIME: 2-3 business days within the USA with USPS Flat Rate Shipping. You will receive a tracking number to track your package!🩵 GIFTS: We can ship our Fancy Tree Jewelry directly to your gift recipient. We are happy to include a complimentary gift note and even gift wrapping for the occasion!  Please send us the text you'd like to use in the notes to the seller field",
    "reviews": [
      "So, so beautiful! I love all the tree jewelry, but when I saw the blue in person...wow!",
      "These sun catchers are so magical and beautiful in my tree. The customer service is excellent. I have every color- the turquoise is very pretty!\nThey hang well from the weight of the mirrors and jewelry!",
      "I absolutely love the tree jewelry, what makes this even better is my husband love them too. We put them in our cherry trees and they look beautiful 😍 and they double as a deterrent fir the birds who eat all our cherries. The mirrors scares the birds. And the look very chic and wonderful!  Thank you so much. Already ordered a second set for another tree."
    ]
  },
  {
    "productId": "OTucZdZXGU",
    "url": "https://www.etsy.com/listing/1586541320/2860-inch-h13-28-inch-handmade-folding?click_key=45f9491ecff1eeb6a885216da9cd7f207c3722b7%3A1586541320&click_sum=20e89d14&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-30&pro=1&frs=1&content_source=4fb565b48f28855bf335a6a7964633ec819482c4%253A1586541320",
    "title": "28*60 Inch-H:13-28 inch Handmade Folding Wooden Table, Camping Table, Picnic Table, Portable Table, Boho Table, Patio Table, Folding Table",
    "description": "*Completely handmade folding table from pine tree with high quality and 6 legs. This table his 2 different legs inside.28* 60 inch-H:13-28 inch70* 150 cm High:35cm-70 cm*Weight: 11,02lb - 8kg*This folding table is totally handmade with high quality.*Every package is carefully wrapped to ensure safe delivery.*Every order is shipped with express shipping.*If you want to have a folding table with speacial and different sizes, please contact with us. (For Example: The length of the legs*Every product is under our warranty.*We are here to answer every question, just share it with us.",
    "reviews": [
      "Perfect for our party! Great quality.",
      "thank you so much for this amazing setup 😊",
      "This was a great item",
      "Thank you so much 😊",
      "I recently purchased a table and when it arrived in Hawaii, I noticed there was damage. Messaged them and immediately got a response to resolve the issue. Although the damage was most likely done in transit, they were very apologetic and even sent me a new one! Their love shows through their beautiful work and their gratitude and appreciation for their customers are top tier! I will definitely be ordering again from them soon.",
      "Thank you so much for your comment. Im doing my best for my costumers. You are all very important for me and for my work. Loves from Istanbul",
      "Fast shipping! The stain is beautiful and the item is well made. I love the stretchy band under the table to stow the legs.",
      "Hi Paulette, thank you so much for this lovely comment. It made me really happy 😊"
    ]
  },
  {
    "productId": "fhfOqDLO9m",
    "url": "https://www.etsy.com/listing/987662260/personalized-frog-garden-stake-metal?click_key=914cb7b13a8bd5f5fda78348e0568f0c714a6d81%3A987662260&click_sum=15a04aab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-31&pro=1&frs=1&etp=1&sts=1&content_source=f2c83f7896ed71ff06a2d7c423850368a8817963%253A987662260",
    "title": "Personalized Frog Garden Stake - Metal Gardening Decor - Dedication Memorial Yard Art Marker - Personalized Gifts - Toad Garden Marker",
    "description": "Let this personalized Frog garden stake add some charm to your outdoor space! This metal yard art is perfect for your garden, yard, or patio. This marker is a great way to add a beautiful dedication to your garden decor.Personalize this sign with two lines of text. Enter the exact text that you would like in the personalization box!  ​ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding a different image, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 12\" wide x 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.***PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.***-Finish OptionsRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "Super fast shipping and really good quality! I am glad I could support a US shop! Don’t hesitate to order something, it will be great quality! I’m already looking at my next purchase from Maker Table",
      "Great quality! a cute gift",
      "Looks as nice as in the photos!",
      "I gave this to my niece for her birthday. Bright red. She loved it."
    ]
  },
  {
    "productId": "iEzIEXhAhe",
    "url": "https://www.etsy.com/listing/958105592/copper-plant-stake-copper-garden-marker?click_key=7c9a1415f0ae3fe9a0c69205ed04b35b6db3367f%3A958105592&click_sum=7f8ef42c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-32&pro=1&etp=1&sts=1&content_source=5f7bef9f0dbc33215dafc785093cf6c6ded97536%253A958105592",
    "title": "Copper plant stake, copper garden marker, indoor planter art, glass plant picks, outdoor metal art, mothers day, plant mom",
    "description": "Whimsy Sticks are one of our most popular and enduring designs.  Truly timeless, whimsy sticks have been gracing planters and gardens for over 20 years! Whimsical with a nod toward minimalist design, this decorative stake set is a welcome addition to both indoor and outdoor plants. Sold individually or as a set of four, Whimsy Sticks are available in three lengths: 6 inches tall, 12 inches tall, and 18 inches tall.Whimsical, elegant, stylish. Whimsy Sticks enhance whatever surrounds them. Indoor or outdoor planters, floral arrangements or fairy gardens, sunrooms or patios, vegetable or flower gardens!  Whimsy sticks garden stakes are created from shimmering 1/2 inch diameter (crackle or opal) glass orbs nestled in solid hand-sculpted copper (a semi-precious metal over 99% pure).Perfect to mark new plantings and bulbs. Beautiful to add color and sparkle to houseplants, flower arrangements, and centerpieces.  Add a touch of magic indoors or out, all year round!Find the perfect plant and garden accessories at Dragonfly Dreams:GARDEN STAKES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=5382837WIND CHIMES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32634106SUNCATCHERS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32650315Made to order by hand with attention to detail. Whimsical & Magical with the Warmth & Beauty of True Copper!Artisan-designed handcrafted sculptures, created in my home studio with raw materials sourced in the USA and purchased from USA small businesses.  Handmade art may vary slightly in size. Loving care is taken at each step of the process to ensure the pieces created are exceptional.* We offer combined shipping on multi-item orders based on weight and destination. The combined rate is calculated at checkout.Visit the Dragonfly Dreams Etsy store for additional gorgeous designs!www.etsy.com/shop/DragonflyDreams1This art should be cared for in the same manner as fine jewelry. Copper will age to a beautiful patina if left in its natural state. Patina is not a destructive process but if you wish to retain the bright finish of this art it will need to be cleaned periodically if displayed outdoors.Items pictured above are examples, your item will be specially made for you.Some glass orbs have a luster finish, some do not. We cannot guarantee what finish will be available at the time of your order, please contact us prior to placing an order if you have a preference.© 1999-2024 Dragonfly Dreams",
    "reviews": [
      "I have already reviewed this",
      "nice items   excellent transaction  yep",
      "Fast shipping, great packaging, great item!"
    ]
  },
  {
    "productId": "kg0sBMp6sA",
    "url": "https://www.etsy.com/listing/1422895973/garden-column-garden-decor-garden-statue?click_key=5c5296fc1a8ffdcdffc92252e943b62d98b27d22%3A1422895973&click_sum=18bf29d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-33&pro=1&frs=1&sts=1&content_source=e10870e3be7bf56d209847336eabf02e37391b55%253A1422895973",
    "title": "Garden Column - Garden Decor - Garden Statue - Well Cover - Landscape Light Cover - Utility Cover",
    "description": "Garden columns are a great way to add visual contrast to your garden, flower bed, or deck. This blank garden design is solid on all four sides so it looks great from anywhere in your yard. Each column is welded by hand and pre-rusted so it will blend in with your landscape as soon as you place it in your space. They work great as a stand-alone monolith or combine 2 or more for extra texture. They even make great platforms for climbing vines or vegetable gardening where you have a plant that needs something to grow on like tomatoes or beans.DIMENSIONS24\" T x 5.75\" W x 5.75\" D36\" T x 8.25\" W x 8.25\" D48\" T x 11\" W x 11\" DIf you want a lid to your Garden Column:https://www.etsy.com/listing/1521161735/garden-column-lid-succulent-planter-box?click_key=033619dc41177fff88fd543c6b4e41b0a59aea5a%3A1521161735&click_sum=23261f22&ga_search_query=lid&ref=shop_items_search_1&pro=1&frs=1&sts=1***Please keep in mind that the Rusted finish will vary. This finish can range from orange, to brown, to black, and many variations in between. There is no guarantee how the rusted finish will look.***MADE IN THE USA - We proudly design, manufacture and finish all of our work from a small shop in Tennessee. Your purchase supports real jobs in a small business.RECYCLED MATERIALS - More steel is recycled annually than paper, plastic, aluminum and glass combined. 88% of our steel is made from recycled scrap that stays out of landfills and reduces the amount of mining required to produce our products.HARDWARE INCLUDED - Our work comes ready to mount with predrilled holes and 4 x 6\" long garden stakes to stabilize each column.SOLID STEEL CONSTRUCTION - Our garden columns are made from 16 ga mild steel, about the thickness of a dime. Designed to last many years without maintenance inside or out.",
    "reviews": ["Looks nice and will work perfectly for my outdoor project."]
  },
  {
    "productId": "MPwSmjFfiy",
    "url": "https://www.etsy.com/listing/1252503033/rare-succulents-caralluma-socotrana?click_key=2aa6cd734275c6ab1370767a1d6b583784e8569b%3A1252503033&click_sum=66b8f1ee&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-34&pro=1&frs=1&sca=1&sts=1&content_source=1d0f74f53e0962690e2cc6e93c4435cbe3640593%253A1252503033",
    "title": "Rare Succulents - Caralluma Socotrana",
    "description": "Listing is for ONE Live rare succulent plant, Rare Succulents - Caralluma Socotrana, hand picked from our California based greenhouse nursery, listing picture taken under nature light in a 6\" pot.We will randomly select all plants for shipping, ensuring that their size and condition closely match the listing photos. Thank you.Caralluma Socotrana is a distinctive succulent native to Yemen's Socotra Island. Its upright, columnar stems have pronounced vertical ridges and are gray-green. This drought-tolerant plant features small, dark red star-shaped flowers and has both culinary and traditional medicinal uses. As a unique and hardy succulent, it's sought after by collectors and adds a striking touch to arid gardens and succulent collections.About,We are an exotic plant shop based in Los Angeles, California. As a California registered Nursery, it’s our mission to guarantee plants from our shop are healthy and insect/pest free, shipping directly from our greenhouse to your doorShipping,Please allow us up to 3 business days to prepare your order. All plants will be in quarantine before shipping and will be packaged under great care. If you have any special instructions or need the package to leave our nursery at any specific date, please add a note in your order during check out. Soils and pots are not included, to prevent any damage or rotten issues.Tips:Once you receive your purchase, we recommend planting the succulents in soil immediately. Due to shipping, the plants may appear dry, soft, or lighter/darker in color compared to the photos in the online pictures.Soil,Place your plants in porous, well-draining soil. To create an adequate cactus mix, simply combine pumice, perlite, or grit to cactus soil to provide the proper drainage. Succulents require little watering and never like to sit in wet soil. We normally suggest our customer to use 1:1 ratio (1 part amendment like pumice, perlite, lava etc., 1 part cactus/succulent soil) soil mix to start with.Sunlight,Introduce sunlight to your new plants gradually. Do not put your succulents in direct sunlight, but instead try to increase the sun exposure gradually in your home or outside. Leaving your new plants in direct sun will lead to sunburns. We normally suggest our customer to have 40% shade fabric in the area that has intense sunlight.Watering,Succulent: water when soil is dry dry, do not let the plant sit on wet soil overnight.Cactus: NO water until plant rooted, and No water in winter or dormant season.Support,Please contact us if you have any questions or concerns, we are here to help.",
    "reviews": [
      "Packaging could have been more contained in the box and ID tags be given for each plant, but the plants that I bought were very easy to tell apart. They have pictures of this plant when I bought it, but I didn’t realize how BIG and robust the plant was going to be. What a stunner!",
      "This was a hard plant to find, so I am glad to have found a seller with such a good selection of plants. I was amazed at just how large and healthy it was on arrival, far more than what I was expecting!",
      "I love this succulent. I can't wait until it blooms."
    ]
  },
  {
    "productId": "QKAPfOnxZB",
    "url": "https://www.etsy.com/listing/1569853876/flowers-on-heart-garden-stake-garden?click_key=842987166b514d54a218e159c67af54b843840d1%3A1569853876&click_sum=661e0032&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-35&pro=1&etp=1&sts=1&content_source=13c83fd26d6174aad8a9aa6633fe593fb96b2e2a%253A1569853876",
    "title": "Flowers on Heart Garden Stake | Garden Decoration | Yard Art | Outdoor Stake | Rain Gauges | Gardening Gifts | Yard Stakes | Garden Decor",
    "description": "Flowers on Heart Garden StakeIf purple is your color, look no further than this absolutely brilliant garden stake.For anybody who loves to garden, this is the piece of decor you've been waiting for. Featuring three bright purple flowers, five handcrafted green leaves, and one whimsical heart, this piece is both colorful and understated. It also offers a handmade bell, offering melody whenever the breeze blows.DIMENSIONS: 6 x 1.5 x 35.75MATERIALS: Handcrafted, flamed metal.DETAILS: Quick, frustration-free installation.Backed by our friendly, one-year warranty.WHY WE LOVE IT: If it were up to us, everything would be this color purple!SHIPPING DETAILS: Most orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote Dad, “We’re going as fast as we can! Promise!”)",
    "reviews": [
      "Cute and great quality! :)",
      "Stunning! Thank you for sharing this photo and for your business, Lisa. Happy to know you like it :)",
      "Very beautiful! Great gift! Would order again.",
      "Fantastic! Glad you liked it. We appreciate your business with us. Happy holidays!",
      "It’s as beautiful as I thought it would be"
    ]
  },
  {
    "productId": "QYiPMGNJgG",
    "url": "https://www.etsy.com/listing/1458626545/solar-string-lights-round-ball?click_key=34a348c839edbf41baa77c21f53270d23b526f47%3A1458626545&click_sum=ce7423b4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-36&pro=1&content_source=6a157866167146265a160591f173e87e7b468389%253A1458626545",
    "title": "Solar String Lights, Round Ball",
    "description": "This Round Ball Solar String Light is perfect for garden decor, porch decor, patio decor, solar lights outdoor, yard lights, yard decor, party lights, party supplies, party decor and more! Hang from fences, pergolas, porch, and patio. Wrap around trees, bushes, windows, doors, pillars, etc.100% waterproof.30 LED lights per strand.21 ft. length.Solar powered, includes ground yard stake for the solar panel.Choose between different lighting functions: Steady On and Flashing",
    "reviews": [
      "Nice light and great customer service",
      "Very pretty still raining here so haven’t seen them light up",
      "My sister loved this product"
    ]
  },
  {
    "productId": "ZUPxuhWwkn",
    "url": "https://www.etsy.com/listing/682373452/ships-in-2-days-metal-bee-garden-stake?click_key=bf0624f6a85a72e49dd5cf4eb95b4c1bb9cc8079%3A682373452&click_sum=9c17fc08&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-37&pro=1&frs=1&sts=1&content_source=57b45182a61e126f3a38afd869e79e472e059a32%253A682373452",
    "title": "Ships in 2 Days |Metal Bee Garden Stake - Steel Gardening Decor - Bumble Bee Yard Art Marker - Free Shipping",
    "description": "*2 DAY SHIP ONLY APPLIES TO RAW STEEL FINISH, THIS REFLECTS OUR PROCESSING TIME FROM ORDER DATE TO SHIPMENT DATE NOT TOTAL TIME TO ARRIVE AT YOUR DOOR.  PLEASE ALLOW AN ADDITIONAL 3 DAYS FOR POWDER COAT FINISHES.Let this metal bee garden stake add some rustic charm to your outdoor space. This steel bumble bee yard art is perfect for your garden, yard, or patio. This marker is a great way to add some fun to your garden decor!ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding images, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 10\" wide 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.-Finish OptionsRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "Great quality sturdy little bee getting paint now",
      "We absolutely love and adore our special metal bee! The incredible quality and beauty are perfect.  Thank you so much for your quick communication and replying back quickly! Sending gratitude for our new art!",
      "Quick shipping & gorgeous product!",
      "This Bee I got was as I expected it to be, however the rabbit that was on the order was not.  Fortunately the rabbit was not a gift or zI would return it. The rabbit will get lost in my flowers it is so small"
    ]
  },
  {
    "productId": "kfxBnuhoOa",
    "url": "https://www.etsy.com/listing/1231017735/unique-fathers-day-gift-this-rustic?click_key=96941cdfefd524611b03b30635cdf2e0c70572e6%3A1231017735&click_sum=2750635d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-38&pro=1&frs=1&etp=1&content_source=7c10f5fe4983a63f2c5345be2e26bcb4c1219bce%253A1231017735",
    "title": "Unique Fathers Day Gift, This rustic cooler is the ideal gift for dad.  Personalized cooler will last for years!",
    "description": "Personalize your own cooler for the patio, pool, backyard or anywhere you need to keep your drinks icy cold! This 48 qt wood cooler is built by hand in El Campo, Texas. Custom laser engraving located on the front of the cooler. Once assembled and customized, the cooler will be shipped in a well packaged custom box.*SIZE & CAPACITY● Holds 54 Cans or 48 Quarts with Plenty of Ice● Dimensions:  27.25\" Long X 19.5\" Wide X 27.5\" Tall*ABOUT THIS ITEMMade with custom cut western cedar, a bottle opener, hinges, nostalgic facet drain and cooler insert. Cedar wood is great for outdoor use and does not require treatment. However the wood can turn gray overtime due to the natural aging process. Though this does not affect the vitality of the wood, you can add an outdoor wood finish to prevent the change of color. Features our own Frio 48qt cooler with excellent insulation properties inside the frame*HOW TO ORDERTo order, select your style then enter what you want engraved Please be specific, type word for word. Click the \"Add to Cart\" button and proceed to checkout. Enter any additional information you would like us to know.*Proofs are sent upon request only. To request a proof please make a note when placing your order.*CUSTOM ORDERSIf you are wanting a custom logo or design please let us know in the notes, or reach out through Etsy messenger.*Please note this product is made with real wood. Each piece is unique, natural color and grain will vary.Social:Like us on Facebook @frioicechestFollow us on Instagram @frioicechestFollow us on Youtube @frioicechestThank you for your interest in our product!  We appreciate every opportunity to earn your business.  Please let us know how we can help make your order experience a great one!",
    "reviews": [
      "Thank you so much, this was a perfect gift.",
      "Look great and shipped way faster than I expected! My only complaint is that it was a little shorter than I was expecting. But otherwise awesome!",
      "Chest is beautiful and the cooler inside is great quality, keeps drinks and ice cold for a long time. Shipping was faster than expected! Didn’t realize the wood would be unfinished and the etching was so light that after we stained it so we could keep it outside the etching has all but disappeared which is a little disappointing for the price. We bought some paint so we can color in where the etching was. Would still absolutely buy again!"
    ]
  },
  {
    "productId": "WtkwsVsQWH",
    "url": "https://www.etsy.com/listing/801515341/mockingjay-stained-glass-suncatcher-bird?click_key=105a238e598fea3010ade2d13bc75c6a5163c4db%3A801515341&click_sum=afc292b8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-39&pro=1&etp=1&content_source=f146b5c264636777a3abf4ae136dd104bc4e6e0a%253A801515341",
    "title": "Mockingjay stained glass suncatcher Bird stained glass window hangings gift for housewarming Mother's Day gift",
    "description": "Mockingjay Bird window hanging suncatcher is made from stained glass and looks so cute. This birds could beautify your home and garden. It's a good gift for mother, sister, partner, friend to show your love and care.DIMENSIONS:Height 8.5 inchWidth 5.5 inchPrice include gift&safe packaging and window fixture.All our handmade products we make from quality USA stained glass Spectrum with using 19th century Louise Tiffany technology, fusing and with glass painting elements.More stained glass items you could find using the link:https://www.etsy.com/shop/VitrageArtSouvenirsWe'll glad to make a portrait of your lovely pet. Please contact me in private messages for details.Any item can be customized. Please contact me for details.Feel free to follow us.Pinterest : https://www.pinterest.com/vitrageart/Instagram : https://www.instagram.com/va_gifts/",
    "reviews": [
      "Truly beautifully made window ornament. Craftsmanship at its finest. I love it! It was securely packed and arrived much faster than expected, especially with all the Russians around you who want to destroy everything you hold dear. Hang in there, you brave people! Slava Ukraini 🕊️",
      "Beautiful item! Looks exactly like photo online.",
      "This piece is beautiful! Shipping to the US of course took a while, but I ordered 3 items total and they were extremely well packaged and all made it in tact."
    ]
  },
  {
    "productId": "HeWxufNvar",
    "url": "https://www.etsy.com/listing/696189355/ships-in-2-days-metal-bunny-garden-stake?click_key=714b2e34568647e0732b9619b628e28b601a5630%3A696189355&click_sum=09a6ebb9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-40&pro=1&frs=1&etp=1&sts=1&content_source=8381eb31c71ffc5d381750922895f30e5234bf28%253A696189355",
    "title": "Ships in 2 Days | Metal Bunny Garden Stake - Steel Gardening Decor - Rabbit Yard Art Marker - Free Shipping",
    "description": "*2 DAY SHIP ONLY APPLIES TO RAW STEEL FINISH, THIS REFLECTS OUR PROCESSING TIME FROM ORDER DATE TO SHIPMENT DATE NOT TOTAL TIME TO ARRIVE AT YOUR DOOR.  PLEASE ALLOW AN ADDITIONAL 3 DAYS FOR POWDER COAT FINISHES.Let this metal garden stake add some rustic charm to your outdoor space. This steel bunny yard art is perfect for your garden, yard, or patio. This rabbit marker is a great way to add some fun to your garden decor!ATTENTION: If you want to change anything about this design, there is a $35 design fee (adding images, changing the design, changing the layout, etc.). Please message me before checkout so I can create a custom listing to match your special requests.PLEASE NOTE: Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish vary from piece to piece. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day. This makes your piece completely unique! Left untreated, RAW STEEL WILL RUST.Want to see more options? Check out my Garden Decor section for more garden stake designs:https://etsy.me/2VlwK8h-DimensionsRoughly 30\" tall x 10\" wide x 16g steelThis garden stake comes fully assembled with a 1/4\" stake that extends approximately 18\" from the bottom.PLEASE NOTE: Weld marks from the 1/4\" stake will be visible on Raw Steel -Dark and Outdoor Gloss Clear finished signs.-Finish OptionsRAW STEEL - DARK (EVEN BLACK) - Left untreated, the RAW STEEL WILL RUST and develop a natural patina completely unique to your environment.  Raw Steel is a highly recyclable material that gets reused over and over again. This makes the finish and color vary from piece to piece, to sometimes even black. Your raw steel finish is created at our local mill and can be darker or lighter than our pictures depending on what material is being recycled that day.OUTDOOR SILVER - The Outdoor Silver finish is a bright silver powder coat with a slight sparkle. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS CLEAR - The Outdoor Gloss Clear finish is a glossy clear powder coat that makes the steel darker, sometimes even black. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR FLAT BLACK - The Outdoor Flat Black finish is a matte black powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS WHITE - The Outdoor Gloss White finish is a glossy white powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.OUTDOOR GLOSS RED - The Outdoor Gloss Red finish is a glossy, bright red powder coat. This UV protected finish will protect the steel in the toughest conditions including outside in wet and salty environments. Powder coat is a thick industrial coating that is VOC free and holds up for many years.Check out the FAQ section for more info:https://etsy.me/2RDJoljWant to hear a real person talk about this option? Check out my Youtube video! Copy and paste the link below:https://www.youtube.com/watch?v=JomsYrwE0wkSend me a message if you have any questions or concerns!",
    "reviews": [
      "Wish I would have looked closer at the pictures.   Was not looking for one one a stake.   Oh well, I will make it work.",
      "Super-cute addition to the yard! Item is exactly as described. I will definitely buy from this seller again in the future!",
      "Great quality. Looks like it won’t rust"
    ]
  },
  {
    "productId": "WljnyDRGOY",
    "url": "https://www.etsy.com/listing/1581188782/elegant-mosaic-fountain-for-outdoor?click_key=dd554616e2b55d24e22d7f12ba9d7b98ab724901%3A1581188782&click_sum=39b5a76a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-41&pro=1&frs=1&etp=1&content_source=efb6ffed1717899b4b22ddc461975af2031da126%253A1581188782",
    "title": "Elegant Mosaic Fountain for Outdoor Patio,Mid-Age Wall Water Fountain Memento,Moroccan Zellige Handmade Zellige,Customizable Gift",
    "description": "**All our products can be left outdoor in winter time or summer,the tile is very known for its durability.**Keywords: Moroccan Tiles Fountain, handmade Tile Fountain, Real Mosaic Fountain Morocco, AtlasTiles Fountain,Interior Decor, Mosaic Artistic Tiles Fountain,Backyard Design Patio Foutain,Morrish Pattern Fountain,Wall Mosaic Fountain,Garden FountainAtlasTiles introducing to you the new item in our store, the tiles fountains, handmade by artisans trying their best to pass on their heritage to the rest of the globe. A fountain where every detail counts. Distinguished design with a variety of colors, AtlasTiles promises you the best material quality.The fountains are elegantly and exquisitely handcrafted by Moroccan artisans with variegated terracotta made from euphonious synchronized colors. The artful patterns of the tiles are encased in a big iron frame similar to the shape of the fountain.The back of the fountain is made of Resin instead of Cement, that way the fountain is lighter, you can easily move it, if you feel like changing a bit of view. Moreover, the iron frame glued to the fountain has wheels so you don’t have to carry it.Let us explain how the fountain works: After you unpack the fountain, make sure you put it somewhere near a socket so you can plug the engine water pump. This is very essential for the circulation of the water you put inside the fountain. There you go, now you can enjoy the sound of water flowing inside you house.A little suggestion from our team: use flavored kind of water in the fountain, that way you get to enjoy the pretty smell as well as the sound. Bring your coffee and come to relax.The fountain comes also with an electric water pump, a mounted spout and a solid packaging so no need to worry about the shipment,and a demonstration of how the fountain works that way you will be able to make it work certainly.Morocco is one of the few countries in the globe having mountains to extract tiles, and one of the best in its production. A unique designs, distinguished colors and famed materials to obtain a high-quality product.The story begins precisely in the area called Ben Jellik. Mountains of raw clay used in Zellige. After the clay is drawn out from the heart of the mountain and took to the four to give it the shape, the clay tiles are paint with colored glass in one of the two sides, then they are levelled and cut. The cutting is done in three phases: First is a form need to be drawn, whether we want triangles or squares or stars, then comes “Nequach” or the artisanal responsible of cutting it by hand by a sharp big hammer to give a perfect form to the clay, and finally they use a small hummer to sharp the edges. Then comes the artisan to start putting the individual hand-cut piece of tiles and start making the fountain, upside down which is magical, tells a lot about the expertise of the artisans. When he is done with the fountain, he adds the resin so the tiles stick together and he flips the fountain.You can watch it all in the amazing video in our store.AtlasTiles guarantee to you the total safety in terms of shipment.All our items are handmade and TOP quality.Our Instagram account and Pinterest to check our new items:Instagram : @AtlasTilesPinterest : @ AtlasTilesFor more information, feel free to visit the link bellow:https://www.etsy.com/shop/AtlasTiles/Keywords: Moroccan Tiles Fountain, handmade Tile Fountain, Real Mosaic Fountain Morocco, AtlasTiles Fountain,Interior Decor, Mosaic Artistic Tiles Fountain,Backyard Design Patio Foutain,Morrish Pattern Fountain,Wall Mosaic Fountain,Garden Fountain,wall hanging, Room Decor, oversized, Nursery room, Nursery décor, Large furniture, home décor, gift for mom, Gift for her, gift for grandma, craft room décor, room decor aesthetic, wedding favors, decor wall art original bedroom, decor home, Decor wall, decor for bedroom, decor wall art original,Moon Wall Hanging, Moon Decor,Handmade Hammered mosaic,Boho Bedroom Celestial ArtAtlasTiles team.KEYWORDS : Moroccan Tiles Fountain, handmade Tile Fountain, Real Mosaic Fountain Morocco, AtlasTiles Fountain,Interior Decor, Mosaic Artistic Tiles Fountain,Backyard Design Patio Foutain,Morrish Pattern Fountain,Wall Mosaic Fountain,Garden Fountain,wall hanging, Room Decor, oversized, Nursery room, Nursery décor, Large furniture, home décor, gift for mom, Gift for her, gift for grandma, craft room décor, room decor aesthetic, wedding favors, decor wall art original bedroom, decor home, Decor wall, decor for bedroom, decor wall art original,Moroccan Tile tagine,Andalusian Kitchen Style,Interior Design, Handmade Pottery tagine,Antique tagine,Home Décor,Cooking Time, Middle Age Porceline,Real Traditionnal Tile,Indoor Design,Cookware,Keywords: Moroccan Tile Sink,Andalusian Bathroom Style,Interior Design, Handmade Pottery Washbasin,Antique Sink,Home Decor, Middle Age Porceline,Real Traditionnal Tile,Indoor Design,Renovation ideas,Marble Design,Luxury Sink,Decor InspirationNotice :- Please we inform you that the scheme may be incomplete for the small sizes of the items, however the processing time is shorter,and the items are fascinating nevertheless.-We inform you once again that the colors may be slightly different from the real thing due to the Camera/Phone resolution,-Contact us for anything regarding shapes or sizes of custom colors.Thank you",
    "reviews": [
      "Shipping took much longer than expected.  I would put next order in more in advance.  \nCustomer service was very pleasant and sinks are beautiful!",
      "Nice item … like it a lot",
      "Beautiful sink. It was packaged very sturdily and was delivered quickly. Everything went smoothly.",
      "I received my sink last week but have not installed it yet.  It was exactly what I saw in the pictures.  I am very pleased with the purchase."
    ]
  },
  {
    "productId": "LfDSy5sFSp",
    "url": "https://www.etsy.com/listing/1676645567/indoor-desktop-plant-stand-leaf-design?click_key=c3ea37768ec322db5f36bcb62a9b62a9e099f0d1%3A1676645567&click_sum=df719cd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-42&pro=1&sts=1&content_source=7de79c08c22cac4e1c535b1e9523ab8acb6eb669%253A1676645567",
    "title": "Indoor Desktop Plant stand, Leaf design plant stand, Plant stand for small plants, Plant lover Gift, Desktop Plant stand for coworkers",
    "description": "These desktop plant stands are made with our laser at our home in Florida.  We made these for ourselves and really love them.  They make great gifts and are super cute and very detailed.Please note:  These are small plant stands that hold mini plants.Plant dimensions:  3 inches tall, 4.5 inches wide.We hope you love them as much are we do!  These are made to order when purchased.Plants and props used in pictures are not included with purchase, only used for illustration.",
    "reviews": [
      "This is a good product",
      "Great quality and service for this shirt!! 💞",
      "Nice design and the shirt arrived quickly"
    ]
  },
  {
    "productId": "PbAIFhZblt",
    "url": "https://www.etsy.com/listing/857449661/bird-on-river-stone-set-of-3-birds?click_key=f96adaee8b4b6021913d8c48a3b92b9e6514c60f%3A857449661&click_sum=68c892f6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-43&pro=1&sts=1&content_source=7f3a29cf527ae66d6c9eda832f3c625f62673355%253A857449661",
    "title": "Bird on River Stone - Set of 3. Birds Garden Statue, Birds Lover Gift, Nature Lover Gift, Yard Statue, Outdoor Statue, Garden Sculptures",
    "description": "Bird on River Stone - Set of 3Happy, funky and bright! That’s how we’d describe our bird on river stone trio. This little set of chirpers will bring a bold punch of color to your garden, patio or lawn. Made from river stones and metal, these tiny chicks are as durable as they are adorable. We love this set displayed in potted plants or a bird bath. Like all our garden sculptures, these pieces are individually handcrafted.Your purchase will include three birds in assorted colors.Dimensions: Approximately 7” L x 5” W x 9” HHANDCRAFTED WITH LOVE - Our garden statues are made by hand with reclaimed river stones by some pretty incredible people. The Honduran manufacturer who provides us with these statues dedicates a portion of his proceeds to improving life for these artisans.EASY TO INSTALL AND CARE FOR - When you receive your statue, the hard work will have already been done. Rest assured you (or the lucky recipient of your gift!) will have this item on display in no time. And cleaning and caring for the statue will be a breeze, too.TOTALLY ADORABLE - Our animal-themed garden statues are so cute, our customers almost can’t stand it. Order your favorite animal, or create an outdoor menagerie and collect ‘em all.MADE WITH QUALITY MATERIALS - Unlike many garden statues available for sale, the ones we offer at Happy Gardens are made from only the best products like real river stones and heavy-duty steel.BACKED BY A FRIENDLY ONE-YEAR WARRANTY - If you have a problem with your garden statue within a year of purchase, just call us! Our customer service team is proud to stand by our one-year limited replacement warranty.",
    "reviews": [
      "Colorful and a bit silly birds.",
      "Yay! Thank you for your business. :)",
      "These are so delightful!  Just as I imagined.  I gave one as a gift and my friend also loved her bird.",
      "Sweet! We are so happy to know that you like the Bird River statue, Mary. :) Thank you for your business.",
      "Very charming and fit nicely in my semi-rural yard. Perfect to add some color when garden is cut back for the winter.",
      "The birds arrived more than a week before I could even leave a review.  Have ordered from this seller before, and will again.  Excellent quality."
    ]
  },
  {
    "productId": "vthkXbppuX",
    "url": "https://www.etsy.com/listing/631636392/rusty-safari-hippo-sculpture-mothers-day?click_key=7077a4bec8b26cfee8ed2667cde14254f4051ced%3A631636392&click_sum=ae4848ce&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-44&pro=1&frs=1&etp=1&content_source=ebdf46ac4dbda0e69cd21ac92fde34164a96b64c%253A631636392",
    "title": "Rusty Safari Hippo Sculpture, Mothers Day, Gardener Birthday Gift, Whimsical Plant Accessories, New Home Ornaments, Animal Themed Lawn Decor",
    "description": "Add something whimsical to your garden with these handmade resin rusty hippo sculptures in rusty iron - bronze or stone-resin finishes. These amusing hippo garden ornaments are the perfect plant accessories for adding a quirky twist to your yard, lawn or patio. They also make the perfect gardener birthday gifts for the green fingered people in your life. Or fantastic gifts for any occasion, from birthdays to memorable housewarming gifts for someone's new garden.Cast from moulds of my original sculptures, these lawn sculptures come in a range of finishes, including real stone or metal powders for a dazzling finish. Choose carefully from the options available and receive your favourite hippo or a set that's perfect for you!Each type of finish requires a different amount of labour and also the cost of each type of powder varies hence why the prices are different for each type.Please be fully aware that you will only receive the hippos you add to your cart and order! You will not automatically receive all three of the hippos that you see in the listing pictures. The listing pictures are just there so you can see the hippos that are available for you to choose from.Discount!!!Add 2 of any hippo sculpture to your cart and enjoy a 10% discount! Or go wild and add 3 or more to your cart and bag a whopping 15% OFF your order! Discount applied automatically at checkout.Approx Weight & Measurements to the Widest Points:Largest Hippos: - L 67cm x W 29.5cm x H 9cm - 2.6kgHippo Heads: - L55.5cm x W31cm x H11.5cm -  2.6kgSmallest Hippos: - L 42cm x W 17.5cm x H 6.5cm - 1.5kgThey’re hollow cast with real metal or stone powders mixed with resin, making them look like metal or stone but much lighter in weight, so you can move them around your garden with ease.I also sell smaller indoor hippos in my Etsy shop. If these sculptures haven’t been quite what you were looking for, please visit: www.martshippoart.etsy.com to see my full range of sculptures.Other Order Details: ⇢• 📞 Your phone number is required by the couriers I use before I can purchase your postage label. This applies to ALL customers. Please add one as a note at checkout. I will never sell or share your personal info with anyone apart from the courier. Please read my full list of policies including my privacy policy on my Etsy shop homepage: www.martshippoart.etsy.com• When you place an order you are agreeing to my Etsy shop's policies terms and conditions. ✓• 🎁 Add a FREE gift message at checkout, and I’ll print it out and add it to the parcel for you.• Add gift wrap option at checkout for just £5 extra. Gift wrap will be unisex.🎁• If you want your gift to be delivered directly to the recipient, please use their address at checkout.So why wait? Add these cute hippo garden ornaments to your lawn or patio and enjoy your garden even more!Please share this listing on your social media platforms with your friends and family to show them what wonderful things you’ve found! Also please favourite this listing and my shop so you can easily find me again!Thanks for stopping by!Copyright © 2011 Martin Pool, Mart's Hippo Art - All rights reserved.",
    "reviews": [
      "Much lighter weight than I expected but very nice. Looks just like the picture. Rust coloring did rub off on my hands as I unpacked it.",
      "That’s great I’m glad you like your hippos! The rust is real rust, so as with any rusty metal, some rust residue can come off on to your hands when handling. I recommend simply washing your hands after handling. thanks again 😁",
      "These are amazing. My wife loves them.",
      "That’s fantastic! I’m so pleased your wife likes her hippo gifts! Thanks so much for your feedback! 🙂",
      "Bought these for my wife’s 40th as I proposed to her on a sandbank on the Zambezi River full of hippos in a truly wild part of Zimbabwe called Mana Pools, Zimbabwe (where I’m from). They are so realistic and look amazing on our lawn.\n\nWould recommend this artist to anyone!\n\nThanks 😃",
      "That's fantastic! I'm glad these made your wife's birthday extra special! Thanks for your feedback! :)",
      "These hippos make me so happy! Everything shipped and arrived as expected, and these are such a great addition to my new “sculpture garden “",
      "Fantastic! I'm so pleased you're over the moon with your hippos and that you were happy with my overall service! I'm pleased to have a pair of my hippos in your sculpture garden :) Thanks for your feedback! Much appreciated :)"
    ]
  },
  {
    "productId": "uALl6QRVAd",
    "url": "https://www.etsy.com/listing/1284086554/rainbow-glass-suncatcher-personalized?click_key=6e71c9f575a791bd1627aacc0522de39561a10f9%3A1284086554&click_sum=194a7ed8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-45&pro=1&etp=1&sts=1&content_source=5bd2ed237ce1b94970794036a6c8505739283682%253A1284086554",
    "title": "Rainbow glass suncatcher, personalized copper garden art, metal outdoor porvh decor, gardening and plant gifts",
    "description": "An enchanting handmade copper and glass suncatcher, suitable for indoor or outdoor use.• 11 inches long• 15 inches total length with hook• Two 1 inch & four 1/2 inch glass orbs• Hand-sculpted copper (semi-precious metal over 99% pure)Created with shimmering opal glass orbs nestled within solid hand-sculpted copper. Adorned with a hand-stamped copper disc to personalize the perfect gift or celebrate a special memory! Delightful as a tree charm or suncatcher and perfectly displayed indoors or out. Includes a copper hook.Personalization can design the perfect gift, celebrate a special memory, and bring joy! We can stamp names, dates, and words to offer encouragement and delight.Find the perfect plant and garden accessories at Dragonfly Dreams:GARDEN STAKES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=5382837WIND CHIMES:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32634106WHIMSY STICKS:https://www.etsy.com/shop/DragonflyDreams1?ref=seller-platform-mcnav§ion_id=32633808Artisan-designed handcrafted sculptures, created in my home studio with raw materials sourced in the USA and purchased from USA small businesses. Handmade art may vary slightly in size. Loving care is taken at each step of the process to ensure the pieces created are exceptional.* We offer combined shipping on multi-item orders based on weight and destination. The combined rate is calculated at checkout.This art should be cared for in the same manner as fine jewelry. Copper will age to a beautiful patina if left in its natural state. Patina is not a destructive process but if you wish to retain the bright finish of this art it will need to be cleaned periodically if displayed outdoors.The items pictured above are examples, your item will be specially made for you.© 1999-2024 Dragonfly Dreams",
    "reviews": [
      "Very satisfied with my purchase",
      "Even more beautiful in person, thank you!",
      "Great support for my plant.  I love the copper color and it adds so much class instead of the usual plant supports.  Functional, beautiful, and unique.  Thoroughly pleased!!",
      "Exactly what I needed and the support is absolutely perfect for my plants.  Very unique.  Beautiful copper that really adds something special to my plant while being extremely functional.  I couldn't be more pleased."
    ]
  },
  {
    "productId": "ExvBUsYuSO",
    "url": "https://www.etsy.com/listing/1282656672/brambleton-lane-spinner-stake-rusted?click_key=e138b7e07680ffcd870351f4d01b4ce5472acafd%3A1282656672&click_sum=ff444b38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-46&pro=1&frs=1&etp=1&content_source=658eb6bf15545d976d501a6831d918b0cae72c65%253A1282656672",
    "title": "Brambleton Lane Spinner Stake | Rusted Metal Yard Art | Garden Gifts | Metal Garden Art | Garden Bed Decor| Wind Spinner | Garden Spinner",
    "description": "Brambleton Spinner Dimensions: 82\" tall x 21\" wide x 20\" deepThe Brambleton Lane Spinner is a simple and classic wind spinner crafted to resemble the look of an old desert mountain windmill, updated with our unique artistic touches. The blades along this spinner are curved and irregularly shaped to add a whimsical look to this piece of metal artwork. As the wind hits the blades, a mesmerizing spinning motion is created!The Brambleton Lane Spinner is made of recycled steel and pre-treated to create our signature rusted texture and natural look. It would be the perfect accent for a breezy spot in your backyard or garden.",
    "reviews": [
      "Always love movement in yard. This is a very nice, well built, attractive addition.",
      "Quality is good.  My problem is how it was packaged.  It arrived damaged (bend and misshaped).  The box was mark fragile but it appeared to have been crushed.  More care should be taken when packing the spinners.  Order two spinners and they were only wrapped in plastic.  Not pack with bubble wrap or popcorn packing.  Very disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed.",
      "Very pretty, excellent quality.  A gift for my brother's birthday.  I specifically requested in my order not to ship immediately, vendor ignored my request and the gift arrived three weeks early.  Better late than never, of course, but I was disappointed."
    ]
  },
  {
    "productId": "pIDvyqkYBe",
    "url": "https://www.etsy.com/listing/1450868345/butterfly-on-flower-garden-stake-garden?click_key=df855937663fe676506fdc69195db1e855af0a59%3A1450868345&click_sum=023ffac8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-47&pro=1&sts=1&content_source=ed4633a3602fe98579ebab0dc9fcd0000f94dd50%253A1450868345",
    "title": "Butterfly On Flower Garden Stake | Garden Stakes | Gardening Decor | Gardening Gifts | Yard Art | Yard Decor | Outdoor Decor | Metal Art",
    "description": "Butterfly On Flower Garden StakeTransform your garden with this outrageously ornate butterfly garden stake.About the productWe sell plenty of butterfly garden stakes—but none quite as delicate, fanciful, and unforgettable as this one. Handcrafted and full of remarkable details, this piece is sure to elevate every inch of your outdoor space. Plus, with its flamed metal finish, this garden stake’s copper-like incandescence will only add to its elegance.Why we love itFor the most sophisticated of butterfly lovers, there’s no better garden stake than this one. No detail has been spared—and the results are breathtaking.Shipping detailsMost orders arrive at your door within 7 to 10 days. You will receive a shipping confirmation email with a tracking number once your order ships. Please be sure to check your spam folder as sometimes our correspondence ends up there.Happy Gardens guarantees that our products will arrive in good condition, without defects, or we will replace the product at our expense.We are a family-owned business that works tirelessly to deliver unique garden decor to your doorstep. Dad runs the warehouse; son runs the website. (To quote dad, “We’re going as fast as we can! Promise!”)Measurements7” x 5” x 32”MaterialsHandcrafted, flamed metal.DetailsQuick, frustration-free installation.Backed by our friendly, one-year warranty.",
    "reviews": [
      "Love this! Highly recommended this seller and the products.",
      "Oh, that is so sweet of your, Gloria. Thank you for sharing your experience and I am glad you are happy with your purchase. You deserve the best and thank you for your business! 💚",
      "Great looking in my dry bed..",
      "Sounds great! I am glad you like it, Jeff. Thank you for your business"
    ]
  },
  {
    "productId": "ADx3qhmNwH",
    "url": "https://www.etsy.com/listing/1695197139/mysterious-creatures-statue-whimsical?click_key=44078eaadf0fe079f580391ee1ea286a871d5e68%3A1695197139&click_sum=77f9bccc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=furniture+and+decor&ref=search_grid-930933-7-48&pro=1&frs=1&content_source=a017ecdf666aa751f37ad788fa7b50d684c66b40%253A1695197139",
    "title": "Mysterious Creatures Statue - Whimsical Fantasy Garden Decor - Handcrafted Outdoor Home Figurine - Unique Gift Idea for Fantasy Lovers",
    "description": "🛸 Explore my whimsical Elf and Alien Resin Statue - crafted to enchant any outdoor space, Each creature adds magic to your surroundings with its unique mission. 🪐🎨 Meticulously crafted with vibrant colors, ensuring lasting enchantment, Perfect for nature enthusiasts and fantasy lovers, adding a touch of magic to your garden. 🌼🔨 Material : High-quality Resin📦 Free & Fast delivery ⚡💌 If you have any questions? Shoot Me a message 😊",
    "reviews": [
      "Great my gods deer finally has a place with the goddess ecat on my altar",
      "Thanks for the review Clementine! Glad to know you are happy with the statue :)"
    ]
  },
  {
    "productId": "GqojoptfnU",
    "url": "https://www.etsy.com/listing/1567221560/charcuterie-board-personalized-cheese?click_key=738eb9fbda5a55f94123c0b5382e797da0a2795d%3A1567221560&click_sum=61baaffb&ref=search_recently_viewed-1&pro=1&frs=1",
    "title": "Charcuterie Board Personalized Cheese Cutting Board Wedding Gift for Couples, Anniversary Gift Housewarming Gift New Home Kitchen Decor Gift",
    "description": "Charcuterie board, Cheese Board, Housewarming gift, Mother of the bride, Custom cutting board, Birthday gift, Realtor Closing Gift, Thank you Gift, Bridal Shower Gift, Unique Wedding gift, Best Friend Gift, Serving Board, Bride Gift🎁 PERFECT GIFT IDEA: Looking for birthday gifts for mom, housewarming gifts for new homeowners, christmas gift for grandma, wedding gifts for bride and groom, or hostess gifts for women who have everything? Elevate the joy for your loved ones with this distinctive and considerate present, ensuring they feel truly special and appreciated on their memorable moments.✅DESIGNED TO MEET YOUR DIVERSE NEEDS: Throw an epic party or host an intimate gathering made possible with all the enhancing features of our charcuterie boards. Our cheese board is equipped with 2 slide-out drawers that hold 4 premium knives of different sizes and shapes. This makes it easy to keep organized. Our bamboo cheese board and knife set offer everything you need to build a stunning presentation for family and friends.✅Your Hosting Partner for Years - You'll feel great about purchasing an earth friendly material that is properly sourced and highly renewable. Bamboo is nonporous and resists liquid so it won't bend, warp, crack, absorb odor, or stain. A truly low maintenance wood for a user-friendly experience. But the obvious benefit is its natural aesthetic value.🧼🌬️Cleaning is easy! Simply hand wash the cheese tray with mild soapy water and let it air dry. It's a straightforward way to keep it in great condition.📍PERSONALIZATION options are available, allowing you to choose between adding your special touch to the board only, the board along with the knives and drawers, or leaving it without any personalization.✅SIZE: 16.25” x 13.5” x 1.5”*Due to the nature of bamboo wood, the color, markings, knots, and rustic characteristics will vary, resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.",
    "reviews": [
      "Beautifully made and recommend. Z",
      "Thrilled with communication of seller. Item is so nice!  Giving as a gift. Exactly what I expected. Thx",
      "Love this item as an engagement gift! I got it for my brother and his fiancé and they loved it! It came out so great I decided to get one for my newly engaged friends as well! Great quality and great price!"
    ]
  },
  {
    "productId": "u7EzmWKjHU",
    "url": "https://www.etsy.com/listing/1544035118/personalized-leather-backgammon-set?click_key=51968dbc5562f9cc404b3ae9fda267f8301e9a86%3A1544035118&click_sum=a9e940fe&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Leather Backgammon Set, Handmade Wooden Backgammon Set Anniversary Gift, Best Gift Idea for Husband,Gift for Boyfriend Birthday",
    "description": "❖PRODUCT FEATURES❖● Made to Order● 1st class leather cover and wooden inner surface●The playing surface is double-polished, with checker and dice chambers.●Item Size: 49x 30 x 8 cm (Closed) (20\" x 12\" x 3\")●It has to carry handle, zipper closure system and carrying bag made of interlining fabric●30 mm 15 dark and 15 light color checkers, four pieces 15 mm dices and 2 wooden dice cup.Our handmade faux leather-wooden backgammon sets offer exceptional features that will elevate your gaming experience. These sets are meticulously crafted from carefully selected high-quality hardwood materials. The natural grain patterns not only enhance the aesthetics but also ensure the longevity of your cherished backgammon set. All these features combine to provide players with an excellent gaming quality.📌 CustomizationEach set can be customized, allowing you to add a special message or name. Because these sets go beyond the game and add a personal touch.  This allows you to create a unique game board that is exclusively yours, making your game not just an ordinary pastime but a memory and legacy.🎁 Gift OptionThe customization options make these wooden backgammon sets excellent gift choices. They are perfect for any special occasion or celebration. You can gift them to friends, family, or that special someone. When they see that the set is personalized, they will feel truly special.📦 RETURN & EXCHANGE & SHIPPINGThe following items are not eligible for returns or exchanges due to their nature:✔️ Custom or personalized orders✔️ Digital downloadsConditions of return: Buyers are responsible for all shipping costs. If the item is not returned in its original condition, the buyer is responsible for any loss in value.We operate from two manufacturing and shipping centers, one in the US and the other in Europe. Depending on stock availability, orders may be fulfilled from either center. Shipping typically takes 3-5 business days from both centers. To minimize delays, we will dispatch your order from the center that can fulfill it first.Before placing an order, please carefully read the product descriptions to ensure it meets your expectations.Thank you for choosing us for your shopping needs. For more items and a delightful shopping experience, please explore our store further.https://www.etsy.com/shop/PearlTimeShop",
    "reviews": [
      "Just beautiful!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Absolutely perfect. Would highly recommend",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Super super fast shipping, great packaging keeping everything safe plus the gold wrapper was a great touch!! The board is perfect, exactly what we were looking for, thank you!",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan",
      "Great product, and service would highly recommend it to anyone.",
      "Thank you for your valuable feedback and shopping us. We hope to see you soon again. Best regards, Alan"
    ]
  },
  {
    "productId": "FtMdWuLQbn",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=1f619491a0607c7d8206588e10c7f148b50924a4%3A747068567&click_sum=a4a08f9a&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Great! It was a wonderful gift :)",
      "This item was great! I love it!",
      "delivered it to me quickly when I needed it as a fast gift! seller is awesome and piece was beautiful!!"
    ]
  },
  {
    "productId": "kfv3YEmxsE",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=04b1800a2aa776a85008c16be410c95472a05d84%3A654638870&click_sum=5c467e03&ref=search_recently_viewed-4",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "nJgipNoWMH",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=7be9582e4c800cd7d5a4dacc641b1b4514a50db3%3A1355783916&click_sum=cdf9d11e&ref=search_recently_viewed-5&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "The drawing exceeded my expectations. The artist not only captured the photographic image, but he beautifully captured the emotions of the mother and baby in the photograph. He was quick to make the few adjustments I requested and the drawing turned out exactly as I wanted!",
      "Can’t wait to give it to my husband!",
      "Great gift and very helpful and talented artist"
    ]
  },
  {
    "productId": "BevYPTqPiS",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=4283cb265156bbe7594ed5ab65adb41cd3e773e2%3A1411614241&click_sum=5f1a8ba7&ref=search_recently_viewed-6&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "A bit flimsier than I thought it would be but it is understandable so the varying light can easily shine through.",
      "Gorgeous night light! The beautiful trees are exquisite!"
    ]
  }
]
