[
  {
    "productId": "bGmCGaRrDR",
    "url": "https://www.etsy.com/listing/1131818146/custom-portrait-from-photo-sweatshirt?click_key=839377f46d122da451489e196c3b492a166d83a3%3A1131818146&click_sum=bb2c019a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-1&pro=1&bes=1&sts=1",
    "title": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait",
    "description": "Custom Portrait from Photo Sweatshirt, Custom Couple Portrait, Couples Portrait, Personalized Gift, Custom Gifts, Family Portrait***Please send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )ORDER INSTRUCTIONS** Check and Review all Photos.**Select Your sweatshirt Size and sweatshirt Color from drop down menus.** Choose Your Quantity you want.**Click ADD TO CART. And, you can go back to add more product color for your family members or You can complete the checkout process.**Please Click “Proceed to Check Out”**Finally, Your order will be ready to ship 3-5 Business Day.**** send your photo to us via Etsy Message(message to seller) ( or you can email to :  lakehousedesign2534 [!at] gmail.com )Due to the nature of the fabric as well as your monitor or mobile screen colors may differ slightly.We do accept cancellations in first 12 hours. Refunds and Exchanges are not accepted.All information is provided in the Item description as well as the photos attached to each listing.The price is for individual sweatshirt, not a setWe do vinyl heatpress printing, not screenprint o embroideryFABRIC8 oz.(US) 13.3 oz.(CA), 50/50 preshrunk cotton/polyesterHeather Sport colors: 60/40 polyester/cottonAir jet yarn = softer feel and reduced pillingDouble needle stitching at shoulder, armhole, neck, waistband and cuffs1 x 1 rib with spandexQuarter-turned to eliminate center creaseSafety Green: Compliant with ANSI / ISEA 107Tearaway labelCARE INSTRUCTIONS• DO NOT iron directly on Heat Transfer Graphic. Iron on low heat with shirt inside-outNever iron directly over design• DO NOT dry clean• Machine wash COLD with mild detergent• Turn inside out when washing• Dry on low setting or hang to dry• No chlorine bleach• Wait 24 hours before first wash*Do not use bleach",
    "reviews": [
      "My boyfriends loves it and won’t stop wearing it.",
      "Great! Thanks for the quick turn around also!",
      "Perfection! Will be making future purchases🫶🏽"
    ]
  },
  {
    "productId": "ho5hsWziQU",
    "url": "https://www.etsy.com/listing/1486296834/personalized-engagement-gift-custom-name?click_key=d9bd394c66eeee7b6c9fcdb638d6fe55e6061318%3A1486296834&click_sum=8d865262&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-2&frs=1&sts=1",
    "title": "Personalized Engagement Gift, Custom Name Round Charcuterie Board with 2pc Cutlery, Gift For Her Wedding Gift for Couple, Bridal Shower Gift",
    "description": "Personalized Name cheese board featuring a unique wood and marble design. Comes with a 2-piece cutlery set.  ❤ We are currently running a 40% for a limited time! ❤Featuring high-quality craftsmanship and perfect for entertaining, this stunning charcuterie board is a must-have for every one. Makes a perfect heartfelt gift for all occasions.Key Features:--------------------------BONUS 2-Piece Cutlery Set: Each cheese board comes with a matching 2-piece cutlery set, ensuring your mom has everything she needs to serve her guests in style.--------------------------Extra-Large Design: 12\" x 12\" - Our wood and marble cheese board is one of the largest on the market, offering plenty of space for an impressive spread of cheeses, charcuterie, and accompaniments.--------------------------Unique Brass Inlay: The brass inlay at the center of the board adds a modern and stylish touch, setting this cheese board apart from others.--------------------------Custom Engraving: Personalize the wooden part of the board with your choice of text engraving, creating a one-of-a-kind keepsake that your mom will cherish.--------------------------Exclusive Personalization: We're one of the few Etsy shops offering fiber laser engraving, which means we can also personalize the metal parts of the cutlery for an added touch of customization.If you have any questions, please message us. We thank you for supporting our small business! ❤",
    "reviews": [
      "Absolutely beautiful quality and arrived within just a few days of ordering. I couldn’t recommend enough!!",
      "Board is absolutely beautiful! Very well made! Future daughter in law loved it!",
      "Thank you so much for your kind words! We're thrilled to hear that the board is absolutely beautiful and that your future daughter-in-law loved it. If you ever need more special gifts or have any questions, feel free to reach out. Wishing you all the best!",
      "Great customer service. Gift was perfect. Thank you!"
    ]
  },
  {
    "productId": "YGPq4FcCvH",
    "url": "https://www.etsy.com/listing/1449125823/personalized-gifts-for-men-engraved-gift?click_key=e7e0f13e495bf8f6f26a84b83fad43519a11d462%3A1449125823&click_sum=4c790644&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-3&pro=1&bes=1&sts=1",
    "title": "Personalized Gifts for Men, Engraved Gift for Dad, Fathers Day Gift, Boyfriend Gift, Husband Gift for Him, Birthday Gifts, Beer Can Coolers",
    "description": "Personalized Laser Engraved Can Coolers!These make the perfect personalized gifts for your loved ones!Give a gift that will last for years to come!Size: 3 3/4 TallMaterial: Vegan LeatherSHIPS NEXT BUSINESS DAYNo changes/updates can made once order is placed since it is a next day shipping item!",
    "reviews": [
      "Instead of using these as groomsmen proposals. I switched it out for Godfather, they arrived exactly how I envisioned! Would absolutely recommend.",
      "Such good quality and hubby says it keeps drinks nice and cold!",
      "Item was exactly as described. Better than I expected, would absolutely recommend!",
      "Have bought several times for different people. Great quality"
    ]
  },
  {
    "productId": "sHEgpfH2WZ",
    "url": "https://www.etsy.com/listing/1304741037/officially-retired-whiskey-decanter-set?click_key=b3c240e56fd3dbab34cb2c14be8a35bc696cd08f%3A1304741037&click_sum=6d706f3e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-4&pro=1&bes=1",
    "title": "Officially Retired Whiskey Decanter Set With Glasses, Whiskey Glasses, Personalized Whiskey Decanter, Retirement Gift, Gift for Retirement",
    "description": "Officially Retired Whiskey Decanter With GlassesPlease note, ALL GLASSWARE is engraved and appears frosted white. There are no color choices.Upon receipt of your order, please open the package and inspect the contents right away. If there any issues, please contact us within 14 days of receipt.Care instructions – Please hand-wash and dry ONLY. These are not dishwasher or microwave safe.If you need your order by a certain day please message us through Etsy.Whiskey Decanter 750ml9\" tall and has a 4.5\" x 4.5\" base.Stopper is all glass – no rubber.Glass is 11ozWe have other wedding gifts and items in our store, be sure to take a look:https://www.etsy.com/shop/CreateYourOwnGiftOfficially Retired Whiskey Decanter Set With Glasses, Whiskey Glasses, Personalized Whiskey Decanter, Retirement Gift, Gift for Retirement",
    "reviews": [
      "I order the Decanter and glasses for a man's retirement party and they turned out really nice.  It came right when it said it would.   I highly recommend getting this for anyone's retirement.",
      "Excellent gift for retiree!  Prompt shipping",
      "Nicely made product great gift"
    ]
  },
  {
    "productId": "dzDHTkhNjU",
    "url": "https://www.etsy.com/listing/1679042271/embroidered-easter-basket-custom-kids?click_key=533cb71e2f85c3811c5695f357d9be2503771dd2%3A1679042271&click_sum=7d6143cb&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-1&pro=1&etp=1&sts=1",
    "title": "Embroidered Easter Basket, Custom Kids Basket, Easter, Basket, Personalized Easter Basket, Taupe Floral",
    "description": "Our embroidered painted bamboo basket with a Taupe Floral printed liner will be a great Easter basket for your loved one! Fill it with candy and small treats to make a beautiful basket. Carrots decor is included, bunny stuffed animal is not included.Details:11\" x 11\" x 7.1\" (28cm x 28cm x 18cm)Chipwood and polyesterEmbroidery will be approximately 2\" in height and length depends on how many characters.",
    "reviews": [
      "Exactly what I was looking for!",
      "I absolutely love it. Everything is as they described. They responded very quickly when I had a slight issue in the mail which was not their fault, (things get lost in mail) they fixed and sent a new one. I will definitely be buying from them in the future 😍😍 100% recommend 👌",
      "absolutely great! so soft, and just as cute as the photos",
      "Awesome blanket! Super soft ! Would recommend anyone to get one!"
    ]
  },
  {
    "productId": "gQSZMILSKk",
    "url": "https://www.etsy.com/listing/1197080203/personalised-birthday-disc-name-necklace?click_key=8cf635c5c2414966bd23d38f570b877ce51d6653%3A1197080203&click_sum=3b10a275&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-2&frs=1&etp=1&sts=1",
    "title": "Personalised Birthday Disc Name Necklace • Handmade Gift • Gift For Her • Birthday Gift • Bloom Boutique",
    "description": "𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗦𝗘𝗗 𝗕𝗜𝗥𝗧𝗛𝗗𝗔𝗬 𝗗𝗜𝗦𝗖 𝗡𝗔𝗠𝗘 𝗡𝗘𝗖𝗞𝗟𝗔𝗖𝗘Whether its a 18th, 30th, 40th or 50th Birthday, this personalised necklace is sure to make a great gift for anyone's special day.The personalised birthday necklace features her birthstone, a large 15mm disc engraved with her name and a smaller 8mm disc engraved with her age. A unique and meaningful gift to celebrate a milestone birthday.Complete this stunning necklace with a Citrine Birthstone to make the perfect gift for a November Birthday.• Available in a Stunning Silver, Rose Gold or Champagne Gold Colourway• Personalised with a chosen Name and Age engraved on the necklace disc charms in our Contemporary Script Style Font• Complete with an Citrine Birthstone to make the perfect gift for an November Birthday﻿• FREE Luxury Ribbon-Tied Gift Packaging𝗪𝗛𝗬 𝗬𝗢𝗨 𝗪𝗜𝗟𝗟 𝗟𝗢𝗩𝗘 𝗜𝗧• A Stunning jewellery gift your loved ones will treasure• Beautifully personalised ready for any special occasion• Made from high-quality materials𝗛𝗢𝗪 𝗧𝗢 𝗢𝗥𝗗𝗘𝗥1. Simply select the colour of your jewellery from the options provided2. Fill in your required personalisation in the box provided, taking note of any details mentioned in the description.3. Add it to your basket and proceed to checkout𝗢𝗧𝗛𝗘𝗥 𝗜𝗡𝗙𝗢𝗥𝗠𝗔𝗧𝗜𝗢𝗡• ﻿﻿All items are beautifully packaged in a luxury gift box ♡﻿﻿• Can’t find the information you need? Feel free to contact us.𝗣𝗢𝗟𝗜𝗖𝗜𝗘𝗦•https://etsy.me/3MNqYWQ𝗔𝗕𝗢𝗨𝗧 𝗕𝗟𝗢𝗢𝗠 𝗕𝗢𝗨𝗧𝗜𝗤𝗨𝗘•https://etsy.me/3Qikcvg𝗦𝗢𝗖𝗜𝗔𝗟𝗦• Instagram - @bloomboutique_uk• Facebook - https://www.facebook.com/bloomboutiquejewellery𝗠𝗢𝗥𝗘 𝗙𝗥𝗢𝗠 𝗨𝗦Personalised Jewellery ▸https://etsy.me/3HgOJFXPersonalised Necklace ▸https://etsy.me/3UPM6B6Personalised Bracelet ▸https://etsy.me/3BR3TiNPersonalised Earrings ▸https://etsy.me/3dXSc1H",
    "reviews": [
      "Perfect gift for 14 year old girl!",
      "Absolutely stunning! Exactly what I wanted for my sister’s special birthday thank you",
      "It was nice nad a good gift",
      "Lovely item. Bought as a gift for a friend. Would recommend"
    ]
  },
  {
    "productId": "JxSblLUTre",
    "url": "https://www.etsy.com/listing/953836857/personalised-bracelet-for-womencustom?click_key=05ca5c8cbc52a62281e438586c986010bae8088a%3A953836857&click_sum=f9274555&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-3&pro=1&etp=1&sts=1",
    "title": "Personalised Bracelet For Women,Custom Bracelet Bar Jewellery, Birthday Gift for Her, Bridesmaid Gift - BGF001",
    "description": "Personalised Bracelet For Women, Bracelet Bar Jewellery, Birthday Gift for Her, Bridesmaid Gift - BGF001__HOW TO ORDER & PERSONALISE__Select your chosen finish from the dropdown menu.Choose the font and enter the font number in the personalisation box followed by the text would you like to be engraved.If you don't provide us a chosen font we going to dispatch the product with our standard font ( Font 1 ) : see images.(We suggest Font 1 particularly for dates in roman/arabic numbers)PLEASE PROVIDE US MAX. 25  CHARACTERS__PRODUCT FEATURES__Material : Stainless SteelBar Size - 35 mm x 4.5Bracelet Length : 18+3cm__SHIPING INFORMATION__The product will come in free gift box.After receiving your order, we immediately start working on your jewellry, which will take 1 business day for us to make.We start working on your item as soon as we receive your order and we aim to dispatch it next day .SHIP BY DATE - When your parcel is leaving our workshop.DELIVERY DATE : When your parcel arrives to you .All of our jewellery products are engraved in our workshop.Our engraving process provides a large range of quality standards using a state of the art fiber laser machine.",
    "reviews": [
      "Absolutely the best quality ever",
      "Great Quality and Beautiful product",
      "Beautiful bracelet, lovely engraving and fast delivery",
      "I love this bracelet so much, I got two, one with my daughters name and one with my sons name, they're beautifully engraved and delivery was quicker than I expected"
    ]
  },
  {
    "productId": "VydAzSIARy",
    "url": "https://www.etsy.com/listing/1179734629/personalised-40th-birthday-map-print?click_key=0cecf333a05d010925090694a3ef48c617d3ae2b%3A1179734629&click_sum=db6a7cd7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-4&frs=1&etp=1&sts=1",
    "title": "Personalised 40th Birthday Map Print | Bespoke Favourite Memories Illustration | Personalised Milestone Birthday Gift | 40th Birthday Gift",
    "description": "A totally unique personalised hand-drawn map, illustrated with all of your special memories leading up to that milestone birthday.This makes the perfect gift for loved ones who are celebrating that BIG 40th birthday! Illustrated from scratch, we will hand-draw a 'map' of up to 14 of your favourite memories of that person. Maybe they have been on some amazing holidays with loved ones and have some memorable personal highlights.How it works:Pick from 2 sizes: A4 £60 (6 PLACES MAX) / 30x40cm £120 (10-14 PLACES)Using the text fields fill out the name of a place - this can be a country / city / town / park - any place that is special to you and your loved ones.Tell us a memory of that 'place' - ie: a specific building / landmark / hotel / food / drink / activity.**PLEASE CHOOSE NO MORE THAN 1 or 2 MEMORIES PER PLACE**Tell us the names you would like to write on the print.Tell us the colour you would like - you can pick from: Black / Grey / Navy / Blue / Green / Marigold / Papaya / Rose / Burgundy / AlmondFor inspiration, please see the images above. We will use our creativity to draw the 'map lines' that suit your 'places' best. We like to be free-hand with the drawing, so the places are not generally in chronological order, but if you would like this, we are happy to work with dates / years too. Just add these into the text boxes.Each map is individually hand-drawn and we will send you a proof via the 'order enquiry' for your approval before printing.Final artwork is unframed.Please note - your list of places is final - we do not re-draw new places once you have seen your proof. Happy to of course make small amends to any text details :)",
    "reviews": [
      "Beautiful gift and shop owners were so nice and accommodation.",
      "Amazing artwork that I’m looking forward to giving as a 40th birthday gift. Corinna and Daryl were constantly in touch regarding my requirements and it was delivered in good time and in excellent quality! They did a wonderful job and I’m thrilled with the result - thank you!",
      "Beautifully out together for a 40th birthday",
      "Loved the print very much!"
    ]
  },
  {
    "productId": "YJbAQelpPY",
    "url": "https://www.etsy.com/listing/666709268/personalized-unique-gifts-for-mom?click_key=fbf2e9b015610b3ac2eb181358a73fdfbabb2b57%3A666709268&click_sum=01c9f177&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-5&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Unique Gifts for Mom, Birthstone Ring Jewelry, Rings for Women, Mothers Ring, Family Birthstones",
    "description": "Personalized gifts for mom or for yourself representing your special persons in life... Birthstone ring with your desired 1-2-3-4-5 or 6 birthstones; this family birthstones ring makes a perfect personalized gift♡It is also available with 1-2-3-4-5 or 6 stones. Please select it from the menu at check out.★ PRODUCT DETAILS;*Band Width: 1.3mm*Gemstone Size: 3mm for each stone.*Material Options: 925K sterling silver & rose gold filled over the silver & yellow gold filled over the silver*Birthstone Options: You can see the birthstone chart in the last photo of the listing.★ HOW TO PLACE YOUR ORDER;*Please select your preferred material, birthstone quantity, and size from the menu while adding to the card.*Please write your desired birthstones to the ''note for seller'' section at check out.★ PROCESSING & SHIPPING*We ship to worlwide, please check current delivery times depending on your location at the bottom of this page.★ Please visit my shop here;www.etsy.com/shop/idajewelrydesign★ Please feel free to contact me if you have any questions or would like to request a custom order :)Thank you!♥,Ida",
    "reviews": [
      "Love! Just as advertised! I absolutely love it",
      "Item as described. Very beautiful!!!",
      "LOVE my ring with my children’s birthstones! The quality was beyond my expectations and it matches the description I read! It is perfection",
      "I absolutely LOVE my ring! It was for my partner, I, and our 3 kids. It came in on time. the quality is amazing. Its got a good weight to it and it is just everything i wanted"
    ]
  },
  {
    "productId": "gRiMIvUYJy",
    "url": "https://www.etsy.com/listing/1020897439/candle-candles-dog-candle-candle-uk?click_key=65466c029db2e2f1e2edca01bb4e9f09429ad4a8%3A1020897439&click_sum=9d7e4099&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-6&etp=1&sts=1",
    "title": "Candle. Candles. Dog candle. Candle UK. Candle gift.",
    "description": "Our puppy candles are the cutest thing since a real puppy. This unique candle will be sure to fit into its new home and  makes the perfect treat for yourself or gift for a fellow dog fanatic.Each dog is made to order from eco friendly soy wax. We take pride in everything we do and produce each item by hand. To keep our environmental footprint low, we do not use any plastic and our packaging is recyclable.Our limited edition pups take the cuteness up a notch. They include the candle and 3 wax melts shaped like a bone and paws in the same colour and scent as your pup. Each wax melt will last over 10 hours and we wrap them inside a reusable bag, free from plastic. Everything sits inside a gift box filled with shredded paper and tied in a red or brown twine bow. Please chose one of the limited edition options for this set.Make this a special gift or treat for yourself with a pair of our gorgeous earrings. They are made from beautiful sterling silver and arrive in our signature velvet bag alongside your candle.Please note that as these are handmade there may be some minor imperfections. If you order two or more and need them boxed separately, please leave us a note with your order so we can cut down on waste packaging where possible.This is a large candle. Approximately 8cm wide by 6cm tall.For our pawsome range of dog candles, please see our shop!  If you want the candle in a different color to the pictures please drop us a message.- Gift wrapping and delivery straight to a fellow dog lover- First class & Express delivery.A bit about us: We are a small family business operating from our Manchester workshop. Everything you see is done by us. We source all of our materials and ingredients  and personally make each and every candle.  We design all of our own labels and package everything ourselves. Our products are completely unqiue to us and we put so much care and attention into it to make sure that you, our valued customer, have a fantastic product and experience with us.Feel free to choose any scent:Cinnamon & Vanilla - A cosy scent that smells so good you could eat it. With a delicious blend of sugary cinnamon and creamy vanilla.Coconut & Raspberry - A sumptuous fragance that open with notes of fresh coconut water which eads to sweet raspberry. So amazing and something you must try!Fresh Linen - So fresh and so clean. A crisp scent that freshens any room.Vanilla - Pure creamy vanilla that everybody loves. The perfect all year round scent.Reccomended for decoration only, not burning. Please note that the unscented candle may carry a minor fragrance. Soy wax has natural aroma and from being produced in our environment, the candle may catch some scent.",
    "reviews": [
      "Awesome, just as cute as pictured and smells lovely!",
      "As described lovely gift and fast delivery",
      "An excellent stocking filler gift for my Wife. The design and quality of the product is excellent. Very well packaged. Will be looking at your site more often in future. Thankyou and good luck for the future."
    ]
  },
  {
    "productId": "SRGuDcXCFw",
    "url": "https://www.etsy.com/listing/1073934707/personalised-birth-flower-necklace?click_key=5784f9911944cdfc6799484bed3a89d5b6f70cba%3A1073934707&click_sum=4a3f915b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-7&pro=1&frs=1&etp=1",
    "title": "Personalised birth flower necklace, Valentine's Day gift for her, birthstone jewelry, bridesmaid necklaces, gift for her, friend birthday",
    "description": "Personalized birth flower necklace, Mothers Day gift for mom, gold birthstone jewelry, bridesmaid gift for her, best friend gift for birthdayThis delicate necklace holds a dainty 3D gold flower on a smooth mother of pearl oval set in gold plated brass. It hangs from a 14k gold-filled chain for quality that will last. Makes the perfect custom gift for her for Christmas, Mother's Day or Valentine's Day, a memorable bridesmaid gift, best friend gift, teacher gift, or as a personalized birthday gift for her. Choose your birth flower and necklace length from the drop-down menu, and personalize it with an initial and tiny birthstone if you'd like :)Birth Flowers:January - SnowdropFebruary - IrisMarch - DaffodilApril - DaisyMay - Lily of the ValleyJune - RoseJuly - Water LilyAugust - PoppySeptember - AsterOctober - MarigoldNovember - ChrysanthemumDecember - HollyThis personalized necklace includes the chain and main pendant. Select “Pendant Only” from the drop down menu if this is what you’d like.If you would like the main pendant and one or more extra charms, you can personalize this necklace with additional initial(s) or tiny round birthstone(s) to add alongside the main pendant. Just choose the number of extra charms you’d like, if any, from the drop down menu, and give me your choices in the personalization section, as well as any specific order or grouping you’d like them in :) Please note this necklace is only available in gold.______________________________**Need an Extender?**If you’re not sure of the right length for a gift, or would like the option to wear your necklace at different lengths, you can purchase a 2” or 3” extender in gold-fill, rose gold-fill or sterling here:https://www.etsy.com/ca/sageandolivia/listing/861764757/extender-for-necklace-gold-fill-extender______________________________➳ ➳ ➳ ➳ MEASUREMENTS ➳ ➳ ➳ ➳Birth Flower pendant:  15mm x 11mmCZ birthstone pendant: 3mmPlated initial charm: 6.5mm➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳ ➳*SHIPPING AND DELIVERY*✨FREE standard shipping anywhere in Canada (no tracking).✨FREE tracked shipping anywhere in the USA on orders over $35USD.✨Flat rate for tracked international shipping.➳CANADIAN orders are shipped with Canada Post over-sized letter mail and do NOT include tracking. Delivery times are generally 3 -12 business days. Tracked, expedited shipping is available at checkout for an extra cost. Please choose one of the tracked options if you are needing your jewelry quicker or would like to track its progress.➳USA orders will be shipped through USPS, and will include a tracking number. You can expect to receive your order in 1-3 weeks, although delivery times will vary across the country, and can change due to COVID or peak holiday times. If you would like faster shipping, please choose from the USA expedited shipping options at checkout (and message me with your phone number).➳INTERNATIONAL orders will be shipped using Asendia, and will include a tracking number. Delivery times can vary between 2-10 weeks, depending on delays in customs, peak holiday times, etc.It will take 1-3 days to make your jewelry before shipping, so please give yourself extra time to order, or choose expedited shipping at checkout to get it quicker! Remember to message me with your phone number :)______________________________*RETURNS AND EXCHANGES*If you are not pleased as punch with your jewelry and would like to exchange or return it, please message me within 5 days of receiving it. The buyer is responsible to ship it back to me in unused condition for an exchange or refund (not including the original shipping charges, if any). If the item arrived damaged or defective, please let me know and I will make it right!______________________________*PACKAGING*Your item will be packaged in a lovely and sturdy decorative envelope. Add a free personalized message for your loved one in the form of a card that will be appreciated for its loveliness and thoughtfulness. Gift wrapping is also available in several designs for a small fee, available at checkout.______________________________*CARE INSTRUCTIONS*A good rule of thumb for jewelry is “last on, first off”. Avoid contact with humidity, lotions, sunscreen, and beauty products as they can be harsh on metals. Polish jewelry with a soft microfibre cloth and store in its original packaging (air-tight bag) to keep it looking its best.______________________________FIND ME HERE:www.facebook.com/sageandolivia/www.pinterest.ca/sageandolivia/www.instagram.com/sageandoliviajewellery/SEE MORE:Earrings -https://www.etsy.com/ca/shop/sageandolivia?section_id=5029372Necklaces -https://www.etsy.com/ca/shop/sageandolivia?section_id=20879801Birthstone Necklaces -https://www.etsy.com/ca/shop/sageandolivia?section_id=26616959Bracelets -https://www.etsy.com/ca/shop/sageandolivia?section_id=5029371Filigree earrings -https://www.etsy.com/ca/shop/sageandolivia?section_id=23066104Bridal Earrings -https://www.etsy.com/ca/shop/sageandolivia?section_id=23411787Resin Earrings -https://www.etsy.com/ca/shop/sageandolivia?section_id=24693508Locket Necklaces -https://www.etsy.com/ca/shop/sageandolivia?section_id=25588691Thanks for visiting! You can return to my shop here:http://www.etsy.com/shop/sageandolivia",
    "reviews": [
      "This charming & customizable necklace was a big hit as a birthday present! She loved knowing what her flower month was and the added letter & birth stone charms made it super personal 😊 I would totally recommend this necklace for yourself or as gifts!",
      "Gorgeous item, super fast shipping and excellent customer service. The necklace made the perfect gift for my mother’s 60th birthday!",
      "Love this necklace so much. It’s dainty and beautiful. I wear it all the time and couldn’t be happier with my purchase!",
      "So beautiful! Gave it to my mom for Christmas and she loves it!"
    ]
  },
  {
    "productId": "RFglMLS5fd",
    "url": "https://www.etsy.com/listing/1146546060/penguin-love-card?click_key=b98debc5cddc20bcb80a009fc7877fa31b53a743%3A1146546060&click_sum=5754cf58&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-8&etp=1&sts=1",
    "title": "Penguin Love Card",
    "description": "Caption: Let's do this forever. ~ Original Watercolour and Ink Card by RossJDesignsMix and match with other designs! Include this card in a multipack on this listing:https://www.etsy.com/uk/listing/584750639- Shipping from Edinburgh, UK- Original watercolour design reprinted on 100% recycled white smooth 300gsm card (FSC approved) OR 100% biodegradable seeded paper (embedded with a mix of wildflower seeds). Cards are handmade, folded and printed by the RossJDesigns team.- SIZE A6 CARDS (148x105mm - around 5 7/8 x 4 1/8 inches)- Cards are blank inside and come with a recycled kraft envelope- Items will be posted in a hard backed envelope- Plastic free packaging (as much as possible)- 10% of profits donated to planting trees and supporting sustainable projects- I only provide tracked shipping for large orders of 15 or more cards. If you require tracked shipping on smaller orders please contact me prior to ordering.- Shipping times are estimates and can sometimes take longer due to the time of year or bad weather etc. I will do as much as possible to ensure your card is arrives within these estimates but please order your item in plenty of time!- If your order doesn't arrive by the time you need it please send me a message on Etsy and I can try and find a solution",
    "reviews": [
      "Better than pictured, prompt shipping and attention to detail.",
      "This card was terrific!  Great art, excellent quality, arrived in perfect condition and on time.  Thank you!",
      "Love this card so much!"
    ]
  },
  {
    "productId": "HFrschkajR",
    "url": "https://www.etsy.com/listing/1557396092/14k-gold-egypt-cartouche-necklace-egypt?click_key=c02938c630ccebc771371deb5a3fee95e166d76b%3A1557396092&click_sum=9dd41472&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-5&pro=1&frs=1&bes=1",
    "title": "14K Gold Egypt Cartouche Necklace, Egypt Name Necklace, Personalized Gifts for Her, gyptian Hieroglyphic Cartouche Jewelry, Ancient Symbol",
    "description": "DETAILS• Materials : High Quality Solid 925 Sterling Silver• Finish : Sterling Silver / 14k Gold / Rose Gold- Not Tarnish problem. Definitely not gold plated or gold filled.• Chain Types : Standart / Vine / Box / Figaro / PaperclipChains have patents and stamps. (925K)CHAIN LENGHT14 inches (36 cm) - Age 5 years or Under15 inches (38 cm) - Choker16 inches (41 cm) - Age 6-18 years18 inches (46 cm) - Most popular size for women• Check the infographics for your model choice and necklace length.• The length option is the TOTAL chain length (including the charm). If you order an 16\" chain, the piece will come as CHAIN + NAME = 16\"• All jewelry is designed with +2'' cable chain extender. You can be flexible when it comes to finding the necklace length that suits you best.BEST GIFT• Ours jewels can be a special gift for your lover, boyfriend or girlfriend, best friend or family. Each jewelry will be packaged in a beautiful gift box, suitable for Birthday, Graduation, Anniversary, Christmas, Thanksgiving Day, Party Wedding and Valentine's Day.PACKING• All items are nicely packaged ready to gift in elegant jewelry boxes.SATISFACTION GUARANTEEYour satisfaction is always our priority. Please feel free to contact us if you have any questions or requests regarding your jewelry.NOTEIf you can't find the information you need or need some advice for your design?Feel free to contact us.HOW TO ORDER• Choose the finish you prefer• Choose the necklace length and chain style you prefer•  Please review the Egyptian alphabet table. Please tell us the name you want in the personalization section. Max 9 letters.FOR MOREhttps://www.etsy.com/shop/UXVJewelry",
    "reviews": [
      "Love!!!!! Item as described. Perfect",
      "Thank you very much 🧡",
      "Beautiful item, just as described!",
      "Thank you very much 🧡",
      "It was a gift so I didn’t see it, but the gift receiver is happy with it.",
      "Thank you very much 🧡",
      "Exactly what it looked like online!",
      "Thank you very much 🧡"
    ]
  },
  {
    "productId": "HzDUZfigLg",
    "url": "https://www.etsy.com/listing/1677403703/personalized-birth-month-flower-gift-box?click_key=0ba24ac587e20d07af1373912652539bb3be55af%3A1677403703&click_sum=c0990d4c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-6&pro=1&frs=1&sts=1",
    "title": "Personalized Birth Month Flower Gift Box with Name, Will You be My Bridesmaid Box Set, Personalized Gift Box, Birthday Gift, Jewelry Box",
    "description": "Personalized Birth Month Flower Gift Box with Name, Will You be My Bridesmaid Box Set, Personalized Gift Box, Birthday Gift, Jewelry Box, Bridesmaid Proposal with Jewelry Box, Mother Day Gift, Valentine Gift, Christmas Gift, Will You Be My Maid Of Honor, Maid of Honor Gift Box, Bridesmaid Gift Box, Personalized Birthday Gift Box, Matron of Honor Gift Box, Gift for her, Birthday Gift Ideas, Congrats Gift, Godmother Proposal Box, Gifts For Team Brides, Custom Birthday Gift Box, Etc.- Perfect gift for yourself, your friends, your family or for your loved ones on Anniversaries, Weddings, Birthdays, Mother’s Day, Father’s Day, Christmas, Bachelorette Party Gift, or Bridesmaid ProposalOur luxury gift box includes:-\t16 oz Birth month flower Iced coffee cup with lid and glass straw. (You can pick clear glass cup or frosted glass cup )-\tA travel size Jewelry Box-\tA Faux Pearl Beaded Bracelet with Daisy Flower-\t2 Scrunchies-\tA Foam Rose-\tStraws and Straw Cover Cap-\tA Gift Box-\tA Gift CardGlass Cup Details:- Material: Clear or Frosted Glass construction, Sublimation Ink, A Bamboo Lid, A Reusable Plastic Straw, and A White Box.- Size: 3\"W x 5.3\"H (16oz)- Material Type Free: Lead free, BPA free.- Securely Boxed: These Can Glass Cups come securely sealed in a thick box with foam protection, so your gifting plan will be a success!How to buy multiple gift boxes in the same order.1. Add your first personalized can glass to your cart.2. Return to the listing and add the next personalized can glass to your cart.3. Repeat the process and check out.Processing time:All orders are shipped out within 1-3 days from Ohio, USA.Shipping time is about 3-7 days depending on your location.Please kindly check your address before placing the orders.Your satisfaction is our priority! If you have any questions regarding the size, color, style, etc., please let me know. I am more than happy to help with your order. Just leave me a message, and I will get back to you within 24 hours.Thank you, and Happy shopping!---Darlify---",
    "reviews": [
      "I love that they have themes and I got this for my sister’s birthday and she loved it. Thank you so much 🫶🏾",
      "It was a perfect birthday present! Thank you!",
      "Perfect gift and gets here in good timing!!!",
      "Great gift for my boss!"
    ]
  },
  {
    "productId": "bGJfwABRuk",
    "url": "https://www.etsy.com/listing/1650434172/paw-print-name-necklace-dog-memorial?click_key=3b5597cbee50b460e91d39b37372107076cf71be%3A1650434172&click_sum=3338f113&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-7&pro=1&frs=1",
    "title": "Paw Print Name Necklace, Dog Memorial Gift, Personalized Tiny Dog Paw Necklace, Minimalist Paw Necklace, Animal Necklace, Pet Necklace",
    "description": "Paw Print Name Necklace, Dog Memorial Gift, Personalized Tiny Dog Paw Necklace, Minimalist Paw Necklace, Animal Necklace, Pet NecklaceDiscover the beauty of our Dainty Stone Cross Necklace, a symbol of faith crafted with precision in 925 Sterling Silver by Neckgold. This elegant piece is more than just jewelry; it's a heartfelt expression of Christian devotion, making it an ideal gift for Christmas, Mother's Day, or any special occasion.Key Features:925 Sterling Silver: Immerse yourself in the enduring beauty of genuine sterling silver. The Dainty Stone Cross Necklace is meticulously crafted to showcase the luster and durability of this precious metal.Upright Cross Design: The classic and upright cross pendant adds a touch of simplicity and elegance to your ensemble. It's a timeless symbol of faith and a beautiful expression of spirituality.Dainty Stone Accent: The inclusion of a delicate stone enhances the overall aesthetic of the cross necklace, adding a subtle sparkle. It's a thoughtful detail that elevates the piece and adds a touch of grace.Versatile and Meaningful:Whether worn as a daily reminder of faith or as a special accessory for significant occasions, the Dainty Stone Cross Necklace effortlessly complements various styles. Its versatility makes it suitable for both casual and formal wear.Perfect Gift for Special Occasions:Celebrate the spirit of Christmas, express love on Mother's Day, or commemorate other special occasions with a gift that reflects faith and elegance. The Dainty Stone Cross Necklace is a thoughtful and meaningful gesture for the women you cherish.Indulge in the grace and spirituality of our Dainty Stone Cross Necklace by Neckgold. Order this timeless piece today and carry the symbol of faith with you wherever you go.[Neckgold]Paw Print Name Necklace, Dog Memorial Gift, Personalized Tiny Dog Paw Necklace, Minimalist Paw Necklace, Animal Necklace, Pet Necklace",
    "reviews": [
      "Wonderful gift to a grieving dog owner. She said she cried to receive this darling remembrance.",
      "Small on the chain, quality of the chain unexpected",
      "Got it as a gift for my daughter and she loves it."
    ]
  },
  {
    "productId": "dBIJNLS3Cu",
    "url": "https://www.etsy.com/listing/1097017861/personalized-name-necklace-gift-for-her?click_key=22a19ce285664bfcac974369b665f8bb0209abe4%3A1097017861&click_sum=58371bb8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-8&pro=1&frs=1&pop=1&sts=1",
    "title": "Personalized Name Necklace,  Gift for Her,  Personalized Gift, One of a kind Jewelry, Gold Name Necklace, handmade gift, Gifts for mom",
    "description": "Mothers Day gift NecklaceThis necklace brings you a chance to carry your name in style.We will design your name in a stylish unique logo.It is a passion for immaculate design and an innate understanding of the woman and her journey that drives Roberto Gold.Roberto Gold has always challenged traditional notions that endorse the view that jewelry was meant to display one's status and be worn sparingly.This Name Logo necklace is designed to make your daily wear meaningful, with artistic pieces that reflect your individuality, resonate with personal meaning, are crafted to be wearable, and celebrate your every day.Roberto Gold launched three years ago and what an amazing journey it has been. The pinch-me highlight would be coming to understand the magnitude of the community of wonderful clients around the world we created and who are the real heart of the brand.This piece of jewelry is designed especially for our 3rd anniversary.Features:⏺ MATERIAL: 925K Sterling Silver⏺ COLOR: Silver, 14k Gold, 14kRose GoldChain Lengths- 14 inches- 16 inches- 18 inches- 20 inchesPlease visit our name bracelet and earring listinghttps://www.etsy.com/listing/1576367253Letter Necklace, Initial necklace, name necklace, gifts for her, gold necklace, gift necklace, initial jewelry",
    "reviews": [
      "I purchased 3 designs from this artist. Amazing work. The seller is kind and works fast. I appreciate him working with me to get gorgeous designs.",
      "Beautifully made. I enjoy wearing it.",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️",
      "The necklaces are gorgeous! I ordered four (one for myself and the others as Xmas gifts). Very satisfied with my purchase, highly recommend this product ❤️"
    ]
  },
  {
    "productId": "gXAPBk5sYn",
    "url": "https://www.etsy.com/listing/574795579/engraved-picture-wallet-insert-add-back?click_key=6244c667ab3a0a26bc03efea0be6c6933a28d526%3A574795579&click_sum=2a893314&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-9&frs=1&etp=1&sts=1",
    "title": "Engraved Picture Wallet Insert - Add Back Engraving Too - Stocking Stuffers, Gifts for Him or Her - Laser Engraved Photo Love Note Card",
    "description": "- Handwritten Wallet InsertHold your memories permanently with this beautifully engraved metal wallet insert.  Your sentiments will stand the test of time and complimented by the engraving of your choice on the back.  Remarkable way to tell someone you love them.   You cannot go wrong this gift that will stay with them for years to come.  Choose from our font menu, snap an image of actual handwriting, and even add a picture to be laser engraved.  These have been turning out amazing!Black anodized aluminum metal cardUp to 350 (font) characters or 150 (handwritten) characters.Measurements: 3.375\" x 2.125\"Add your image:In order to use your own image for your order, please click on the \"MESSAGE THIS SELLER” link (just above the FAQs to the right). From here, simply click on the photo icon to attach the image you would like to use for your order. Your image will automatically connect to your order as well as any conversations posted within.All bulk orders are individually packaged within clear plastic bags.For multiple orders of the same product, we will gladly offer discounts. Message us for more details and coupon codes.>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Browse our full shop collection:www.Etsy.com/shop/VintageBrandingCo>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>Vintage Branding Company is dedicated to helping you create custom unique gifts. Take pride in knowing that each piece is a quality hand-crafted treasure, made in our own shop.",
    "reviews": [
      "High quality, clear image. Fast shipping! Exactly as I expected.",
      "The final product looked so good! Got it as a Valentine’s/deployment gift for my fiancé and he was very impressed.",
      "Excellent gift! Great quality and style.",
      "Just as shown. Great quality"
    ]
  },
  {
    "productId": "dQpIyt6EHS",
    "url": "https://www.etsy.com/listing/1297748938/gift-golden-ticket-foiled-voucher?click_key=411e321e2d32199159b2be7571e8224dd777c42a%3A1297748938&click_sum=c884c936&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-10&etp=1&sts=1",
    "title": "Gift Golden Ticket, Foiled Voucher, Personalised Ticket, Christmas Voucher, Surprise Holiday, Personalised Gift, Birthday Event, Real Foil",
    "description": "Choose this perfect foiled gift voucher to surprise a loved one or friend with a special surprise you have planned for them…whether it be a weekend away, their favourite concert, bottomless brunch, or theatre date...it's up to you what we print :-)We have Red foil, gold foil, rose gold foil and many more colours!For personalisation please include the following:Personalisation Line 1: Recipient Name  -  (e.g. HANNAH)Personalisation Line 2: The surprise  -  (e.g. A spa break in the Lakes!)Personalisation Line 3: Occasion/Message  -  (e.g. HAPPY BIRTHDAY!)Personalisation Line 4: Who it is from  -  (Love, Danielle x)__________________________________________Further product details:❤ 350gsm Premium Quality White Smooth Card❤ Size: 210mm x 100mm❤ Reverse is blank❤ Includes: 100gsm FSC certified Kraft brown envelope❤ Packaging: Sent in a hardback envelope to ensure safe arrival.Custom option:If you have something different in mind for your ticket design, please feel free to drop us a message for a custom design quote.__________________________________________***Delivery:***• Your order will be made and dispatched within 1–2 working days.In 99% of the time, the very same day!• Your order in the UK can be sent via Royal Mail 2nd class as standard.Royal Mail aim to deliver this within 1 - 3 working days(I have 1st class and Next Day upgrades available at the checkout!).• International orders will be also sent via Royal Mail International Standard and can take a minimum of 9-14 working days.Please note: All delivery quotes are estimated and in most cases are **quicker**, but during busy periods, can see a slight delay.---------------------------------------------Golden ticket gift voucher, gift voucher, personalised gift voucher, spa break, bottomless brunch, weekend away, surprise gift ticket, gift ticket, personalised gift ticket, sent with love, foil finish, gift voucher for husband, gift voucher for wife, gift voucher for friends, gift voucher for couple. Harry Styles Ticket, Peter Kay Ticket, Afternoon Tea Ticket, Ed Sheeran Ticket, Man United Ticket, Event Ticket, Valentines Day Voucher, Christmas Day Voucher, Birthday Voucher, Surprise Trip Voucher",
    "reviews": [
      "Great!",
      "Bought for my mum, she loved it and  after the event, she now uses as a bookmark.",
      "Great purchase, wife loved the presentation",
      "Fast delivery and  Good design"
    ]
  },
  {
    "productId": "dDoqvyGEZE",
    "url": "https://www.etsy.com/listing/695801114/personalized-name-blanket-minky-swaddle?click_key=b9c577054847e5ba05156bfdc0bcffe87ac101d7%3A695801114&click_sum=ca20f61f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-11&pro=1&etp=1&sts=1",
    "title": "Personalized Name Blanket / minky swaddle knot hat bow / hospital coming home reveal outfit boy girl custom newborn baby receiving gift",
    "description": "Please preview the name you would like printed here, proofs are not sent unless requested.https://previewtool.sewminedesign.com/product/personalized-minky/Create your custom personalized items here! Get the perfect hospital announcement photo. Make your newborn photos extra special. Show big brother or sister they are special with a matching name minky blanket ♥-Swaddle Blanket-Our swaddle is made from our jersey knit polyester for the perfect stretch and softnessAvailable in approx 47\"x47\" with rounded edges and 30\"x40\" with rounded edgesPrinted on one side, reverse side is white-Coordinating Accessories-Our accessories are made from a stretchy polyester spandex blendChoose from Bow wrap, Bow hat or Knot hatAvailable in newborn, 0-3 months, and 3-6 months-View our Plush Minky blankets listed here-https://www.etsy.com/SewMineDesign/listing/710316787/personalized-name-blanket-minky-swaddle?utm_source=Copy&utm_medium=ListingManager&utm_campaign=Share&utm_term=so.lmsm&share_time=1635099075403- Names on blankets are 2-3\" tall, size varies depending on font and name- Names on clothing items are 1-1.5\" tall- Printed on one side, the opposite side is solid white- Vibrant, permanent colors will not fade- Machine washable (see care instructions below)- Professionally sewn- We custom print our blankets in house with baby-friendly, non-toxic, water-based inks- CPSC Compliant-ORDER DETAILS-* Computer and phone screens can vary. A color name does not guarantee a specific shade of a color. Replacements and refunds will not be given for color discrepancies. Colors are printed exactly as listed in color chart. I can not guarantee a color from a review photo-HOW TO ORDER PLEASE READ FULLY-1. Select your items from drop down menu2. Please include all requested information. Orders missing information will be delayed. IF NO FONT CHOICE IS LEFT the font shown on the first listing photo will be used3. PREVIEW your little ones name in all fonts and color options here! Check out the endless possibilities! Proofs are not sent without request. Refunds/returns are not accepted for correctly made items. Please check font format as each font varieshttps://previewtool.sewminedesign.com/product/personalized-minky/PLEASE INCLUDE ALL information with your orderPlease tell us...1. Name(s) exactly as you'd like it printed (middle name is no extra charge)2. If you would like hearts added to your order, please enter script or solid heart. Hearts will not be added unless requested3. Background Color (If no color is chosen, color shown in first photo will be used.)4. Font Color (If no color is chosen, white will be used.)5. Name Font/s IF NO FONT CHOICE IS LEFT the font shown on the first listing photo will be used.6. Names are printed repeatedly on bow items. Single name available on knot and beanie hat7. Clothing items will be made in 0-3 mo if no size is chosen.I can not guarantee any order changes after the order is placed, please send a message with any questions or concernsPreview the name herehttps://previewtool.sewminedesign.com/product/personalized-minky/",
    "reviews": [
      "Great quality, item was perfect and exactly what I was expecting! 😊 definitely recommend!",
      "Very nice material and vibrant colors!!",
      "One of my favorite gifts to give new mom's! This is my 3rd order!!",
      "Very nice! The new Mama to be she absolutely loved the personalized swaddle blanket and matching bow. The seller was nice to answer any questions I had. She even came back and told me that she thought the Charcoal print would show up better than just the grey on the rose color swaddle blanket and bow. So I got her to change it based on her opinion and it was perfect!"
    ]
  },
  {
    "productId": "XGmXsdBttf",
    "url": "https://www.etsy.com/listing/1549793044/personalized-animal-lovey-baby-shower?click_key=5ca9202e1f78f617e8d4f5756dab89ebd7154a18%3A1549793044&click_sum=e37c98c9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-12&etp=1&sts=1",
    "title": "Personalized Animal Lovey, Baby Shower Gift, Baby Blanket, Horse Lovey, Personalized Blanket, Security Blanket, New Baby gift",
    "description": "Keep your little one cozy and comforted with our essential lovey.Woven, all natural, OEKO-Tex certified premium cotton makes this lovey light weight, breathable and perfect to snuggle.Our unique animal lovies are perfect for baby announcements or as a keepsake!If you wish to personalize the lovey, please indicate name(s) to be embroidered and choice of thread color in the \"add your personalization section\".Made with 2-layers of super-soft breathable muslin cotton.Babies will love the incredibly gentle feel of the soft fabric against their skin. Natural and eco-friendly, rest assured knowing that the blanket is free from harmful substances. This lovey is ideal for baby to cuddling while sleeping.The perfect gift for little hearts and hands, this comforter baby blanky is sure to impress both caregivers and children with its delightful design and endearing charm.SIZE15”  X 9.5”FABRIC:100% OEKO-TEX certified cotton, Stuffing in head : 100% CottonCARE INSTRUCTION:Machine wash in cold water on gentle cycle. Tumble dry low or air dry.All Muslin Items are handmade, It may have slight imperfections.Small details may be different to pictures.Real colors may slightly differ from their appearance on your display, as it depends on your monitor settings.GIFT MESSAGE:We do offer your message (maximum 15 words) and we'll have it handwritten! on the back of a minimalist “Oh Hello Baby” gift card.Please make sure to include your name, so the recipient knows who to thank!SHIPPING- We can ship directly to your loved one.- Each Baby Gift Box is packed using an eco-friendly white & kraft recyclable tuck top shipping box with premium ivory tissue paper.- Please note that, the gift box, crinkle fillers and decorative eucalyptus in the photos are photo props only and are not included in theproduct.- Please put their address in the shipping information.- Also we can ship to you so you can deliver your gift yourself!SHIPPING POLICYIf your order is received before 11 a.m. PST, on any business day, it will ship the same business day. If your order is received after 11 a.m. PST, on any business day, it will ship the next business day. Any orders received on non-business days will ship the next business day. Business days are generally Monday through Saturday excluding U.S. holidays.After the order is shipped, Minivalley is not responsible for loss, delivery delay or any damage to your package. Unfortunately delays from the postage provider may occur from time to time and this is out of our control. If nobody is home to receive the order, the postage provider reserves the right to leave it in a safe place if there is a place out of sight. If the driver does not believe there is a safe place, the parcel will be taken to the nearest post office for collection or a designated pick-up point. Minivalley is not liable for parcels that show as delivered and gomissing.SAFETYAlways supervise children when using our items. They contain small parts and could potentially be a choking hazard if not used in a safe manner.Before each use, check carefully.Throw away at the first sign of damage or weakness.INSTAGRAM@theminivalley",
    "reviews": [
      "This is sooo adorable! I can't wait to gift it!",
      "Adorable gift . . .",
      "Beautiful gift for your newborn, customizable, high quality. Arrived quickly",
      "Very cute, just like the photos!"
    ]
  },
  {
    "productId": "vbVXYezQNl",
    "url": "https://www.etsy.com/listing/839825360/handmade-gift-for-couple-personalized?click_key=75962520c10ad0d51fa8bdca7fe4cb33483d76db%3A839825360&click_sum=17f675dd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-13&pro=1&frs=1&etp=1&sts=1",
    "title": "Handmade Gift for Couple - Personalized Picture Frame Gift for Wedding Photo or Engagement Photo | Engagement Gift | Gift for Boyfriend 031",
    "description": "Make your frame into a beautiful gift box with our gift box options!  Our gift box options include photo printing, gift cards, and a gift box. You can see them here:https://www.etsy.com/listing/1463668417/add-on-frame-gift-box-with-photoWhether you're looking for a wedding gift, engagement gift, anniversary gift, Christmas gift, or just a special way to show your loved one how much you care, the personalized picture frame is sure to be treasured always.This beautiful frame is engraved with the names of two people and the date of their wedding or anniversary. It's a gift that will be cherished for years to come. You can choose between a 5x7 or 4x6 picture, making it perfect for displaying a favorite wedding photo or anniversary celebration.Whether you're celebrating a special occasion or just showing your loved ones how much you care, this personalized picture frame is sure to be cherished for years to come! The frame also comes with an easel back so it can be displayed prominently in their home.Choose between a 4x6\" Opening or a 5x7\" OpeningMost of our designs format better with a horizontal orientation; however, a vertical orientation is available upon request, just let us know! :)4x6\" Overall Frame Size: 8x8 Inches5x7 Overall Frame Size: 9x10 Inches",
    "reviews": [
      "Fast shipping and nice quality",
      "Just like the picture! Will be ordering more",
      "Incredibly happy with this frame. It came out more beautiful than I expected with excellent quality. It was also shipped extremely fast!"
    ]
  },
  {
    "productId": "jCGSISx7iD",
    "url": "https://www.etsy.com/listing/1440751878/personalized-recipe-book-blank-custom?click_key=914e383127f80a512e7e93f97846dddb26b34c73%3A1440751878&click_sum=b75adbd8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-14&pro=1&etp=1&sts=1",
    "title": "Personalized Recipe Book Blank Custom Cookbook Binder Mothers Day Gift",
    "description": "Personalized Recipe Book Blank Custom Cookbook Binder Mothers Day GiftThe recipe book is a great gift for close person who loves to cook or could help you gather all your recipes in one place! We perform three steps of processing the cover. It means that this book last you for many years.Complete set:- Wooden cover;- Ring mechanism (for A6 and A5 books - a mechanism with two rings (30 mm (1.2 in) - diameter), A4 - a mechanism with four rings (30 mm (1.2 in) - diameter));- Elastic band;- Set of pages to choose (70 sheets);- Set of sticker dividers.More recipe book designs:https://www.etsy.com/shop/MakityShop?ref=seller-platform-mcnav&section_id=27931767Book sizes:1. SMALL 15x18 cm (5,9\"x7\") - pages A6 (4.1x5.8\")2. LARGE 19x24 cm (7,5\"x9,4\") - pages A5 (5.8x8.3\")3. EXTRA LARGE 25x32 cm (9,8\"x12,6\") - pages А4 (8.3х 11.7\")Sheets:You can choose one of the sets of pages (70 sheets): classic recipe pages, color recipe pages, lined, craft, milky white, or 50 sheet protectors.The sheet density is 80 g/m2. You can add an additional set of pages when choosing the size or order it separately:https://www.etsy.com/listing/773260067/recipe-card-pages-70-sheetsAlso, you can add a stand to your binder:https://www.etsy.com/listing/979267380/recipe-book-stand-for-a6-a5-a4-sizes?ref=shop_home_active_1&frs=1Processing time:We need 3-5 days to produce your book. After we will send the parcel and provide a tracking code.If you have any questions feel free to ask us!",
    "reviews": [
      "Good stuff my mom liked it a lot",
      "Even better than the pictures. The quality is great.",
      "Very pretty and well made"
    ]
  },
  {
    "productId": "V9EdNEkXGd",
    "url": "https://www.etsy.com/listing/983150412/personalised-oak-photo-block-with-heart?click_key=8ba1eb5cd2c88eca226d8b3ff0745f72d90f1857%3A983150412&click_sum=a3ffba82&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-15&frs=1&etp=1&sts=1",
    "title": "Personalised Oak Photo Block With Heart And Initials | Ideal Gift for Couples | Anniversary, Wedding, Birthday, Mother's Day",
    "description": "A personalised oak photo block, printed with your photo above a love heart containing the initials of a couple, as if carved into the wood.Create a sentimental gift by adding a favourite photo to this solid oak photo block. Add initials to appear in a heart below the image, that appears to have been romantically carved into the wood, to make a thoughtful, sentimental photo gift to cherish for years to come.A perfect romantic gift for a partner on any occasion, including a birthday gift, anniversary gift (specifically fifth wedding anniversary, celebrated with wood!) or Valentine gift.A great gift for the hard to buy for or the person who has everything! Simply add a favourite photo to bring a smile to the face of the recipient.HOW TO SUPPLY YOUR PHOTO:• Please supply your photo AFTER your order has been placed and email to  orders [!at] thedriftingbear.com with your order numberPLEASE NOTE: If your image cannot be cropped to the portrait shape, and is more suited to a landscape format, we will produce your wooden block in landscape for you. The wood colour & grain will show through behind your photo, making the photo appear slightly darker. Please see example images.made from:Each wooden block is handcrafted from natural oak, sourced from sustainably managed forests. Each block is natural, meaning no oil, varnish, wax or stain, just natural wood, sanded on both front and back faces.Your wood block will arrive in either tissue paper or a natural cotton gift bag, ready to give as a gift and will be sent out in plastic free packaging with tracked delivery.dimensions:Standard - 15cm x 10cm, 2cm thick.Large - 15cm x 20cm, 2cm thick.↟ EVERY ORDER PLANTS ONE TREE - As an additional gift to you & our planet, for every order placed, The Drifting Bear Co plant one tree in an area of the world that needs it most. ↟An original design © The Drifting Bear Co.",
    "reviews": [
      "Really beautiful! My partner absolutely loved it. I was nervous about how the image would print onto the wood but it looks amazing. Perfect gift for our 5 year anniversary. Thank you :)",
      "I am so excited to give this gift to my boyfriend for Valentine's Day. If you are looking for a sentimental, quality gift, this is it :)",
      "Got this for our one year anniversary for my Gf, she loved it!!"
    ]
  },
  {
    "productId": "ZhGoFYMfrI",
    "url": "https://www.etsy.com/listing/493522756/personalized-gift-hand-forged-purple?click_key=1888ddf69ceecf170e083143c5eb766b47999158%3A493522756&click_sum=68d9b7a7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-16&frs=1&etp=1&sts=1",
    "title": "Personalized Gift - Hand Forged Purple Metal Rose - Christmas Gift for Mom - Iron Anniversary - 30th Birthday For Her - 50th Birthday Gift",
    "description": "This exquisite hand forged iron rose seems to have come straight out of a fairytale! The metalwork is extremely detailed and the petals and stem look just like the real thing, but unlike a fragile natural rose, this metal flower will be around to be admired for years to come.Purple roses symbolize enchantment and desire, so a purple rose is a fitting gift to send a message of \"love at first sight\". Our purple metal roses will last well after the first blush of passion has worn off and will see you through to your \"happily ever after\".Each rose measures approximately 8.5” tall and is shaped by hand in an authentic blacksmith shop in Quebec, Canada.A name or a date can be engraved on the optional base or on one of the leaves.S H I P P I N GFor US and Canada: Standard shipping is free. Please allow 4 to 8 business days (processing + shipping) to receive your order.Expedited shipping is available in the cart for US customers.For international orders: please allow 2-4 weeks for delivery. Faster shipping is available upon request. Please notify us before your order is placed so we can adjust the invoice for the additional cost. All customs and import fees are the responsibility of the buyer.",
    "reviews": [
      "Perfect gift thanks! Stands up nicely on the base.",
      "Amazing quality, beautiful product. Will definitely do business again!",
      "Blacksmith was effective in communication, gift was excellent, and wife loved it. Would 1000% recommend.",
      "Shockingly fast delivery. The flower looks stunning in person!"
    ]
  },
  {
    "productId": "PLmLBzAASe",
    "url": "https://www.etsy.com/listing/1528718272/personalized-leather-portfolio-zipper?click_key=8b24c317ff282ffa156537ea58cde6b7c44a74d9%3A1528718272&click_sum=01bef046&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-9&pro=1&frs=1&bes=1&sts=1",
    "title": "Personalized LEATHER PORTFOLIO & ZIPPER Padfolio Notepad Notebook Custom Engraved Business Corporate Gifts for Him Dad Men Boyfriend Gift",
    "description": "Personalized LEATHER PORTFOLIO & ZIPPER Padfolio Notepad Notebook Custom Engraved Business Fathers Day Gifts for Him Men Dad Boyfriend Gift▬ 𝗔𝗕𝗢𝗨𝗧 𝗨𝗦 ▬PrecisionMemory aspires to create moments that last a lifetime with our personalized gifts for him & her.• Ships within 24 Hours.• Etsy Star Seller Support.• Designed in Los Angeles, California.• Express Shipping Available During Checkout!Please feel free to reach out to us with any questions.▬ 𝗣𝗥𝗢𝗗𝗨𝗖𝗧 𝗜𝗡𝗙𝗢𝗥𝗠𝗔𝗧𝗜𝗢𝗡 ▬Introducing our Personalized Leather Portfolio Gift for Men – the perfect blend of sophistication, functionality, and sentimental value. Crafted from genuine, high-quality leather, this portfolio exudes elegance and durability. 8.5 x 11.0 inchesWhat sets this portfolio apart is the opportunity for personalization. Make a lasting impression by adding the recipient's initials, name, or a meaningful message. Our skilled artisans will expertly engrave the personalization details onto the leather, creating a truly unique and one-of-a-kind gift.Designed to fit either side bound letter size notebooks or top bound letter (8.5x11 inch) and legal (8.5x11.75 inch) notepads, our padfolio is ideal for taking notes in meetings, delivering presentations or acing the big job interview. It serves as a legal pad holder, providing a convenient option for those who need to take notes on legal pads.● 1 refillable slot for side- or top-bound A4, letter, or legal writing pads● 1 side pocket for loose papers or notes and 1 pen loop● 1 clear window business card holder + 3 slotsIncludes GIFT BOX for Easy Gifting!▬ 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗭𝗔𝗧𝗜𝗢𝗡 𝗗𝗘𝗧𝗔𝗜𝗟𝗦 ▬Please provide your desired custom font/text in the personalization box. Multiple lines are welcome.• See listing gallery images for font options.• Listing images are examples of similar previous work.PERSONALIZATION EXAMPLE:Font: Bickham ScriptFront Text: MichaelBack Text: Best Dad Ever",
    "reviews": [
      "It was a great item",
      "It was a great item",
      "The perfect stylish and practical gift!"
    ]
  },
  {
    "productId": "vMrYmSHKFS",
    "url": "https://www.etsy.com/listing/1596014840/corporate-portfolio-and-smart-thermos?click_key=7fff7ed22b0b99fab334b6bfc11e676ed9e53146%3A1596014840&click_sum=bf47c890&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-10&pro=1&frs=1",
    "title": "Corporate Portfolio and Smart Thermos Gift Box, Company Custom Diary Gift Box, Business Bulk Order Smart Thermos, Company Client Gift Box",
    "description": "Corporate Portfolio and Smart Thermos Gift Box, Company Custom Diary Gift Box, Business Bulk Order Smart Thermos, Company Client Gift BoxIMPORTANT INFORMATION: All set products come in our very high quality and stylish gift box. We can only print logos on our black and navy blue boxes.WHAT'S INCLUDED IN OUR GIFT PACK ?1- Business A5 Notebook Charger Diary2- 16oz Stainless Steel Smart Thermos3- Premium Carbon Fiber Pen4- High Quality Gift BoxPRINTINGWe can print all of our products in the set FREE OF CHARGEPROCESSING TIMEOnce your order is confirmed, we can usually complete printing within 1-3 days.SHIPPING TIMEShipping times vary depending on the shipping states. Typically, delivery is made to New York in 2 days, Texas and Chicago in 3 days, Arizona and Colorado in 4 days, and California in 5 days.Thank you very much in advance for choosing us and wish you success in your work.Best RegardsUNITED PROMO - Corporate Gifts",
    "reviews": [
      "Great quality and great customer service.",
      "I am very happy with the items received. These were gifts for Admin Day. They were received very quickly, and customer service was responsive, helpful, and accommodating. I would definitely purchase more items in the future.",
      "We are very happy that you honored us with your wonderful comments.\n\nThank you very much for your kindness and kindness.",
      "Incredible Quality and service. Will use frequently",
      "We are very happy that you honored us with your wonderful comments.\n\nThank you very much for your kindness and kindness."
    ]
  },
  {
    "productId": "zVGiMkeyYx",
    "url": "https://www.etsy.com/listing/1336593575/personalized-makeup-bag-customized?click_key=7541cd36f9d70fc0a9d2eb2e9234d5931cb3d7e4%3A1336593575&click_sum=f8a260b0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-11&pro=1&bes=1",
    "title": "Personalized Makeup Bag, Customized Toiletry Bag, Monogram Cosmetic Organizer, Gift for Her, Bridesmaid Gift, Maid of Honor, Christmas Gift",
    "description": "Introducing our exquisite Personalized Bridesmaid Makeup Bag, a must-have accessory for creating unforgettable memories with your bridal party!Elegance meets practicality in this stylish, customizable makeup bag, designed to make every member of your bridal party feel extraordinary. It's more than just a bag; it's a keepsake they'll treasure for years to come.Each makeup bag is carefully personalized with the names of your beloved bridesmaids, transforming it into a truly unique and thoughtful gift. Imagine the joy on their faces as they receive their own personalized bag, with their name elegantly displayed.Our makeup bag offers a roomy main compartment, perfect for storing cosmetics, brushes, and all their beauty essentials. Inside, you'll find two optional pockets, ensuring convenient organization and easy access to smaller items.But this makeup bag is more than just storage; it's a symbol of unity and gratitude. Your bridal party will feel a sense of pride and togetherness as they carry their personalized bags, creating beautiful memories together.With an eye for detail, our makeup bag effortlessly blends sophistication and versatility. Its timeless design complements various bridal themes and styles, making it the perfect accessory for any occasion.Whether you're searching for the ideal bridal shower gift or a heartfelt gesture for your bridesmaids, our Personalized Bridesmaid Makeup Bag is the ultimate choice. Delight your bridal party and ensure they feel cherished throughout the journey to your special day.Don't miss the chance to make your bridal party truly unforgettable with these personalized makeup bags. Let us add a touch of elegance and individuality to your celebration, ensuring it becomes a cherished experience for all. Order now and create lasting memories with these personalized treasures.Additionally, our Personalized Bridesmaid Makeup Bag makes for a thoughtful Christmas gift for your cherished relatives. With its elegant design and customizable personalization, it's a versatile present that spreads holiday cheer and warm wishes.Sizes : 20 cm x 11 cm x 9 cm (7.87 inch x 4.33 inch x 3.54 inch)------------------------------------------------------------------------------------------------------------------------------------------Who we are ?At Atelier Yula, we believe that personal style is an expression of individuality and creativity. That's why we offer a curated selection of handmade, personalized bags that are both elegant and functional. Whether you're looking for a unique gift or a stylish accessory, our bags are the perfect choice.We also take the art of personalization to the next level. Each of our bags can be customized with the customer's name or initials, making them one-of-a-kind keepsakes that the customer can treasure for years to come. Our focus on quality and attention to detail means that each bag is made with care and precision, ensuring that every customer is completely satisfied with their purchase.We're a small team of artisanal craftsmen who are passionate about creating beautiful and functional products. Whether you're looking for a stylish tote for everyday use or a unique accessory for a special occasion, Atelier Yula has something for everyone. Shop with us today and discover the art of personalized style!",
    "reviews": [
      "Beautiful item, quick turnaround- no complaints",
      "Fast and accommodating service. Would definitely use it again.",
      "Fast shipping and great quality makeup bags! They are perfect to fit travel sized goodies in and have a loop on the end to hold as you open it, which is a nice option.",
      "My bridesmaids absolutely loved them"
    ]
  },
  {
    "productId": "oifEAWADUf",
    "url": "https://www.etsy.com/listing/1326183511/round-personalized-charcuterie-board?click_key=7fe4e85690b3a1cbca1ac9f75959517540d6a47f%3A1326183511&click_sum=cbad37c0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-12&frs=1&etp=1&sts=1",
    "title": "Round Personalized Charcuterie Board Set/19pcs Cheese Board And Knife Set, Realtor Closing gift, Custom Charcuterie board, Wedding Gift",
    "description": "Show your love to someone special with this fabulous charcuterie board set!4 Fonts to choose from.This large charcuterie board is made from 100% Acacia hardwood, black natural slate, white ceramic bowls, stainless steel knives, forks, wine opener, and food-safe chalk for decorating the board and slate.A perfect gift for weddings, anniversaries, bridal showers, housewarmings, birthdays, Christmas, and more!Size is approx: 17”L x 13”W x 2” HIncludes,1 - Large Charcuterie Board with Slate insert.1 - 19 piece Cheese Tools And Knife Set (See pictures)The board can be personalized with a family name (The Strykers, Brad & Jackie, Est. 2022), a cute saying, a wedding date, etc.I can also add your business logo at no additional charge. Whatever you would like to be engraved, I'll make it happen.*Because this is a natural Acacia wood product, There will be variations in wood color, engraving color, knots, and other natural markings. Each board will be unique.Please contact me with any and all questions, I typically reply within seconds!",
    "reviews": [
      "Great looking. I was able to have something written on it and that came out very nicely. I noticed a slight crack in the wood on the side so hopefully it stays small.",
      "Gorgeous! I purchased this as a gift for my daughter and son-in-law. They loved it!",
      "Stunning product.  Fast shipping. This is my favorite client closing gift with a fine bottle of wine.",
      "The quality of the item was great. This was ordered as a gift and was perfect! The packaging was good quality and sturdy. Will definitely look at other items they sell to purchase!"
    ]
  },
  {
    "productId": "IcIjVoZmdc",
    "url": "https://www.etsy.com/listing/1618644367/anniversary-gift-for-him-boyfriend-gift?click_key=2c4405c434e14b2d01260c1374a76275acfad7ae%3A1618644367&click_sum=2caf1ae1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-17&pro=1&etp=1&sts=1",
    "title": "Anniversary Gift For Him Boyfriend Gift For Husband Best Gifts For Him Unique Valentines Gift You're The Best Thing I Found On Internet AG18",
    "description": "You are the BEST thing I've ever found on the internet. A Candle that is sweet and humous, it's the perfect gift for your loved one.Product Details9oz Amber Jar | 7oz Net WeightDimensions: 2.85” wide x 3.5” tallBurn time: Approximately 40-50 hoursHandcrafted in the U.S.AScent Note:[Ocean Breeze]A smooth and elegant blend of soft floral notes. The first comes with ozone, followed by the floral notes of jasmine, Lily of the Valley, and green leaves, while the base note is of wood and tonka bean.[Warm+Cozy]A Winter-Scented Holiday Candle You Must Have! Sitting next to the fireplace with a glass of mulled wine, enjoy the warm and cozy day with our beautiful scented candle specially made for you.[Pumpkin Spice]A warm blend of Pumpkin, allspice, ginger, cinnamon, nutmeg, ground cloves, and Vanilla. Substantial, warm, inviting fall in a jar—a best-scented candle for fall and the holiday season.[Teakwood]Masculine, bold, and complex. Spicy, woody, and smoke. Some call it the boyfriend scent.[Strewberry Cake]Light it up. This \"Piece of cake\" will make your day. Immerse yourself in the irresistible aroma of a freshly baked cake with the delightful notes of sugary strawberry, raspberry, and Vanilla. A hint of sweet Tonka and a splash of white freesia add a touch of elegance, culminating in the subtle sweetness of velvety white frosting.[Champagne]Cheers to life's beautiful moments with our Champagne Toast Candle. This celebratory scent features bright and crisp champagne bubbles that are expertly balanced with the subtle sweetness of pink sugar and soft musk tones. Perfect for any occasion. Light it up and raise a glass to life, love, and all the beautiful moments in between!Candle Care:Always trim wicks to 1/4 inch before lighting.The first time you light your candle, let it burn for 3-4 hours to allow the melted wax to reach the edge of the container and prevent your candle from tunneling.Burn 3-4 hours maximum use on a stable.SHIPPING & HANDLING:Your order will ship within 3-5 business days. We use USPS first and priority mail and will include delivery confirmation. It usually takes between 3-5 business days in the United States. If you are in RUSH, please get in touch with me. I will accommodate express and rush orders.Follow us and tag us.Instagram: @paperwhitecandlesThank you so much for visiting us. Please get in touch with us with any questions.",
    "reviews": [
      "It was my valentine's gift. What do you get for the guy that wants nothing? A candle.",
      "Everything was perfect. Exactly like advertised",
      "This is a great candle",
      "The candle itself is wonderful but more than that, the owner is SO helpful and I could not recommended ordering from this small business more! The product is so high quality and smells incredible and came faster than predicted! The gift was loved by my partner and I must say, if you’re considering ordering from here, you 1000% should."
    ]
  },
  {
    "productId": "tBtFzsvOEJ",
    "url": "https://www.etsy.com/listing/560548441/wedding-gift-for-couple-jewelry-dish?click_key=011c6627869f93e0449a64d343d994da27d8b2f4%3A560548441&click_sum=4c8e4b91&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-18&etp=1&sts=1",
    "title": "Wedding Gift For Couple Jewelry Dish / Date and Initials / Wedding Gift / Personalized Gift / Personalized / Engagement Gift / Bridesmaids",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "These make a great gift for a special occasion. They are beautifully made, and having them personalized makes them the perfect keepsake.",
      "This was a lovely gift :)",
      "Beautiful!!! my bonus daughter will adore it!!!"
    ]
  },
  {
    "productId": "qinamHPgOy",
    "url": "https://www.etsy.com/listing/1462563718/personalized-mens-leather-toiletry-bag?click_key=37d4a2d89e8bc87e4a04468b9a0b4c0ef583e1dc%3A1462563718&click_sum=c2da20f9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-19&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Men's Leather Toiletry Bag Groomsmen Gifts, Dopp Kit Men's Leather Accessory, Christmas Gift for Him, Anniversary Gift for Him",
    "description": "✨ Personalized Groomsmen Gifts , Leather Toiletry Bag, Custom Dopp Kit, Travel Bag, Monogram Makeup Bag,Gifts for Dad , Boyfriend, Husband, Him, Birthday Gift For Dad Valentines Day Gift For Him Dopp Kit Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for Him, Anniversary Gifts, Wedding Gifts, Bridesmaid Gifts,✨✨ Thank you for stopping by ✨✨✨Introducing our luxurious and rugged Dopp kit/Toiletry bag made with premium crazy horse leather - the ultimate accessory for your travels, gym sessions, or daily routine. This bag is crafted to perfection, offering both durability and elegance in one perfect package.✨Our Dopp kit is designed with top-of-the-line crazy horse leather, which is known for its durability and natural character. The unique grain patterns and marks on the leather create a distinctive and rugged look that sets this bag apart from other toiletry bags on the market.✨With its spacious main compartment, this bag provides ample storage options for all your essentials. You can easily fit your toothbrush, toothpaste, razor, shaving cream, deodorant, and other grooming products in this bag, and still have room for other items like phone chargers, headphones, or even a small book.✨Our Dopp kit makes a perfect gift for anyone who loves quality craftsmanship and luxurious accessories. Whether it's a birthday, anniversary, or Father's Day, this bag is sure to impress. And with its versatile design and premium construction, it's sure to be a gift that they'll cherish for years to come.✨✨ SIZES ✨✨✨XL Dopp Kit:Approximately 9.5” x 4.5” x 4.5”✨Large Dopp Kit:Approximately 8” x 4” x 4”✨Small Dopp Kit:Approximately 7” x 3.25” x 3.25”✨✨ Care ✨✨✨To keep your crazy horse leather Dopp kit/Toiletry bag looking its best, it's important to care for it properly. Use a soft, dry cloth to clean the leather as needed, and avoid using any detergents or cleaners that could damage the material.✨Over time, scratches and bumps may appear on the leather, adding to its vintage charm. If you wish to minimize the appearance of these marks, you can use leather polish to help restore the bag's original appearance.✨When wiping or polishing the leather, it's best to use circular motions to avoid damaging the material. If the leather gets wet, be sure to wipe off any moisture and hang the bag to dry to prevent mildew from forming.✨By following these simple care instructions, you can help your crazy horse leather Dopp kit/Toiletry bag look its best for years to come✨✨ Color of Leather ✨✨✓ Tan✓ Black✓ Brown✨✨ Shipping ✨✨→ We dispatch orders within 1-2 business days as mentioned above✨✨ Shipping time ✨✨➢ Canada ; 3-8 business days➢ US ; 2-6 business days✱✱✱✱ Please feel free to ask any questions. Our customer service is ready to answer all of your questions 7/24 ✱✱✱✱",
    "reviews": [
      "It was quick and efficient and looked exactly as it should",
      "Good quality, perfect for gifts.",
      "I'm beyond impressed with my purchase. I look forward to ordering more, seller was great with communication even with an personalization not on the listing and SO quick! Thank you!!"
    ]
  },
  {
    "productId": "LQwOriukoi",
    "url": "https://www.etsy.com/listing/631097298/bridal-shower-gift-speckled-minimalist?click_key=0c8b57845a9dc193fae8c609f0619907da1f12a0%3A631097298&click_sum=a657d2af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-20&etp=1&sts=1",
    "title": "Bridal Shower Gift, Speckled Minimalist Ring Dish, Jewelry Dish, Engagement Gift, Bridesmaids Gift, Personalized Gift for Her, Ring Tray",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "This is adorable! Perfect size for our details shots",
      "It is the perfect engagement gift!",
      "Very cute shipped quickly happy with order",
      "Such a pretty ring dish and great quality!"
    ]
  },
  {
    "productId": "cJlGMhZQOq",
    "url": "https://www.etsy.com/listing/992041090/personalized-toy-gifts-puzzle-piece?click_key=fc59fad4695231a1c0171a079586e7a912d1ac56%3A992041090&click_sum=b96c3577&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-21&pro=1&frs=1&etp=1",
    "title": "Personalized Toy Gifts, Puzzle Piece Names,  Custom Wooden Name Puzzle for Toddlers, Baby Keepsake, Best Baby Gift, Toys for 18 Months",
    "description": "A well designed name puzzle will be a unique toy gift for 1-4 years old. It's could be a great early learning toy and beautiful name sign as nursery decor.As listed is a personalized wooden name puzzle with 2 lines of adorable animal heads. Babies could learn to spell their names and tell animals while playing with this name puzzle. Below the animals, the name of each will be laser engraved so it could also be played as a matching game.>>>> WHAT'S SPECIAL <<<<♦ Completely Colored Letters- Letters on a common name puzzle are only colored on the front side. We do far more than that. Front, back and edges of each TYU name puzzle letter will be completely colored with water-based, non-toxic inks.♦ Free Engraving- TYU will not charge you a cent when you require us to engrave a message on anywhere of the puzzle. No limit on letter quantities.♦ Free shipping to USA, Canada, Australia, UK and most EU countries. No MOQ.♦ More Choices, More Customizable- TYU provides 20 different colorful animal head options and 25 color choices for letters. Pick your favourites and make your gifts one of a kind.♦ Light Weight, Soft Touch- TYU name puzzles will all be made of linden wood which is lightweight and soft, perfect for babies to play with.♦ Safer- Laser cutting applied for all parts to make sure every piece is cut neatly and smooth to avoid hurting babies' fingers.-  Pegs are secured with hidden nails so won't fall off and bring choking hazard.Each puzzle set is 3/8 inch thick in total. Letters are 1/5 inch thick and are raised an 1/8 inch above the front of the puzzle so it's easy for a kid to play with.This name puzzle could be made for a single name with up to 10 letters(no spaces). If you need a longer name, please message me first, I will be happy to help.Want to have a look at other unique designs we have? Here is the whole section:https://www.etsy.com/shop/Tyuweddinggifts?ref=simple-shop-header-name&listing_id=790066607§ion_id=24125360>>>> HOW TO ORDER <<<<You will be required to type you requests in the personalization box when you checkout. Please write below:1)  name of the baby2) color number for each letter(check the last image for my color list)3) animal numbers>>>> TURNAROUND <<<<All puzzles are custom made made to order. Please allow 10-15 business days for delivery after ordering.",
    "reviews": [
      "This makes a beautiful new baby gift!",
      "cute for a baby girl",
      "Just love it!  Great gift! Idea for baby!"
    ]
  },
  {
    "productId": "OLzcKIGB3Y",
    "url": "https://www.etsy.com/listing/1393063139/personalized-cat-frame-custom-cat-name?click_key=9780bc6077fb901117542e0e5be3bf976792d9f8%3A1393063139&click_sum=7fd9e139&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-22&etp=1&sts=1",
    "title": "Personalized Cat Frame | Custom Cat Name Picture Frame | Gifts for Cat Lovers | Wooden Cat Photo Frame",
    "description": "This personalized cat picture frame makes a great gift and cat memorial for the cat lovers out there. The pet's name is laser cut from solid wood for a 3D effect.The entire frame is handmade from natural poplar wood - no MDF, plywood or veneer. Due to the nature of the wood, please expect slight variance in the tone and pattern of the wood grain.The frame can be used easily on a tabletop by inserting the provided stand into the back.In place of glass, 1/8\" thick acrylic protects the photo without risk of shatter.Optional: For an additional fee, enjoy the convenience of having your photograph printed and inserted into the frame - - a great option for gifts!  Photos will be printed on medium weight glossy photo paper with Canon PIXMA technology. The designer will crop your photo to create the best final appearance for your custom frame. If you prefer the photo to be cropped a specific way, please indicate via etsy message.------------------------------------Sizes:SMALL: 4\" x 5\", holds a 2.5\" x 3.5\" photoSQUARE: 5\" x 5\", holds a 3.5\" x 3.5\" photoMEDIUM: 6\" x 8\", holds a 4\" x 6\" photoLARGE: 7\" x 9\", holds a 5\" x 7\" photo",
    "reviews": [
      "I don’t have anything to say.",
      "The quality is absolutely amazing! It was a very thoughtful gift and my co-worker absolutely loved it for her beloved pet that passed away.",
      "The custom frame is awesome - I absolutely love it!",
      "Absolutely perfect in every way! Definitely reccomend"
    ]
  },
  {
    "productId": "FPUCwDArFs",
    "url": "https://www.etsy.com/listing/546569019/wedding-ring-dish-jewelry-dish?click_key=cd46836f06dfad62dc8ca9daf0ee4d3cd9659123%3A546569019&click_sum=0069274e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-23&etp=1&sts=1",
    "title": "Wedding Ring Dish / Jewelry Dish / Bridesmaids Gift / Wedding Gift / Engagement Gift / Gift for Her / Gift for Mom / Personalized Ring",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "As expected and arrived quickly",
      "Great engagement gift. Loved it",
      "This item was an amazing gift to my best friend after her engagement!"
    ]
  },
  {
    "productId": "CEovTNhlhZ",
    "url": "https://www.etsy.com/listing/598548597/personalized-handpainted-name-keychains?click_key=11893af5d74556c964916b68b76ce6adc2ec1d43%3A598548597&click_sum=6380c05e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-24&frs=1&etp=1&sts=1",
    "title": "Personalized Handpainted Name Keychains - Wood keychain,  gift for her, bridesmaid gifts, colorful keychain, custom keychain, mother's day",
    "description": "Handpainted wood custom personalized keychains.This listing is for 1 keychain.The keychain will be painted similar to the keychain with the corresponding tassel color in the listing photo.Longer names will have smaller lettering to fit the keychain. Names will be printed using capital letters.DETAILS:Keychains are attached to a key ring and measure appox. 4.5  inches long. Keychain is laser cut out of 1.75 birch plywood.HOW TO ORDER:Please select the tassel color you would like from the drop down menu.PACKING AND SHIPPING:Please do not use the notes section of your order to relay time sensitive information (such as needing an address change). If you need to relay information regarding shipping, please message us directly. Requesting an arrival date in the notes section of your order does not guarantee it will arrive by that day, but we’ll do our best! Please see our Policies section for more information about turnaround times.As soon as your item ships, Etsy will send a shipping notification that includes tracking information.Our packaging is important to us! We don't offer gift packaging at this time, but all orders are packaged with Jill Makes branding and make great gifts.Please visit our FAQ section for further shop information.Thanks so much for your support! We love making colorful and personalized pieces for you!",
    "reviews": [
      "Well made. Vibrant colors. Better than pictures depict",
      "Great gift!  So colorful and cute!",
      "Super cute as usual. I’ve been buying from Jill since 2016. Love the wood and colorful paint together.",
      "These were great gifts.  They look better in person.  Would definitely use this shop again"
    ]
  },
  {
    "productId": "EN6iFbGFeP",
    "url": "https://www.etsy.com/listing/1580151882/personalized-custom-name-blanket-3-sizes?click_key=a1a7707e0a49f3fb17a656b99a4959f00b070062%3A1580151882&click_sum=a64a3d21&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-13&pro=1&bes=1&sts=1",
    "title": "Personalized Custom Name Blanket, 3 sizes Fleece/Sherpa, 30+ Colors, Baby/Girl/Boy/Adult Blanket, Custom Gift, Personalized Blanket",
    "description": "Wrap Your Loved One in Warmth and Magic: Custom-Printed BlanketsEvery child and grownup deserves the warmth and comfort of a soft, cozy blanket that's uniquely their own. Our custom-printed blankets are designed to make bedtime and cuddle time extra special. Crafted with the softest materials and customizable with your loved one's name, these blankets are more than just a source of warmth; they're a canvas for dreams and imagination.Our blankets are printed in the United States onto a super soft minky fleece fabric that will stay plush and vibrant through a lifetime of washings.With our state-of-the-art shop, we can turn around orders in 1 to 3 days. Pick your perfect pairing of color and font style, supply the name, and you'll have an amazing gift that's truly one-of-a-kind in about a week!Notes* Our blankets are printed on one side, and the reverse side is a clean white color.* We will try to reach out if we notice any obvious typos or mistakes in our customization selections.* Machine wash cold, and tumble dry on low heat",
    "reviews": [
      "Great quality, quick shipping, much softer than expected. They look amazing!",
      "Great product, i would definitely recommend",
      "I got this as a gift for my son and he absolutely loves it. It arrived very fast and is great quality. Definitely recommend.",
      "Excellent Quality and fast shipping"
    ]
  },
  {
    "productId": "NfhEaQcRXu",
    "url": "https://www.etsy.com/listing/1505125587/last-nerve-candle-funny-candle?click_key=0c64bab53a0280ae600b79099641e74fa0e5d448%3A1505125587&click_sum=2c62613b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-14&pro=1&bes=1",
    "title": "Last Nerve Candle, Funny Candle, Personalized Candle Gift, Custom Name Candle, Funny Gift, Last Nerve Gift, Mom Gift, BFF Gift, Gift for Her",
    "description": "This funny candle will make a great gift for a friend, co-worker or loved one. Customize it with a name!Our coconut wax is a vegan blend, gluten-free, toxin-free, paraben-free, and phthalate-free, and comes from renewable sources.Product Details & Ingredients:Featuring an elegant straight-sided amber glass jars with modern minimalist labels - these candles are perfect for gift giving!Wax Color: Natural (No Dyes)Wick Material: Cotton (Lead and Zinc free)Wax Material: Hand-Poured Coconut Soy Wax Made in the USAHand Poured in the USAStandard 9 oz Amber Jar | Net Wt: 8.7 ozDiameter: 2.75 inHeight: 3.5 inBurn time: Up to 50 hours +Small 4 oz Amber Jar | Net Wt: 3.7 ozDiameter: 2.25inHeight: 2.75 inBurn time: Up to 20 hours +Candle Care:Trim Your Wick to 1/4\" Before the Candle is Lit Each Time. Allow the wax to melt to the edges of the jar every burn to prevent tunneling - especially important on the first burn! Never leave a lit candle unattended, and don't burn for more than 4 hours at a time. To protect the surface below from heat, place your candle on a coaster or tile. Don't burn your candle if only 1/4\"-1/2\" of wax remains. Lighting a candle without enough wax can overheat the jar. Never Leave a Burning Candle Unattended.Please find the details for all our fragrances below.Beachwood - Refreshing fragrance combines woodsy and marine notes into a luxurious, aquatic accord. A balance of sea salt, orange peel and green grass fold into waves of sage and eucalyptus mid notes, which rest on an island of moss, teakwood, and patchouli.Blackberry Vanilla - Mouthwatering blend of ripe berries and creamy vanilla. Balanced aromas of sweet, dark berries with velvety vanilla. A top note of black cherry gives away to a heart of raspberry, strawberry and plum, while base notes of vanilla, sugar and musk keep this fragrance grounded.Blood Orange - A melody of citrus gives way to vetiver and cedar with green leaf undertones. This fragrance has a bright, punchy flair with a slight creaminess that keep it balanced. Citrus fragrances meld into a strong, bright fragrance with a hint of peach and a naturally derived sweetness.Cinnamon Chai - The comfort of Cinnamon Chai, a centuries-old beverage, is beautifully captured with warm notes of vanilla paired with cinnamon, cardamom, and orange peel. The ultimate comfy, cozy fragrance.Evergreen - Evergreen has mild top notes of lemon peel and cypress grounded by earthy undercurrents and a woody, fir balsam core that makes you think of the holiday season. Evergreen is the perfect aroma for creating a festive holiday setting or enjoying a quiet winter evening by the fire.Sage & Cypress - An herbal, lightly coniferous scent with a hint of smoke, this fragrance has a sophisticated base of palo santo and patchouli dusted with notes of muck and smoke. This blend grows into heady mid-notes of sage and cypress, followed by spruce and bergamot top notes.Wild Fig - Wild Fig is an intricate fusion of woody and floral aromas. Reminiscent of a sun-drenched grove, hints of sweet freesia and ozone open up to sun-ripened fid surrounded by light jasmine, cherry blossom, and geranium. Notes of green leaves, bamboo, and moss add a lush, green quality balanced by shades of patchouli and saffron.",
    "reviews": [
      "Fast and thorough! Arrived on time and in quality-packaging.",
      "Great gift item, no complaints!",
      "Great gift item, no complaints!"
    ]
  },
  {
    "productId": "FwtycxScMp",
    "url": "https://www.etsy.com/listing/1568033825/personalized-men-duffle-bag-groomsman?click_key=48f252963a2140ce2f1bc1e8c5c32fb1f0b0b579%3A1568033825&click_sum=7b87c149&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-15&pro=1&frs=1",
    "title": "Personalized Men Duffle Bag, Groomsman Gift, Leather Travel Duffel Bag for Men & Women, Gift for Boyfriend, Custom Travel Companion",
    "description": "Personalized Men Duffle Bag, Groomsman Gift, Leather Travel Duffel Bag for Men & Women, Christmas Gift Leather BagIntroducing our Personalized Men's Duffle Bag, a timeless travel companion designed for the modern adventurer. Crafted with meticulous attention to detail, this duffle bag is the epitome of style, functionality, and durability.Handcrafted from premium full grain leather, this bag exudes a sense of sophistication and luxury. The full grain leather not only adds a touch of elegance but ensures the bag's longevity, developing a rich patina over time that tells the story of your journeys.This duffle bag is thoughtfully designed to cater to the needs of both men and women on the move. The spacious interior is lined and features a secure zippered pocket, allowing you to organize and stow your essentials with ease. Whether it's a weekend getaway or a week-long trip, this bag offers ample space for your clothing, toiletries, and travel essentials.Make it truly yours by adding a personal touch. We offer customization options, allowing you to emboss your initials, a name, or a meaningful date onto the leather, creating a unique and cherished item. This personalization adds sentiment and individuality to your duffle bag, making it a perfect gift for groomsmen or a cherished Christmas present.Whether you're a business traveler, or a weekend explorer, this duffle bag is your reliable companion. The dual handles and a detachable, adjustable shoulder strap provide flexibility in carrying options, making it convenient to carry however you prefer.Elevate your travel experience with this Personalized Men's Duffle Bag. It's more than just a bag; it's a statement of style, a reflection of your personality, and a lasting reminder of unforgettable adventures.SİZESDUFFLE BAGSmall Size: 14\" x 10'' x 10\" inchesX-Large Size: 21\" x 11\" x 11\" inches (Has separate shoe compartment )LUGGAGE TAG3.2” x 4.25” InchesCOLOR OPTIONSBlack, Dark Brown, Light Brown",
    "reviews": [
      "Very high quality. Received in a few days. It’s a gift and it’s perfect!",
      "I Would definitely order again!",
      "I purchased for a gift. My husband loves it and the monogram.",
      "I purchased as a gift. My son loved it and the monogram was perfect."
    ]
  },
  {
    "productId": "wJM5QZLAon",
    "url": "https://www.etsy.com/listing/1202760025/gift-for-him-mens-leather-dopp-kit?click_key=b78dc420ac62a9d94f3de265690ef60edb5b28ee%3A1202760025&click_sum=e76a21cc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591208-12-16&pro=1&frs=1&bes=1",
    "title": "Gift for Him, Men's Leather Dopp Kit, Personalized Groomsman Gift, Men's Leather Accessory, Custom Mens Shave Bag, Anniversary Gift for Man,",
    "description": "Personalized Leather Dopp Kit, Third Anniversary Gifts For Men, Leather Toiletry Bag, Birthday Gift For Dad, Valentines Day Gift For Him, Dopp Kit, Travel Bag, Personalized Groomsmen Gift, Custom Leather Toiletry Bag, Leather Personalized Gift, Mens Toiletry Bag, Father’s Day Gift, Birthday Gift, Gift for HimMaterials: %100 Genuine Full Grain Cowhide Leather, Italian Leather, Distressed Leather, Reliable Smooth Heavy-Duty Zipper**Get it fast! Free Ships out by USPS when you order up to 2PM(ET) from New JerseyITEM SIZEXL Dopp Kit:Approx. 9.5\" x 4.5\" x 4.5\"Large Dopp Kit:Approx. 8.25\" x 4.25\" x 4.25\"Small Dopp Kit:Approx. 7\" x 3.9\" x 3.9\"COLOR OPTIONS-Light Brown-Dark Brown-Blue-Antic BlackPERSONALIZATION INSTRUCTIONSWe will engrave your initials, names or monograms to the bottom right corner of the bag. Also we can engrave your handwriting, messages or pictures such as family photo, pets photo, team logo groomsmen photo ect. to the middle of the bag. Please specify your personalization request at the personalization section.HOW TO ORDER________________________________1. Please Select Your Quantity, Color and Size then Add This Listing to Your Cart.Example: Design 9, Groomsmen, Anthony,Example: Design 11, SFR, 7/2/2023Example: Design 1, Anthony2. At the checkout page, enter the personalization information for the item in the labeled box 'Note to CraftCornerHouse'.👀👉Please don't forget to specify which design you want.👈🏽👀If you don't specify which design you want,I use \"Design 6\" for Initialsand \"Design 3\" for Names as the default design.► We love custom orders, so if you don’t find what you are looking for or if you have a custom idea please contact us.If you are looking for a perfect men's gift, you need to look no further. We use premium-grade leather to produce beautiful handcrafted and extremely durable toiletry bags which are a timeless classic gift for any occasion: Birthdays, Father's Day, Graduations, Weddings, Travels, you name it.***Want to order 9 or more items? Contact for bulk pricing!If you have any questions or need help regarding our products, get in touch with us!Thank you for visiting our shop!",
    "reviews": [
      "Lovely and my husband loved it",
      "Great product and quick shipping",
      "Very high quality and beautiful craftsmanship!",
      "Gorgeous craftsmanship\nBeautiful design and a very special gift"
    ]
  },
  {
    "productId": "fjRWX2FuUs",
    "url": "https://www.etsy.com/listing/1157975065/personalised-leather-keyring-monogram?click_key=122654f0d7e4e29d648158770f3981ebe65e38b6%3A1157975065&click_sum=61fecdb6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-25&etp=1&sts=1",
    "title": "Personalised Leather Keyring  Monogram Initials - Couples Gift Pair of Keyrings Valentines Hearts Love Married BF GF Christmas Birthday",
    "description": "Colour may vary from listing imagesMonogram Initials Keyrings x2Made in house.Shipped within 1 business day!All items made to order.Perfect for all occasionsSingle side engraveIf purchased with gift box, one is supplied",
    "reviews": [
      "This was a gift - it came on time and looks perfect!",
      "Very good quality leather, feels like it would last, had a little hiccup with delivery but the seller was amazing would recommend",
      "Perfect little unusual gift for a couple … good value and quality. Arrived promptly"
    ]
  },
  {
    "productId": "WF4JGYagSy",
    "url": "https://www.etsy.com/listing/856209529/wooden-personalized-name-puzzles-first?click_key=391a7429940efb62f3952ed46b66c0f9ba85126d%3A856209529&click_sum=5118984b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-26&pro=1&frs=1&etp=1&sts=1",
    "title": "Wooden Personalized Name Puzzles First Christmas Gift Personalized Name Puzzle for Kids Personalized Puzzle 1st Birthday Girl Gifts Toys",
    "description": "Welcome to our store, where you can find beautiful Wooden Name Puzzles for toddlers. Our puzzles are designed specifically for young children and follow Montessori principles.Celebrate your little one's First Christmas with a unique and personalized Baby Name Puzzle. It makes a thoughtful Baby Shower Gift or a special keepsake for your own child. Each puzzle is carefully crafted to feature your baby's name, creating a truly personalized touch.Our Wooden Name Puzzles are not only fun and engaging but also promote early learning and fine motor skills development. They are made from high-quality wood, ensuring durability and safety for little hands. The custom design allows you to choose the colors and patterns that best match your child's style and preferences.These custom puzzles are not only great for toddlers but also make wonderful first birthday gifts. They provide hours of educational and interactive play, stimulating your child's cognitive abilities and hand-eye coordination.At our store, we take pride in offering custom-made baby gifts that are both meaningful and beautiful. Our wooden baby toys and puzzles are crafted with love and attention to detail, making them cherished keepsakes for years to come.Shop now and discover the joy of giving a personalized and educational gift with our Custom Name Puzzles.SAFETY AND QUALITY.Baby safety is the most important thing for us. We use only natural wood and water-based paint that is absolutely safe for children. All edges and parts of the puzzle are polished to the ideal. We give this particular attention.GUARANTEED DELIGHT.If you do not like the puzzle, we will refund your full price.",
    "reviews": [
      "Return customer.  Highly recommend this seller.  Quality of puzzle is amazing.   Cant wait to give it to my grandbaby.  .  Thank you again!",
      "The name puzzle arrived as expected in terms of the product. It did take longer to arrive then expected but that wasn't too big of a deal.",
      "Items are better than I imagined!  I bought these as gifts and the recipients are going to be SO happy!  Great work!!"
    ]
  },
  {
    "productId": "zeLbJCgeWZ",
    "url": "https://www.etsy.com/listing/1607549209/custom-diaper-caddy-personalized-baby?click_key=2464e8daeda3522a57edb9140c44c38047e73929%3A1607549209&click_sum=7dd47cd6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-27&etp=1",
    "title": "Custom diaper caddy personalized baby basket personalized basket baby shower name gift baby shower gift basket nappy caddy diaper bag baby",
    "description": "Elevate your baby shower gifting with a custom diaper caddy, personalized baby basket, or a name-engraved gift basket. Whether it's for a baby shower or a thoughtful newborn present, the personalized name adds a special touch to the essential nappy caddy or diaper bag.🧸 These would make a great gift as a personalized baby shower gift, gift basket for newborn, custom diaper basket, custom name gift, gift from grandma, gift from aunt, personalized diaper caddy, and more.✨ You can add a name, design, or both!✨ Ordering more than one? You may choose a different yarn color for each basket! Also, see this listing for basket sets of 3 (S,M,L!):https://etsy.me/3DeGAkd✨ Baskets may be shipped folded and need to be reshaped, reshaping instructions are included.✨ Design details & Sizes:✧ Yarn i-cord, handmade✧ Sturdy rope basket with handles and a removable organizer insert📏 Medium: 14.2\" x 8.7\" x 7.1\"📏 Large: 15.5\" x 10\" x 8\"✨ How to order:✧ Select your color and size from drop downs at checkout.✧ In the personalization box add desired lettering color and name or design you would like on the basket.*(If you need to color match message us pictures)✧ ADD TO CART✨ Personalization example:1.  Enter, name, word or design2. Enter yarn color per listing (A-Y)EX.1. Oliver2. B✨Important note:✧ Basket comes with a removable divider but is not pre-packaged with gifts.🌟Check out our other best sellers! 🌟✨ Personalized gift basket:https://etsy.me/3OJqp4p✨ Dog toy storage:https://etsy.me/3usHokG✨Our most popular shop sections!:+ Personalized diaper caddies 🍼https://etsy.me/3T1ysw7+ Personalized gift basket:https://etsy.me/3OJqp4p+ XL Dog & puppy toy storage baskets 🐕‍🦺https://etsy.me/3usHokG+ Dog & puppy toy storage baskets 🐶https://etsy.me/3usHokG+ Custom corduroy pillow cases 🧸https://etsy.me/3wtftBq+ Apparel for mom 🌿🌷https://etsy.me/3uHM8CP🤩Have a unique idea for your kids room? Please reach out so we can coordinate to make your ideas come to life!🤩📍Shipping📍All of our items are packaged with care. You will be provided with a tracking number once your items have shipped, please check our shop announcement for current processing times. Ground shipping the default shipping method and you may upgrade at checkout if a faster shipping time is desired. Once a package is is handed to the shipping carrier Llama Loon LLC is not responsible for any delays in shipping.🦙 Back to our shop 🦙http://www.llamaloon.etsy.com✨ About us:✧ All items are designed and produced with love in our workshop, located in Saint Paul, MN 🌲🦌✧ Check out our shop announcement for current processing times✧ Please send us a Message if you have any questions about ordering!✧ We stand behind the quality of our products 👍📸 Check out our Instagram for exclusive discount codes, customer and new product sneak peeks, customer photos and behind the scenes!:🦙 Instagram:@LlamaLoonhttps://www.instagram.com/llamaloon/📝Copyright © 2023 by LlamaLoon. All rights reserved. This design or any portion thereof may not be reproduced or used in any manner whatsoever without the express written permission of Llama Loon LLC. Duplication of intellectual property is illegal and all infringements are subject to fines and penalties. Failure to comply will result in legal action.",
    "reviews": [
      "Great communication. Very beautiful diaper basket!!",
      "Thank you THANK YOU!! 🥰",
      "The item met my expectations, thanks!",
      "Enjoy your day! Thanks for taking the time to leave us this review 🤗",
      "This little basket is adorable!  Perfect caddy for all different stages of babies - newborns to toddlers",
      "Thank you so much! We love how you pointed out that your basket can grow with your little. Our littlest is 2.5 now and we still use it daily!! Was so SO helpful during the younger days too when we would carry up and down the stairs & had everything we needed! We appreciate you, enjoy your day!! 🥰"
    ]
  },
  {
    "productId": "ttgXjuIkVQ",
    "url": "https://www.etsy.com/listing/688445923/personalised-solid-copper-photo-print?click_key=88b628373ffe60c2ecaf278e91a66b570a705c63%3A688445923&click_sum=96456c1f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-28&frs=1&etp=1&sts=1",
    "title": "Personalised Solid Copper Photo Print",
    "description": "A beautiful way to display a cherished photo, complete with your own text and personal message.This solid metal photo print looks fantastic with your Instagram pictures, selfies, family photos, and Polaroid-style snaps. The metal has a brushed finish which we print directly onto, so your photos will look great. The prints are waterproof and highly scratch resistant too.Choose from two sizes, medium and large. Create a beautiful display by combining different sizes and metals.Like all of Oakdene Designs products, our copper prints are manufactured and printed in England.You can add personalised text underneath the image as well as having the option to add a message to the bottom of the product, this is great for gifting occasions or simply adding information about the image.If you would like specific line breaks please include a '//' where you would like these.Choose from solid copper, stainless steel or brass. All metals have a brushed finish.We recommend the photo size to be a minimum of 260 x 260 pixelsPLEASE NOTE: Images that are not square - i.e rectangle - will be cropped to fit a square image. We do not provide proofs unless requested. Please open an enquiry after ordering, to request a proof, or for any other issue.-------Made from:Made from a single sheet of thick folded copper, stainless steel, or brass all with a brushed finish. Printed in special hard wearing and waterproof inks directly onto the metal, with a clear varnish printed over the image to further enhance the quality and finish.This product and its components are designed, sourced, and manufactured in England.-------Dimensions:Medium: H12 x W10 x D3cmLarge: H17 x W14 x D4cmDimensions are to the nearest centimeter.",
    "reviews": [
      "Perfect anniversary gift for 7 years!",
      "Love this! Based on the pictures of previous orders I went with a black and white photo which did not disappoint! Excellent quality.",
      "Very pleased with product & quality.",
      "Lovely product that arrived quickly and in lovely packaging! Will definitely be ordering again!"
    ]
  },
  {
    "productId": "OeqgiaIHJB",
    "url": "https://www.etsy.com/listing/940721551/personalised-custom-leather-bookmark?click_key=645f91152113e708c34fe27b6909d448852ee74b%3A940721551&click_sum=58d01b8c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-29&etp=1&sts=1",
    "title": "Personalised Custom Leather Bookmark Anniversary Gifts, Personalized Gift, For Him, Gift for Her , Mother's Day Gift",
    "description": "Are you tired of dog ears pages in your book and not knowing where you left off when you are reading? We were too, so we decided to fix that by creating the most DESIRED and compelling personalised leather bookmarks on the market. With our personalised Leather Bookmark, you are guaranteed in not losing your place in a book or resorting to folded corners.Nothing beats a freshly designed sleek personalised leather bookmark to help you keep track of the pages when reading.Whatever your style is, we designed a versatile enough personalised bookmark to handle it.HOW TO ORDER1. Please make your leather colour selection, then select your tassel colour2. In the personalisation box, please enter the personalisation style of your choice, then your messageWe emboss in capital letters and numbers, and we also have available the following symbols: @ # & . ♥ ♡☆ % ? ! \" \" / 'LEATHER COLOURWe have a variety of 5 premium leather colours for you to choose from for both bookmark and tassel colour.PACKAGINGWe take pride in our packaging to safely deliver your products to you so we offer a stylish and elegant bookmark box for those magical special gifts, please add that from the drop-down menu when selecting your leather.DIMENSIONS / SIZELength : 18cmWidth: 2.1 cmLeather : PremiumLeather Type: Vegetable Tanned ( no chemicals )Origin: ItalyPERSONALISATIONEngrave the recipient's name, a heartfelt message, or a meaningful quote, that will transform this bookmark into a one-of-a-kind special memory to be treasured for a lifetime. Whether it's for a bookworm, a student, or a special person in your life, our personalised Leather Bookmarks make an unforgettable gift that celebrates their individuality and love for reading.EMBOSSED- OPTION 1: GOLD FOIL - Max 3-15 letters/numbers, we can only emboss capital letters- OPTION 2: SILVER FOIL - Max 3-15 letters/numbers, we can only emboss capital letters* if your personalisation is over 15 characters we will automatically progress with laser engraving.LASER ENGRAVED ( BLACK WRITING )- OPTION 1 : Cursive text - maximum 2 sentences 5/6 words each sentence- OPTION 2: Arial text - maximum 3-4 sentences 5/6 words eachI engrave my creations to make bespoke items especially for you or your loved ones, I am always happy to try and help if something is unsuitable.I also offer other models, click the link below:https://www.etsy.com/uk/shop/LucianLeatherGoodsUK :  Shipped by Royal Mail 1st Class  ( 1-2 working delivery days )International : Sent by Royal Mail Standard , which aims to deliver in 10 working daysInternational : Track and Signed recommended - Upgrade available at checkout.Occasions this would be suitable for :Father's Day Gift, Valentines Day Gift , Christmas Gift, Birthday Gift, Anniversary Gift, Third Wedding Anniversary Gift, Guest Gifts, Engagement Gift, Housewarming Gift, Graduation Gift, New Car Gift, New House Gift, Mother's Day Gift, Wedding Favours, Wedding Day Gifts, Baptism Gift, Corporate Gifts and Social Events Gifts.",
    "reviews": [
      "Great quality and look amazing! Really happy with the items!",
      "Thank you",
      "Exactly as described. Really lovely design and great quality.",
      "Thanks",
      "Bookmark looks great and very fast delivery, would highly recommend!",
      "Thank you",
      "Beautifully made and a lovely gift idea for book worms",
      "Thank you Hannah"
    ]
  },
  {
    "productId": "FX7faXKCEf",
    "url": "https://www.etsy.com/listing/1165066584/10-years-our-little-family-10th?click_key=105fb0bee69f50104aa5e0e49535141d45789b5e%3A1165066584&click_sum=608414d5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-30&etp=1&sts=1",
    "title": "10 Years Our Little Family | 10th Anniversary Gift - Choose Your Own Family Combination",
    "description": "Our little family frame comes with 1 or 2 adults and your choice of 0 to 4 children sat in an engrave wooden frame 'Our Little Family'.The 10th anniversary personalised our little family frame is the perfect gift for mothers day, fathers day, Christmas, parents birthdays, or families in their new homes. It is a thoughtful ornament that is able to be displayed anywhere, with a sentimental meaning of the family.The wooden frame is 26.2cm x 11.2cm x 3cmN.B.Wood being a natural material will differ slightly in colour and grain.",
    "reviews": [
      "Beautiful! Thank you so much!",
      "Good gift for 10 year anniversary",
      "Perfect as an anniversary gift.",
      "Great item, thanks. Love the item"
    ]
  },
  {
    "productId": "TypiSoIymn",
    "url": "https://www.etsy.com/listing/1496597510/personalized-pet-ring-portrait-for-cat?click_key=b683b1453d767d0fa7852fd436f7e2a74edd160f%3A1496597510&click_sum=2136edd5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-31&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Pet Ring Portrait for Cat, Dog and Pet Memorial Gift, Handmade Summer Jewelry Loss Tribute, Gift for Her Personalized Gifts",
    "description": "Cherish your furry friends with a Personalized Pet Ring Portrait for Cat, Dog, and Pet Memorial Gift. I create each handmade summer jewelry loss tribute as a special way to remember your beloved pet or give it as an unforgettable gift for her personalized gifts collection. Keep their memories close always!Your Masterpiece is in Your Pet Portrait- Cherish your furry friends with a custom pet portrait, be it a cat or dog portrait, capturing their unique personalities and creating lasting memories- A thoughtful memorial gift for someone who has experienced pet loss, these personalized jewelry pieces serve as heartwarming keepsakes of treasured companions- Handmade summer jewelry crafted to represent the bond between you and your beloved pets on rings, necklaces, or bracelets. The perfect heartfelt gift for her- Choose from an array of materials and styles - gold-filled to sterling silver - in my collection of exquisite personalized gifts that truly honor the love we share with our four-legged family members➰ Handmade and Delivered Exactly as Requested & on Time!🎉 Zero Shipping Charges🚀 Package at Your Door within 1 to 5 days🎁 Arrives in a Beautiful Gift Box➰ How to Order in a Breeze:- Choose your most-loved pieces from the drop-down menus above- Use the \"Personalization\" box to specify your customization- Got more requests? I'm all ears! Send me a message or leave a note for me at checkout!➰ Support the Handcraft of Experienced Artisans:- My mission is to ensure you're overjoyed after this shopping experience- Crafting with supreme materials: 925 sterling silver and genuine 14k gold- Proudly maintaining an allergenic material-free environment in my shop➰ Only the Finest, Certified Precious Metals- Say no to tarnish, scratches, and fade outs- No green blemishes or marks on skin- Offering 100% waterproof jewelry- Featuring Superior Quality Solid 925 Sterling Silver, 14K Gold Filled, 14K Rose Gold Filled, Authentic White Gold (Rhodium) Filled, and 10K 14K 18K Karat Gold- Your tailor-made piece will come with an authenticity certificate and hallmark➰ My Journey and my Dream- My love for handmade custom jewelry was born in a humble workshop- Secrets of the handcraft were passed on by my gold and silver-loving grandparents- Today, I breathe life into that very workshop, pouring love into each custom creation➰ I Ensure a Worry-Free Etsy Experience- I accept returns and exchanges, and I offer full refunds for any dissatisfaction- Something not as you expected? I'll recreate and reship at no cost- Kindly give USPS a bit more time during peak seasons. Your package is in safe hands➰ Fantastic Custom Made Picks for You:- 14K Gold Name Birth Flower Necklace:https://www.etsy.com/listing/1495633534/14k-solid-gold-name-birth-flower- Custom Morse Code Necklace:https://www.etsy.com/listing/1509775523/custom-morse-code-necklace-for-women- Discover more at my handmade sanctuary:https://www.etsy.com/shop/MinimalistAuraWarmest thanks!",
    "reviews": [
      "Beautiful ring to commemorate my baby. Arrived quickly, good communication.",
      "You are very welcome and thank you for the review!",
      "My daughter love ring and his face looks just like the picture i submitted.  Thank for the great job!",
      "My pleasure and thank you so much for the review!",
      "Adorable, fast, my daughter loved it. I had it made of her cat that passed away last year.",
      "That's great thank you so much!"
    ]
  },
  {
    "productId": "HbeyeWob9n",
    "url": "https://www.etsy.com/listing/908837704/dog-leash-hook-custom-dog-leash-hook-dog?click_key=2c245747cc1f4b3439bb9d82f7309799f6e6e70a%3A908837704&click_sum=3370482f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-32&frs=1&etp=1&sts=1",
    "title": "Dog leash hook-custom dog leash hook-dog leash hook with name-wooden dog leash holder-custom dog gift",
    "description": "This dog leash hook is a great gift for any dog lover.The names and dog shapes are made from laser cut plywood. They are approximately 7.25 by 7.25 with white wood as the backing.Choose from 3 board colors:NaturalDark brownGreyChoose from 5 dog colors:NaturalDark brownWhiteBlackGreyAdd your CHOICE OF DOG and CUSTOM NAME in the personalization box provided (One name per board) If you do not select a dog type the dog/puppy will be used and if you don’t provide the name I will use the word “woof”Dog hook may vary in shape. Colors may look slightly different than what is seen in pictures due to different wood grains in different computer screens.Please feel free to message me with any questions!",
    "reviews": [
      "Such cute signs for my dogs!",
      "Nice job… Hope you utilize them for a long long time! 😊",
      "So cute! Turned out great!",
      "You displayed them so cute… You must’ve hung them the minute you received them since I feel like it was yesterday that I just mailed them out… Enjoy! 🐶",
      "Adorable gift. Would buy again.",
      "Thank you, and thank you for ordering  🐶",
      "My father-in-law loved this for christmas. The quality of the item was amazing and the seller was very helpful in helping select the template to match his dogs breed. Highly reccomend!",
      "Thank you so much, your review with such kind words is so appreciated… Enjoy! 🐶"
    ]
  },
  {
    "productId": "KDbjNiYPsv",
    "url": "https://www.etsy.com/listing/539183172/engagement-gift-ring-dish-jewelry-dish?click_key=142b2293f23ba87b1af3fc0fb16faa22a075303b%3A539183172&click_sum=57c90d59&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-33&etp=1&sts=1",
    "title": "Engagement Gift / Ring Dish / Jewelry Dish / Date and Initials / Wedding Gift / Personalized Gift / Gift for Her / Anniversary",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Love this cute item: inexpensive and priceless.",
      "great product! came out exactly how i wanted!",
      "Very beautiful little piece. My sister ordered one for me when I got engaged in 2020. Then I purchased one for her in 2023 after she got engaged.",
      "Item was extremely well-crafted and quick!"
    ]
  },
  {
    "productId": "nBwOMvw1Jx",
    "url": "https://www.etsy.com/listing/258376254/4gb8gb16gb-usb-mix-tape-retro?click_key=200136c355c33b2bfe73e7ea219baa6cb0400e3d%3A258376254&click_sum=1b31e62d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-34&etp=1",
    "title": "4GB/8GB/16GB USB Mix tape - Retro Personalised Gift - Loved One, Birthday, Valentines Day - Boyfriend, Girlfriend, Best friend- Flash Drive",
    "description": "Our retro AUTHENTIC Mix tape is the real deal - manufactured in the UK so premium quality is assured – Exactly the premium quality and original retro design that you would wish to give a loved one as a special gift.You won’t be disappointed – Check out our 5 Star feedback and customer comments.--------------------------------------------------I’ve made you a Mixtape- AS SEEN ON THE TODAY SHOW - AustraliaShare photos, videos and memories, with this perfect gift in a classic retro style.Once the highest of all loving gestures, the Mixtape is now, in the 21st century, grossly impractical. And what a loss this is! As a personal, thoughtful gift that proved the giver had put in a huge amount of effort, was it not the perfect present for a loved one?Fortunately, Blank Record has designed a unique and innovative solution that combines the digital and the physical. The USB Mixtape allows you to store up to 4GB/8GB/16GB of an unlimited range of files for you to present to your loved one as a thoughtful gift with a novel and fun design. For example, celebrate your best friend’s birthday by giving them a compilation of photos and videos that showcases their life so far. For newlyweds, look back at the memories that define your relationship, from the first date all the way to your honeymoon.And don’t feel you have to stop there. Eternalise the past by scanning in old photos or handwritten love notes, add those funny text messages with phone screenshots and edits.… Possibilities are endless!Each tape label can be personalised with your own message and design. For example; “DJ Sam’s Mixes”, “I Love you Hazel” or “Our Wedding Memories” etcI’ve Made You A Mixtape: Personal and personalised, it’s a very special gift for that very special someone.----------------------------------------------------Finish Options- 4GB/8GB/16GB USB Mixtape + Giftbox (Label design & text shown in image)- 4GB/8GB/16GB Personalised Mixtape + Giftbox- (Personalised the cassette sticker with your own message)For personalised labels, please write your message in the buyers notes when you come to purchase your item.We aim to dispatch our orders within one business day.Shipping from United Kingdom via the carrier Royal Mail.----------------------------------------------------Some EU countries such as Germany in particularly are charging import taxes on all goods coming from the UK. Items won’t be released from Customs until the import tax have been paid to the German government. Please enquire at your local post office for further information.----------------------------------------------------Shipping from the United Kingdom.United Kingdom: 1st Class DeliveryEstimated 1-3 working days.Europe: Standard Delivery (this service isn’t tracked)Estimated 1-2 weeks.United States and Canada: Standard Delivery (this service isn’t tracked)Estimated 1-2 weeks.Australia: Standard Delivery (this service isn’t tracked)Estimated 1-2 weeks.Everywhere else: Standard Delivery (this service isn’t tracked)Estimated 1-2 weeks.----------------------------------------------------We recommend our international customers to select and pay extra for tracked delivery if they wish to track their parcels journey. This service is also express and may have some advantages to getting there faster.----------------------------------------------------Thank you for your interest and don’t forget to favourite us for our latest shop updates.BlankRecord ™ Copyright 2023 - All Rights Reserved ©",
    "reviews": [
      "Love it! So cute! Perfect!",
      "This made a great gift for my girlfriend for Valentine's Day. She loved it. The box that it comes with is really cute, too.",
      "Great item to purchase for any holiday.",
      "Item arrived quickly and is of great quality. I can’t wait to make my significant other a ‘mixtape’"
    ]
  },
  {
    "productId": "qirJzmmiQU",
    "url": "https://www.etsy.com/listing/609852937/10-year-anniversary-gift-tin-anniversary?click_key=e44d56d98c1b4104561742835401a2481629d8f0%3A609852937&click_sum=3f20b956&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-35&etp=1&sts=1",
    "title": "10 Year Anniversary Gift, Tin Anniversary Gift, Anniversary, Family Tree,  Personalized Names and Wedding Date Stamped, Aluminum Anniversary",
    "description": "Original 10 Year Anniversary Artwork created from recycled Aluminum!!This listing is for 3 Children on ivory back ground and all silver tree and leaves.Listed New Design!Family Tree - Anniversary Couple initials or last Name and or wedding date and Children Hearts - Names hanging from Tree Branch (note only up to three children available)Celebrate your 10 year Wedding Anniversary with a lasting wonderful Keepsake.This Aluminum TREE AND HEARTS Collage is an Original and made from different recycled Aluminum.This is an original, no prints are made oravailable.It is a very fashionable Home Decor Art piece as well as a Keepsake stamped with Names and Wedding Date.Custom order with Names and Wedding Date Size 8 x 10.Frame is not included.",
    "reviews": [
      "Very quick to respond with answers to my questions, paid close attention to detail and very helpful. Item was A++ quality and am very pleased with the end product. Exceeded my expectations and highly recommend.",
      "Great communicator and caught my mistake for me!!!!",
      "I loved my artwork. Is was  just like the picture.",
      "It looks great! Lots of detailes. Love it!"
    ]
  },
  {
    "productId": "1EkAevXrEg",
    "url": "https://www.etsy.com/listing/961232445/delicate-stripes-personalized-natural?click_key=74845e3111eb0171ddff2b2b50d71b02d133b454%3A961232445&click_sum=626fdd16&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-36&pro=1&etp=1",
    "title": "Delicate Stripes Personalized Natural Easter Basket, Easter Basket, Kids Basket, Easter, Basket, Personalized Easter Basket",
    "description": "The Delicate Stripes Personalized Natural Easter Basket is the perfect basket to fill with all of their goodies from the Easter Bunny.𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- Basket contents not included- Liner features a printed design- Design and name are printed, NOT embroidered- Natural colored basket measures approx. 17\"-19\" H x 12\" D- Woven by hand, each basket will vary slightly in color and size. No two will be exactly alike- Dropdown handle features white metal hinges on each side which makes for easy storage.- 𝑻𝒉𝒆 𝒉𝒂𝒏𝒅𝒍𝒆 𝒅𝒐𝒆𝒔 𝑵𝑶𝑻 𝒔𝒕𝒂𝒏𝒅 𝒖𝒑 𝒐𝒏 𝒊𝒕𝒔 𝒐𝒘𝒏, listing images are just for reference of height- Removable colored liner includes tie closure; spot clean𝑪𝒉𝒆𝒄𝒌 𝒐𝒖𝒕 𝒐𝒖𝒓 𝒐𝒕𝒉𝒆𝒓 𝒊𝒕𝒆𝒎𝒔 𝒉𝒆𝒓𝒆!*White Colored Basket Sold Separately Here:https://www.etsy.com/PersonalizationMall/listing/1416566227/delicate-stripes-personalized-white𝙋𝙚𝙧𝙨𝙤𝙣𝙖𝙡𝙞𝙯𝙖𝙩𝙞𝙤𝙣 𝙄𝙣𝙛𝙤𝙧𝙢𝙖𝙩𝙞𝙤𝙣:- Name: up to 14 characters𝙋𝙇𝙀𝘼𝙎𝙀 𝙉𝙊𝙏𝙀:Spaces and punctuation count as a character. If no personalization is wanted; please write 𝙉𝙊𝙉𝙀 in the text box(s)",
    "reviews": [
      "Gorgeous Easter basket for my first baby! I cannot wait to use this for her first Easter!",
      "Ordered this for my daughter and it is so cute.  Shipping was very fast",
      "I really Loved this Item.",
      "Great quality fast shipping perfect for my son"
    ]
  },
  {
    "productId": "zFUSSfArIN",
    "url": "https://www.etsy.com/listing/572341749/personalised-initial-leather-heart-page?click_key=cc9279db2cb6d23e3e336bb80d380be6560ee76f%3A572341749&click_sum=cdcea304&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-37&pro=1&etp=1&sts=1",
    "title": "Personalised Initial Leather Heart Page Corner Bookmark",
    "description": "PRODUCT DESCRIPTION• Gorgeous heart shaped Italian leather bookmark personalised for the lucky recipient to create a thoughtful bespoke gift.• This innovative leather bookmark slots over the corner of the page that you wish to mark.PERSONALISATION• We engrave our pieces to create bespoke items especially for you, we are always happy to try and help if something is unsuitable but we regret we are unable to offer refunds on personalised items.GIFT PACKAGING• The bookmark comes in a free Hurleyburley velvet pouch. We can add a gift card for your special message.MADE FROM• Italian leatherDIMENSIONS• 4cm x 4cmPRODUCT CODE• HBL09",
    "reviews": [
      "Excellent item bought for sister’s birthday",
      "arrived so quickly and amazing product, bought as a gift for a book lover and she will love this",
      "Great product which was received quickly and well packaged",
      "great service. Received quickly and well packaged"
    ]
  },
  {
    "productId": "kzSqvkJPMG",
    "url": "https://www.etsy.com/listing/1412912632/custom-watercolor-portrait-family?click_key=59146e1a3ea74a8228be2bf2ddcae330ddf88a0d%3A1412912632&click_sum=6b58bcd5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-38&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Watercolor Portrait, Family Portrait, Custom Portrait From Photo, Portraits From Photos, Personalized Gifts, Mother's Day Gift,",
    "description": "ADD-ONS:Pet add-on:www.etsy.com/listing/1108170740Digital file add-on ($10) :www.etsy.com/listing/901256888Priority processing add-on ($30) :www.etsy.com/listing/918935889Full background add-on ($15):www.etsy.com/listing/956027552To add a gift message, please add this to your order:www.etsy.com/listing/1476123399DETAILED PORTRAIT LISTING:www.etsy.com/listing/1210157189.........................................................Please note this painting style is a miniature watercolor portrait where the focal point of the portrait is not the face of the subjects, therefore the facial details will be minimal. To get the best result we recommend natural-looking moments, where the subjects are not looking straight at the camera (focal point of the photo is not the face).Your custom portrait will be hand-painted by a real watercolor artist and reproduced at the finest quality. Printed on premium heavyweight 320 gsm cotton-rag textured paper and LUCIA Pigment archival inks to reflect the true watercolor quality. You will see every single brush stroke and smallest intricate detail of your loved ones in this print. This print will last for a lifetime, guaranteed.We only ship out after you approve the artwork. This piece will be 100% custom-tailored for you.• Hand-painted by talented watercolor artists• Approve before shipping• Current artwork creation time:  5-7 days• Shipping time (US):  3-5 days• Shipping time (international):  14-20 days.........................................................How to order?1. Select size and add personalization requests (if any) and place your order2. Send us the photo of your loved ones via Etsy Message (you can send as many as you want)3. Allow 3-5 days for the artist to paint your portrait4. Preview the artwork (you can request revisions or approve the artwork)5. Once you approve the artwork we'll ship out the print.........................................................If you have any questions or inquiries, please feel free to send us a message. We'll be happy to accommodate your custom request and SO excited to make this piece for you :)",
    "reviews": [
      "These were the perfect gifts, and will be cherished for a long time!",
      "Lovely gift for a graduation present.",
      "Love my customized print - thank you",
      "LOVED IT SO SO MUCH"
    ]
  },
  {
    "productId": "uZXfomHCRS",
    "url": "https://www.etsy.com/listing/1402335626/custom-embroidered-pet-sweatshirt-custom?click_key=b5f88565ad20b2b8c6fecdd1297bde22c55ca23c%3A1402335626&click_sum=b42bb080&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-39&pro=1&etp=1",
    "title": "Custom EMBROIDERED Pet Sweatshirt, Custom Dog Portrait, Dog Sweatshirt, Pet Face Shirt, Dog Mom Gift, Dog Embroidery, Personalized Gifts",
    "description": "❤️ Personalized EMBROIDERED Pet Sweatshirt, Pet Gifts, Custom Dog Portrait Sweatshirt, Personalized Gifts Pet Face Shirt, Dog Mom Gift, Dog Embroidery, Dog Lover Gift ❤️😊 HAPPINESS GUARANTEED! 😊 Our #1 priority here at Pet Creativo priority is your happiness, which means that we stand by our products 100%. If you have a problem, we will solve it. Just reach out to Penny & Louie from our Customer Happiness team.Your pet, embroidered on a super soft and beautifully made unisex sweatshirt.HOW THIS WORKS:• We will digitally illustrate a photo of your pet, then embroider it on a high quality, soft sweatshirt. You will receive a mockup prior to order fulfillment. Please approve the mockup within 24hrs. If we do not hear back, the order will automatically get cancelled and refunded.  Please note- a design fee of $12 will still be collected.• After you place your order, please send me your pet's photo(s) + name via Etsy message. **Please send a high-quality photo - the better the quality, the better the sweatshirt. If unsure, please send a few photos and I'll pick one.** Info entered in the personalization box and sent via Etsy message MUST match 100%.**** Please note- after the portrait is done, I am able to do minor edits only. I am NOT able to re-create the piece using an entirely different photo than what you initially provided, so please carefully select the photo you would like me to use.**** Please expect the following from your new, hand-made sweater1. Machine markings around the design. This is normal and is to be expected. The dents will disappear after the first wash.2. Slight color variations from the mockup to the actual embroidery. No embroidery can mimic the mockup 100%.3. Possible loose (excess) thread on or around your embroidery. We will try our best to clip the excess thread, but if you notice some loose thread upon receiving your shirt, do not fret. It will not ruin your embroidery and you can feel free to clip it gently.~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~This well-loved Gildan 18000 Unisex Sweatshirt is the perfect addition to any wardrobe. It has a crew neck, and it's made from air-jet spun yarn and quarter-turned fabric, which eliminates a center crease, reduces pilling, and gives the sweatshirt a soft, comfortable feel.KEY FEATURES:Unisex (fits both men and women)Loose fit, Runs true to size, but please measure against the size chart provided. Returns/exchanges are not possible.50% Cotton; 50% PolyesterMachine washable - the print will not fade.Brand: Gildan 18000 unisex, heavy blendSIZE↠ The shirts are unisex size. Women can downsize their regular size if they want a fitted look.PRODUCTION / SHIPPING TIME↠ Processing time is currently 2-3 weeks.We will do our very best to ensure your order is fulfilled in a timely manner. PetCreativo is not responsible for delays in shipment but will gladly contact the shipping company on your behalf, so let us know if you experience any issues.~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~CARE INSTRUCTION↠ Inside out, wash with delicate cycle.↠ Lay flat to dry↠ Do not bleach↠ Do not iron directly onto the design↠ Do not dry clean.** Note: We cannot offer refunds or exchanges, unless there is damage to the item or, if item was never received. **© 2023 All designs are copyrighted by Pet Creativo® and remain the sole property of Pet Creativo®. We do not give permission to copy, replicate or otherwise reproduce without our direct permission. Ordering from Pet Creativo® does not transfer any rights for reproduction.~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~We can paint ANY pet and ALL dog breeds. Here are some examples:BEAGLE | BERNER | BASSET HOUND | BICHON | BOXER | BOYKIN | BOSTON TERRIER | BULLDOG | BULLY | CAVAPOO | CHIHUAHUA | CHOW | CAVALIER KING CHARLES | CORGI | COCKER SPANIEL | DACHSHUND | DALMATIAN | DOBERMAN | DOODLE | ENGLISH COCKER SPANIEL | ENGLISH POINTER | FOX TERRIER | GREAT DANE | GOLDEN RETRIEVER | GERMAN SHEPHERD | GERMAN SHORT HAIRED POINTER | HEELER | HUSKY | JACK RUSSELL | LABRADOR | LONG HAIRED DACHSHUND | MALTESE | MALTIPOO | MASTIFF | MINI FOXY | OLD ENGLISH BULLDOG | PITBULL | POMERANIAN | POMSKY | POODLE | PUG | ROTWEILER | SCHIPPERKE | SCHNAUZER | SHARPEI | SHELTIE | SHEPSKY | SHIBA | SHIH TZU | SPANIEL | TOLLER | WESTIE | YORKIE",
    "reviews": [
      "It looks great . It is a gift so I will message the shops once I give it.",
      "Quick to ship and exactly what we wanted! Great quality",
      "Amazing customer service, I recommend!",
      "Item was just as described and wonderful communication with the seller. Would definitely purchase from seller again!"
    ]
  },
  {
    "productId": "aZORmtgoUO",
    "url": "https://www.etsy.com/listing/1509325794/engraved-leather-bookmark-handwritten?click_key=edbf6c42df0f1483cd998121da1818bd7693ef56%3A1509325794&click_sum=79cfbb94&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-40&etp=1",
    "title": "Engraved Leather Bookmark, Handwritten Note Bookmark Custom 3rd Anniversary Gift for Him Unique Mother's Day Gift Idea for Her",
    "description": "Personalized Anniversary Leather BookmarkMade of genuine leather and comes with a kraft sleeve holder6.5 x 1\" - thickness 2.3 mm==============================♦ ORDER WORK FLOW: ♦==============================In the personalization box on the right, please add your complete customization details. We will produce & ship in 3-5 business days. WE DO NOT SEND DIGITAL MOCK-UPS so we can produce and ship orders quickly. If you request a digital mock-up, have missing customization details, or have any changes to your order/customization, please take note that it will cause delays in production & shipping. We can only allow changes to the order if the request is made within 24 hours of purchase time.» NOTE FOR BUYERS: Contact us for any questions! Please allow up to 24hrs Mondays - Fridays for us to respond to messages. We are closed on weekends & holidays and we ship all products from our office in Sunnyvale, California. Follow us on instagram: @muujeehandmade / Tiktok: @muujeeweddings",
    "reviews": [
      "Great, quality item that shipped quickly! Thanks so much!",
      "Excellent workmanship on this book mark. Loved it!",
      "Nice quality, my girlfriend loved it."
    ]
  },
  {
    "productId": "lhZivJRQFC",
    "url": "https://www.etsy.com/listing/1128551673/birthstone-bracelet-for-mom-family?click_key=9ada3add384239fb08270f90251a35f30ffd6e6f%3A1128551673&click_sum=c952391c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-41&pro=1&frs=1&etp=1",
    "title": "Birthstone Bracelet for Mom, Family Birthstone Bracelet, Birthstone Jewelry, Family Birthstones, Personalized Gifts, Christmas Gift",
    "description": "Create a one-of-a-kind gift, we have personalized jewelry made just for you. The unique bracelet can be made with your  birthstone. The bracelet  with a birthstone will help you to remember every important moment and lucky time with someone you love.IDEAL GIFT FOR SOMEONE YOU LOVE:A wonderful jewelry gift for baby, kids, children, couples, lover, wife, girlfriend, boyfriend, mother, daughter, grandma, nana, mother in law and best friends. This personalized bracelet is a perfect gift for Mother's Day, Christmas, Anniversary, Birthday, Engagement, Valentine's Day, Thanksgiving, Wedding celebration and more. Perfect as simple romantic gestures!• Material: High Quality Solid 925 Sterling Silver• Finish: Sterling Silver ∙ 18K Gold ∙ Rose Gold• All our jewelry is made by hand with LoveSTERLING SILVER 925♥ We use real Sterling Silver 925 ♥♥There is an extender of 0.5 inches ♥♥ Removable clasp ♥♥The clasp is not included in the main length♥♥ Stone Size : 3mm ♥♥ How to customize Order? ♥1) Select Color2) Select Chain length3) Click \"Add to Cart\"4) Will need work name or letters write to the text box ( like: December April May  )5) Checkout6) Complete order♥ Shipping & Package ♥• Your order will be shipped within 5 days (on business days).• Our products will be sent carefully wrapped and packed in a beautiful gift box!• Your order ships with a tracking number. You can always tracking order status.• Don't worry, you can always ask without hesitation. We're here for happy customers.",
    "reviews": [
      "It is very cute, but I expected the birthstones to be a little bigger.",
      "super cute and great quality!",
      "Received in mail and it’s perfect",
      "Came as shown, great quality"
    ]
  },
  {
    "productId": "nZsManFnHr",
    "url": "https://www.etsy.com/listing/909679206/personalized-coasters-wedding-gift?click_key=573a4a7c59385670f5ed3d416b6f4c6a64c90272%3A909679206&click_sum=6f698255&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-42&frs=1&etp=1&sts=1",
    "title": "Personalized Coasters, Wedding Gift, Housewarming Gift, Custom Coaster Set, Set of 4 marble and Wood Hexagon Coasters, Engagement gift |",
    "description": "Set of 4 Marble & Mango Wood Hexagon CoastersApproximately 4\" x4\"Laser EngravedThese coasters make a great Christmas gift, hostess gift, housewarming gift, wedding gift, engagement gift, bridal shower gift, Anniversary gift, teacher gift, thank you gift or corporate gift, employee gift.They also make a great realtor closing gift - a logo can be added to the back for an additional charge.See our other listings to add on matching wine glasses and or charcuterie boardPlease message us for a custom design*Use correct grammarWhen adding \"THE\" - Just add an \"S\" to the last name (don't add an apostrophe)When a last name ends in s, x, ch, sh, or z, you add ESFor Example- JONES or THE JONESES",
    "reviews": [
      "The quality of the coasters are beautiful and very authentic feeling. I love the engraving because it adds a personal touch to the gift for the gift receiver. The coasters are also very smooth and engraved nicely :) Seller was also very quick to reply and easy to talk to, thank you!",
      "Made a great housewarming gift. Seller was kind and able to execute the design I had in mind. Thank you!",
      "The clients love the coasters!~",
      "Gave these as a Christmas gift - came out great, looked just like the pics"
    ]
  },
  {
    "productId": "RYiIxJaEtN",
    "url": "https://www.etsy.com/listing/888003836/coasters-set-of-6-housewarming-gift?click_key=ee47e680f9d5213d482b555951ffd7d7313df957%3A888003836&click_sum=06944cac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-43&etp=1&sts=1",
    "title": "Coasters | Set of 6 | Housewarming Gift | Gifts for Her | New Home Gifts | Best Gift | Unique Holiday Gift | Home Gift| Christmas Gift",
    "description": "Discover matching placemats:https://www.etsy.com/uk/listing/896570068/mediterranean-pattern-placematsplacemats?click_key=2b991514ff8c1258bb56537329777c9e1360dfa3%3A896570068&click_sum=f500581f&ref=shop_home_active_1&pro=1&frs=1Discover cushion covers:https://www.etsy.com/uk/listing/1048409405/mediterranean-style-cushion-covers?click_key=5ae46280091dfc37450f45ed37255de72c7f96b0%3A1048409405&click_sum=a30bc529&ref=shop_home_feat_5&pro=1&frs=1UNIQUE DECORATION: Impress your family and friends with this set of tin corked-back coasters in a luxury gift box. Printed with unique design, this special set of 6 printed coasters provides a stylish and protective solution for your coffee and dining table. The beautiful design makes them look gorgeous under your cups and are handy for any occasion.PROTECT YOUR TABLES: Are you tired of finding ring marks all over your tables? Protect your surfaces with the help of these wonderful tin coasters.SPECIFICATIONS: This pack includes 6 tin corked-back coasters in a luxury gift box. The coasters have a diameter of 9 cm and are perfect to use under your mug, teacup, glasses to help prevent scratches or rings from liquids. Choose our thick, durable and long-lasting coasters that will not be damaged even after repeated use.EASY TO CLEAN: The tin corked-back coasters are easy to clean. You should make sure that you never put it in a dishwasher or soak in water. Simply clean them by using a soft cloth and then use a dry cloth and let it dry in the shade.PERFECT GIFT: Offered in a brilliant gift box, these beautiful coasters can make a special gift for your loved ones. Surprise your family and friends on their Birthday, Mother’s, Father’s Day, Valentine's Day, Wedding Anniversary, Housewarming or Christmas.****Material****Coaster: Painted tin top and a cork underside.****Size****Coaster: 9cm/3.5\"",
    "reviews": [
      "Beautiful coasters with excellent quality. Designs are so pretty. Very delighted with my purchase",
      "Despite the price the quality is immense, well made and nicely designed",
      "They are as described.Good quality."
    ]
  },
  {
    "productId": "awDnFaYsTT",
    "url": "https://www.etsy.com/listing/862819941/real-leather-personalized-bookmarks?click_key=a4c44c5f7ffbbd315d070591b200f57e38b76141%3A862819941&click_sum=2c0f1171&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-44&pro=1&frs=1&etp=1&sts=1",
    "title": "Real Leather Personalized Bookmarks | Heirloom Quality Handmade Bookmarks Perfect for Home, School, Office, Trips or Vacations | Read USA",
    "description": "Are you looking for High Quality Handmade Leather Goods Made in the USA? At Hashtag Leatherworks we are veteran owned and proud to bring you heirloom quality products from hides and hardware sourced in the USA and made from our home shop in Central Maine.Are you looking to upgrade that old bookmark and want something that will last years to come?  If so you have come to the right place!These bookmarks are handcrafted with heavy duty leather specifically chosen so they are Maine Tough and Made to Last!Up to 3 letters can be heat embossed to the front bottom center.Example of free (optional) monogrammed letters is pictured.  Font is approximately 1/4\" high.  Font is placed bottom center.A rugged long lasting gift for that special reader. A future heirloom.   Multiple color options.As with all leather there can be some variation in color even over the same hide.  Please understand some shade variation may occur as this is a natural product.Overall dimension open: 1.5\" X 6.5\" -  Approximately 3/16\" thickMilled and Natural Bison are made from American Bison.  Milled Bison is a softer more flexible style bookmark compared to the other options due to the tumbling process during tanning. The Blue is not color struck and has a cool white center between the front and back.The final product is proudly Made in the USA and Made in Maine.Hashtag Leatherworks is a Veteran Owned Company.Subscribe to Hashtag Leatherworks for product updates & deals:https://mailchi.mp/277c6dde143b/subscribe-nowCare Instructions:Although most leather gets better with age, you may clean your leather from time to time.  A lightly wet cloth/t-shirt is the best method, and the leather should then be air dried.  Polishes are used to improve shine (sometimes add color) whereas conditioners are used to rehydrate your leather and protect you leather from drying out and cracking.  In either case, if you choose to use a leather product make sure to do your research and read product labels for likely outcomes. ALWAYS test a small section of your leather prior to use. *Hashtag Leatherworks, LLC is not responsible for the results of leather products being applied by a customer.Try to avoid excessive cold which can cause a ghosting/opaqueness appearance on the finish and avoid excessive heat which can cause color transfer of waxes and oils to another object while hot.  In both situations bring leather back to a room temperature and wipe with a dry cloth if necessary. Be mindful of the weather and try to avoid your leather getting excessively wet.  If it does get wet, try to dry it at room temperature.  Leather needs to breath so it does not rot or mildew.  If storing your product, consider a breathable, low nap, fabric bag or household item such as a pillowcase.",
    "reviews": [
      "Gift for my husband. Perfect!",
      "Great gifts, I ordered more.",
      "It did the job necessary",
      "High-quality, handmade leather bookmark at a reasonable cost. Terrific product and service."
    ]
  },
  {
    "productId": "GRAJIjqpEl",
    "url": "https://www.etsy.com/listing/1304917922/custom-portrait-minimalist-couple?click_key=163f7d95440b754f172725c727da1db542604ee0%3A1304917922&click_sum=11ec74c1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-45&frs=1&etp=1&sts=1",
    "title": "Custom Portrait, Minimalist Couple Portrait, Cute Cartoon Illustration, Personalized Print, Personalized Gift, Couple Memory Digital Gift",
    "description": "✦This listing is an intimate hand drawn artwork perfect as a gift for a loved one or special couple. This personalised piece will capture a special day full of memories, love, and happiness.✦Custom Portrait, Couple Portrait, Cute Cartoon Illustration, Personalized Print, Personalized Christmas Gift, Couple Memory Digital Gift✦This listing is for DIGITAL download ONLY, NO PHYSICAL item will be delivered. You will receive a high-resolution, printable file, you can use it online, on your design, or print it at your local print shop.𝐒𝐢𝐳𝐞 : 𝟒𝟎𝟎𝟎𝐱𝟒𝟎𝟎𝟎 𝐩𝐢𝐱𝐞𝐥𝐬𝐇𝐎𝐖 𝐓𝐎 𝐎𝐑𝐃𝐄𝐑:---------------------------After completing your purchase:STEP 1: Send us your pictures by using \"Message Seller\" to attach your favorite photo.STEP 2: Your Digital portrait will be sent to your email within 2-10 days!STEP 3: Don't forget to leave us a review to support my artworks",
    "reviews": [
      "Very great and accommodating. Would buy from again",
      "Amazing! Ordered twice from this shop already and i am in love with our drawings",
      "Loved the finished piece and it arrived fast",
      "Amazing product, high quality, very quick!"
    ]
  },
  {
    "productId": "JaFKvuedgD",
    "url": "https://www.etsy.com/listing/1075928142/childrens-personalized-coloring-book-for?click_key=56b7b66e75d06c072e8d5d7d3d22777011b2de64%3A1075928142&click_sum=7c44c924&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-46&frs=1&etp=1",
    "title": "Children's Personalized Coloring Book for Weddings, Travel, Birthdays and Holidays-Unicorn, Super Hero, Animal, Affirmation Kid's Color Book",
    "description": "Looking for a screen-free activity for your kids? This is it!These personalized On-the-go coloring books are made to keep kids busy and engaged in an activity.Get everyone involved and make it a family activity!Color books measures 8.5 inches by 5.5 inches perfect for those little hands. They come bond together with easy to use coil binding with a sturdy cardboard backing.Each book includes 52 pages. 26 of the pages are personalized and 26 are additional coloring pages related to the theme chosen.Colored pencils NOT includedThe following options are available:HeartsShapesSuper HeroesA-Z animalsUnicornDinosaurs",
    "reviews": [
      "Very cute and personalized !",
      "Great gift. I have ordered several times",
      "I absolutely love it! Thank you 😊"
    ]
  },
  {
    "productId": "tArTg5YchR",
    "url": "https://www.etsy.com/listing/1313414732/personalized-acrylic-night-light-boho?click_key=ba8dc370e594939113213f39366c353fc76052b1%3A1313414732&click_sum=c17c454b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-47&etp=1&sts=1",
    "title": "Personalized Acrylic Night Light | Boho Night LED Light | Kids Bedroom Decor, Custom Name, Boho Nursery Decor, Baby Shower Gift,Holiday Gift",
    "description": "Get a good night's rest with our warmly lit night lamps! The soft white lights create a soothing, comforting, and cozy atmosphere that helps your little ones feel relaxed. A must-have essential bedside table decor piece to accompany you to have the sweetest dreams.- PRODUCT DETAILS -♡ Personalized Name will be etched on the acrylic. Please provide first and middle or last name.♡ Wooden Stand Size: 6 in. x 1.75 in. x 1.25 in.♡ Visible Acrylic Size: Approximately 5 in. x 5.75 in. (width x height)♡ Power: USB cord, On & Off button (wall plug NOT included)♡ Light color: Soft white lightDISCLAIMER: Please handle with care. We highly recommend using a micro-fiber cloth (not included in purchase) to remove any fingerprint marks or dust that may come into contact with the clear acrylic.WARNING! All Harper & Lo products are for decorative purposes only - they are not a toy. Adult supervision required at all times. Harper & Lo cannot be held responsible for any accident or injury following the misuse of our products.",
    "reviews": [
      "This is a beautiful night light, not to girly and the parents love that it will grow with her.",
      "Bought as a gift. Absolutely love this! Such great quality and quick shipping.",
      "It came quickly, was packaged beautifully, and looks stunning! Thank you, Alex!"
    ]
  },
  {
    "productId": "mzNUSkgVbv",
    "url": "https://www.etsy.com/listing/650996575/personalized-brown-leather-bracelet-3rd?click_key=2d1e17d191e9e3dec9ae1af7549c15d7d9b8d45d%3A650996575&click_sum=7935e12f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-591209-12-48&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Brown Leather Bracelet // 3rd Anniversary Gift for him",
    "description": "Personalized Leather Bracelet //  Handmade Jewelry // 3rd Anniversary or Graduation GiftAre you searching for the perfect meaningful or funny gift for Valentines Day? Look no further! Our adjustable two snap cuff bracelet is a meaningful personalized gift that lets you show your love with a subtle hidden message. Minimalist, and rustic on the outside and sweet and sexy on the inside. A cute fun gift to celebrate your commitment and years together. Full grain leather made to last, just like you and your special person.HOW TO CUSTOMIZE:1. Choose your size according to the sizing guidelines shown as the second photo.  Adjustable is our most popular if you are unsure!*The size ranges shown tend to be almost snug at the high side of the range and roomier at the low side, please keep this in mind when choosing your size.2. Choose your preferred font from the font list (this is the second photo in the listing, swipe left on the first photo to view).3. Use the 'Add your personalization' section during checkout to include your custom text for the inside of the bracelet** IMPORTANT, PLEASE READ **- Text will be printed exactly as it is written so please double check for typos. We will assume that any misspellings or grammatical abnormalities are intentional since we see these so regularly in custom engravings (inside jokes, silly and sweet messages, etc)- The only change we will make is to change '<3' into an actual heart character '♥' so if you do not want us to make this change please leave a note during checkout. The heart character in your engraving will be the heart character shown on the same line as the font you have selected unless otherwise specified.- If you use a an outlined heart character in your personalization text (♡) we will do our best to use an outline heart instead of a solid heart- In order to process and ship your order as fast as possible while keeping prices as low as possible we do not provide design proofs for customized bracelets.- Please reach out to us if you have a problem with your order, we're here to help and just an email away:  contact [!at] locallaserco.com____________________DETAILS:Material: Full Grain Leather with dark brown burnished edges and a soft smooth flesh side.Outer Color: Rich medium brownInner Color: medium brown with dark brown engravingClosure: Durable and easy to use solid Brass button closureDimensions: 0.5\" x size chosen at checkout (refer to the guide in product images)Hypoallergenic: YesGift Box: Included (3.5\"x3.5\" cotton filled gift box)Handcrafted In: North Carolina, USABy: Local Laser CompanyLOCAL LASER CO. ~ OUR PROCESSAll of our leather goods are handmade in our shop on the East Coast. We use high quality full grain leather sourced in America to create our products, ensuring that they will last.Many of our leather goods and gifts can be engraved with your personalized message - check out our shop or shoot us a message to find products that can be personalized. We love creating custom leather gifts for Anniversaries, Weddings, Birthdays, and more. We work hard to ensure your order ships out as fast as possible.",
    "reviews": [
      "my boyfriend has barely taken them off since he got them (ordered 2)! ❤️",
      "They were super respectful when I asked them to send it to a different address than the one that automatically came up. Speedy delivery, and good quality! Would highly recommend!",
      "Good quality bracelet a nice gift"
    ]
  },
  {
    "productId": "EGdPdyrKhd",
    "url": "https://www.etsy.com/listing/747068567/charcuterie-board-personalized-easter?click_key=b5d77daabc68ecc49d727e8d2afeda75b65a4123%3A747068567&click_sum=da3d44e6&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Charcuterie Board Personalized Easter Gift for Couple with handle Monogrammed Cheese Board Engagement Gift Bridal Shower Gift - 065",
    "description": "Want to create an amazing gift box complete with a card and gift wrapping? See our gift box options here:https://www.etsy.com/listing/974242988/make-it-a-gift-box-add-onsPersonalized engraved cheese board made from solid wood.  Pick your design from the options shown in the listing photos.Did you know! We have personalized gifts for EVERY occasion! We have customized ring trays, candles, notebooks, coasters, frames, tumblers, and dishtowels!You can see everything we offer here:https://www.etsy.com/shop/CopperFoxCompanyD E T A I L S• Premium Top Grain cheese boards• One side can be used as a cutting board, the other side a charming addition to any home decor• Conditioned with Mineral Oil to ensure long-lasting durabilityH O W • T O • O R D E R1. Select quantity and size from the drop down menus located to the right of the photograph above and add to cart2. Add Engraving details to box provided3. add to cart, along with any other items you would like to purchase4. proceed to checkout processT U R N A R O U N D  T I M EOur processing time is 2-4 business days, and standard shipping is 3 days (4 days for coasters and small cheese boards).   If you have a deadline for your item we can generally accommodate.  Please send us a direct message before or after placing your order.**PLEASE DON'T LEAVE DELIVERY DATE REQUESTS IN THE ORDER NOTES, AS THEY ARE NOT ALWAYS SEEN IN TIME.** thank you! :)International orders can vary significantly in shipping times depending on your country's customs. International orders can take up to 30 days to arrive.To preview some of our font options go to the following link:https://www.copperfoxco.com/pages/etsy-font-previews",
    "reviews": [
      "Would recommend this is a great gift",
      "I paid extra for this to be delivered by Christmas--and it came early :) Great responsiveness and its beautiful.",
      "The best! A great housewarming gift"
    ]
  },
  {
    "productId": "aQcuTnJhgY",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=acfeb2351b9f9a0381bb77bbd432bece7601ac60%3A1115114382&click_sum=7b601f20&ref=search_recently_viewed-2&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "ImLadrZPVJ",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=384e33bcae7aed82d02c8c4d18c89e6d83ad0dfa%3A654638870&click_sum=61fac44c&ref=search_recently_viewed-3",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "mQYNgIzpKk",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=7afc057488baff36806ddd1eaed18f0898acbff9%3A1355783916&click_sum=6c1796da&ref=search_recently_viewed-4&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "TGKwcjjeCU",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=a8a03bb87d345d24a204feca8e70cbaf848d88e6%3A1411614241&click_sum=c32f9066&ref=search_recently_viewed-5&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!"
    ]
  },
  {
    "productId": "YOJLDOWZqz",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=03b8894a2019c6665fc54f2c1772d3fdbe070651%3A999136086&click_sum=6043055d&ref=search_recently_viewed-6",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you."
    ]
  }
]
