[
  {
    "productId": "KXIrlZWvtI",
    "url": "https://www.etsy.com/listing/1098221866/monogram-custom-personalized-decanter?click_key=7118f1eb5fef357a5a7a9d6c064603e426dca36d%3A1098221866&click_sum=7f580654&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-1&pro=1&sts=1",
    "title": "Monogram Custom Personalized Decanter, Engraved Decanter Whiskey Decanter, Scotch Decanter Gift, Housewarming Gift, Wedding Shower Gift,",
    "description": "Personalized Whiskey Decanter, Custom Personalized Decanter. Our Scotch Whiskey Decanter set is Personalized with our stylish Designs .Whiskey Lovers will adore this unique Personalized Engraved Whiskey Decanter Glass gift. Each 23.75 ounce Decanter features a stylish engraved design. The perfect Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift. Made and engraved in The USA. Option to Add 2 pcs 10 oz Rocks Cocktail Glasses, Each holds 10 oz of your favorite Spirits.ITEM DETAILS:- GLASS ENGRAVED IN USA- Whiskey Decanter Holds 23.75 oz liquid, Option to add 2 pcs 10 oz Whiskey Glasses.- Permanently Etched , Laser Engraved- Makes a Great Housewarming Gift, Wedding gift for couples, Man Cave Gift, Groomsman Wedding Party Gifts or any Special Occasion Gift- Great addition the Barware or even housewarming wine glass gift.To Personalize items please do the following:1. SIMPLY ADD PERSONALIZATION INFO in the personalization box.You can find many More Unique Housewarming and Gifts for the Couples on our store by Clicking the link below:https://www.etsy.com/shop/PersonalityGiftShop?ref=simple-shop-header-name&listing_id=717905139&section_id=25132821*** Shipping ****   FREE SHIPPING APPLIES TO ORDERS VALUE OVER $35.00 NOT INCLUDING SHIPPING COSTS*****This item ships via USPS. We will send you the tracking number once your order has shipped.We ship to the Continental US . Please contact us for shipping quotes to Hawaii and Alaska.",
    "reviews": [
      "Very happy with the quality of the glassware as well as the lettering.",
      "Great quality . My sister loved it",
      "Good quality and size was ideal"
    ]
  },
  {
    "productId": "wtkHZT8eUl",
    "url": "https://www.etsy.com/listing/1490770998/dainty-initial-tag-necklace-engraved?click_key=8feb3b1514679d8fe1a63e6acb972b7b5beeb0e0%3A1490770998&click_sum=9813ecba&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-2&pro=1",
    "title": "Dainty Initial Tag Necklace - Engraved Initial Charm Necklace - Gifts for Her - Personalized Gifts - Letter Tag Necklace - Christmas Gifts",
    "description": "Welcome to Dainty Gold Shop, where we specialize in customizable jewelry! Our jewelry is made of high-quality materials that make it last for many years. At Dainty Gold Shop, we believe that every person deserves to express their individuality, and we are here to help you do just that. Explore our collection and find the perfect piece to complement your personal style.This is the dainty tag necklace from our collection. It has a unique design with its elegant chain and the dainty tag with an engraved letter on it. Made from high quality 925 Sterling Silver and designed to last and maintain its shine for many years to come, our initial tag necklace will become a staple piece of your collection. If you are or if you know someone who loves classic everyday jewelry, this item is perfect for you.Available in three stunning colors of silver, gold, and rose gold, our dainty tag necklace can be customized to suit any style preference. Choose the color that best suits your taste or opt for multiple colors to switch up your look depending on your mood.This necklace from our store DaintyGoldShop makes for a thoughtful and meaningful gift for any special occasion, including birthdays, anniversaries, graduations, or simply as a way to show someone how much you care. The personalized touch of the initial letter  makes this necklace a truly unique and special gift that will be treasured for years to come. It is also an amazing bridesmaid gift if you are planning a wedding in the near future. Your bridesmaids will love to see how you thought of them on your most special day too.So why wait? Elevate your look and add a personal touch with our dainty handmade initial tag necklace!♥ MATERIALHigh Quality Solid 925 Sterling Silver, 14k solid gold filling, Rosegold fillingWe have chain length options: 14\", 16\", 18\", 20\", 22\", 24\"Charm Size: 6mm X 10mm♥ OPTIONSSterling Silver ∙ 18K Gold filled ∙ Rose Gold filled♥ CHARM OPTIONSYou can personalize this necklace by adding up to 3 charms.♥ HOW TO ORDER1) Select Color2) Select Chain length3) Personalise by sharing your initial with us4) Click \"Add to Cart\"5) Checkout6) Complete order♥ SHIPPING AND PACKAGE• Your order will be shipped within 5-7 days• Our products will be sent carefully wrapped and packed in a beautiful gift box!• Your order ships with a tracking number. You can always tracking order status.• Don't worry, you can always ask without hesitation. We're here for happy customers.♥ GIFT OPTIONThis inital tag necklace makes for an unforgettable gift for anyone who loves dainty jewelry, especially on special occasions such as birthdays, Christmas, or Mother's Day. It's a thoughtful and personal way to celebrate the bond between you and your loved ones.We have prepared a dainty gift box for you to both store your jewelry and also to give them as a gift to your loved ones!  Your orders are delivered to you in a special gift box. Order yours today and start expressing your individuality with Dainty Gold Shop!♥ STYLE SUGGESTIONS FROM OUR STOREDaily Use:Dainty Gold Shop's jewelry collection is unique and will be the perfect addition to any outfit. Made of high-quality materials, our jewelry is designed to be both durable and fashionable. You can easily use your jewelry, which will take your style to the next level at a breakfast with your family or a daily meeting with friends, at any time. With a variety of designs to choose from, you can find the perfect jewelry from our collections.Mother's Day:Celebrate a mother's unconditional love with exquisite necklaces from Dainty Gold Shop. Each 925 Sterling Silver necklace is carefully crafted to embody the grace and elegance of motherhood. Choose from a variety of styles, including our personalizable jewelry to create a unique and meaningful gift that will be loved for years to come. Give the gift of appreciation and gratitude with our Mother's Day necklaces and let her know how much she really means to you.Birthday Gift:Celebrate a special birthday with our beautifully crafted and customizable jewelry. Our jewelry is designed to be both stylish and timeless, so they can be loved and worn for years to come. If you are looking for a thoughtful gift for a friend, family member or loved one, our personalizable jewelry will definitely impress and please. Make their birthday extra special with a gift that really captures the essence of the occasion and let them know how much they mean to you.Anniversary:Celebrate the love and commitment of your special relationship with the gorgeous anniversary necklaces of Dainty Gold Shop. Each necklace is carefully designed to symbolize the lasting bond between two people in love, with customizable details such as initials or names. With their timeless style and elegant designs, our necklaces are the perfect way to honor the memories and milestones of your relationship. Give the gift of lasting love and compassion with a necklace that captures the essence of your special relationship and make your anniversary truly unforgettable.Valentine’s Day:Celebrate your Valentine's day, one of the most romantic days of the year, together with your partner with a little help from exquisite and unique Dainty Gold Shop necklaces. Whether you are looking for a thoughtful gift for a new love, or you want to rekindle passion with your longtime partner, our Valentine's Day necklaces will definitely impress and please. Give the gift of love and romance with a necklace that captures the essence of your relationship and make this Valentine's Day unforgettable.Christmas Day:Make the Christmas holiday unforgettable with our dainty and unique necklaces. Each jewelry is carefully crafted to embody the magic and wonder of the season, with customizable details such as engraved initials or festive messages. With their elegant design and timeless style, our jewelry makes the perfect gift for your spouse, family or loved ones. Spread holiday cheer with a thoughtful and heartfelt gift that will be treasured for years to come.Wedding Ceremony:Make your wedding day or your friend's wedding ceremony even more special with our elegant and customizable necklaces. Each piece is crafted with the best materials and designed to complement your bridal look, adding elegance and charm to your special day. Whether you are a bride, bridesmaid or guest, our necklaces are the perfect finishing touch to your wedding day outfits, making you feel confident and radiant while celebrating this special day.For Pet Owners:These beautifully crafted necklaces have a delicate paw print carefully written next to your pet's name for everyone to see. With their timeless style, these necklaces serve as the perfect souvenir to honor the bond between you and your beloved pet. Wear it with pride and feel the warmth and love of your furry friend close to your heart wherever you go. They also make the perfect gift for animal lovers. Choose their favorite photo of their furry friend and surprise them with an engraved necklace.",
    "reviews": [
      "Very nice hoodie, ultra soft and decal is perfect.",
      "I sent this to my girlfriend for her birthday and she loved it!! Thank you so much!!",
      "This necklace made the perfect gift for my mom! I got mine and my siblings initials and it turned out so beautiful.",
      "Dear Carina, I'm so happy that you liked your necklaces. Thank you for your feedback."
    ]
  },
  {
    "productId": "USJGAwWhmB",
    "url": "https://www.etsy.com/listing/1502947528/personalized-sister-birthday-gift?click_key=ef1ebf823ed64d80c4cee7f732d13ea41c317ff5%3A1502947528&click_sum=6e7c5124&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-3&pro=1&sts=1",
    "title": "Personalized Sister Birthday Gift Sweatshirt, Funny Sister Life Hoodie, Custom Cool Sister Vibes Hoodie, Sarcastic Sister Sweater",
    "description": "High quality and super soft, comfortable hoodie and sweatshirt. Made with top of the line vinyl and pressed with a professional grade heat press.✔Make sure you check our size-chart before you place your order.➡️𝗛𝗢𝗪 𝗧𝗢 𝗢𝗥𝗗𝗘𝗥 ⬅️𝟏. Please, Check and Review all Photos.𝟐. Select Your Hoodie Size and hoodie Color from drop down menus.𝟑. Enter your Design Color.𝟒. Choose Your Quantity as much as you want.𝟒. Click 𝗔𝗗𝗗 𝗧𝗢 𝗖𝗔𝗥𝗧. For multiple items go back to the listing and repeat the steps.📏𝐒𝐈𝐙𝐈𝐍𝐆 𝗔𝗡𝗗 𝐂𝐎𝐋𝐎𝐑𝐒 📚For detailed sizing information and color options, please see listing images.𝗜𝗳 𝘆𝗼𝘂 𝗵𝗮𝘃𝗲 𝗮𝗻𝘆 𝗱𝗶𝗳𝗳𝗶𝗰𝘂𝗹𝘁𝗶𝗲𝘀, 𝘀𝗲𝗻𝗱 me 𝗮 𝗺𝗲𝘀𝘀𝗮𝗴𝗲.🧺 🚰🚿🧼 WASHING INSTRUCTIONS:Turn inside out.Machine wash cold.Tumble dry low.Do not bleach.Do not iron directly on design.Thank you for your business! We would love to serve you again.Please share your experiences with feedbacks",
    "reviews": [
      "I love this sweatshirt! It’s perfect",
      "Great hoodie, shipped right away! Thanks!",
      "Made a great gift for my sister. It is comfortable and fits well.",
      "Awesome product! Arrived on time"
    ]
  },
  {
    "productId": "MNvNU6tYec",
    "url": "https://www.etsy.com/listing/1642496099/mental-health-self-care-care-package-for?click_key=0e360ea61ede54c3bbce7008ce9595f3a4a6d61a%3A1642496099&click_sum=8e13d171&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-4&pro=1&frs=1&bes=1&sts=1",
    "title": "Mental Health, Self-Care, Care Package for Her, Self Care Box, Stress Relief Gift Box, Thinking of You Care Package, Care Package Friend**",
    "description": "FREE SHIPPING Please note; during the weeks preceding Mother’s Day and Christmas our shipping times could extend out to 5 days during our peak business. Thank you for your business.Teeny-TINY4x4x4 Gray box with white ribbonContents include:1- full size soap in scent chosen1-2oz body oil1-2oz Shea Butter Cream1-lip balm1-Shower Steamer/Bath bomb in chosen scentSMALL box contents:6x6x3 Gray box with white ribbon1- full size soap in scent chosen1- 2oz body oil1-2oz Shea Butter Cream1-lip balm2-shower steamers/bath bombs in chosen scent1-2oz candle tin in chosen scent1 face towelMEDIUM Box Contents:8x8x3 Gray box with white ribbon2-full size soap in scent chosen1-2 oz body oil1-2 oz shea butter cream1-lip balm3-shower steamers/bath bombs in scent chosen1-face towel1-4 oz bath salts1-8 oz body scrub1-2 oz face mask1 Loofa (when candle is chosen it takes the place of the loofa) box is completely full!Large box contents:8x8x8 Gray box with white ribbon2-Full size soap in scent chosen1-8 oz Body oil1-8 oz shea butter cream1- lip balm6-shower steamer/bath bombs in chosen scent1-face towel1-16 oz bath salts1-16 oz body scrub1-4 oz face mask1-2 oz body cream1-loofa",
    "reviews": [
      "Beautiful gift for my daughter ❤️",
      "Thank you!",
      "Great variety of products that my wife cannot wait to try out.",
      "Thank you!",
      "My sister loved the gift.  Unfortunately, the package got a little damaged as it wasn’t protected enough for travel but overall very cute.  Thanks!",
      "Thank you!",
      "This item was a perfect gift for a friend going through a tough time. She loved these items and said everything smelled amazing. It shipped on time and arrived as pictured.",
      "Thank you!"
    ]
  },
  {
    "productId": "Dy11VMBgwp",
    "url": "https://www.etsy.com/listing/1582229596/musical-wooden-ballerina-carousel?click_key=7e0abe48959f102b1f731dc39cb17cacf27fd8ae%3A1582229596&click_sum=e572e8e1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-1&pro=1&etp=1",
    "title": "Musical Wooden Ballerina Carousel Keepsake, Custom Christmas Gift, Engraved Name Music Box, Baby Shower Gift, Nursery Decor,Wooden Music Box",
    "description": "Introducing our Handmade Personalised Ballerina Musical Carousel Wooden, a custom heirloom music box and engraved keepsake gift perfect for baby showers, new moms, and baby girls. Made from high-quality beech wood, this beautiful carousel measures 11cm wide x 18cm high and features a delightful ballerina or horse etched design.Available in a My First Christmas, Family Design or keep it simple and non-personalised. Each carousel is perfectly packaged in a gift box.Our Personalised  Musical Carousel Wooden is carefully handcrafted with attention to detail. We only use high-quality beech wood, ensuring long-lasting durability and a beautiful finish. The personalization process is done using timeless script and serif fonts, guaranteeing an elegant and enduring engraving. Packaged in a gift box, our carousels are meticulously inspected before shipping to ensure they arrive in perfect condition, ready to be treasured for years to come.-Product details:Cross mountain train:Size: 4.3*4.3*5.1 inchesMusic: Castle in the SkyFeatures: music + train rotationChristmas train:Size: 4.3*4.3*5.1 inchesMusic: Merry ChristmasFeatures: music + train rotationEiffeltowerSize: 4.3*4.3*6.2 inchesMusic: MeetFeatures: music + trolley rotationFerris wheelSize: 4.3*4.3*5.1 inchesMusic: Castle in the SkyFeatures: music + ferris wheel rotationwhirly:Size: 3.9*3.9*6.7 inchesMusic: Castle in the SkyFeatures: Music + Trojan rotationBallerina:Size: 4.3*4.3*6.7 inchesMusic: Castle in the SkyFeatures: Music + little girl spinMagic Castle:Size: 4.3*4.3*5.9 inchesMusic: Castle in the SkyFeatures: Music + trolley rotationBig Ben:Size: 4.3*4.3*5.9 inchesMusic: CanonFeatures: Music + trolley rotationBirthday cake:Size: 4.3*4.3*5.5 inchesMusic: Happy birthdayFeatures: Music + Cake RotationChristmas snowflakes:Size: 4.3*4.3*6.5 inchesMusic: Merry ChristmasFeatures: Music + Snowflakes and Sled SpinsBear Seesaw:Size: 4.3*4.3*5.5 inchesMusic: Castle in the SkyFeatures: Music + Seesaw startTriumphant Arch:Size: 4.3*4.3*5.9 inchesMusic: CanonFeatures: Music + trolley rotation",
    "reviews": [
      "This is so much cuter than I even expected!!!! Such a great gift idea!!",
      "hand made and just loved the results. Arrived early grateful since this was a gift for our new girls added to our family through adoption.",
      "Beautifully made item - thank you."
    ]
  },
  {
    "productId": "XlPLGhEyVF",
    "url": "https://www.etsy.com/listing/552986593/ring-dish-jewelry-dish-date-and-initials?click_key=eb200d7850c941c03d369b54b43d205a58ce095e%3A552986593&click_sum=11c160f4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-2&etp=1&sts=1",
    "title": "Ring Dish / Jewelry Dish / Date and Initials / Wedding Gift / Personalized Gift / Engagement Gift / Anniversary Gift / Personalized",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.This dish design was inspired by a special order I received. Important dates are impossible to forget. They become imprinted within us, and they deserve to be stamped into a special dish as well.  To Personalize, please include the initials and date in the order notes at checkout!•\tApproximately 3” diameter•\tThis is not a ceramic item.  It is light and can be slightly pliable.  This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio.  This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies!  Feel free to shoot us a message with any questions you might have.Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Beautiful, turned out exactly as I pictured it!",
      "Item was exactly as ordered",
      "Great! Loved this little piece.",
      "I have ordered this ring dish for every just engaged couple! Love it!"
    ]
  },
  {
    "productId": "PLkXaADxgJ",
    "url": "https://www.etsy.com/listing/1598333386/personalized-gift-ring-dish-custom-ring?click_key=685e72b14bb25479d127617bc337acedbbbc9083%3A1598333386&click_sum=abc80bb6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-3&etp=1",
    "title": "personalized gift, ring dish, custom ring holder, minimalist engagement gift, wedding gift, clay ring dish, initials, dates, names",
    "description": "Beautiful minimalist personalized ring dish, trinket dish, great gifts for wedding, couple, engagement gift, bridesmaid giftmade of high quality polymer clay, gold paint. 100% handmade from scratch from our studio.Size: 3.5 inchesPersonalization example:A&K (heart needs to be specified , example N heart M)11.22.23Fast 1-3 business days processing time.Each dish will be packed in a cute drawstring bag, easy to gift.Need  gold rim, more customization or have a question?Please feel free to reach outThank you for visiting our shop!",
    "reviews": [
      "Cute product and when the tracking got messed up, the shop owner was quick to reply!",
      "Very cute, great price and fast shipping!",
      "Super cute! I’m a wedding photographer & had bought this for a client of mine. I will definitely be purchasing more in the future!",
      "Got it as a gift for my best friend and it turned out great! She loves it!"
    ]
  },
  {
    "productId": "HwPFVcXqUR",
    "url": "https://www.etsy.com/listing/1606419903/wedding-gift-ring-dish-personalized?click_key=46cd158ca9de5d37773f19852b74509815a63faf%3A1606419903&click_sum=f60c6bd3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-4&etp=1",
    "title": "Wedding gift ring dish, personalized jewelry dish, engagement gift, flower wreath, gift for her, gift for mom, initials, dates, names",
    "description": "Fast 1-3 business days processing time.Beautiful and unique 3D embossed  flower wreath personalized ring dish, made of high quality polymer clay, gold paint. 100% handmade from scratch from our studio.Size: 3.5 inchesPersonalization example:A&K (heart needs to be specified , example N heart M)11.22.23Fast 1-3 business days processing time.Each dish will be packed in a cute drawstring bag, easy to gift.Need no gold rim, more customization or have a question?Please feel free to reach outThank you for visiting our shop!",
    "reviews": [
      "I love this! Excellent product",
      "As expected, i would recommend",
      "Such a cute engagement gift!",
      "Such a cute engagement gift!"
    ]
  },
  {
    "productId": "LraHsFBTnS",
    "url": "https://www.etsy.com/listing/1141793266/bracelet-with-medal-to-engrave-with-thin?click_key=6e450fe7008c010ea32c1792baa9d3da756917be%3A1141793266&click_sum=7bf858fc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-5&pro=1&etp=1&sts=1",
    "title": "Bracelet with medal to engrave with thin stainless steel chain • Personalized bracelet, Birth gift, Mom gift, Valentine's Day",
    "description": "Our catalog of graphics & illustrations to engrave:https://tinyurl.com/blicheBracelet N1:• Silver, gold or rose gold stainless steel bracelet• Medal of 14 mm to engrave• Fine chain, Length: 15 cm + 5 cmBracelet N2:• Silver, gold or rose gold stainless steel bracelet• 16 mm medal to engrave• Link chain, Length: 15 cm + 5 cmBracelet N3:• Silver, gold or rose gold stainless steel bracelet• 18 mm medal to engrave• Beaded chain, Length: 15 cm + 5 cmBracelet N4:• Silver, gold or rose gold stainless steel bracelet• Irregular 14 mm medal to engrave• Fine chain, Length: 15.5 cm + 5 cm- CUSTOMIZATION -• Choose whether you want to engrave the front or the front/back of the medal• Fill in the word or picto to engrave for the medal + the fontWe remain available for any questions!------To see the whole collection:https://www.etsy.com/fr/shop/BlicheInstagram: @blichebijoux------- GIFT WRAP -All jewelry is delivered with a small pouch but if you want a real gift packaging, please choose the option in the basket.------- DELIVERY -Orders are processed within 2 to 5 days.Delivery takes 1 to 3 days for mainland France, 3 to 12 days for Europe, and 8 to 60 days for the rest of the world.Mom Wristband | Double Strap | Medal Cord Bracelet | Engraved Medal | Godmother Gift | Mom Gift | Mom Jewelry | Personalized Wristband | Personalized Jewel | Personalized Gift | Woman Gift | Anniversary Wristband | Bridesmaid Bracelet | Birth wristband",
    "reviews": [
      "It was one wonderful bracelet! I loved it and I sure that the person getting it will love it too. <3",
      "Perfect customer service. There was a problem with my order and the solution was quickly found.",
      "Thank you, I am delighted, the bracelet is very beautiful and was sent very quickly. 👍"
    ]
  },
  {
    "productId": "YZWyThRBVe",
    "url": "https://www.etsy.com/listing/1597967688/personalized-flower-hidden-name-necklace?click_key=4498cf3fd0f482c073ff624c43a709e4d40411c9%3A1597967688&click_sum=e3210360&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-6&pro=1&frs=1&etp=1",
    "title": "Personalized Flower Hidden Name Necklace, Floral Garden Necklace, Dainty Secret Message Pendant, Custom Flower Jewelry, Gift for Mother",
    "description": "Personalized Flower Hidden Name Necklace, Floral Garden Necklace, Dainty Secret Message Pendant, Custom Flower Jewelry, Christmas Gifts.♥♥ Handmade with love ♥♥♥♥WHY YOU WILL LIKE THIS PRODUCT♥♥• This necklace has a simple and elegant design. Wear this Dainty Custom Paw Necklace With Name and get all the attention.• It is a product that will satisfy women of all ages. This item is perfect for you as an ideal gift for Christmas.MATERIALS• Material: 925 Sterling Silver• Finish: Gold• Chain color: Gold,Silver• Chain Lengths: “12+2 inch - 30+5 cm, “14+2 inch – 35+5 cm, “16 inch - 40 cm, “18+2 inch – 45+5 cm, “20+2 inch – 50+5 cm, “22+2 inches – 55+5 cm• (+2 inches extender for each product to help if you want to adjust the product)♥♥ We will package your ring in a beautiful gift package.PROCESSING TIME• All items are custom made to order. Our turn around time is 3-6 business days.SHIPPING• Shipping time: 1-5 business days.C A R E I N S T R U C T I O N S- Do not wear it to the pool, spa, or the beach- Avoid contact with perfumes, body oils, and other chemicals, household cleaners.- Do not use chemical jewelry cleaners. Gently polish with a soft, microfiber or other lint-free clothes.- Store your jewelry in the cool dry places.- Remove it when sleeping, exercising, or doing other physically strenuous activitiesHOW TO ORDER- Please choose your necklace color and chain length.- Please write the name you want to be written in the \"Personalization Box\".- Please complete your order.Please feel free to contact me if you have any questions.♥♥Thank you so much for your order.♥♥",
    "reviews": [
      "Lovely gift for my daughter.",
      "Beautiful ... exceeded my expectations",
      "It is a gorgeous necklace!",
      "Beautiful necklace and prompt delivery"
    ]
  },
  {
    "productId": "ANwesYYWTs",
    "url": "https://www.etsy.com/listing/1603901418/baby-shower-personalized-gift-basket?click_key=92acc5a302b1c41c120fd0547dc500225654171c%3A1603901418&click_sum=e8a5a395&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-7&pro=1&etp=1&sts=1",
    "title": "Baby shower personalized gift basket, baby Gift Basket Rope Cotton Basket Baby Gift Basket Toy Basket Storage Basket Baby Name Gift",
    "description": "Our delicate personalized baby shower rope cotton baskets are designed to add a touch of practicality and organization to your baby's nursery. These delicate baskets are perfect for organizing and storing essential items while adding a personalized touch to your space.Each basket is carefully crafted with attention to detail, using high-quality cotton rope and feature sturdy handles for easy carrying and convenient usage.You can choose to have the baby's name, initials, creating a unique and memorable keepsake.If you need to RUSH YOUR ORDER. add this listing to your cart along with your basket and we will ship in 1-2 business days.https://www.etsy.com/listing/1672821827/rush-order-ships-1-2-business-daysThese personalized baskets make wonderful gifts for baby showers, and their versatility allows them to serve multiple purposes in the nursery or kids' bedroom. Use them to store diapers, wipes, lotions, toys, as a cute laundry hamper or even to store books.The collapsible design allows for easy storage when not in use, maximizing space efficiency in the nursery.Medium size measures  12.5x8.6x 5.1Large size measures 14x13x6Steps to order:1.Choose Name Color2.Add your personalized text (maximum number of characters is 9)",
    "reviews": [
      "Cant wait to give it to my grand daughter!",
      "Very cute!! Great quality and shipped fast.",
      "The basket Met all expectations!",
      "This was a great baby shower gift filled with all the necessary goodies you need for a newborn! It was so cute!"
    ]
  },
  {
    "productId": "mqTBHB1yxm",
    "url": "https://www.etsy.com/listing/1268593152/personalized-babys-five-star-plush-robe?click_key=443c79f9ae07713fc5fec035821d7653553458e6%3A1268593152&click_sum=d70481fa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-8&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Baby’s Five-Star Plush Robe - New Baby Gift - Baby/Toddler Robe - Choose 6-12 Months Or 12-24 Months - Available In 3 Colors",
    "description": "MAKE BATH TIME LUXURIOUSLY FUN: When you wrap your baby up in this super-soft plush robe, bath time gets elevated in an inviting, cozy way. It acts like a high-quality towel but has fun elements like deep pockets and a waist tie.UNIQUELY PERSONALIZED: Choose pink with pink or gray thread; white with gray, dark pink or navy thread; or navy with gray thread—Personalize with any name up to 9 characters.SIZES FOR ALL BABIES: Choose 12-24 months (chest 13 3/8”, front length 18”) or 6-12 months (chest 12 1/4”, front length 15-3/4”). All sizes are approximate in inches.PREMIUM QUALITY: Made of plush polyester microfiber. Machine wash warm with like colors, gentle cycle, only non-chlorine bleach when needed. Tumble dry low. Imported for final manufacture locally.A SWEETLY SOPHISTICATED GIFT: Post-bath cuddles will take on a whole new meaning when your little one is wearing their soft, ultra-absorbent robe. It’s never too early to introduce them to the finer things in life!",
    "reviews": [
      "So fast and amazing quality! This will be a new go-to for gifts!",
      "Awesome company!  Very customer service oriented. ❤️",
      "This robe is the cutest thing ever. I wish I could fit more letters but I made do with the character count. It’s soooo soft and fits my 1 year old perfectly.",
      "My great granddaughter absolutely loved it."
    ]
  },
  {
    "productId": "PoKwvxECmJ",
    "url": "https://www.etsy.com/listing/1615684401/cozy-gift-box-hygge-gift-box-engraved?click_key=81f689369a330ede95a8cd7a2aaf2395098b848a%3A1615684401&click_sum=be272981&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-5&pro=1&frs=1&sts=1",
    "title": "Cozy Gift Box, Hygge Gift Box, Engraved Gift, Cashmere Scarf Gift, Personalized Gift Box, Spa gift box,  Sending a hug, Thinking of You Gift",
    "description": "Cozy Gift Box, Hygge Gift Box, Engraved Gift, Cashmere Scarf Gift, Personalized Gift Box, Holiday Gift Basket, Spa gift box,  Sending a hug, Thinking of You Gift, Handmade Gift Basket, Thank you Gift box, Spa gift for women, Birthday Gift Box, Spa gift basket, Spa gift box, Christmas Gift Box, Self-care, Sending a hug, Thinking of you, Birthday Gifts. Sending A Hug, Thinking of You Gifts, Best Friends Gift.Send this thoughtful gift to your loved one. Make it extra personal by having it engraved.An amazing gift choice for the Holiday Season or for Any Occasion!Pick the handmade hygge gift box with a cashmere scarf, a notebook, fuzzy socks and more goodies that work best for any occasion - whether you want to send hugs and love to a friend who's going through rough times, or a loved one who doesn't feel well and needs some positive get well vibes. Encouragement gift baskets and cheer up care packages are the best way to show how much you love them!FREE personalized message included. Gift wrapping available (choose wrapped gift box when completing the purchase)You can personalize it. Make it personal by engraving the notebook (choose add engraving option when completing the purchase)BOX 1:❀  Cashmere Scarf❀  Notebook (choose to have it engraved for additional cost)❀  Diamond Pen❀  Fuzzy Socks❀  Rose Shea Butter Flower Soap❀  Natural Soap Saver Pouch❀  Organic Shea Butter enriched Lip Balm❀  Gourmet Tea❀  Honey with wooden spoon❀  Sugar Free Lemon Drop Candy in a paper pouch❀  9x6x3 box, paper filler and free message printed on a cardBOX 2:❀  Cashmere Scarf❀  Notebook (choose to have it engraved for additional cost)❀  Diamond Pen❀  Gourmet Tea❀  Honey Jar with wooden dipper❀  Sugar Free Lemon Drop Candy in a paper pouch❀  9x6x3 box, paper filler and free message printed on a cardBOX 3:❀  Cashmere Scarf❀  Notebook (choose to have it engraved for additional cost)❀  Diamond Pen❀  Rose Shea Butter Flower Soap❀  Natural Soap Saver Pouch❀  Sugar Free Lemon Drop Candy in a paper pouch❀  9x6x3 box, paper filler and free message printed on a cardBOX 4:❀  Notebook (choose to have it engraved for additional cost)❀  Diamond Pen❀  Organic Shea Butter enriched Lip Balm❀  Fuzzy Socks❀  Hot Cocoa❀  Brownie Brittle❀  9x6x3 box, paper filler and free message printed on a cardBOX 5:❀  Notebook (choose to have it engraved for additional cost)❀  Diamond Pen❀  Gourmet Tea❀  Honey Jar with wooden dipper❀  Sugar Free Lemon Drop Candy in a paper pouch❀  9x6x3 box, paper filler and free message printed on a cardSunshine gifts, with love, heart, mug, sending sunshine gifts, hug in the box, thinking of you care package, best friend birthday gift for her, care package for her, care package, cozy gift, extra cozy gift, hygge gift box, hygge gift basket, gift basket for her, gift basket for him, hygge gift ideas, gifts for women, fall gifts for team, corporate gifts, appreciation gift, gifts for her, holiday gifts, holiday gift basket, valentine's gifts, valentine's day gift box, holiday gifts for women, holiday gifts for men, corporate gifts, employee gift box, self care gift basket, care package, get well care package, just because, happy holidays gift, valentine's day gift basket, best gifts for her, gift basket for mom, gift box for best friend, you're my sunshine gifts, birthday gift, Get Well Soon Gift, Friend Gift, Best Friend Gifts, birthday gift for her, giftbox, relaxation basket, relaxation gift, relaxation, relax, birthday box, birthday gift, birthday set, birthday, birthday gift basket. Self care gift box, New mom gift basket, Spa gift box ,birthday gift for herBath Set. bridesmaid gift set, Spa gift, Holiday gift, Spa basket, Birthday bath and body gift, Bridesmaids spa Gift Gift for Mom, mom gift, Christmas gifts, birthday gifts, gift for her, friend gift, gift basket, gift box, birthday gift for her,",
    "reviews": [
      "Unable to access quality since was sent as a gift",
      "Very nice gift!  This will make a great care package.",
      "I got this for a friend who had graduated and she absolutely loved it and loved the personalization."
    ]
  },
  {
    "productId": "IIRbfvFyFc",
    "url": "https://www.etsy.com/listing/1667967290/realtor-closing-gift-housewarming-gift?click_key=a047e1a81586ee83deea9431d95627010625f1ba%3A1667967290&click_sum=3b941ad7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-6&pro=1&sts=1",
    "title": "Realtor Closing Gift, Housewarming Gift, Realtor Logo, Personalized Gift for Clients, Realtor Gift Buyers or Sellers, New Home Gift",
    "description": "Are you a realtor looking for the perfect closing gift to leave a lasting impression on your clients? Our specially curated gift box is designed to do just that. Crafted with care and attention to detail, each item in our collection is handpicked to reflect the joy of homeownership and the excitement of new beginnings. From elegant home décor pieces to personalized keepsakes, our gift box is sure to delight your clients and show them how much you appreciate their business. Say thank you in style with our exclusive selection.♥ If you are purchasing more than 5 boxes, please place ONE order with the desired quantity and download and fill up this excel sheet (http://bit.ly/Eryns-multiple-boxes) with EACH recipient address, and email it to erynshomeandgifts [!at] gmail.com ​♥♥ Leave us the details in the Personalization BoxClosing giftRealtor giftHousewarming giftPersonalized home decorCustomized keepsakesReal estate client giftNew homeowner giftHome closing presentUnique housewarming giftRealtor appreciation giftHomebuyer thank you giftClosing day surpriseCustom housewarming giftPersonalized closing giftRealtor closing gift ideasHousewarming basketMoving day giftHome sweet home giftWelcome home presentHome décor giftCustomized home accessoriesRealtor referral giftReal estate closing tokenPersonalized home artworkCustom house keychainHomeowner milestone giftHouse closing mementoPersonalized home plaqueReal estate agent appreciation giftHomebuyer celebration giftHousewarming candleCustomized home signRealtor thank you presentNew home celebration giftReal estate closing souvenirPersonalized home ornamentCustomized housewarming decorRealtor client thank you giftHome closing keepsakeHousewarming party favorPersonalized real estate giftCustom home accessoryRealtor closing day giftNew homeowner celebration presentHousewarming gift boxPersonalized real estate decorCustomized housewarming keepsakeHome closing memoryRealtor appreciation tokenReal estate client thank you presentNew home ornamentPersonalized housewarming ornamentRealtor closing tokenHomebuyer welcome giftHousewarming decorationRealtor closing day surprisePersonalized real estate keepsakeCustomized home décorRealtor gratitude giftReal estate closing celebration giftNew homeowner keepsakeHousewarming basket ideasPersonalized house key holderRealtor thank you mementoHome closing celebration presentHousewarming throw pillowRealtor closing presentReal estate closing gift basketPersonalized realtor giftCustomized home closing giftRealtor appreciation presentNew home artworkHousewarming wine giftPersonalized home welcome signRealtor referral thank you giftReal estate closing party favorHomebuyer closing giftHousewarming gift setCustomized real estate souvenirRealtor closing day mementoNew homeowner plaquePersonalized real estate ornamentRealtor thank you tokenHome closing party favorHousewarming present ideasPersonalized housewarming gift ideasRealtor closing day surprise ideasCustom real estate decorRealtor appreciation souvenirNew home candleHousewarming gift for clientsPersonalized real estate signCustomized housewarming plaqueRealtor thank you keepsakeHome closing party giftHousewarming gift for new neighborsRealtor closing gift basket ideasReal estate client appreciation giftPersonalized home closing tokenCustomized realtor closing gift",
    "reviews": [
      "Beautiful quality! Beautiful materials! Thank you!",
      "Was a perfect gift for my sister- she loved it!",
      "I sent this to my best friend for her birthday and she loved it! Especially the smells that were coming from the box before she opened it."
    ]
  },
  {
    "productId": "NZFhBmFmpb",
    "url": "https://www.etsy.com/listing/933297264/personalized-water-bottle-custom-water?click_key=716521162d0fef0d2f31d4a52ae3e890ad250977%3A933297264&click_sum=9588c442&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-7&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Water Bottle, Custom Water Bottle, Personalized Gifts for Her, Engraved Insulated Water Bottle & Straw Lid - Name Bottle",
    "description": "Water Bottle Personalized w Logo or Design - Custom Water Bottle, Stainless Steel - Personalized GiftsOur Bulk Prices--------------------------------18OZ - 2PC $54.9518OZ - 3PC $74.9518OZ - 6PC $129.9518OZ - 10PC $199.95--------------------------------24OZ - 2PC  $59.9524OZ - 3PC  $79.9524OZ - 6PC  $149.9524OZ - 10PC  $229.95--------------------------------32OZ - 2PC  $62.9532OZ - 3PC  $84.9532OZ - 6PC  $159.9532OZ - 10PC  $239.95--------------------------------40OZ - 2PC  $69.9540OZ - 3PC  $87.9540OZ - 6PC  $164.9540OZ - 10PC  $249.95Our bottles are BPA-free but not dishwasher safe.****If you need a custom design please contact us before placing your order.****PREMIUM INSULATED WATER BOTTLE - Stay hydrated in style with a sleek bottle that takes care of your favorite drink. 18, 24, 32, 40 oz. powder coated water bottles are made of stainless steel and have double-walled insulation, which means your beverage will stay hot for 12 hours and cold for 24 hours. Easily fill your bottle with ice and clean it through the wide mouth opening.CUSTOMIZE ON YOUR OWN - Select your size, color & design then enter your customization which fits with your selective design. Laser engraving will remove the paint on the tumbler, exposing the smooth stainless steel. Our products are crafted to be as unique as you are, and designed to inspire the community with others. Choose your color and design to create your own bottle that is perfect for your lifestyle.MULTIFUNCTIONAL - Note: Fits any cup holder. For sports, fitness, gym, traveling in your car, staying hydrated at work, drinking soup while camping, enjoying hot, piping coffee, iced cold water, and so much more.ECO-FRIENDLY - Safe, healthy alternative to plastic bottles and cups. Reusable, unbreakable, and easy to wash. Eliminate single-use cups and waste and buy this cup that lasts a lifetime. Help save the world!!!! KINDLY NOTE: HANDWASH ONLY !!!FAST SHIPPING: We ship orders in 2 Business days. If you have any questions, please contact our customer service and we will reply shortly.",
    "reviews": [
      "GOOD QUALITY. Fast shipping. As descrive.",
      "It was perfect, worth every penny!",
      "I love so much ❤️",
      "I have already reviewed this product"
    ]
  },
  {
    "productId": "gqrBIQeBTU",
    "url": "https://www.etsy.com/listing/1161358788/personalized-gifts-for-him-groomsmen?click_key=4908ccf0db29eb6e07aa74f15fb43ff89e3a3c75%3A1161358788&click_sum=5c7204d0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-8&pro=1&frs=1&bes=1",
    "title": "Personalized Gifts for Him, Groomsmen Wallet, Engraved Leather Wallet for Men, Christmas Gift, Personalized Wallet, Custom Wallet for Men",
    "description": "Personalized Gifts for Him, Christmas Gifts, Engraved Leather Wallet for Men,Personalized Wallet, Handmade Custom Engraved Wallet for Men, Fathers Day Gifts** NEXT DAY FREE SHIPPING WITH USPS **I handcraft high-quality top-grain leather wallets. You can personalized with engraving on the front side with a monogram, name, logo. For inside you can add your message or your hand-written which making it very special for someone who will receive it.Functional and trendy, this Custom Leather Wallet is the perfect place to hold your most important cards.  Designed with the person who’s on the go in mind, this leather wallet features an array of conveniences. Not only is it easy to get your cards out of, it also can be customized with your monogram.Great as a gift, this credit card wallet is something that your loved ones will appreciate as a trendy and functional holiday gift.  Gift this amazing leather wallet to someone that you know that loves to shop!* FEATURES *- %100 Genuine Leather- Hand stitching- 12 Card Slots, 1 ID Flip-Up with Transparent Slot, 1 Cash Room and 2 Hidden Card Places.- 3 1/2\" by 4 1/2\" FoldedPersonalized Wallet, Engraved Wallet, Leather Wallet, Gift for him, Handwriting Wallet, Leather wallet for Men, Mens Wallet",
    "reviews": [
      "Was quick in getting me the product and did great with transferring my daughter's handwriting to the wallet.",
      "Great quality and speed of shipping. Very affordable would definitely order again.",
      "GREAT SELLER! Great quality! Fast shipping. My man loves his gift. I recommend seller 💖"
    ]
  },
  {
    "productId": "nYsgYyVtIM",
    "url": "https://www.etsy.com/listing/790790109/safari-blanket-personalized-baby-blanket?click_key=691a03b119753d7d8d2a68919ba47051d151b290%3A790790109&click_sum=c8f99a41&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-9&pro=1&frs=1&etp=1&sts=1",
    "title": "Safari Blanket, Personalized Baby Blanket Gift, Toddler Blanket, Jungle Nursery Decor, Toddler Birthday Gift, Safari Theme, Elephant, BB02",
    "description": "Baby BlanketThis blanket makes a perfect keepsake and baby shower gift for a mom to be.They are perfect for Hospital Gifts, Birth Announcements, Birthday Gifts, Christmas and just snuggling those precious babies.DETAILSDesign: Printed On One Side. Designs are printed using high quality inks that will not fade or peel. The fabric stays silky smooth against skin. This is NOT embroidery or vinylCare: Machine Wash; Tumble DryAvailable Materials: Fleece / Minky / Sherpa (dependent on size)Please Note: All sizes have a variance +/- 1\"-2\" due to heat causing shrinking when pressed.DISCLAIMER: Periodically tiny microfiber dots may occur – this is a natural occurrence in the fabric (mostly seen in fleece). They typically appear black, blue, orange or yellow in color. Once the fabric is washed, they usually are less visible. This is common in sublimation - caused by natural fiber particles!Please note with preconstructed items, exact symmetry is not guaranteed.*Please review photos for size references!*CUSTOM ORDERSI LOVE creating new designs but for a design that I do not currently offer please contact me before ordering to see if can create your request.HOW TO ORDER1. Choose the Size & Material for the drop down menu above (see photos for references)2. Add your Personalization requests (include the name(s), font, and color)3. Click \"Add to Cart\"4. Enter your payment information, shipping address, *DOUBLE CHECK EVERYTHING* and click \"Order\"5. Sit back and wait for your special package in the mail!RUSH ORDERSIf you are in a rush, I do offer an express production option.Please add this listing to your order-https://www.etsy.com/listing/498793304RELATED LISTINGSInterested in more personalized baby gifts? Look through the following listings to complete your order!https://www.etsy.com/shop/DashingFoxCoFAQS:.What material is most popular?Jersey is our most popular for baby swaddles because they're stretchy and are not thick.  Minky and Sherpa are our most popular for a standard baby blanket because of the softness and thickness.Are these personalized?Yes, the babies name will be changed to the one that is left in a note for me during checkout. If you would not like a name to be added you can leave the note blank or simply leave \"No Name.\"Do you do custom designs?Absolutely! I love to make custom designs. Please contact me before ordering to make sure that I am able to produce the design you would like.Can the blanket be made in a different color?Sometimes, The text and parts of some designs can be made with a different color. Watercolor floral is not able to be changed however I can try to create something with floral in the color you are looking for. Please contact me before purchasing to make sure I can make the adjustments you would like.Can my order be rushed?Yes, if you need your order rushed, I do offer an express production option to have your order shipped quicker. Just apply it to your order:https://www.etsy.com/listing/498793304Can the fonts be changed?Absolutely!! Just include a note for me during checkout.What is Minky?Minky is a special type of plush fabric that is often used to make baby blankets, baby clothing and baby accessories. Minky fabric is like fleece – but softer and thicker.What is Jersey?It is a 100% lightweight polyester material that stretches. Perfect for swaddling. Features rounded corners.What is Fleece?Fleece blankets are made of 100% Polyester. It is a thinner blanket but provide a very vibrant print.What is Sherpa?Sherpa is an Ultra Plush blanket. It is a 100% polyester with a faux fur fabric on the back. The faux fur side is available in white. Tan back is available by request only.Will I receive a proof?We do not supply a proof of your personalized design as standard to ensure we do not delay your order, however if you would like to see the design before we create it please request this along with your personalization when you place your order. If requested we will not proceed with your order until you are 100% happy with the design. Please ensure you factor in extra time for this, as edits may delay your order.ADDITIONAL NOTES▹ Please keep in mind when ordering that color settings on monitors and lighting in product photography vary so the product might differ a tad from what you see on screen.▹ I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.▹ If you have any questions, please use the “Message Seller” button next to the price and I’ll get right back to you.Remember to select the ♥ FAVORITE button to save this product for later!Thank you so much for shopping at DashingFoxCo!https://www.etsy.com/shop/DashingFoxCo© 2019 DashingFoxCo",
    "reviews": [
      "Great vendor to work with corrected mistake forthwith.",
      "Good fast delivery  good quality",
      "Just as I was expecting.  Great blanket."
    ]
  },
  {
    "productId": "zPQzUshHlw",
    "url": "https://www.etsy.com/listing/1507846774/personalized-wall-mount-custom-headstock?click_key=647d03d0da0e6725a79457bcb08645a03f7b29ff%3A1507846774&click_sum=45cf6412&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Wall Mount Custom Headstock Shapes",
    "description": "Usually ships in just one to two days! Free domestic shipping! If you would like a proof of your personalization, you need to message us before checking out.The Headstock Shaped Guitar Wall Mounts by Left Coast Original. Also holds bass guitars, ukuleles, banjos, mandolins or most any instrument with a headstock.𝙋𝙍𝙊𝘿𝙐𝘾𝙏 𝘿𝙀𝙏𝘼𝙄𝙇𝙎Create a space that is as one of a kind as your beloved electric or acoustic guitar with our personalized wall mounts!Designed to securely hold guitars, bass guitars, banjos, uke’s, and more.Each mount contains:- Two 2-inch Phillips head screws for securing your mount to the wall- One 1⅝-inch Phillips head screw for securely attaching our custom hook to the wall mount.We are proud to offer 100% renewable materials for our personalized cutting boards! The bamboo used is cut from an FSC Certified forest. Not only is bamboo an incredibly strong and lightweight material for personalized cutting boards, but increased use of this eco-material helps cut carbon production. All of our pieces are hand finished and truly unique with natural variances and inclusions. The engraved area will show a natural variation in color and tone.Choose from the Following Shapes:- Taylor- Fender (with angled headstock rest for Bass or Fender Guitars. See photos)- Gibson- ClassicalPRODUCT DIMENSIONS: Approx 4 in x 8 in x 3/4 in thickDouble check your ukulele headstock measurement to make sure it’ll fit. Some uke’s have a smaller headstock. The opening for the headstock bracket at its widest is about 2.14 inches.Finished with our homemade board butter made from food safe mineral oil and beeswax. We do not treat our bamboo products with sealants, varnishes, or dyes.𝙃𝙊𝙒 𝙏𝙊 𝙊𝙍𝘿𝙀𝙍Please read our instructions carefully - we will engrave exactly as requested in the personalization box. We are not able to make changes once your order is processed.Add your request in the Personalization Box or the Add a Note to Seller section when checking out.Tell us:1. What you'd like engraved and on which piece if ordering a set (50 characters or less)2. Your font choice (see our listing photos for reference). If no font is specified, we'll use Font 3 for names and Font 9 for monograms.Fonts 7-9 showcase a larger middle initial. Please send initials in the 𝙚𝙭𝙖𝙘𝙩 𝙤𝙧𝙙𝙚𝙧 you want them engraved. The middle initial will be larger.For Font 10 specify the letter you want used for the large initial. If none is specified, we'll use the first initial of the last name, or first name given.For Fender style shapes, the small top engraving placement is available upon request. The default placement for the engraving is bottom large engraving. Both options are shown in the item listing pictures.𝘾𝙐𝙎𝙏𝙊𝙈 𝙂𝙍𝘼𝙋𝙃𝙄𝘾𝙎 / 𝙇𝙊𝙂𝙊𝙎If you'd like a Sports Team, Company Logo or any custom image engraved, send us a high quality, black and white graphic (with no gray areas or shading) via Etsy Messages. After you check out, simply attach your graphic to the message thread and send it over to us.𝙎𝙃𝙄𝙋𝙋𝙄𝙉𝙂Usually ships in about 1-2 business days. Free Standard Shipping on US orders. Shipping upgrades are available upon checkout.𝙍𝙀𝙁𝙐𝙉𝘿𝙎 𝘼𝙉𝘿 𝙀𝙓𝘾𝙃𝘼𝙉𝙂𝙀𝙎All items in our shop are made per order and just for you. Personalized pieces are not eligible for refunds or returns.If there is a material defect with the piece, we will gladly make you a new one. If you have a question or concern about your order, please message us first so we can help fix the situation. We stand behind our work and aim to create the highest quality products.Please review our shop policy before placing your order for questions concerning proofs, our engraving process, non-personalized returns, international shipping, and delayed/lost packages.----------------------------Thanks for shopping with us!Visit our shop front, Left Coast Original. It features other functional and impeccably designed bamboo, leather, and wood pieces:https://www.etsy.com/shop/leftcoastweddingsLeft Coast Original is a Registered Trademark and all of our pieces are copyrighted and/or patented or patent pending.",
    "reviews": [
      "better than expected, thank you!",
      "Item is crafted beautifully.  Perfect gift for any guitar player.  Very pleased.",
      "Exactly as advertised. Excellent product"
    ]
  },
  {
    "productId": "srbMm2uRub",
    "url": "https://www.etsy.com/listing/1317733254/christmas-gift-for-her-gift-for-mum-gift?click_key=a36f6997ef7577aa62bf20a32074933b5500c38e%3A1317733254&click_sum=ccc48533&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-11&pro=1&etp=1",
    "title": "Christmas gift for her gift for Mum gift for Girlfriend Christmas gift ideas gift for wife gift for sister gift for woman Custom Jewelry box",
    "description": "Personalised Jewellery can store daily jewelleries.  This is a cute gift for bridesmaids, the maid of honor or any woman in your bridal party. This box can be used to store several rings, earrings, and dainty bracelets or necklaces. Besides, it is convenient to bring everywhere. Hence, it is a perfect partner for travel!!!*********US FREE SHIPPING OVER $35********LAMORIEA SPECIAL SERVICE: Our designer will show you the design before we start to produce your jewelry box.  Please allow 24 Hours for the designer to send a preview photo after placing your order. You can request to change all previews until you are satisfied!  Please feel free to communicate with us.PRODUCT DETAILS:Lettering Colour:♥ Gold♥ Rose Gold♥ Silver♥ Black♥ White♥ Champagne Gold♥ Holographic♥ Burgundy♥ Glitter Blue♥ Glitter Gold♥ Glitter Moonlight♥ Glitter Blush Pink♥ Glitter Red♥ Glitter SilverCONTENTS NOT INCLUDED. BOXES ARE EMPTY INSIDE.Material: LeatheretteSize: 10cm x 10cm x 5cm",
    "reviews": [
      "Lovely items we ordered 3 and all were beautiful",
      "Attractive jewellery box with chosen name on lid - very handy for travel",
      "Great travel size jewellery box. I chose the black with gold writing. Font and style turned out the way I wanted it too. I paid for it to be gift wrapped which was done well. Very pleased overall.",
      "My wife really enjoyed receiving this gift."
    ]
  },
  {
    "productId": "HRJvggeljW",
    "url": "https://www.etsy.com/listing/1315569390/personalized-initials-ring-dishcustom?click_key=e0fe2ecc454dcbbf71144ec808a65c7344fb8978%3A1315569390&click_sum=8fd71c33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-12&frs=1&etp=1&sts=1",
    "title": "Personalized Initials Ring Dish/Custom Jewelry Dish/Wedding Ring Dish/Wood Ring Holder/Mens Ring Dish/4th Anniversary Gift/Engagement Gift",
    "description": "DIMENSIONS are 2.75\" x 2.75\".**GIFT WRAPPING AVAILABLE ON SEPARATE LISTING**https://www.etsy.com/listing/1197419225/This mini initials walnut ring dish makes a beautiful wedding gift, anniversary gift, bridesmaid gift, birthday gift, or any occasion gift! Customized with your initials, this modern wooden ring dish is designed to hold your wedding rings while you shower, do the dishes, or go to sleep. This mini ring dish fits perfectly in your hand and looks great on a tabletop or nightstand. We offer this ring dish in walnut or mahogany.The ring dish is hand-finished with an all-natural clear stain and protected with a beeswax seal, giving it a semi-gloss finish. Its dimensions are 2.75\" x 2.75\".ORDERING PROCESS:Please select whether you would like an engraving from the drop-down menu. If you have an alternative font or text, select \"Custom Engraving,\" send us a message, and we'll do our best to accommodate you. If no engraving, select \"No Engraving.\" There is also an option to add a cork backing to the ring dish if you prefer. Specify whether you want uppercase or lowercase letters. If you would like uppercase, the letters will not come with swashes (decorative curved lines).Design preview provided only upon request.NOTES:*Does not come with jewelry.**Please note that each tray is unique and there are variations on each piece of hardwood from which the trays are made. Natural walnut ranges from light blond to nearly black in color. Knots, dark streaks, and light streaks are all common characteristics of walnut. Engravings may appear darker or lighter as well.***If you receive a damaged item, please contact us immediately. We must receive a report of the damaged item within 24 hours of delivery, including a picture of the item and packaging.Feel free to message us with any questions.",
    "reviews": [
      "Great gift for my anniversary.",
      "Adorable! A little smaller then I thought, but all in all a great buy!",
      "Great item that was true to the description!",
      "Perfect gift for my daughter’s engagement party ❤️"
    ]
  },
  {
    "productId": "MbtSojZOid",
    "url": "https://www.etsy.com/listing/1216509209/personalized-leather-keychain-customized?click_key=a83cb832fa97e693613e2f11413ffd4793566fa5%3A1216509209&click_sum=501a8f1a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-13&pro=1&etp=1&sts=1",
    "title": "Personalized Leather Keychain Customized Leather Keychain Genuine Leather Key Chain Engraved Keychain Key Tag Gift for her Gift for him",
    "description": "These keychains make wonderful gifts for that special person and even as corporate gifts.  Personalize them and add an extra special touch to your gift.100% high quality genuine leatherLeather size - 8 x 2.8cmRing size - 2.5cmPLEASE ENSURE YOU SPECIFY FONT/SYTLE TO USE IN THE PERSONALIZATION BOX.Fonts 1 / 2 / 3 - maximum 20 characters including spaces and symbols. More the characters smaller the font.Font 4 - 3 letters all in CAPITAL (middle letter larger than the other 2 letters.)Font 5 - 2 letters in CAPITAL.Font 6 - 2 or 3 letters initials all in CAPITAL (same size letters).Also available in my shop:Monogram Designs available under this listing:https://www.etsy.com/ca/listing/1430340371/personalized-monogram-leather-keychainSkinny Leather 1 ring option:https://www.etsy.com/listing/1216529497/personalized-leather-keychain-customizedThese keychains are handcrafted from genuine leather. Each keychain is unique in its look and feel. There may be a slight variation in the shade of the leather from the photos due to lighting, screens and slight differences between the leather batches. Our products are made from 100% real hides, range marks such as scars and even bug bites are to be expected on genuine leather. Please keep in mind that I don't issue refunds or exchange for these natural markings.Standard shipping doesn't have tracking.  If you'd like tracking or are in a rush to receive it please upgrade shipping at checkout. Your order will be shipped on time but we are not responsible for delays in shipping.  Refunds will not be provided for delayed delivery.Thank you!",
    "reviews": [
      "Really nice quality. Feels like it'll last so long",
      "Great customizable gift! Totally recommend!",
      "Amazing!!!! Beyond happy with this purchase",
      "Item just a described. Great quality and prompt shipping!"
    ]
  },
  {
    "productId": "OMwezpVMSc",
    "url": "https://www.etsy.com/listing/659993162/personalised-childrens-book-a-promise-to?click_key=e87aa1ff2415ddfbb01f8c4b3ed4d93a50e7a221%3A659993162&click_sum=2e061b29&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-14&frs=1&etp=1",
    "title": "Personalised Children's Book, A Promise To You, Baptism Gift, Gift for Godchild, Grandchild, Gift for Niece Nephew, Personalized Story Book",
    "description": "A beautifully illustrated personalised book filled with love and promises to give to a child close to you to show them how much they mean to you.This delightful book is filled with wonderful promises to help and guide a child through their lives. It can be from one or two people and is personalised with your name and the child’s name. A truly special book to be treasured for a lifetime.The words:I/We promise you a warm and safe place in my/our home, and hearts. I/We promise to always have time for you... To talk to you and listen to you. To sing with you and dance with you. I/We will show you how wonderful your world is... we are going to have so much fun! I/We promise to learn about the things you love, so I/we can love them too. I/we promise to always have a cuddle – and a smile for you. I/we may not be able to reach up and grab you a star, but I/we will be by your side to look at them together. I/we promise to help you pursue your dreams... and help you grow to be strong and happy and free. I/we promise to encourage you to follow your own path. I/we will share my/our knowledge with you... and learn from you. I/we may not always be able to stop you getting hurt – but I/we promise to always do my/our best to make you feel better. And my/our biggest promise to you is that I/we will be there for you, whenever you need me/us, day or night. All our/my love...Made from high quality paper and binding.UK CUSTOMERS: Shipped from Devon, UKUSA CUSTOMERS: Shipped from San Jose, CA, USAAUS/NZ CUSTOMERS: Shipped from New South Wales, AUSCANADA CUSTOMERS: Shipped from Ontario, CAN'A Promise To You' is created by award-winning authors Steve Wilson and Lucy Tapper, and illustrated by Lizzie Foster-Turner.Please note that what you type is what will appear in the final book. THIS BOOK Is AUTOMATICALLY SENT TO PRINT ONCE YOU ORDER so please check all spelling, grammar and customisation before ordering. PLEASE type carefully!Please Note: This book takes 5 - 7 days for dispatch, so Express Delivery is not available on this product.Dimensions: 210mm x 210mm, 32 pages.",
    "reviews": [
      "Sweet story and beautiful quality",
      "It came super quick and was made with very nice quality.",
      "so cute love it lots"
    ]
  },
  {
    "productId": "yeUcrMBQFt",
    "url": "https://www.etsy.com/listing/567858721/monogrammed-journal-with-lined-pages?click_key=fb0256f5203b4de1977454ffa84c234fa4ad02c6%3A567858721&click_sum=24ed56dc&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-15&pro=1&etp=1",
    "title": "Monogrammed Journal with Lined Pages, Engraved Leather Journal, Personalized Notebook, Customized Leather Gift, Custom Leatherette Journal",
    "description": "Monogrammed Leather Journal - 5 1/4\" x 8 1/4\"  x 3/4\"Engraving will be black on all colors except RUSTIC BROWN and BLACK (2 options)- Rustic Brown engraves to Gold- Black engraves to Silver or Gold- Blue engraves to SilverCustom requests are welcome and more design options available herehttps://www.etsy.com/shop/EventCityDesign?ref=seller-platform-mcnav&section_id=22591708***ORDERING***Please select the design number and enter the exact details for the engraving in the notes box or send us a message after you order with those details. We will contact you for clarification if the details you provided are not clear or are not formatted for that particular design.  Make sure to scroll through all photos so you don't miss the design and color options.***MONOGRAMS***If ordering a monogram design, please note the initials in the order shown below based on the design style you pick as we will engrave the initials in the order you provide them.***PROOFING***A black & white proof is provided upon request and is always a good idea if you want to double check what will be engraved. With proofing you can request design changes and we will not start making your order until you have approved the proof OR if we have not received a response back from you in over 2 weeks (in some cases the order may be canceled at this point if it's clear we are missing information from you).***DETAILS***112 lined pagesBlack Satin Ribbon BookmarkSize: 5 1/4\" x 8 1/4\" x 3/4\"Material: LeatheretteColor Options: Red, Pink, Rose, Grey, Light Brown, Rawhide, Dark Brown, Rustic Brown & Gold, Black & Silver, Black & Gold, and Blue & Silver.***Please view our shop policies for additional information on ordering, shipping (domestic & international) & proofing.",
    "reviews": [
      "Overall, this item is beautiful! I do love the exterior, but not a huge fan of the actual interior (although I was 100% aware of what it looked like prior--so no fault on the seller's side). Almost every etsy seller seemed to have the same kind of notebook paper, so there wasn't much of an option, BUT regarding the exterior, there were many font options to choose from and the font that I chose looked exactly as it should! I looked through many journals for hours, but this journal seemed to be the most \"legit\" in terms of expectations. If you are debating whether or not the font will turn out exactly as is shown in the example photos, debate no longer. The journal was gifted to a friend, so I didn't think to take a photo at the time, BUT I will hopefully update with a photo when I get the opportunity to do so.",
      "Excellent product and great seller! Turned out better than I hoped for.",
      "It is great quality and I was very pleased!"
    ]
  },
  {
    "productId": "MHAiKQSQXv",
    "url": "https://www.etsy.com/listing/1066771775/star-map-on-night-light-personalized?click_key=7a12077aed92a4e6e280f33ce8cc4e437950ab9d%3A1066771775&click_sum=518a14a9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-16&pro=1&etp=1&sts=1",
    "title": "Star Map on Night Light - Personalized Constellation Map - Custom Night Sky - Stars on Wedding - Stars Chart Anniversary Gift - Celestial",
    "description": "⭐ ROUND STAR MAPYes, you found the PERFECT GIFT!A light to enlighten the night with the stars above that moment that changed your life forever. The night you said \"I do\" or saw that little face for the first time. We make beautiful star map night lights showing the unique alignment of the stars in a place and time chosen by you. Birthday, engagement, wedding, when you first kissed...Besides choosing the design, you can completely personalize your star light by adding your own title and footnote. Each night light is unique and made on-demand, just for you.⭐ WHAT ARE STAR MAPS?Given a location (e.g. a city), a date and time of the day, we can calculate the exact celestial location of all the stars and constellations in that very moment, using astronomical algorithms. We then project these onto a map and engrave it for you and make a beautiful night light so that it serves as a memento of your special moment. For example, first dates, wedding days, birthdays or passed loved ones.⭐ WE NEED THESE TO CREATE THE PERFECT GIFT FOR YOU:1- Your personal message - \"The Day You Were Born\" phrase will be added by default unless otherwise requested.2- Name or names3- MANDATORY: Address or the name of the location.4- MANDATORY: Date and Time (We will use 10PM by default if time is not available)❗️❗️❗️❗️ Location of coordinates are required to create your unique star map. It could be a special place for you.If it's not provided by you, the location of the stars on this specific date will be used. ❗️❗️❗️❗️🤔 SOME IDEAS ON YOUR CUSTOM LINES OF TEXT- \"The Night We Met\"- \"Under This Sky It All Began\"- \"Our Wedding Day\"- \"The Night You Were Born\"- \"The Stars Aligned\"- \"A Star Is Born\"- \"The Night We Became One\"- \"The Day We Said I Do\"📦 PRODUCT DETAILS- Size: 18 cm / 4.5 inches wide - 20 cm / 7.5 inches high - (including the wood base)- LED's life span - 50.000 hours- Works plugged-in- It has no on/off button.- Wall charger is NOT included. Any usb charger will work just fine.❗ IMPORTANTRemember that we will use the shipping address if the address is not available.And will use the cursive style if the style choice is not available.Will use the current year if the year is not available.🚚 SHIPPINGWe can not ship to APO and POBOX addresses.💭 WRITE USWe are here for all your questions you want to ask!Do not hesitate to write to us for your questions and suggestions.We will do our best to assist you as soon as possible.Visit our store for more:www.etsy.com/shop/AboveStarsArt",
    "reviews": [
      "This is a beautiful addition to our home. It was a wonderful anniversary gift.",
      "Just as described and what a beautiful night light :)",
      "Nice design, makes a great gift",
      "The light was beautiful and well put together.  It was a very well loved gift.  Thanks!"
    ]
  },
  {
    "productId": "0QrPioiTOm",
    "url": "https://www.etsy.com/listing/1497161511/garden-and-floral-led-photo-frame-lamp?click_key=0c1bcc24e61e417580e6e2bc08fa99778ca3d698%3A1497161511&click_sum=376a5e0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-9&pro=1&bes=1&sts=1",
    "title": "Garden and floral LED Photo Frame Lamp | Personalized Light-Up Name Sign | Perfect for Daughter,Girl's Room | Unique Baby Shower Gift",
    "description": "They are two types of gifts, the ones you ask, \"who gives me this?\" and the ones that make you remember that special person.It's time to add a special touch to your room, with these beautiful wooden custom night lights.Our lamps are engraved in the USA and will be a perfect gift for any event.❤ Nursery rooms.❤ Office.❤ Graduation.❤Weddings.❤ Birthdays.❤ Christmas❤ Baby shower❤ Home warming party.❤ Baptism.❤ or any other occasion❤ Lamp details6.70\" wide by 9\" tall.Cast 3mm acrylic for better results.Laser engraved in our studio in Florida.Super-Fast ShippingOn/off switch.Warm Light❤Other details.The buyer is responsible for any customs fees (Which don't apply to the USA)We don't take returns, but if we make a mistake, we will send a new lamp the next day.Acrylic slides into the frame to add a lovely touch to any room.We also love to do custom work.We can also add a gift note in the box without extra charge.Our custom-led light sign is perfect for any space (bar, desk, garage, nursery, Mancave, shop, coffee area) and on all occasions (Christmas, Baby shower, gender reveal, birthday, graduation, mother day, father day)",
    "reviews": [
      "Absolutely beautiful couldn’t be happier",
      "A gift for a friends baby girl. It came out beautiful and I am sure she is going to love it!",
      "The item met my expectations! I was very pleased with the quality and matched the description exactly"
    ]
  },
  {
    "productId": "wlkoYLXsqS",
    "url": "https://www.etsy.com/listing/1193971186/gift-for-him-man-grill-gift-idea?click_key=3754261e5062649d1893cbe9103176ae5f0c49a0%3A1193971186&click_sum=5d247c6e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-10&pro=1&frs=1&etp=1&sts=1",
    "title": "Gift for Him | Man Grill Gift Idea | Personalized BBQ Set | Grill Gift Set | Personalized Gift | Father's Day Gift | Fathers Day | Dad Gift",
    "description": "A Personalized Grill set is a perfect gift for anyone who loves to grill. Let's face it, who doesn't?  Grill masters everywhere will want this.We personalize each BBQ Set to your likings, based on one of our premade designs. We are able to do more customized items for a small fee if desired.Specs and Details:Box measures: 18\" x 6\" x 3\"Set Weight: 4.5 lbs5 Stainless Steel ToolsHow to Order:Select the quantity and click the design you want and in the \"Notes Section\" upon check out leave all your engraving details so we can personalize your bbq grill set.Due to the nature of the wood the engraving may appear in lighter and darker colors.",
    "reviews": [
      "quality of barbeque tools is good - - it's a special present for son - sure to love it!",
      "It was a perfect gift.",
      "Beautifully made, well organized and the BBQ tools are perfect",
      "My brother loved this gift, it even smelled of fresh wood when opening it"
    ]
  },
  {
    "productId": "BVQEGmNETU",
    "url": "https://www.etsy.com/listing/1495048709/personalized-round-board-with-2pc?click_key=5b0b3a6cc4255649c91e1d7ce5fe4e65088bd823%3A1495048709&click_sum=d0a6e8af&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-11&frs=1&sts=1",
    "title": "Personalized Round Board with 2pc Cutlery, Bridal Shower Gift, Engraved Marble Cheese Board, Wedding Shower Gift, Couple Engagement Gifts",
    "description": "Personalized Name cheese board featuring a unique wood and marble design. Comes with a 2-piece cutlery set.  ❤ We are currently running a 40% for a limited time! ❤Featuring high-quality craftsmanship and perfect for entertaining, this stunning charcuterie board is a must-have for every one. Makes a perfect heartfelt gift for all occasions.Key Features:--------------------------BONUS 2-Piece Cutlery Set: Each cheese board comes with a matching 2-piece cutlery set, ensuring your mom has everything she needs to serve her guests in style.--------------------------Extra-Large Design: 12\" x 12\" - Our wood and marble cheese board is one of the largest on the market, offering plenty of space for an impressive spread of cheeses, charcuterie, and accompaniments.--------------------------Unique Brass Inlay: The brass inlay at the center of the board adds a modern and stylish touch, setting this cheese board apart from others.--------------------------Custom Engraving: Personalize the wooden part of the board with your choice of text engraving, creating a one-of-a-kind keepsake that your mom will cherish.--------------------------Exclusive Personalization: We're one of the few Etsy shops offering fiber laser engraving, which means we can also personalize the metal parts of the cutlery for an added touch of customization.If you have any questions, please message us. We thank you for supporting our small business! ❤",
    "reviews": [
      "I gave this as a host gift and they loved it.",
      "I blinked and it was here! Lightning fast shipping and just beautiful. Carefully packaged so there was no damage (even though it was left in my driveway ugh!). THANK YOU!!!! JUST GORGEOUS!!!!",
      "I was actually surprised because I no sooner clicked on the purchase button then I got notification that it shipped!  Highly recommend!"
    ]
  },
  {
    "productId": "RegTLbZaEU",
    "url": "https://www.etsy.com/listing/1117449685/ultimate-spa-box-for-women-personalized?click_key=ca38cef1cb4805cf6d0b384a574d66a176b3a9d0%3A1117449685&click_sum=9223525e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-12&pro=1&frs=1&sts=1",
    "title": "Ultimate Spa Box for Women| Personalized Gift| Friendship Gift| Christmas Gift for Her",
    "description": "Is there someone you think is truly awesome – a coworker, friend, neighbor? Then let them know by sending them one of our truly lovely gift boxes packed with thoughtful items …. and we can mail directly to them!Love Delivered ❤️GIFT BOX INCLUDES:✿ Natural Perfume Roller✿ 1  All Natural Lavender Shower Steamer✿ 8 oz Lavender Bath Salts✿ 8 oz Asian Tea Body Butter✿ Clay Mask✿ 1 Lavender Bath Bomb✿ 1 All Soy Candle 15 hour burn life✿ Decorative Matches✿ Crinkle Paper✿ Free Shipping!✿ Personal handwritten greeting card with a message from you!SHIPPINGShipped in a branded Gift Box Love Co box ready for gifting!***All gifts are shipped out 1-2 business days after the order was made. Additionally, as you're making your order, Etsy provides you with an estimated delivery date.******Please note, if you are shipping this as a gift, please update the shipping address to where it should be sent. We will ship to the address you give at Etsy checkout.******If an incorrect shipping address was given and the gift is returned back to our shop, the customer is responsible for paying the re-shipping fee.***PERSONALIZATION can be made by leaving a message in the personalization area; please remember to ALSO INCLUDE YOUR OWN NAME. Messages written on the card are exactly as they were received in the order.Please check the photos for instructions and answers on questions you might have.**Due to succulent pot shortage there may be variations in pot designs and color. They will still have a cute feel and same vibe as our shop! 🖤How is the boxed shipped?Each box is shipped in a branded Gift Box Love Co box ready for gifting!How do we ship your package?We ship all of our packages through USPS and FedEx depending on size and location.",
    "reviews": [
      "Great quality products!  Everything in the box matches descriptions and pictures perfectly!  The items over exceeded my expectations!  & the personalized note I requested was beautifully hand written!  10 out of 10, definitely recommend <3",
      "The item was a gift and met my expectations.",
      "This was a gift, but recipient was very pleased with it",
      "Very nice quality, received very quickly."
    ]
  },
  {
    "productId": "MvDdkDy0Ku",
    "url": "https://www.etsy.com/listing/1530082765/personalised-christmas-gift-for-him-cell?click_key=09cedb2a55b72c16a435c58640eb45e606c07b8d%3A1530082765&click_sum=1955c010&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-17&pro=1&etp=1",
    "title": "Personalised Christmas Gift for Him Cell Phone Docking Charging Station Stand Tech Accessory Desk Organizer Handmade Gift Boyfriend Man Men",
    "description": "Unique personalized gift for him! A handmade wooden phone docking station is a great gift idea for Holidays, anniversaries, Birthdays, Father's Day, housewarming, or any other occasion. Stylish cell phone charging station - desk organizer can be custom laser engraved.✅PERSONALIZE IT: We use top-of-the-line laser technology for precise details, ensuring the custom laser engravings look precisely as you wish.✅ORIGINAL GIFT FOR ANY OCCASION: Surprise your friend, boyfriend, husband, dad, son, co-worker, boss, and even picky grandfather. A unique and handy gift for birthdays, anniversaries, Holidays, Valentine’s Day, Father’s Day, housewarming, and Graduation. Phone charging stations are packed in elegant recycled gift boxes.✅FUNCTIONAL DESIGN: Forget the messy desk! Charge your phone while keeping your wallet, keys, glasses, jewelry, or other frequently used items tidy and always at hand! The stylish, timeless design will fit perfectly with any interior: modern, minimalist, rustic, or classic.✅HANDMADE AND DURABLE: Docking stations are made of natural Plywood. All our products are carefully handcrafted, detailed, sanded, and hand-painted with organic paint. You can choose from three natural wood colors. The stand is easy to assemble - it has three pieces you must insert into each other (see the example in the images).✅MEASUREMENTS: 17.5 cm x 25.6 cm x 17.1 cm (6.9 in x 10 in x 6.7 in). NOTE: Due to the natural grain and color variations between boards, your item's color and grain texture can differ slightly from those in the listing photos. The engraving color can be darker. Accessories are not included.This product is handmade by our production partners and shipped from Lithuania.Personalized gifts for Him and more athttps://www.etsy.com/shop/PersonalizedGiftMen▼ HOW TO ORDER A PERSONALIZED DOCKING STATION ▼1. Choose the engraving option and the color, and write us the number of the chosen design.2. Fill in the personalization section. You can write your text with the needed font or select any logo from our designs.3. Select shipping options (Standard or express).IMPORTANT: If you select Express shipping, please leave your phone number in the order notes.4. We will send you a sketch of what the engraving will look like.We will send the order without confirmation if you confirm the sketch when shipping is due.If you have any questions, please feel free to ask us.",
    "reviews": [
      "Decent quality, very nice finish and accurate with draft provider by seller.",
      "Received on time and in good condition.",
      "My dad is really pleased with his gift.",
      "It is what I expected."
    ]
  },
  {
    "productId": "ahEOXLLkjF",
    "url": "https://www.etsy.com/listing/1412479718/easter-diy-personalized-paint-kit-easter?click_key=4db119f50d277d068285cb54130ff072f906a9f1%3A1412479718&click_sum=af26f9be&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-18&pro=1&pop=1&sts=1",
    "title": "Easter DIY,  Personalized Paint Kit, Easter for Kids, Easter basket Stuffers, Fillers, Easter Eggs",
    "description": "These Wood Easter Egg Paint Kits make wonderful Easter Basket Stuffers.The paint kit comes with 1 personalized wood Egg, acrylic paint set with your choice of 3 colors and a brush. Choose one of our 4 original egg designs.The wood eggs are handcrafted in our studio, and our designs are copyrighted.The egg measures approximately 5” tall. The paint is acrylic and it is permanent It will not wash off.If you have any questions please ask before you place your order. We don't accept returns, exchanges, or cancellationsBack to \"April & Kiwi\"https://www.etsy.com/shop/AprilandKiwi?ref=hdr_shop_menu",
    "reviews": [
      "The items are cute and mailed very timely.",
      "I just received the two items. One has the incorrect name on it. I ordered Sophia and Sophie was sent. Is it possible to get an another sent out ? I can send you a picture if you’d like. \nTerry",
      "I am terribly sorry about the mistake. I will send a replacement asap.",
      "These are the best gifts ever.  Love these personalized Easter crafts.  They are just perfect."
    ]
  },
  {
    "productId": "TbEXtQHaOq",
    "url": "https://www.etsy.com/listing/947565180/crochet-baby-rattle-with-grip-ring-made?click_key=ebb181ae538e7cb6cdb9c8470b4f33b63b921f74%3A947565180&click_sum=01941bc3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-19&pro=1&etp=1&sts=1",
    "title": "Crochet baby rattle with grip ring made of beech wood",
    "description": "Your bunny baby rattle in a beautiful cream pastel shade is the ideal gift for your loved ones. Your rattle supports your baby in his development and stimulates discovery, play and feeling. Your baby rattle is perfect for developing your child's senses. With your baby rattle, your baby is supported in the areas of feeling, hearing and motor skills.In your bunny there are two bells that make a pleasant sound. The beech wood is hand-polished and is therefore 100% free from wood chips. We only use natural products in all of our baby items. This means that our products are 100% free of harmful substances and can be used for teething by your little ones without hesitation.",
    "reviews": [
      "Very nice contact and quick help.",
      "The grip ring is beautiful and was delivered very quickly. Everything was great and I would happily order again",
      "I love everything about the ring! Really beautifully crafted and exactly as promised!"
    ]
  },
  {
    "productId": "JpJo5UspdD",
    "url": "https://www.etsy.com/listing/704936110/genuine-4-leaf-lucky-cloverdried?click_key=bb059dce21a480974d196a0cc8736f2225a49e1d%3A704936110&click_sum=92531f19&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-20&pro=1&frs=1&etp=1",
    "title": "Genuine 4 Leaf Lucky Clover,Dried Flower,Locally Made Pressed Flower,Terrarium Bracelet,Holiday,St.Patrick's Day Gift for Her, Adjustable",
    "description": "Fast Shipping Guarantee:*****We will ship this item within 24 hours after you place the order!*****WHY CHOOSE THIS PRODUCT:- UNIQUE: Our talented artists handpicked the plants with the brightest color. They were quickly dehydrated to reserve the color before being embedded in resin.  These one of a kind pieces are ONLY available at our store.- ADJUSTABLE: The center piece measures 0.8\"W x 0.8\"D x 0.3\"H. Earrings size: 0.25\"W x 0.25\"D x 0.25\"H. The cord is adjustable that goes from 6'' to 12'' (XS to XXL for Women). The necklace is adjustable from 22'' to 25''.- LOCAL: These crafts were designed and made by countryside artists in Northeast Missouri. We are also doing our best to use wild flowers / plants whenever possible.- NATURE FRIENDLY: All plants were preserved with a natural method and no harsh chemicals were used. The waxed cord is made from recycled polyester- HYPOALLERGENIC: All materials we use are hypoallergenic including surgical grade steel, natural resin, copper, waxed cord etc.",
    "reviews": [
      "Love!!! Can wait to wear and show my friends.",
      "Product deliverers as advertised… shipping took longer than expected but looks great!",
      "Looks great, thank you 😊",
      "Love this bracelet!  I didn’t realize until I received it that it was an actual 4-leaf clover.  Very beautiful and well made."
    ]
  },
  {
    "productId": "LbHRdYovew",
    "url": "https://www.etsy.com/listing/699404612/a-year-of-dates-a-box-of-date-night?click_key=1d0bed927f8c7a25aa41f4d615411c86ebacc310%3A699404612&click_sum=c17526d5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-21&frs=1&etp=1&sts=1",
    "title": "A Year of Dates: A Box of Date night cards, the perfect Anniversary present or paper anniversary gift for him.  A romantic Wedding gift",
    "description": "A Year of dates: A box of dates that is the perfect romantic Wedding gift, anniversary present, birthday gift or just because you want to show them how much you want to spend time with them :)An Anniversary GIFT FOR YOUR PARTNER - Every couple should date more in 2024. Our Date night box is the perfect solution. 52 sealed date cards and 5 blanks to add your own ideas ensure it will last all year.BOX OF DATE NIGHT IDEAS*******************************************************•\t52 sealed cards to help inspire a different date each week so your gift lasts all year•\tAdd your own ideas into the mix! - With 5 blank cards included, personal date night ideas can be added. They can be added before or after it is gifted, and once sealed they appear just like the existing 52 cards.•\tAll date night ideas are suitable for any couple, regardless of gender, relationship dynamics and the busy schedule life brings.•\tDesigned to be achievable around work and life – Dating shouldn’t be hard work•\tThe activities are kept simple in their description and can be interpreted to suit you and your lifestyle, the cards are a prompt for those days, or nights, when no-one can decideTWO VERSIONS*******************************************************The date suggestions in both versions are the same! however...•\tThe SURPRISE EDITION (Gold logo on front of box) means any card could be any colour – it’s a total surprise!•\tThe CATEGORISED EDITION (Silver logo on front of box) The date ideas on the cards are color-coded into four categories: Stay home, Go out, A day out, and Surprise! This helps make the date selection suit any busy schedule and family life. A date night at home when there isn’t a babysitter, or a day out when time allows.To help with any 'difficult' decisions (like who chooses the film/restaurant/who cooks the candlelit dinner) some cards suggest you flip a coin; but don't worry there is a leaflet included to explain it all.** US and Australia CUSTOMERS **Great news our stock is now available in the US so we can now offer QUICKER SHIPPING TIMESPlease note that there will be no gift note included in US and Australian orders as we do not have access to these** Jetzt auf Deutsch verfügbar **https://www.etsy.com/uk/listing/1442570498/a-year-of-dates-deutsche-ausgabe** Maintenant disponible en français **https://www.etsy.com/uk/listing/1456757427/a-year-of-dates-edition-francaise-cadeauBe sure to check out the rest of our range including our making memories journals which compliment these boxes and allow you to keep all your dating memories safe 😊ADD ON*********************************************************•\tMAKING MEMORIES JOURNAL to keep the cards safe once you have been on the date. Our specially designed ring bound book allows you to add the cards and any tickets, photos and receipts to the pages, there is space to write about your dates to look back on in years to come. To add the journal please visit:https://www.etsy.com/uk/listing/675974006/making-memories-journal",
    "reviews": [
      "So excited to try these out!",
      "Perfect gift for my partner and I.  Takes the pressure off of coming up with new ideas.",
      "Great gift for wife to priorize our relationship!",
      "Amazing buy. Everything I needed. Amazing quality"
    ]
  },
  {
    "productId": "FcnaVQo19p",
    "url": "https://www.etsy.com/listing/979013555/recipe-binder-personalized-recipe-book?click_key=de9716e6ad2b2424bf4bf933ab0e855e7f98e983%3A979013555&click_sum=7b1a8121&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-22&pro=1&etp=1",
    "title": "Recipe Binder Personalized Recipe Book Mothers Day Gift Wooden Custom Cookbook 5th Anniversary",
    "description": "Personalized Recipe Book Blank Binder Custom Cookbook Mothers Day Gift for Her Bridal shower giftOur wooden recipe book will appeal to those who love to cook and want to preserve family traditions and the best recipes. A personalized wooden recipe binder can be an unforgettable gift for any occasion.Collect your favorite recipes, write personal chef’s notes and have fun creating your own amazing wooden сookbook!Create a unique kitchen kit along with a recipe book standhttps://www.etsy.com/listing/979857882/adjustable-cookbook-stand-recipe-book?ref=shop_home_recs_18&pro=1&frs=1✦Free personalization ✦:You get free personalization of covers.We can engrave almost anything you want! You can choose one of our designs or send us a picture or a text that you like, and we’ll engrave it on the wooden cover of your Recipe Book.If you want to have custom cover. Write when placing an order in the 'Notes to Seller' what you would like to personalize or also what you want to engrave.You'll get:- Wooden cover;- Ring mechanism(for A6 and A5 books - a mechanism with two rings (25 mm), A4 - a mechanism with four rings (25 mm);- Elastic band;- Set of pages to choose (70 sheets);✦SIZE✦1. SMALL A6 -13x15.5 cm (5\"x6.1\") 70 sheets2. MEDIUM A5 -19x22 cm (7,5\"x8,6\") 70 sheets3. LARGE A4 - 25x30,5 cm (9.8\"x12\") 70 sheets✦PAPER✦:Includes a selection of 70 sheets of pages. The sheet density is 80 g/m2. You can add an extra set of pages when choosing the size.You can choose:- lined paper- white recipe pages- craft recipe pages- blank white- designer recipe pages- sheet protectors✦HOW TO ORDER✦:1. Choose notebook size and papers.2. Fill in the personalization field (name, cover design, paper).3. Purchase the listing.✦PROCESSING TIME✦We will ship your package in 2-4 business days after receiving your order.✦DELIVERY✦Approximate delivery time:1. USA: - 14 - 18 business days2. Europe: 14-18 business days3. Canada: 14-20 days4. Australia: 14-25 days5. England 14-18 daysYou can also use fast delivery DHL, FedEx or TNT express, 3-7 days.Sometimes delays occur, International shipping is unpredictable and delays happen at the customs.Please let me know if you've got a specific deadline, or are in a sort of rush, I'll do my best to meet it, if possible.If your parcel is returned because of incorrect information about the address or if you forgot to receive it, we can send it back, but you will need to pay the shipping cost again.Please! Feel absolutely free to contact us, if you have any questions.We wish you a happy shopping!",
    "reviews": [
      "This product was fantastic and came earlier than expected which was perfect so I could give it close to her actual birthday!",
      "Great buy recommend it nice",
      "As described. Good quality product."
    ]
  },
  {
    "productId": "FsSoOHoiYe",
    "url": "https://www.etsy.com/listing/1151015958/personalized-jute-bag-with-initial-and?click_key=b8ee2351699e2a6e824a05c203ae096fe62f08da%3A1151015958&click_sum=a5a30a97&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-23&etp=1&sts=1",
    "title": "Personalized jute bag with initial and name | bachelorette party | Teacher farewell gift idea | Mother's Day gift | Personalised gift bag",
    "description": "Personalized jute bag in black with initials and desired name with padded handle.(No set offer, please personalize each bag size individually! Shipping costs are only calculated once.)❤︎ Our jute bag is perfect- to go shopping- as a present- as a team bag for the bachelorette party,- Mother's Day gift,- Gift for grandma or aunt or best friend- as a souvenir for the girlfriend- Gift to yourself❤︎ Product Information & FeaturesSizes:Small: 26 x 22 x 14 cm (pictured)Large: 30 x 30 x 19 cmJumbo: 42 x 33 x 19 cmMaterial and care instructions:- Material: 100% jute- Handle: Solid cotton- Color: BlackInside is coated and can also withstand liquids and dirt. It is washable. Not suitable for washing machine and dryer.❤︎ PersonalizationInitial and font color: freely selectable.Colors for initial / name:- White / Gold- Black / White (as in picture)- Black gold- Black silver- Rose / White- You are welcome to add other color combinations under special request. feel free to add under special request. We have significantly more color options, just ask.EXPRESS:Would you like to receive your order faster? Please note our express processinghttps://www.etsy.com/de/listing/1169392478/express-editing-----------------------------Important information:Personalized items are made to order and are therefore non-returnable. Therefore, please check your details before ordering or send us a message before placing an order if you are unsure about the design. If you do not request a preview for approval, the visualization is the responsibility of our design team and does not constitute a reason for complaint if your idea deviates.Jute is a natural product, different strengths and colors of the fibers are part of the characteristic material and therefore do not constitute a reason for complaint!The decoration shown on the product image is not part of the scope of delivery.You can find more great personalized gifts here:https://www.etsy.com/de/shop/Jellie",
    "reviews": [
      "The bags were amazing ! My mother in law loved it 🤍",
      "I really liked it and am always asked about it :)",
      "Well done. Thanks so much"
    ]
  },
  {
    "productId": "JAoySOSsMi",
    "url": "https://www.etsy.com/listing/1420002405/mum-gift-daughter-gift-mum-birthday-gift?click_key=5e66d3530f65f4e4e79bce59d617e90409425520%3A1420002405&click_sum=ced3519f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-24&frs=1&etp=1&sts=1",
    "title": "Mum gift, daughter gift, Mum birthday gift, Mothers Day Gift, Gift for Mum, Mum Print, Mother gift, Mother daughter gift, unframed print",
    "description": "🌺This customisable Mother and Daughter print makes a lovely gift or keepsake for your mum or your daughter for Mothers Day, Birthdays or any other occasion.🌺👀Please see the order template above the personalisation box to check how to order & make sure to look at the gallery for all outfit and hairstyle codes. If you are viewing on your mobile phone then all you need to do is swipe right on the main image.👀❔If you have any questions or concerns, please do not hesitate to contact me. ❔***IMPORTANT INFORMATION***❗PLEASE NOTE THAT THE FRAME IS NOT INCLUDED UNLESS PURCHASING THE OPTION WITH THE FRAME. ❗❗PLEASE NOTE THAT THE FRAME SHOWN ON THE MAIN IMAGE IS NOT THE FRAME USED TO FRAME YOUR PRINT IF OPTING FOR THE FRAMED VERSION. THIS IS A STOCK PHOTO USED TO DEMONSTRATE HOW MY PRINTS LOOK FRAMED❗*** SIZING OPTIONS ***🖨️ Digital print – Saved as a high-quality PNG File that can be printed in any size. If you are after a specific size then please request this on your order. This digital copy will be emailed to you rather than a physical copy sent and will be delivered to the email address attached to the ETSY order ready for you to print off. The email you receive will be from  pennyprintsx [!at] gmail.com which is my business email.🖌️Unframed A4 print - approx. 11.7\" x 8.3\" or 21cm x 30cm🖌️Unframed A5 print - approx. 8.3\" x 5.8\" or 15cm x 18cm🖼️ A4 Framed print Black or White – 9.5\" x 13\" or 24cm x 33cm. Border thickness is 0.78\" or 2cm🖼️ A4 Framed print Grey, Silver or Wood – 8\" x 10\" or 20cm x 25cm. Border thickness is 0.39\" or 1cm. Frames are slightly smaller but advertised as A4 as it needs to be printed on A4 Supplies.🖼️ A5 Framed print Black or White – 6.25\" x 7\" or 16cm x 21cm. Border thickness is 0.78\" or 2cm🖼️ A5 Framed print Grey, Silver or Wood - 6.29\" x 8.2\" or 16cm x 21cm. Border thickness is 0.39\" or 1cm❗ALL FRAME MEASUREMENTS ARE TAKEN FROM THE OUTSIDE OF THE FRAME AND DETAIL THE COMPLETE FRAME SIZE❗❗ALL FRAMES CAN BE STOOD UP ON A TABLE TOP OR WALL MOUNTED. IF OPTING TO STAND ON THE TABLE TOP PLEASE MAKE SURE TO USE THE STABILISER ON THE BACK OF THE FRAME. ❗❗All PRINTS ARE PRINTED ON 220GSM MATTE CARD❗***DETAILS***⭐At The Penny Prints, I understand the importance of quality when it comes to gift giving. That's why I only print on high-quality 220gsm card, with perfect resolution. I offer the highest quality customised prints at very affordable prices and like to pride myself of being available to the many!I am more than happy to work with you on customisation to make unique prints so if there is something you would like but can’t see then please give me a message. There's nothing I enjoy more than helping you to create an exclusive & unique print. ⭐***HOW TO ORDER***📏 Choose the size you would like (Digital copy, A4 unframed print, A5 unframed print or a framed version)💻In the Add personalisation box Please type:a. From left to right please provide the number of people for the print – you can have as many people as you would like. Any number over 2 means the print will be landscape.b. From left to right please provide the name, skin colour code, prop code, outfit code and hairstyle code for each person (for detailed instructions please see listing image)c. For hair options please see options in listing image, please state in personalisation box which style it is you would like and the number attached to the picture.d. Please write the text you would like to appear on the print in the personalisation box this can be any message you like! The complete print is fully customisablee. Click \"Add to Cart\" button❗PLEASE ENSURE THAT ALL DETAILS IN YOUR MESSAGE ARE CORRECT TYPOS WILL NOT BE RECTIFIED AS QUOTES & NAMES ARE DIRECTLY COPIED AND PASTED FROM YOUR ORDER❗Example:Person 1Skin Tone: S1Hairstyle code: H245Top option: T1Bottom option: B2Prop option: P11Name: OliviaPerson 2Skin Tone: S1Hairstyle code: H365Top option: T10Bottom option: B8Prop option: P15Name: MumTitle for top of the print: MumText for beneath title: A mother is a daughter's best friend❗IF YOU WOULD LIKE A PREVIEW OF YOUR PRINT BEFORE IT IS SENT OUT THEN PLEASE REQUEST THIS ON YOUR ORDER AND WHETHER YOU ARE HAPPY TO BE CONTACTED VIA ETSY MESSENGER OR IF YOU WOULD PREFER IT SENT TO YOUR EMAIL. IF OPTING FOR THE EMAILED VERSION PLEASE LET ME KNOW THE EMAIL ADDRESS TO SEND IT TO. ❗❗PLEASE NOTE THAT 3 REVISIONS/CORRECTIONS ARE INCLUDED IN THE PRICE ANY CHANGES MORE THAN 3 TIMES WILL INCUR A FEE FOR THE TIME IT IS TAKING ME TO COMPLETE THEM❗❗PLEASE NOTE THAT PREVIEW MAD POTENTIALLY ADD TIME TO THE DISPATCH OF YOUR ORDER. IF A PREVIEW IS NOT REQUESTED THEN THE ITEM WILL BE SENT AS PER YOUR PERSONALISATION REQUESTS SO PLEASE CHECK THAT THEY ARE ALL CORRECT BEFORE ORDERING. ❗❗PLEASE NOTE THAT ONCE THE IMAGE HAS BEEN CREATED AND A PREVIEW SENT THEN NO REFUND OR CANCELLATIONS CAN TAKE PLACE AS I HAVE SPENT TIME CREATING THE PRINT AND THE PREVIEW THAT YOU HAVE WILL NOW MEAN THAT YOU HAVE A PRINT THAT HAS BEEN SENT FREE OF CHARGE. ❗❗IF YOU FAIL TO REPLY TO THE PREVIEW WITHIN 2 DAYS/48 HOURS THEN THE IMAGE WILL BE SENT AS THE PREVIEW’D VERSION❗❗PLEASE MAKE SURE TO SPECIFY THE TEXT YOU WANT ON THE PRINT/IF YOU DONT WANT ANY TEXT. IF THERE IS NO INDICATION ON THE ORDER SHOWING ME WHAT TEXT YOU WOULD LIKE THEN THE DEFAULT QUOTE AND TITLE WILL BE ADDED❗***POSTAGE INFORMATION***📫 All UNFRAMED PRINT orders to the UK are sent via Royal Mail First Class Post (NOT TRACKED)📫All FRAMED PRINT orders to the UK are sent via Royal Mail First Class Post Tracked and Signed📫 All UNFRAMED A5 PRINT orders sent internationally are sent via Royal Mail International Tracked & Signed 5–12-day delivery📫 All UNFRAMED A4 PRINT orders sent internationally are sent via Evri Parcelshop Tracked Standard 3-7 day delivery📫All FRAMED PRINT order sent internationally are sent via Evri Parcelshop Tracked Standard 3-7 day delivery.❗PLEASE DOUBLE CHECK THE DELIVERY ADDRESS BEFORE PURCHASING AS REPLACEMENT ITEMS/REFUNDS WILL NOT BE GIVEN FOR INCORRECT DELIVERY DETAILS❗❗PLEASE NOTE THAT ALL TRACKED ORDERS CAN BE FOLLWED THROUGH THE PURCHASES SECTION IN ETSY OR VIA THE DISPATCH EMAIL. IT IS YOUR RESPONSIBILITY TO CHECK ON THE STATUS AND MAKE SURE THAT YOU DON’T MISS THE DELIVERY. IF THE ITEM IS SENT BACK TO ME DUE TO MISSED DELIVERY/COLLECTION THEN ANOTHER POSTAGE FEE WILL NEED TO BE PAID FOR IF YOU STILL WANT THE ORDER❗***FAQ’s***What paper do you use?All prints are printed on high quality 220GSM CardHow long does the dispatch process take?Once ordered all & created the same day and then posted next day with 1st class post to the UK and approx. 5–12-day delivery Leadtime internationally.Does this item come with a frame included?Frames can be purchased at an additional cost when selecting the size option***RETURNS***Due to the product being personalised I not be able to issue a refund, unless the item has arrived with you damaged, in this case please let me know within 7 days of receiving your item. Unfortunately, I won’t be able to accept returns once the 30 days have passed.Please be sure to check the Estimated Dispatch time under Deliveries & Policies upon ordering***ADDITIONAL INFORMATION***This shop and its content are copyright of PennyPrintsx - © [2021]. All rights reserved.Any redistribution or reproduction of my designs in any form is prohibited other than the following:•\tyou may print or download the custom artwork for your personal use only•\tArtwork may not be reproduced by any process without the express written permission of the artist.•\tAll copyright and reproduction rights are retained by the artist.•\tDigital File is for personal use only.You may not, except with my express written permission, distribute or commercially exploit the content of my shop. Any shop found to be copying my work will be reported to ETSY and legal action may be taken.❤ Follow me on Instagram @pennyprintsx",
    "reviews": [
      "Great seller with great communication. Thankyou!",
      "Looks great and the frame was good quality 👍🏻",
      "Love it! It’s perfect especially for Mother’s Day",
      "I highly recommend Penny and her designs for the perfect gift for any occasion! She offers  exemplary service and her products are very high quality. I am so excited to give my gift to my mother, am sure she will be delighted with it! I am sure your recipient will be delighted with your gift too! Penny's customer service was up there with the best I have received on Etsy. I will be sure to buy from her again in the near future!"
    ]
  },
  {
    "productId": "BGZHmveKMv",
    "url": "https://www.etsy.com/listing/1522897652/personalized-gift-custom-gift-unique?click_key=f9cd1b02a36e78e02cf9850bd3814caa48daaf36%3A1522897652&click_sum=c4717c4b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-13&pro=1&frs=1&sts=1",
    "title": "Personalized Gift, Custom Gift, Unique Engraved Gift For Her Gift For Him Entrepreneur Present, Thank You Gift For Dad, Congratulations Gift",
    "description": "Welcome to our sunny California family! We're a passionate bunch who design and handcraft all our high-quality treasures right here in the Golden State. Every item you see is bursting with sunshine and love, shipped straight from our hearts to yours.Unleash the power of personal expression with the Parker Frontier pen. This sleek and sophisticated writing instrument combines timeless design with modern functionality, making it the perfect gift for anyone who appreciates quality and craftsmanship.Crafted from durable stainless steel, the Parker Frontier pen features a comfortable grip and smooth ink flow that ensures a satisfying writing experience. But what truly sets this pen apart is the ability to personalize it with custom engravings.Engrave one or both sides of the pen, or even add an inscription to the accompanying pen box, to create a truly unique and meaningful gift. Whether it's a name, initials, a special date, or a heartfelt message, your personalization will transform this pen into a treasured keepsake.Imagine the joy of gifting a pen engraved with a recipient's name or graduation date, or the surprise of a pen box etched with a special inside joke. A personalized Parker Frontier pen is more than just a writing tool; it's a way to show someone you care, to commemorate a special occasion, or to simply add a touch of luxury to their everyday life.Who would love this pen?The professional: Make a lasting impression with a personalized pen that exudes both style and sophistication.The graduate: Celebrate a major milestone with a pen engraved with their name and graduation date.The writer: Every author deserves a pen that's as unique as their words.The traveler: A personalized pen is the perfect companion for capturing memories on the go.Anyone who appreciates quality: The Parker Frontier pen is a gift that will be treasured for years to come.Give the gift of self-expression with the Parker Frontier pen. It's more than just a pen; it's a story waiting to be written.Important:-Please double-check your personalization before submitting your order. To ensure a flawless engraving, the text will be copied exactly as you enter it.-Personalization is done in a high-quality laser engraving into the metal surface and not a print! Therefore you are unable to choose the color of the engraving.-Ensure you choose the correct “Ship To” address as we can only ship to the shipping address provided on the order.-We ship from California via USPS First Class mail which takes 2-6 business days to arrive. We do have faster shipping upgrades available at checkout.",
    "reviews": [
      "Giving this beautiful pen as a gift and very happy with the quality, smooth penmanship, and extra ink refill.  Shipping was very fast.  Highly recommend. So happy on found you on ETSY!",
      "2nd time I order from this store and continue to be extremely pleased. The pen was great! Quick shipping too.",
      "This pen is a great quality and it came out beautiful!!"
    ]
  },
  {
    "productId": "xUGOJaSJOr",
    "url": "https://www.etsy.com/listing/1577799046/custom-makeup-bag-personalised?click_key=f99027f7eb8b70bd045a093552846e03efa4a4ab%3A1577799046&click_sum=80268e48&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-14&pro=1&frs=1&etp=1&sts=1",
    "title": "Custom Makeup Bag • Personalised Bridesmaid Gifts • Wedding Gift • Travel Toiletry Bag • Cosmetic Bag • Birthday Gift • Wedding Favors",
    "description": "💕Indulge in the elegance of velvet with exquisitely makeup bag & toiletry bag.  are a cute gift for women, It’s a practical and memorable gift for them. Handcrafted with care and precision, this bag serves as a luxurious home for all your beauty essentials.  is also a perfect thank you gift, birthday gift, maid of honor gift, mother's day gift, and much more...is perfect for travel!Want it faster? Expedited Production & Expedited Shipping Service is available.See this link:https://www.etsy.com/listing/1373117202- Material: 100% Italian Velvet- Customized Heat Stamp (Gold by default)- Size: Perfectly sized to accommodate all your beauty essentials or your bathroom items: toothbrush, cream, face moisturizer, brushes etc- Good for travel: small and easy to carry- Personalization: Add your name or initials for a custom touchEach bag can be personalized with the name of your loved one, top quality guaranteed.ANY QUESTIONS? Send me a message and I will be there to help.",
    "reviews": [
      "Nice, rich deep color, perfect Birthday gift",
      "This was my second bag I’ve purchased and once again it did not disappoint! Beautiful color and quality! I’m obsessed! This bag is my new go to for birthdays and celebrations. I LOVE it! Thank you!",
      "Perfect little bags for Christmas gifts! Can’t wait to order again",
      "Amazing quality and my family loved them as Christmas gifts. I will be ordering more!"
    ]
  },
  {
    "productId": "zLxpJyDnMU",
    "url": "https://www.etsy.com/listing/1104413132/personalized-charcuterie-board-acacia?click_key=713b027553ac827932a290226b0bb563cc2e81bb%3A1104413132&click_sum=54a889ab&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-15&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Charcuterie Board | Acacia wood Cheese board | Custom Charcuterie board set | Wedding Gift | Personalized Christmas Gift",
    "description": "Large Acacia Charcuterie Boards w/Ceramic Bowls, Black Slate, Knives, Forks, Wine Opener, White MarkersThe charcuterie board can be personalized by choosing engraving options, incorporating family name or important dates. You can bring a unique experience into the kitchen, dining, and living rooms of your friends, family, and coworkers.  Perfect gift for Weddings, Anniversaries, Housewarmings, Bridal showers, Birthdays, Christmas, and so much more !!Size: 17”L x 13”W x 2” H*****Check out our shop for other designs ******Due to the nature of acacia wood, the color, markings, knots, and rustic characteristics will vary,resulting in lighter and darker areas in the engraving and wood boards. Each board will be unique.** Shipping to Hawaii or Alaska may take a couple of weeks by USPS delivery. Please contact us if you have any questions.",
    "reviews": [
      "Super fast from purchase to delivery!",
      "Great wedding gift!   I just love how it turned out.",
      "Consistently high quality with each order"
    ]
  },
  {
    "productId": "aJhRUZbPSB",
    "url": "https://www.etsy.com/listing/498167607/personalize-groomsman-gift-set-of-8-men?click_key=ffe3c4f366254f1342440fa797f901c76c436d49%3A498167607&click_sum=b9a27351&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744525-8-16&pro=1&sts=1",
    "title": "Personalize Groomsman Gift Set of 8 Men Shaving Toiletry Leather Travel Bag Dopp Kit Wedding Gift Groom Best Man Brother Father Husband",
    "description": "Dopp Kit - Pricing includes embroidery.Affordable gifts for the Groom, Fathers, or Groomsmen on your wedding day. Spacious to hold personal toiletries and belongings. Great as gifts and every day use.♥ Shaving Bag Details:· Material: PU Faux Soft Leather· Measurements: 8.5 x 6 x 4· Interior: Polyester Lining· Zipper Closure· Side Loop♥ Embroidery Options: Max 3 letters· 1 Letter, 2 Initials, or 3 Letter Initials (first, middle, last)♥ Add-On Rush Fees:· Ship within 14 days ($25)· Ship within 7 days ($50)♥ Note for 3 Letter Initials for Men· Men Initials should be in first, middle, last and will be embroidered same size across.♥ SHOP POLICIES:· By purchasing any listing from Love Meets Craft, all buyers acknowledge that they have read and understand the \"Item Details\" described in all listings and shop policies. Thank you.· All items are made to order.· Shop cannot be responsible for incorrect initials provided.• Due to variation between every monitor, smart phone and tablet display, the colors shown may appear different in person.· Personalized gifts do not qualify for returns. If there is a mistake, please contact us.· Customer satisfaction and happiness is our number one priority!♥ All images are property of Love Meets Craft",
    "reviews": [
      "Excellent gift for my groomsman, shipping was very quick and product was perfect.",
      "I got these to ask our groomsmen to be in our wedding, and they all loved them! I plan to get them koozies and bottle openers to match these bags for the Bachelor party!",
      "Perfect size and exsculy as pictured",
      "Wonderful quality & shipped very fast!"
    ]
  },
  {
    "productId": "ZGY5pVRfEV",
    "url": "https://www.etsy.com/listing/1104827052/grandparents-welcome-door-mat?click_key=d9d3ede0e61fe00e3e3052c9b1f0ba607e3afac2%3A1104827052&click_sum=bd1f664c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-25&pro=1&etp=1&sts=1",
    "title": "Grandparents Welcome Door Mat - Personalized Doormat - Gift Grandparent - Custom Coir Mat - Home Decor - Grandparent Gifts - Housewarming",
    "description": "Welcome to the perfect gift for the beloved grandparents in your life! Our personalized doormats offer a heart-warming and functional way to express your love and appreciation for the pillars of your family. Crafted with care and attention to detail, these mats are not just practical; they are a beautiful testament to the bond shared across generations. Customize it with a special message, their names, or a significant date to create a unique and thoughtful gift that they will cherish every time they step through the door. Ideal for birthdays, anniversaries, or just because, this grandparent’s gift is sure to leave a lasting impression and brighten their day! Grandparent Gifts this holiday period.★ UK Fast & Fully Tracked Shipping On All Orders★ USA Fast & Free Ship Over $35 with FedEx★ Fast Fully Tracked Shipping via FedEx to UK, CA, AU, Europe, & ROW★ 100% Happiness Money Back Guarantee★ We've Worked With MTV, ABC, TeaPigs, House Beautiful, Visit Anaheim & lots more!ORDERING OPTIONS:[SIZE]: 16x24\" or 18x30\" or 24x36\"[FINISH]: Durable UV Printing (more info below)[FONTS]: You cannot change the fonts shown on this listing - If you wish to either create your own custom mat from scratch or have a mat design based off of this one, then you can do so using the following listing; you can use any font on dafont.com or use the popular fonts which will be shown in the listing images:https://www.etsy.com/listing/1468225073/personalized-doormat-custom-door-mat?ga_search_query=custom+doormat&organic_search_click=1MATERIALS AND CRAFTSMANSHIP:Our eco-friendly mats are made from durable and natural coconut fibers with a biodegradable PVC vinyl backing to help keep the mat from sliding around.UV PRINTED:Our mats are created using a specialist printing technique that gives an extremely sharp, bold looking doormat. The design is cured using UV light to lock the ink into the mat fibres, they look fantastic and are durable; much stronger and longer lasting than laser engraved or spray painted mats. They are by far our most popular product. You or your gift recipient will be blown away, guaranteed.PREVIEWS:Please note that we only send previews upon request for custom designs and not until after purchase. Any pre-designed mats, including doormats with last names, do not get proofs unless requested. There are font references in each listing where applicable. Please send us a message if you have any questions.RUSH ORDERSNeed your order quickly (last minute gift ideas anyone?) We offer an Express upgrade on the cart drop down, which will ensure you mat leaves us the next working day. Shipping to the UK is next working day with this service, and the US is 2-3 days.IMPORT FEES/TAX:We do not cover Canadian taxes and import fees as these are determined and imposed by the Canadian government, and it is the responsibility of the recipient to comply with these requirements. We encourage our customers to familiarize themselves with the relevant Canadian tax and import regulations to make informed decisions regarding their purchases and to avoid any unexpected costs or delays.CARE INFO:Each mat is hand crafted by our team with the best materials possible to ensure they last. We really care about each one that leaves our little workshop! We recommend that you keep your doormat in a dry, covered area to prolong the life of the design. To clean the mat, shake it out. Our mats are made from natural coir fibres and may have small chunks of imperfection and different variances of color. All mats are unique. Do not saturate the mat in water. Excess water can cause discoloration or fading of the design. Orders cannot be returned and refunded if mat has not been taken care of as advised above.CUSTOM DESIGNS:Do you have a design in mind or a business logo you’d like placed on a doormat? No problem! We love making custom designs, just reach out to us with your idea and image if you have one and we will work with you on making it exactly as you imagined. You can also find a 'Custom Mat' listing on our shop or click here:https://www.etsy.com/listing/1084583465/your-text-here-custom-doormatREVIEWS / SOCIAL MEDIA:We love to hear from all our customers so please share a photo of your mat with us on Etsy Reviews as well as our social media!Instagram: https://www.instagram.com/designsbyimagineered/Facebook: http://facebook.com/designsbyimagineeredBULK/WHOLESALE ORDERSPlease get in touch for your bulk order needs, we'll be happy to help.REALTORSWe can meet realtors requirements with logo mats or custom designs for your clients closing gifts, whether we ship to you or direct to your client.",
    "reviews": [
      "Super cute and my grandpa loved it!",
      "Perfect. Great quality and fast shipping!",
      "Fast shipping and my husband loved it",
      "After a couple uses the words faded. I feel like that’s to be expected. But we all loved it."
    ]
  },
  {
    "productId": "SfAFyoPunD",
    "url": "https://www.etsy.com/listing/926994216/fathers-day-gift-personalized-leather?click_key=cbdeb07fa82b77eb240b7050a68598dce6ecf115%3A926994216&click_sum=0a196bb1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-26&pro=1&frs=1&etp=1&sts=1",
    "title": "Fathers Day Gift , Personalized Leather Dopp Kit For Dad , Custom Leather Toiletry Bag , Gift For Dad , Best Man Gift ,  Gift For Men",
    "description": "Have a travel case to store your bathroom essentials with the Leather Dopp kit. Your toothbrush, deodorant, aftershave, comb, etc. It helps you stay organized by keeping everything in one place.The large Dopp kit is enough to store all your cosmetics and toiletry essentials.Give your loved ones an unforgettable gift experience with a special leather wallet that they can always carry with them!You can give all the personalized leather bags for Father's Day, Mother's Day, birthday, anniversary, Valentine's Day, Graduation, Wedding, Thanksgiving, and Christmas gifts.🔷Product Features:Large: 10\" x 4\" x 5\"Medium: 7\" x 3\" x 4\"A hand handle that makes it easy to carry.Industrial strength zipper.Hand sewed with strong thread.Hand stitches achieve aesthetics and durability that you can use for many years.Our products are produced by hand in our atelier using completely natural materials. There may be slight differences in handmade products, depending on the nature of the material or the taste of the craftsman's hand. Since the products are not fabricated, they may differ slightly from the images on the site.We always check our products before we pack them. But if you find an error/deformation caused by production/delivery, please contact us directly.🔷Personalization:We can engrave text/name/initial/logo on the engraving area specified on the leathers. Check out our customization examples!For Initial:Please select your initial style from the picture and enter your text. We offer some classy fonts for initials or names. We engrave the initials/names in the front side right corner by default.Example: F-3 MIf you forgot to choose any personalization option when giving an order, you may purchase from the link below.Please let us know your order number for that personalization request.Personalize it!https://www.etsy.com/listing/777398602/personalization-add-on?click_key=2c0d3ce9f9f829f6b648a1df74ba6691ad41f08b%3A777398602&click_sum=ea7ea536&ref=shop_home_active_1&frs=1&sts=1For our stylish wallets and bags, you can make changes to your personalization request within 12 hours after your purchase. If you still want a change after 12 hours, you should order a new one. Since our products are customized according to your wishes, they cannot be resold.If you have purchased the customization option but do not send us your request within one week, we will ship the item unengraved after one week and refund the engraving price.🔷Color Options:BrownBlackCinnamonGrayOliveOur products are durable for many years of use.🔷How to Care:When necessary, clean the leather only with a soft, dry cloth.Do not use detergent or any cleaner.Scratches and bumps that occur as you use it will give the leather a vintage look. However, the leather polish can be used for unwanted scratches.Always rub in circular motions when wiping or polishing leather.If the leather gets wet, do not heat treat, wipe off moisture to prevent mildew, turn it over and hang it to dry.🔷Processing Time:Our production time is 1-3 days for all our products. At the end of the production time, your order will ship.If you want to rush your order, you may purchase the link below. And after your purchase, your product will ship the same day.Rush My Order!https://www.etsy.com/listing/1100140287/rush-my-order?click_key=4d83106689648a6f4b6ec399809f39d576f4bde4%3A1100140287&click_sum=902f1623&ref=shop_home_active_2&frs=1&sts=1🔷Shipping Time:We ship your package with the USPS shipping company with the First-Class option by default. If you want fast shipping, you may choose the Priority or Priority Mail Express options. But we are not responsible for the shipping delay.In order to speed up the Production Process and Cargo Process, if you purchase the listing below, we will send it to the cargo within the same day and make the delivery with UPS cargo service.Rush My Order and Fast Shippinghttps://www.etsy.com/listing/1117156957/rush-my-order-and-fast-shipping?click_key=219e2d50717ca424812b00cbc1f59b4c5dc430ae%3A1117156957&click_sum=c0da52b8&ref=shop_home_active_3&frs=1&sts=1🎁Your order is ready to be gifted in a free, eco-friendly box.We only use leathers and hides which are by-products of the food industry.Black Friday SaleBlack Friday Deals",
    "reviews": [
      "Great product and love the monogram!",
      "It was perfect! Such a lovely gift and the quality is amazing. Thank you :)",
      "Gave it as a valentines gift to my husband, now he can stop using a ziplock bag for his toilets!"
    ]
  },
  {
    "productId": "ECjUGGFXir",
    "url": "https://www.etsy.com/listing/796072957/everything-tastes-better-when-grandma?click_key=8b70b13da780389a63400e96dac5294d8db99f99%3A796072957&click_sum=229b009f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-27&frs=1&etp=1&sts=1",
    "title": "Everything tastes better when Grandma makes it! Personalized Mother's Day Gift for Nana, custom grandmother gift for Mimi",
    "description": "Everything tastes better when Grandma makes it! This wooden spatula can be personalized with any name you would like. Example: Mom, Grandma, Mimi, Nana, Gigi, or any other name! Just enter the name you would like in the personalization box before checkout!This listing is for 1 utensil.Kids' or Grandkids' names can also be added to the handle of the utensil for an extra special gift! Just select the \"Add Handle Engraving\" option and be sure to include the names in the personalization box.These personalized utensils make great Mother's Day gifts for grandparents or mom!• ALL ORDERS are GIFT WRAPPED in a beautiful, handmade, cotton bag. Also included in the packaging are care instructions and a free recipe card! Please choose your dietary preferences for the recipe card in the drop-down options. These spoons are perfectly ready for gift giving!Please see my shop home page for details about my efforts towards eco-friendly packaging!Features• I carefully create my designs, and engrave these spoons to create a one-of-a-kind, personal product for your home.• Made with high quality, chef grade, durable beech wood• Since the design is engraved into the wood, these spoons will last a lifetime with simple care.• This listing is for one 12 inch utensil for all of your baking and cooking needs.CareCare is simple. Just wash with warm water and dish soap and pat dry. Do not allow wooden spoons to soak.Packaging and Shipping Details• Processing time before your order ships is 3-5 business days• First Class shipping is FREE! First class typically takes 4 business days to be delivered after you receive shipping notification. Priority shipping is available as an upgrade during checkout. Priority shipping typically takes 3 business days to be delivered after shipping. Contact me if you need your order to ship even faster!• Would you like to ship your gift directly to the recipient? Include a special message for free upon request! Just include your special message in the \"notes to seller\" section at checkout! Be sure the delivery address is correct when shipping to a friend.• You will receive a shipping notification and tracking number via email when your order shipsThanks for visiting my shop! Please contact me with any questions!",
    "reviews": [
      "It was very very good.",
      "Spoon came out great and the customer service was phenomenal! Highly recommend!",
      "So happy with this item. :)",
      "Love this spoon thank you"
    ]
  },
  {
    "productId": "NrdRnxYvyX",
    "url": "https://www.etsy.com/listing/1074644269/personalized-wooden-spoon-baking-gifts?click_key=2fdbaf66be1fd24fd491a5ae7a1ed67bd945c775%3A1074644269&click_sum=45a92269&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-28&frs=1&etp=1&sts=1",
    "title": "Personalized wooden spoon, Baking gifts, Cooking gifts, Bridal shower gift, Unique wedding gift for couple, Housewarming gift,",
    "description": "Impress the new couple on their wedding with a gift of beautiful personalized wooden spoon/s that will give their kitchen a personal and unique touch, reminding them of you when they are baking or cooking! The bride will love her custom kitchen utensils made just for her! Choose dish towel gift wrap to add value to your gift! Also perfect gifts for a Bridal shower, housewarming, and more.12 inches long2.2 inches wideBeechwoodLaser engravedOiled with natural food grade oil that smells like lemons, making your package smell amazing!Dish towel:  100% cotton28x18 inchesWe also offer many different gift boxes and can also make custom gift boxes especially for you. Contact us if you need a custom order, or with any other questions! We are happy to help!Visit our shop for many more beautiful laser engraved kitchen products to spice up your kitchen!https://www.etsy.com/shop/AFewSpareMoments?ref=shop_suggIf you need a custom designed spoon here is the link to where you can purchase:https://www.etsy.com/listing/884903171/personalized-wooden-spoon-engraved?click_key=a1d6a4edf4103479b25503ee6e4c4288b4d68bde%3A884903171&click_sum=3a5a7085&ref=shop_home_active_28&frs=1&crt=1&sts=1",
    "reviews": [
      "The item was so perfect!",
      "Love the spoons - look beautiful - fast shipping.",
      "Great I love it !",
      "I ordered for a wedding shower gift and the inscription and spoon were exactly what I hoped for. Thank you"
    ]
  },
  {
    "productId": "YtwddjGHtr",
    "url": "https://www.etsy.com/listing/856510776/personalised-flower-initial-resin?click_key=7176910ebd0911696cf72d5b56425786a9e82473%3A856510776&click_sum=f07e8b6c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-29&etp=1&sts=1",
    "title": "Personalised Flower Initial Resin Keyring, Mothers Day Gift, Gift For Mum, Gift For Her, Birthday Gift, Easter Gift, Keychain, Custom Gift",
    "description": "D E S C R I P T I O NHandmade resin initial keyrings using pressed flowers and foil flakes. You can fully customise your keyring by choosing the flower, foil flake and keychain colour. The perfect gift for your mum on Mothers Day or a thoughtful present to give to a friend or partner. You could add the keyring to your car keys, house keys or bag.  Please note flowers are only visible on one side of the keyring, the back of the keyring will show the foil flakes only.D I M E N S I O N S (approximate)Letter height: 4cmLetter width: 1cm to 5.8cm (dependant on letter)Letter depth: 0.8cmFull length: 10cmP R O C E S S I N G  A N D  D E L I V E R YYour order will be dispatched within 5 to 6 business days via Royal Mail.UK DeliveryYour order will be dispatched via 2nd Class Standard (estimated delivery time: 2 to 4 business days). You can upgrade delivery to Tracked 24 (estimated delivery time: 1 to 2 business days) or Next Day Delivery (estimated delivery time: 1 business day) at checkout.International DeliveryYour order will be dispatched via International Standard (estimated delivery: 6 to 10 business days). You can upgrade delivery to International Tracked and Signed For (estimated delivery: 6 to 10 business days).S H O P  P O L I C I E S- Cancellations are only accepted if I have not started manufatcuring your order.- Returns and exchanges are not accepted due to products being made to order.- Any damages to your order must be reported within 30 days from the delivery date to request a refund. After then only a replacement will be offered.- I kindly ask customers to wait 10 days from the estimated delivery date to report a missing order. This allows for any delays with the postal service.",
    "reviews": [
      "Beautiful keyring , my fifth  one I have quick delivery as needed quickly .",
      "Very pretty to look at",
      "I bought 12 key rings and they’re all amazing. Arrived faster than expected and the seller replied to my questions fast. Highly recommend.",
      "Great quality and fast shipping:)"
    ]
  },
  {
    "productId": "9dZaLzMdGm",
    "url": "https://www.etsy.com/listing/1097214607/personalized-monogrammed-engraved?click_key=719f00bb3bdc1ba1a2561f370491ca326e9a95d4%3A1097214607&click_sum=21743c40&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-30&pro=1&frs=1&etp=1",
    "title": "Personalized Monogrammed Engraved Genuine Leather Bifold Mens Wallet - Father's Day gift with personalized wooden box",
    "description": "A nice soft Dark Brown genuine leather wallet which can be personalized outside and inside. This wallet would make the perfect gift for him, anniversary gift, Birthday gift, Father’s Day, Christmas Gift, best man and thank you gift and many more special occasions. You can add a special personalised gift to your loved one.You will get a wallet + wooden box after purchasePlease contact me or leave a message for the personalized content of the wooden box.P R O D U C T ∙ I N F O• Material: Genuine cowhide leather• Dimensions: (4.5 x 3.9 x 0.6 Inch)• Features:-1 money slot-6 card slots-2 hidden slots-ID slot-Coin pocketNew Dark brown wallethttps://www.etsy.com/au/listing/1119310001/anniversary-gift-for-himpersonalized?ref=shop_home_feat_1&frs=1Brown red wallet：https://www.etsy.com/au/listing/1062808063/personalised-mens-walletgenuine-soft?ref=shop_home_active_2&pro=1&frs=1",
    "reviews": [
      "Wallet is a bit on the smaller side for use by a busy guy.  I loved the craftsmanship and my son loved it but due to its smaller size cannot use it for daily use.",
      "I purchased this for my husband for our anniversary, and he absolutely loved it. Perfect gift and their service was amazing.",
      "My dad loved it for Christmas 🎄"
    ]
  },
  {
    "productId": "BHQD3OJoyw",
    "url": "https://www.etsy.com/listing/1343709009/customized-dog-mitt-put-your-cute-dog-on?click_key=40f6b9d444a6fa5b002301344b5255618684b148%3A1343709009&click_sum=751db582&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-31&frs=1&etp=1",
    "title": "Customized Dog Mitt - Put Your Cute Dog on Custom Oven Mitts, Dog Lovers, Dog GIft, Dog Personalized, Dog Gift Socks, Christmas Gift",
    "description": "Get custom mitt with your very own fur babies face on them! They make the perfect gift for anyone who loves their dog! Perfect for any holiday, birthday, or anniversary! Handmade by local part time moms in Portland, Oregon every pair is made to order.HOW TO SEND IMAGESYou will receive an emailed link within 30 minutes of placing your order to upload your images for us to crop. If you can't find your link in your email, feel free to message us and we can send over Etsy message as well. By default we crop the face, so please leave a note on the upload page if you would like it cropped differently.We only offer right-handed oven mitts. If you purchase multiple mitts, they will all be right-handed. Price is for 1 right-handed oven mitt.GROUP DISCOUNTSIf you are looking to buy more than 25 please message me and I can get you our group discount pricing!Feel free to message us with any other questions and we will get back to you ASAP.Photo Oven Mitts, Custom Oven Mitts, Oven Mitts, Personalized Oven Mitts, Custom Printed Oven Mitts, Picture Oven Mitts, Photo Gift, Custom Photo Oven Mitts, Photos on Oven Mitts, Gift idea, Mother's Day, Father's Day, Christmas Gift, Stocking Stuffer, Birthday Gift, Perfect Gift Idea, Dog Lover Gift, Gift for Dog Lover, Puppy Gift, Anniversary, Wedding, Fur Baby, Softest Comfortable Oven MittsAs all of our products are 100% customized, everything we sell is one of a kind. Due to this, we cannot accept returns. In the case of a damaged/faulty product, we are happy to work with you to get you a replacement. In this case, contact us and we will resolve the issue.",
    "reviews": [
      "Great product with good quality, received exactly what I asked for. Would buy again.",
      "perfect gift and fast shipping",
      "Made for a great gift, very good quality!!"
    ]
  },
  {
    "productId": "kiPEAHRCrA",
    "url": "https://www.etsy.com/listing/732270536/custom-personalized-wood-guitar-pick-box?click_key=25bc5d96f24f01ef00956c531d5ffd4efa157fe6%3A732270536&click_sum=901d245e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-32&pro=1&etp=1&sts=1",
    "title": "Custom-Personalized-Wood-Guitar Pick Box-Plectrum-Pick Case-Pick Holder-Musicians Gift-Gifts for Him-Guitar Player-Xmas gift-New Year gift",
    "description": "If you are buying it for yourself or as a gift,it will be a great addition to your guitar playing.The highest strength magnets hold the lid in a secure position, keeping everything in place during transport or storage. We know that our boxes are a great musical accessory, an ideal gift for: beloved, brother, father, friends. Also suitable as a wedding anniversary gift for friends or parents.A gift that brings joy to a loved one.These are Unusual gifts for men who have everything.You can also order personalization, engraving or a small logo.🚀 ORDERING1. In the drop-down list \"personalization and quantity of compartments\".Choose from an option with or without a logo and the number of compartments for a pick.2. In the dropdown list \"Color and Slope\"Choose a color and cut type. Type \"A\" (with a straight cut) or type \"B\" (with an oblique cut).3. In the comments to the order, write the number of the logo or the number of the text for engraving, (or both) if you have an individual logo, then send it to me in a message after ordering4.Click the \"Add to Cart\" button.Note. The pick shown in the photo are NOT included in the purchase price.Details and Benefits:📌•Materials: Oak.📌 Wood treatment is carried out with completely eco-friendly and anti-allergenic water-based oils.📌 Inserts with Natural felt.Internal compartment thickness 0,12 in (3.1 mm)🙂    Sizes: boxes for 4 picksWidth (55 mm) 2.16 inchesLength (71 mm) is 2,79 inchesHeight (37 mm) is 1,45 inches🙂    Sizes: boxes for 6 picksWidth (55 mm) 2.16 inchesLength (102,8 mm) is 4,047 inchesHeight (37 mm) is 1,45 inches🙂    Sizes: boxes for 8 picksWidth (55 mm) 2.16 inchesLength (134.2 mm) is 5,27 inchesHeight (37 mm) is 1,45 inches🙂    Sizes: boxes for 10 picksWidth (55mm) 2.16\"Length (165.6 mm) is 6.49 inches.Height (37 mm) is 1.45 inches.Production time 1-3 days.✈️ ShippingUSA  10-14 days.Shipping worldwide:Canada: 2-3 business weeksEurope: 2 business weeksOther countries: 2-4 business weeks.PERSONALIZE IT!Would you like your name, initials or logo engraved on this piece for a personalized gift? Just send us a message and we'll do our best to come up with something for you.Customized Wooden  Pick Guitar Box, Pick Case, Pick Holder, Gifts for Musician, Gifts for Him, GuitaristGift for guitarist Wood Pick with box, personalized gift with name Perfect gift for guitarist or musician Personalized to order",
    "reviews": [
      "This has really good quality and matched exactly what I wanted. Definitely recommend!",
      "Uber luxe way to pimp your TS picks",
      "super trick way to store and travel with your pics and be king status",
      "super nice pick case - hinges and engraving and pick slots top luxury style"
    ]
  },
  {
    "productId": "xPMGoPEjLn",
    "url": "https://www.etsy.com/listing/1316233154/personalized-wooden-walnut-chopsticks?click_key=8443246d1960c2d62097ca4e7a3a1874b177e17f%3A1316233154&click_sum=0e5f26ba&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-33&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Wooden Walnut Chopsticks, Custom Chopsticks Set, Reusable Chopsticks, Engraved Wooden Wedding Favors",
    "description": "Personalized Wooden Walnut Chopsticks, Custom Chopsticks Set, Reusable Chopsticks, Engraved Wooden Wedding FavorsIf you are looking for something Beautiful and really Unique, these engraved chopsticks are perfect!This beautiful wooden chopsticks are laser engraved and made of Walnut, they are coming in wooden box.Walnut wood chopsticks will leave a masterpiece impression on your traditional event. These are beautiful chopsticks and the perfect gift for sushi lovers, wedding guests, or friends. The proud owners of these great little wooden masterpieces won't have to worry about mixing up utensils with anyone else. These customizable chopsticks can be personalized with your name, bride & groom's name, date, company name, and/or short phrase. Get the box for a great presentation or for storing away. Personalize your box as well to proudly display.If there is other products your looking for message us and we will be happy to provide information.Unfortunately, we're unable to offer custom colors for engraving. Our laser engraving equipment uses heat to burn the design onto steel, wood, metal, or leather, creating a deep mark on the surface. It's important to note that the process is not etching or printing, but our team ensures that each piece is carefully crafted for a lasting and distinctive result.Item details:- Original Walnut chopsticks and case- Classical Design- Box size: 9.8х1.1х0.75 inches, 2 ozChopsticks size: 8.8 inches, 0.35 ozDiameter from 0.1 to 0.3 inchesPlease make sure you leave right information at Personalization window, our laser engraving equipment burns the wood and the sign is not removable.The photos of chopsticks in this listing are shown just examples.",
    "reviews": [
      "shipped quickly and had all the correct order specifications",
      "Happy with how this came out",
      "Very nice product and good quality.",
      "Everything is perfect!  Shipping was fast too!  Thank you so much!"
    ]
  },
  {
    "productId": "thzpewGJhw",
    "url": "https://www.etsy.com/listing/1599769763/personalized-engagement-gift-box-for-her?click_key=33c51cb757b3142b5d57e6abff9bbdd4277eb4e0%3A1599769763&click_sum=941e9e17&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-34&pro=1&etp=1&sts=1",
    "title": "Personalized Engagement Gift Box for Her, IT'S GIVING ENGAGED Candle and Keepsake Champagne Flutes or Shot Glass Gift for Couple with Names",
    "description": "If you're looking for a gift that's sure to get a smile, look no further than this 'IT'S GIVING ENGAGED' beautifully crafted custom candle gift box. The box includes two elegant champagne flutes or shot glasses and a luxurious candle, designed to create a memorable and unforgettable experience. The flutes or shot glasses can be etched with \"Mr & Mrs\" or the couple's names or initials, making it a truly unique and special gift.Choose from 12 signature scents to enhance the atmosphere of the celebration. Our candles' delicate aromas will fill the air with a soft and inviting scent, creating a warm and welcoming atmosphere for the happy couple to enjoy. The boho-inspired design of the gift box adds a touch of whimsy and charm, making it a thoughtful and stylish gift that the couple will treasure during this special occasion.This engagement gift box is also a perfect bridal shower gift for her. Whether you're looking for a special present for your best friend, sister, daughter, or you want to treat yourself and your partner, this gift box is sure to impress. Add safety matches or a delicious chocolate bar for an extra special touch. Your order will arrive beautifully wrapped and ready for unboxing.⫸ GIFT BOX INCLUDES• 8 oz premium soy candle• 2 stemless champagne glass flutes or 2 shot glasses• Safety matches (THIS IS ADD-ON OPTION)• Chocolate (THIS IS ADD-ON OPTION)• Made for you card (we will handwrite the gift message if one is provided with the order)Please note: The etching on our champagne flutes and shot glasses are transparent and permanent. We do not use vinyl or stickers.⫸ AVAILABLE SCENTS• BERGAMOT MUSK: Orange, bergamot, ambrette & musk.• CITRUS AMBER: Bergamot, lemon, amber & vanilla.• FIRESIDE: Warm spices, cinnamon stick, tonka beans & wood.• GOLDEN HOUR: Fresh eucalyptus, crisp mint, pineapple & sugarcane• MORNING DEW: Apple, pear, patchouli, moss, wood & musk.• OAKMOSS CEDER: Citrus, cedar, lavender, white oakmoss & amber• ORANGE BLOSSOM: Sweet mandarin orange, apple & vanilla bean.• PEONY & CASHMERE: Apple, peony, jasmine, cashmere, musk & wood.• SUNKISSED: Sweet citrus, lemon, white blossom & crisp greens.• SWEATER WEATHER: Marshmallow, chestnut, brown sugar, vanilla & sweet musk.• SWEET JASMINE: Jasmine, fresh mandarin & sea salt.• VANILLA VELVET: Orange, lemongrass, cedarwood, amber & vanilla.• WINTER PINE: Cooling cedar, evergreen, juicy citrus & amber.📦 PRODUCTION & SHIPPINGOrder Production: 1-3 business daysStandard Shipping: 3-7 business days after production timePriority Shipping: 2-3 business days after production time✨ KEEP SHOPPING• check out the rest of our shop here:www.etsy.com/shop/endlessaster",
    "reviews": [
      "I got this as a gift for my friends after their engagement & they absolutely loved it!! The packaging was so cute, the flutes were perfect, and the candle smelled AMAZING!",
      "Arrived early and the recipients loved it!",
      "The recipient was very excited when this arrived, she loved the personalization.",
      "Sent as a gift and she loved it!"
    ]
  },
  {
    "productId": "yZgBvqVivG",
    "url": "https://www.etsy.com/listing/983174996/laurel-initial-personalized-tumbled?click_key=efb97fd134f945f9f8ba25375b49e1b153c71314%3A983174996&click_sum=5623639c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-35&pro=1&etp=1",
    "title": "Laurel Initial Personalized Tumbled Stone Coaster Set, Wedding Gifts, Gifts for Newlyweds, Gifts for Couples, Personalized Housewarming Gift",
    "description": "Celebrate a special couple with our Laurel Initial Personalized Tumbled Stone Coaster Set. This coaster set makes a great engagement or wedding gift!𝙉𝙤𝙩𝙖𝙩𝙚:Tumbled stone tile is a natural product. Variations in color, texture, plus noticeable cracks and flaws are to be expected as that is the nature of the product. Due to this, print colors may vary from tile to tile and you may see graining or crystallization.𝘼𝙗𝙤𝙪𝙩 𝙩𝙝𝙚 𝙄𝙩𝙚𝙢:- Measures 4\" x 4\"- Genuine marble stone- Each coaster has a full cork back to protect your furniture- Clean with warm soapy water. Do not use isopropyl alcohol or any harsh cleaners",
    "reviews": [
      "These made for a great Christmas gift!",
      "These made for a great Christmas gift!",
      "These made for a great Christmas gift!",
      "It was great quality! Used them for a Christmas gift"
    ]
  },
  {
    "productId": "BC8xzbWOsl",
    "url": "https://www.etsy.com/listing/755498299/wanderlust-travel-gift-adventure-time?click_key=7119e7495b7838a48c462776ce6a058574eca87c%3A755498299&click_sum=d6e31891&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-36&frs=1&etp=1&sts=1",
    "title": "Wanderlust Travel Gift, Adventure Time, Travel Journal, Travel Accessories, Wanderlust Print // 50 Challenges Game",
    "description": "— UNIQUE TRAVEL GIFT 2024— PERFECT GIFT FOR TRAVELERS— ALONE TRAVELERS, WITH PARTNERS OR WITH FRIENDS— ONLY A LIMITED AMOUNT OF PIECES, ORDER SOON— FREE WORLDWIDE SHIPPING— MADE BY YOUNG EUROPEAN TRAVEL COUPLE, LIZA & TIAGOYou don’t even know how you ended up riding that donkey to the wedding of the cousin of your taxi driver? Or how you managed to learn the art of traditional hand weaving?Well, that could all be results of our challenges.If you want to bring home stories like that, these challenges are for you. Just pick a card and let the adventure happen!The cards will bring you joy, unique memories and many adventures. You can leave your comfort zone at home, because you will not need it.On every card you find a challenge that you will do on that day. A great way to explore any destination of the world. Get to know the locals and create a lot of new friendships.Stop worrying about small talks with strangers. These cards are a great conversation starter. Even if it’s just as easy as asking other people to do the challenge with you!For anyone who seeks adventure! A must have on your next packing list or great as a creative gift for travelers!50 Challenges50 Inspirational travel quotes50 Adventures50 Stories.. uncountable memoriesYour adventure starts now. Can you do it?_______________________________________Features50 Travel Challenges50 Inspirational QuotesHigh-Quality CardsPerfect Travel Pocket SizeWorks WorldwideTechnical DetailsFormat 60mmx90mm with 50 exclusive cards.Each cards containing 1 Travel Challenge and 1 Inspirational Quote.Material: Couche Paper 350GOverall UV layerMatte FinishingBox TRUCARD 260G carton_______________________________________MOST AUTHENTIC TRAVEL GUIDEOur challenges are a Travel Guide that will recommend the best places together with a cultural interaction in a playful way._______________________________________MOST ORIGINAL TRAVEL GIFTPeople love to share inspiration and expectations! These cards are the perfect gift to offer to someone that will travel!_______________________________________LET'S INSPIRE THE WORLD.If you have any questions please do not hesitate to message me :)",
    "reviews": [
      "These are a fun option!",
      "Amazing item! Love it, thanks!",
      "You did a great job"
    ]
  },
  {
    "productId": "gtIjJeXtMd",
    "url": "https://www.etsy.com/listing/1076321635/happy-birthday-present-personalised-self?click_key=cfa07d8af2086e7d80e0730a7df6d079c4d80d5a%3A1076321635&click_sum=86d0711a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-37&etp=1&sts=1",
    "title": "Happy Birthday Present Personalised Self Care Gift Box Filled Artisan Vegan Gift Best Friend Present Bridesmaid Gift Set Spa Gift Eco Gift",
    "description": "These beautiful artisan gifts are perfect to treat a loved one for a special occasion or maybe just to say thank you.We can personalise this gift with a special message from you which can be printed on the gift box.If you would like this as a Christmas gift we can change the message to a more Festive theme for you.When you place the order on Etsy the 'personalisation message' will be printed inside the box and the 'gift message' will be on the Etsy gift printout along with the gift card.Our gift boxes are filled with unique items that are natural, sustainable, vegan and ethically made.This gift box contains:(PLEASE NOTE WE CAN EXCHANGE THE BATH SALTS FOR A SMALL BODY LOTION AND SHOWER GEL IF PREFERRED - PLEASE SEND A NOTE)A special gift in hand painted ceramic - choose your optionOrganic natural soap hand wrapped in printed materialNatural Plant Wax Votive Candle with Dried Flowers in GlassGlass with cork bottle of pink Himalayan spa salts with dried flowers3 Soy wax melts with dried flowers (or 2 soy wax tea lights with dried flowers) choose which option you preferChoose from a choice of 3 special gifts:Option 1 - Rustic Bud Vase H8cm with Dried Flowers includedOption 2 - Love You BowlOption 3 - Happy Days BowlOption 4 - Blooming Gorgeous BowlOption 5 - Ceramic Star DishOption 6 - Adventure AwaitsOption 7 -  You are Loved BowlOption 8 - Special Friend BowlOption 9 - White Daisy Dried Flower in Matchbox - Thinking of YouOption 10 - Special Mum BowlGift Box Dimensions:Width 19cm - Height 8cm - Length 19cmVase dimension - Height 8cmCeramic dishes dimension - Diameter 6.5cmSuitable as a Happy Birthday Gift or any occasion Boxed GiftsPlease note: box contents may vary slightly due to stock availabilityGifts can be sent straight to the recipient with your message printed inside the gift box.If you have any queries please message us through Etsy, we always answer emails promptly.",
    "reviews": [
      "This was exactly what I wanted out of a comforting, self-care gift. Recipient loved it xx",
      "Brought as a present for my bestie, and she loved the quirkiness. The quality is spot on, and it was as described. So thank you for making my bestie smile.",
      "Recipient who I gifted this absolutely loved it, especially the personal name touch.",
      "Really quick delivery and super happy. Fantastic gift for a friend."
    ]
  },
  {
    "productId": "hRwSbUFpvt",
    "url": "https://www.etsy.com/listing/1500263950/personalized-wedding-gift-speckled?click_key=8938f82797a109c368881e4888538159e5ea500e%3A1500263950&click_sum=4f81d5a8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-38&etp=1&sts=1",
    "title": "Personalized Wedding Gift / Speckled Minimalist Ring Dish / Jewelry Dish  / Engagement Gift / Bridesmaids Gift / Personalized Gift for Her /",
    "description": "*PLEASE NOTE* We aren't able to rush orders or expedite shipping, and we can no longer guarantee USPS shipping timelines. Our current processing time is 4 business days (Monday-Friday), and USPS shipping should take 5-7 days.Thank you for continuing to shop small.  Your support is how we feed our family, and it's our team members' livelihood.  We are beyond grateful for you.Back in 2014 I wanted to create something that was personal, affordable, and totally unique. I designed these jewelry dishes to be elegant, minimalist, and carry individual meaning for whomever orders one. Since then, various people have started creating similar items but I want to thank you for supporting the original idea! It means the world to me that you're here, and I can't wait to create one of these dishes for you or someone you love!•\tThis is not a ceramic item. It is light and can be slightly pliable. This means that it is much harder to break and should not shatter if dropped.•\tPlease note that each dish is molded, stamped, painted and sealed in our studio. This is a delicate hand-crafted process, and each dish will be different.•\tFollow us on social media:•\tinstagram: @thepaintedpress•\tpinterest: www.pinterest.com/thepaintedpress/•\tFor more details please see our shop policies! Feel free to shoot us a message with any questions you might have.Wedding Photographers - Client thank you gifts, am I right? These are perfect stand-alone gifts OR added to a larger box of your curated goodies. Contact us for a special wedding photographer discount!Our dishes are perfect for weddings, anniversaries, engagements, birthdays, holidays, and everything in between! There really is always a reason to show someone you love them with a unique, personalized gift!Wholesale - We would love to be carried in your shop or online store!  Shoot us an email at  contact [!at] thepaintedpress.com to get started.",
    "reviews": [
      "Perfect little addition to my friends engagement gift!",
      "Expectations were exceeded 100%! I ordered a custom ring dish with our engagement date and the flower of the month and both turned out amazing. Will be ordering here again!",
      "so cute and came quickly"
    ]
  },
  {
    "productId": "zhHoIWWnBJ",
    "url": "https://www.etsy.com/listing/1576154065/personalized-docking-station-men-gift?click_key=315ad6f5e5c4b2f6b716ccbb6cf84dfbf9d9180b%3A1576154065&click_sum=1d49a4d6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-39&pro=1&frs=1&etp=1&sts=1",
    "title": "Personalized Docking Station Men, Gift for Men, Wooden Docking Station, Gift for Him, Christmas Gift, Personalized Gift, Gift for Husband",
    "description": "Docking Station can be a unique gift for: Gift for Men, Anniversary Gift, Father's Day Gift, Gift for Him, Boyfriend Birthday Gift, Anniversary Gifts for Husband, Birthday Gifts, Groomsmen Gift, Unique Gift, Christmas Gift, Valentines Day Gift, Wedding Gift, New Job Gift, Graduation Gift, Mothers Day GiftThe Personalized Docking Station is a versatile desk organizer. Docking station is compatible with all mobile phone models. It is a product designed specially for you to help store and organize your belongings such as mobile phone, watch, AirPods, glasses or keys. This is also a charging station, you can easily charge your phone, apple watch and Airpods with your charging cable.Docking station which is created from high-quality birch plywood is a sustainable product. Created completely by manual labour, docking station makes the product you buy unique.This is a laser Cutting and Engraving.Wood is oiled and colored with organic natural oils. The texture of the product does not deteriorate. When you touch it, you feel the texture of wood.This holder has two parts, only need to insert them into each other and it is ready to keep your lovely gadgets.*If you do not want the watch charging point to be cut off, please specify via message.Dimensions:8\" Width X 8\" Height X 8\" DepthTop part is 6 mm thick.Bottom part is 12 mm thick.ORDERINGChoose your Color and Personalization option and fill out the personalization section.Personalization options;*Engraving: You can choose the design from the photos.Example: Design 5 - S*Cutting: Just write your name.Example: STEVEN*Engraving + Cutting: You can see it in the main photoExample: Design5 - S + STEVENYou can personalize docking station with any name or logo you want.You can visit our store to review our other products.https://www.etsy.com/shop/TheArtOfEngraving",
    "reviews": [
      "The item is beautifully made and came safely packaged.",
      "just ss described  fits perfect on bedside table",
      "Item is okay for the price. It arrived quickly. I didn't realized the phone ledge was going to be a tiny piece of wood that has to balance in a slot."
    ]
  },
  {
    "productId": "IlgJtyDnpx",
    "url": "https://www.etsy.com/listing/1352481290/minimal-personalized-book-embosser-stamp?click_key=9ef8ac27a5aecdc282bc4cccabaf10a0de957b41%3A1352481290&click_sum=81163959&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-40&pro=1&frs=1&etp=1&sts=1",
    "title": "Minimal Personalized Book Embosser | Stamp | From the library of | Ex Libris | This book belongs to | Book lover gift Self ink | Wood handle",
    "description": "Personalized Book Stamps, change the wording to your own or use common phrases \"From the Library of\" Ex Libris\" Property of\"🎁 𝗧𝗛𝗘 𝗣𝗘𝗥𝗙𝗘𝗖𝗧 𝗚𝗜𝗙𝗧Makes a brilliant gift for your loved ones (or for yourself!).💎 𝗤𝗨𝗔𝗟𝗜𝗧𝗬 𝗖𝗥𝗔𝗙𝗧𝗠𝗔𝗡𝗦𝗛𝗜𝗣✨ 𝗘𝗟𝗘𝗚𝗔𝗡𝗧 𝗗𝗘𝗦𝗜𝗚𝗡🌟 𝗠𝗢𝗡𝗘𝗬-𝗕𝗔𝗖𝗞 𝗚𝗨𝗔𝗥𝗔𝗡𝗧𝗘𝗘We love this stamp, and we hope you will too. If for any reason you are not satisfied, we will give you your money back, guaranteed!----------𝗣𝗥𝗢𝗗𝗨𝗖𝗧 𝗢𝗣𝗧𝗜𝗢𝗡𝗦- SELF INK STAMP = inkpad is built into the stamp and inks design with colors: Black, Blue, Red, Green, Purple- WOOD HANDLE STAMP =  inkpad not included- EMBOSSER = Embosser orientation: bottom is the default. If you want top please let me knowSIZESWood Stamp: 1.25 x 2 in.Self Ink Stamp: 1-1/8 in. × 2 in.Embosser: 1x2 inches----------Follow these easy steps to customize & complete your order:♡ 𝗖𝗛𝗢𝗢𝗦𝗘 𝗬𝗢𝗨𝗥 𝗢𝗣𝗧𝗜𝗢𝗡𝗦Wood stamp with handle, wood stamp with no handle, self-ink stamp or embosser♡ 𝗣𝗘𝗥𝗦𝗢𝗡𝗔𝗟𝗜𝗭𝗘 𝗜𝗧Use the \"Personalization Box\" or \"Notes to Seller\" to let me know the details of your stamp. Please copy & paste this template:Text above: from the library ofName: Taylor Strade♡ 𝗗𝗜𝗚𝗜𝗧𝗔𝗟 𝗣𝗥𝗘𝗩𝗜𝗘𝗪 (OPTIONAL - ADDS 2-3 DAYS)If requested, I'll send you a digital preview via Etsy messages within 2-3 business days. I ask that you please keep an eye on your Etsy messages and email. The quicker you approve your preview, the faster I can ship it to you 🙂If there's no response, I'll attempt to contact you a second time before I begin production as-is.♡ 𝗣𝗥𝗢𝗗𝗨𝗖𝗧𝗜𝗢𝗡 𝗔𝗡𝗗 𝗦𝗛𝗜𝗣𝗣𝗜𝗡𝗚 𝗧𝗜𝗠𝗘𝗟𝗜𝗡𝗘Production: please allow 2-3 business days after your digital preview is approvedShipping: the average shipping time is 3-5 business days---Can you rush my order?Of course! I offer options to expedite production and shipping.Please contact me before placing your order, so I can make sure that you can get your stamp delivered to you in time 🙂",
    "reviews": [
      "I am so excited about this purchase! It arrived quickly and exactly as expected. The packing slip included a mockup of what the embossed marking would look like, and I tested on that paper with the same result. It turned out super cute and I’m sure my friend will love her gift!",
      "Quick turnaround and great quality. I've already used it on over 100 books and there are no signs of this wearing down.",
      "Wonderful! Makes a beautiful indentation! Will be used for a long, long time. Will recommend this shop to everyone."
    ]
  },
  {
    "productId": "WUFkxVGJRq",
    "url": "https://www.etsy.com/listing/1152863124/monogram-whiskey-custom-2-in-cocktail?click_key=b1b33feb5c19b96bd60408e20269cf5b39b0f8c9%3A1152863124&click_sum=c6d127a4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-41&pro=1&frs=1&etp=1",
    "title": "MONOGRAM Whiskey Custom 2-in Cocktail Ice Cube Tray, Personalized Silicone Cocktail Ice Cube Mold, Holiday Gift For Him, Ice Stamp",
    "description": "Make unique, speakeasy-worthy ice cubes at home with a monogram ice tray! Effortlessly elevate your next cocktail night with ice cubes bearing your initials or couple’s monogram. Our unique ice trays are made-to-order in the United States and make an excellent gift for the home bartender in your life. They're also ideal for adding a sophisticated and personalized touch to special occasions such as weddings and anniversaries. Cheers!FEATURES:- Makes 2 inch ice cubes - perfect for a standard rocks glass- Personalize each ice cube with up to three initials in a classic monogram style- Soft silicone remains flexible when frozen, making removing cubes a breeze- Made-to-order by a small business in Concord, Massachusetts- Designed to last a lifetime- Lids are available for this mold type through a separate listing here:https://www.etsy.com/listing/1083661252/silicone-ice-tray-lid-for-bemoldMATERIALS:- Food grade silicone- Free of BPA, lead, and phthalates- Dishwasher and oven safe up to 400FMEASUREMENTS:- 2 cube ice tray: 4.5” length x 2.5” width x 2.3” height- 4 cube ice tray: 4.5” length x 4.5” width x 2.3” height- 6 cube ice tray: 6.5” length x 4.5”width  x 2.3” height- Ice cubes: 2.0” length x 2.0” width x 2.0” height--HOW TO ORDER:Please type the initials from left to right in the EXACT order you want them to appear on ice. For an individual’s monogram, it is traditional to arrange the initials from left to right as first name, last name, middle name. So for Sarah Jessica Parker, you would type SPJ. For a couple’s monogram, it is traditional to arrange the initials from left to right as one person’s first name, the shared last name, and the other person’s first name. So for Victoria and David Beckham, you would order VBD. To see how your initials will appear, please reference the style guide in the product photos.Please note that the beloved round monogram style requires letters to conform to a circle. As a result, some letters may look unusual depending on their placement. For the full monogram alphabet, please reference this link: https://tinyurl.com/mdxmcm5sVisit our shop or to find our listings for ice trays that allow you to include plain text or a custom logo / graphic!--TIPS FOR PHOTOGENIC ICE:1. Use distilled water: Tap water naturally contains impurities which cause white cloudy balls to form in the cubes as they freeze. To minimize cloudiness, we recommend filling your mold with distilled water, which is free from impurities and is readily available at grocery stores for about $1 per gallon.2. Remove air bubbles: The surface of your ice cubes may have pockmarks created by air bubbles that were stuck inside your design or clinging to the walls of the ice tray when frozen. Prevent this by using a chop stick or butter knife to release any visible air bubbles from the mold before freezing.3. Temper the ice: Before putting the ice in your drink, place it on a dinner plate for a few minutes to allow it to warm up slighty. This prevents it from cracking as soon as it hits the room temperature liquor.4. Allow frost to form: As the ice warms up outside of the freezer, moisture in the air will condense on the surface of the ice, creating a nice frost that makes the appearance of your monogram much sharper. That's the secret to our photos!5. Keep it dry: here's our spin on the old adage - ice before liquor, design fades quicker. Liquor before ice, looking nice. In other words, carefully add your tempered, frosty ice cube to your drink last to keep the design dry. If you pour room temperature liquor over your frosty design, it will quickly vanish, and you'll be quite disappointed!--BULK ORDER INQUIRIES:Send us a message and we'd be happy to get back to you with pricing!POLICIES:- Our refund policy is available upon request.- Our return/exchange policy can be located at the bottom of every listing.- Have a question? The best way to contact us is to send us a direct message.*Due to the nature of our production process and order volume, all delivery dates are subject to change.",
    "reviews": [
      "Would definitely order again. Worried that the ice wouldn't have the monograms nice and clear but they were really clear. You need quite a large tumbler ro fit them in.",
      "This is my second time ordering and they are perfect!",
      "Great product , it arrived on time. Work’s wonderfully.,"
    ]
  },
  {
    "productId": "BzBbxBDNyl",
    "url": "https://www.etsy.com/listing/1211464539/custom-city-map-glass-gift-for-him?click_key=aea5722d471232b8c0c5a2f63407ddf259695fdd%3A1211464539&click_sum=c51d3460&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-42&pro=1&etp=1",
    "title": "Custom City Map Glass Gift for Him, Personalize Any City, Town, Hometown Etched Beer Glass for Men, Custom Engraved Beer Glassware Gift",
    "description": "Sip your preferred beverage from this unique and personalized beer can glass. Crafted with the city of your choice, it's a standout addition to any home bar. Whether you're savoring a chilled beer or a refreshing iced coffee, this glass is sure to be a cherished favorite. It's an ideal gift for loved ones, groomsmen, or that hard-to-shop-for individual. Makes an excellent birthday, Valentine's, Christmas, or Father's Day present. Opt for a bamboo lid and glass straw to enhance your set.⫸ FEATURES:• Capacity: 16 oz, size approximately 3\" x 5.25\"• Featuring a city map design, customizable with your choice of city• Crafted from high-quality, lead-free glass for safety and durability• Dishwasher-safe on a gentle/delicate cycle, though hand washing is recommended for lasting use• Designed with a long-lasting finish. We do not use vinyl or stickers• Map design available in Etched (frosted), Black, or White• Includes a complimentary gift box for easy gifting• Proudly designed and made with care in California📦 PRODUCTION & SHIPPINGOrder Production: please check out our shop announcement for current production time.Standard Shipping: 3-7 business days after production timePriority Shipping: 2-3 business days after production time✨ KEEP SHOPPING• we have more drinkware options here:http://etsy.me/3jtdBPD• check out the rest of our shop here:www.etsy.com/shop/promenadefield",
    "reviews": [
      "Husband loved it. The glass was packaged well and arrived without any broken pieces or cracks.",
      "I got this as a Christmas gift for my dad - he really likes it",
      "Looks perfect. I definitely like the black lettering better, but both look nice. Crisp, high quality etching. Thanks!",
      "They loved the gift. Extremely thoughtful."
    ]
  },
  {
    "productId": "uhSuAddLlf",
    "url": "https://www.etsy.com/listing/1234617898/gift-for-son-secret-men-message-bracelet?click_key=cad472f55d8014f99a398a22d95c703f8b747069%3A1234617898&click_sum=18e7d475&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-43&frs=1&etp=1",
    "title": "Gift For Son Secret Men Message Bracelet Hidden Message Personalize Leather Custom Birthday Gift for Him Her  Boyfriend  Husband Anniversary",
    "description": "Hidden Message Bracelet, Bracelet For Men, Custom Men Bracelet,Personalize Leather Bracelet,Engraved Leather Wristband For Dad.This TRENDY, SIMPLE, MODERN, and COMFORTABLE bracelet is great to wear in any occasion.-TO ORDER THE CORRECT SIZE: Please refer to the listing Pictures.-Note: -Drop down menu option for leather Color, engraving side, where you want your bracelet to be engraved.Out-In/Outside and Inside engraving, Out-Outside engraving  and In-Inside engraving.If you select Out Option in the drop down menu, the engraving will be on the outside not on the inside, So please select the correct option.Bracelet Specifications:____________________________-10mm Leather Band-Antique Red Copper Clasp-Antique Bronze Clasp-Cotton cordTo maintain the quality and the beauty of your leather accessory , please DO NOT expose it to the water such as the shower, pool, spa, or the beach!---Please Note: Sometimes the clasp color and the cotton cord color may varies a little bit due the fabrication processEngraving Details:_____________________-I can engrave up to 55 characters including spaces, on the bracelet per side. Make it as clear as possible, easy understandable instructions will significantly speed up completion process.-This bracelet can be personalized with own phrase, Letters, numbers, messages, dates, coordinates, roman numerals,names, favorite places..........HOW TO ORDER:____________________First): In the drop down menu it will give you options for leather color, engraving option and clasp color.Second): Choose the size the bracelet needs to be.Third): Add to carFourth): Upon check out, there is a NOTE TO SELLER where you can specify your personalization and font# from the last picture in the listing.Presentation:_______________All bracelets are packaged neatly and ready to give as a gift for any occasion.-All my bracelet are 100% HANDCRAFT.HOW TO ORDER THE CORRECT SIZE:___________________________________________-To order the correct size, measure the wrist with a piece of string, just below the wrist bone, where you would normally wear the bracelet. Add extra room for a comfortable wear. Measure the piece of string and that will be the correct wrist size to order.-Please note the wrist size you order will be the inside circumference of the bracelet, NOT the total length of the bracelet. Please make sure you add extra room for a comfortable wear. I WILL NOT ADD EXTRA ROOM TO THE WRIST SIZE REQUESTED.-Contact me for any special request.SHIPPING:____________All items are shipped first Class USPS mail with a tracking number (USA only). Normally delivered USA 2-5 Business Days, International 2-3 Weeks.",
    "reviews": [
      "I had to get another one and she was extraordinarily helpful and making it just like my first one",
      "The bracelet was great quality. My son loved it",
      "Exactly what I was hoping for! Got it as a gift and he absolutely loved the clasp design. The engraving turned out really well, too.",
      "Great material and beautifully made - Quick service ! ty"
    ]
  },
  {
    "productId": "yzZ9mcnnyK",
    "url": "https://www.etsy.com/listing/1119612879/personalized-necklace-handmade-custom?click_key=6664e9358991bf4fb4ec37df1db09540f9277ab2%3A1119612879&click_sum=b7a96e21&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-44&pro=1&frs=1&etp=1",
    "title": "Personalized Necklace-Handmade Custom Letter Necklace-Personalized Birthday Gift For her-Personalized Name Jewellery-Spaced Letter Necklace",
    "description": "♥♥♥ Welcome To Our TheLondonSohoJewelry Store . We are here to introduce you our beautiful, elegant and stylish products and give you a good service.♥♥♥Finished Colour:•Sterling silver,•Rose Gold Plated•Gold Plated• Personalisation : -This product can have any name, text, letter, symbol, roman numeral, number or anything else you want.• You can personalize your necklace, ring or earring, whatever comes to your mind, and always have it with you as the most meaningful part of your life :)• Each item is made to order, which makes our pieces a unique meaningful and special to you•  *** If you have any questions or  concerns please always get in touch with us via Etsy messages before leaving a review. We are here to help you right away. ***• Production Method: Handmade and some Laser Cutting tools (for quality)H O W ∙ T O ∙ O R D E R• Choose options from the drop down menu• Add you personalisation requirements in the personalisation box• Add to cart and proceed to checkoutO T H E R ∙ I N F O R M A T I O N• Please leave us the name or initials you want in the personalisation box please type your text as you would like it to appear (e.g.  capitals or lowercase). Please note that numbers and symbols count as a character e.g. \"M & H\" or \"1🤍G\"  would be a 3 letter necklace.• Unless you specify whether you want your personalisation to be uppercase or lowercase, we will process all in uppercase.PROCESSING & SHIPPINGAll purchased items will be shipped within 1-3 business days.We ship your parcel via Royal Mail .• UK Standard Shipping Time and Delivery : 3-5 working days•USA  Standard Shipping Time and Delivery  = 8-12 business days• European Union Standard Shipping Time and Delivery = 8-10 working daysExpress Shipping Time: 1-3 working days.CURRENT PRODUCTION HOURSAll items are made to order, so please see the top of our policies page/store announcement for the most current production and delivery times. If you need it sooner, please send us a message on Etsy.Thank you very much for your visit and we hope you will enjoy shopping with us.R E T U R N S   A N D   E X C H A N G E S• We gladly accept cancellations• Please request your cancellation within 24 hours of purchase• As all items are custom made we do not  accept returns or exchanges on jewellery unless there is a error made by us. We know that these products can be very important for you so, if you have an issue with your piece, please do not hesitate to contact us and we can solve the problem within 14 days of receiving your jewellery.We will not be able to replace or refund any item after 14 days.C A R E ∙ I N S T R U C T I O N S• We go through extra coating and polishing processes for your long-term use and to make them better quality, so you will not encounter any problems such as blackening or discoloration for a long time.• Although our jewellery is of high quality with extra layers to ensure longevity, plated jewellery should be cleaned periodically. It is very important to keep your jewellery dry to prolong its life. (Never spray your jewellery with perfume, chemical reactions with other elements such as chlorine and perspiration can cause tarnish).• Remove jewellery when exercising or doing physical activities, as prolonged contact with sweat can cause the coating to wear off more quickly. Never use abrasive chemicals or products to clean your jewellery. After each use, you can gently wipe each piece of jewellery with a soft, lint-free cloth to remove makeup and skin oils to prevent scratching.You can also take a shower with your jewellery.► PLEASE READ OUR POLICIES► ENTER OUR SHOP HEREhttps://www.etsy.com/shop/TheLondonSohoJewelry",
    "reviews": [
      "Beautiful necklace, excellent quality and super fast delivery. They also contacted me to offer their advice on my choice (I’d chosen too short a chain for the lettering) which was greatly appreciated. I adore the necklace. Will definitely shop again! Xx",
      "Item came with an incurable chink in the chain. Item was also shipped with a requirement that it be signed for; however, that information was not given to me and it took days before I could find it at the post office.",
      "The product is really lovely! Would definitely recommend ☺️"
    ]
  },
  {
    "productId": "wwwRyW4Jhw",
    "url": "https://www.etsy.com/listing/1407275907/sister-gift-personalized-sister-birthday?click_key=9a3aa798d3729b78f0a1075958e8f33e32d93d78%3A1407275907&click_sum=5b451da7&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-45&pro=1&frs=1&etp=1&sts=1",
    "title": "Sister Gift Personalized, Sister Birthday Gift For Sister From Sister, Gift For Women Gift, Mother’s Day Gift, Gift Mom One Line Art For Her",
    "description": "✨🤍✨NEW MONTH ✨ NEW SALE✨🤍✨RISK-FREE ∙ PURCHASEIf you realize after our first conversation regarding your personalization wishes that it’s not the right product for you, then I’ll give you full refund (This term doesn’t apply once I’ve started creating the artwork for you.).CREATED ∙ WITH ∙ LOVE ∙ TO ∙ THE ∙ DETAILAre you looking for a handmade, thoughtful gift for your special someone? Or would you like to preserve precious memories captured in an old picture which maybe doesn't have the best quality? Then you are at the right place! I'd love to create a beautiful artwork for you according to your wishes.H O W ∙ TO ∙ ORDER• Please select in the drop-down list the number of people/pets to be illustrated (e.g. 2 people + 1 dog = select \"3\") and the desired background color (any other desired color is also possible). After the purchase lean back and relax. I'll contact you within a few hours via Etsy Messages. So please check your Etsy inbox regularly. Of course you can also message me first.• I'll ask you for a reference picture and if you have any other wishes.DRAFTSI’ll provide you with drafts of the artwork until it corresponds fully to your expectations.FINAL ∙ PRODUCTDIGITAL FILENo physical items will be shipped.The aspect ratio of the illustration will be suitable for 8x10 inch paper. If you’d like it in any another size up to 24 inches, simply let me know.You can easily print it at home, any copy shop or use an online printing shop like Zazzle or Walgreens. I recommend using heavyweight paper (65 lb / 180 gsm or more). A good quality photo paper (matte / semigloss / glossy) is also a great option.Please contact me if you have any further questions.Let’s put on your loved ones’ faces a lovely smile and a twinkle in their eyes! I wish you lots of joy and happiness with your very special & timeless keepsake.MY ∙ SHOPhttps://www.etsy.com/shop/AnsAtelierI N S I D E ∙ S C O O P• IG: @Ans.Atelier• Pinterest: AnsAtelier | Custom Portraits & IllustrationsThank you so much for visiting and happy shopping! ♡",
    "reviews": [
      "It was absolutely perfect and Beautiful!",
      "This is the 3rd time I order and I’m never disappointed! I will definitely keep coming back ❤️",
      "Yuvi is incredible! I’ve ordered from them twice and I love both images!"
    ]
  },
  {
    "productId": "FhYqsEBewV",
    "url": "https://www.etsy.com/listing/932218890/slate-coaster-personalised-your-drink?click_key=d1fd04d2e5d9a0a97524c3a3da760db376c93343%3A932218890&click_sum=f35ac576&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-46&etp=1&sts=1",
    "title": "Slate Coaster, Personalised Your Drink Here, Tea Coffee Gin Beer Wine Whisky Laser Engraved Gift, Wedding, Birthday, Anniversary, Christmas",
    "description": "Laser Engraved Slate Coaster.Laser Engraved by us in house.All items made to order.100mm x 100mm approximately.Available in circle or square.Please checkout the other designs in my store.All coasters from my store can be mixed and matched.Custom designs can be made, please get in touch first.Same working day postage before 3pm.Free 2nd class postage UK.Cheap international shipping.If you have any questions please get in touch.",
    "reviews": [
      "item was packaged surprisingly well, item itself was as advertised and made my father very happy so props to the maker for allowing his/her customers to write whatever they wish",
      "Fantastic item, looks great, quick delivery, would definitely use again",
      "Fantastic item, looks great, thankyou"
    ]
  },
  {
    "productId": "SWKSbjsQPG",
    "url": "https://www.etsy.com/listing/1343417831/bridesmaid-tote-bags-personalized?click_key=27ae86e651dd1e039e2b4d603844fc6841539e49%3A1343417831&click_sum=f246fd8a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-47&pro=1&etp=1&sts=1",
    "title": "Bridesmaid Tote Bags, Personalized Bridesmaid Bags, Canvas Tote Bag with Zipper, Bridal Party Bridesmaid Gifts (BR170)",
    "description": "This Bridesmaid Tote is Perfect for your Wedding Party!Add your Wedding Colors to these Totes and surprise your Maid of Honor and Bridesmaids with this Perfect Gift!!Don't forget to get one for yourself!✨PREVIEW NAME OR TEXT✨https://app.fontvisual.com/showcases/6eb73a01-3391-4401-b3d1-7af4a3b3ad28⭐ Bag Color only comes as pictured ; there are no options for bag color for this item ⭐*PLEASE NOTE: Jute material (middle section of bags) is woven from natural fibers, and can have slight variations in the fabric so an area can appear darker or spaced out. This is a normal variation of this specific material and IS NOT a defect or mistake.*♥ HOW TO ORDER ♥1) Select options for any Dropdowns (see photos for options)2) Enter information in the Personalization Box3) Click \"ADD TO CART\"4) Go back to listing and repeat as needed5) Confirm Shipping Address and Complete Checkout!♥ SIZING AND ITEM DETAILS ♥◆ VIDEOS ARE TO SHOW BASIC ITEM DETAILS ONLY / REFER TO EACHLISTING FOR FONT / DESIGN / COLOR OPTIONS ◆▹ Listing photos contain sizing, details, and color options.▹ Monogram is professional vinyl transfer.▹ 21\" x 13.5\" x 7\"▹ Canvas, Jute Blend and Jute Burlap Tote.▹ Large main compartment with zipper closure.▹ Text is all lowercase; no special characters or capitals.▹ METALLIC VINYL NOT AVAILABLE FOR WORDING ON THIS ITEM♥ PROCESSING & SHIPPING ♥▹Shipping (re-shipment fee) must be purchased for packages returned due to incorrect address to be mailed again.▹ You will be emailed with shipping confirmation and tracking once your order ships.✧ PROCESSING ✧• Times vary by design style.• Please message us for accurate turnaround on a specific item.✧ SHIPPING ✧• Times are typically between 2-10 business days:• Shipping times are ESTIMATES ONLY; actual delivery time can be faster or may be delayed.• Holidays, natural disasters, and other special circumstances can delay delivery.• We are not responsible for shipping delays, and do not guarantee any specific delivery date.♥ CARE INSTRUCTIONS ♥▹ See package insert for all care instruction.♥ DISCLAIMER ♥▹ Verify all information including spelling and address before ordering.▹ Due to the nature of our items, we are unable to accept returns, exchanges.▹ Cancellations and changes can not be made to orders once purchased due to fast processing times.▹ Colors can vary from screen monitors to physical products.▹ For any Rush Order, we must be messaged for accommodation and purchase Rush Upgrade BEFORE ordering.▹ We are not liable for delays due to missing information, shipping delays, or any deadlines.▹ Read shop \"POLICIES\" for more information.♥♥ Any other question or concern, please message us directly! ♥♥",
    "reviews": [
      "Can’t wait to give my friends these bags! They look exactly as pictured and larger than I expected!",
      "I absolutely love these bags and I cannot wait to gift these to my bridesmaids for our beach side wedding.  They are so cute, loving the names on them and their size is fantastic for on the go!",
      "Absolutely perfect! I got them for my girls & went right back & bought one for myself!"
    ]
  },
  {
    "productId": "UZdmKOPuTK",
    "url": "https://www.etsy.com/listing/1409978816/anniversary-candle-personalized-gift?click_key=a422698d250b7fd8fdb624d9e62b05e59513b55b%3A1409978816&click_sum=456bcfc0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=personalized+gift&ref=search_grid-744526-8-48&pro=1&etp=1&sts=1",
    "title": "Anniversary Candle, Personalized Gift, Wedding Anniversary, Gift for Him, Gift for Her, Gift for Boyfriend, Gift for Girlfriend",
    "description": "Celebrate your love and commitment with our Anniversary Candle, the perfect gift for any kind of anniversary! Whether you're searching for a special first anniversary gift or commemorating a 50th year of marriage, this candle is a thoughtful and sentimental gesture that will surely be cherished. This personalized candle makes an excellent gift for your husband or wife, friend, or parents, expressing your love and gratitude for all the years spent together. This personalized gift is a way to celebrate your love and commitment, and to honor the special bond that has been shared.Gift Box Packaging Included -We value a beautiful unboxing experience that matches any occasion. Be sure to include any personalized message you want to include inside our gift box.INGREDIENTSOur candles are hand poured in our studio in Tennessee. We use a natural soy coconut wax blend, premium phthalate-free fragrance infused with essential oils, and cotton wicks. Our soy coconut wax is a sustainable alternative to paraffin that burns evenly and binds beautifully with our toxin-free fragrances to produce a rich, enduring scent. Each candle comes in a muslin bag and then placed inside a white branded box before it is packaged for shipping. Our branded box is included in the listing price. Please see the listing photos for more specifics on how your candle will arrive.FROSTED CANDLE VESSEL-Coconut Soy Wax-Phthalate Free Fragrance-40-45 Hour Burn Time-230g/8oz weight-Cotton Wick-Includes Bamboo Lid-3.75in x 3.15in (with lid)-Comes in 4x4x4 Branded BoxPERSONALIZEDIf You are giving this as a gift, be sure to include the recipient's first name and a short message. We will enclose this in vellum and place it inside of the branded box to be seen first as they open the package. \"Wisdom House Co\" will be placed on candle labels in small print. Please send us a message with any questions.________________FRAGRANCE  OPTIONSGRAPEFRUIT + BASILTop: Grapefruit, Basil Leaves, MintHeart: Lavender, Rhubarb, AppleBase: Vanilla BeanWILD FIG + MOSSTop: Freesia, OzoneHeart: Jasmine, Geranium, FigBase: Patchouli, Moss, Bamboo, PowderTEAKWOOD + BERGAMOTTop: Leather, Allspice,TeakwoodHeart: Tobacco, Cloves, BergamotBase: Sandalwood, Amber, PeppercornBLACK CURRANT + PLUMTop: Bergamot, CitrusHeart: Ripened Plum, Creme de Cassis, Black Cherry,Base: Light Musk, Freesia, Vanilla, AmberPOMELOTop: Orange PeelHeart: Ripened Peach, Grapefruit, MangoBase: Cedar, Red CurrantBIRCH + SAGETop: Eucalyptus, MintHeart: Cypress, Birch Resin, Pine,Base: Sage, Tonka BeanSEA SALTTop: LinenHeart: Eucalyptus, Sea Salt, VioletBase: OakMoss, Light Powder",
    "reviews": [
      "Would recommend for a nice gift",
      "This was the perfect gift for friends celebrating their 25th anniversary. The personalization allowed me to create a unique and special remembrance. The presentation was beautiful and the candle arrived quickly. It is very reasonably priced. Our friends loved it. I could not be happier!",
      "Great quality! Item matched the description and met my expectations. Smells great too!"
    ]
  },
  {
    "productId": "cuehuPxepv",
    "url": "https://www.etsy.com/listing/1115114382/personalized-name-cufflinks-customized?click_key=b38c1c7fbacf62ddcc28dff1251f773695a42b25%3A1115114382&click_sum=518c61d0&ref=search_recently_viewed-1&pro=1&frs=1&sts=1",
    "title": "Personalized Name Cufflinks - Customized Cufflinks - Groom Wedding Cufflinks - Groomsmen gift - Initials Cufflinks - Sterling Cufflinks",
    "description": "PERSONALIZED • CUFFLINKS • UNIQUE GIFT FOR SPECIAL OCCASIONSElevate your style with our personalized cufflinks, meticulously crafted for those who appreciate distinctive details. Whether it's a date, location, monogram, initials, special message, or a name, our cufflinks make excellent gifts for dads, graduates, boyfriends, grooms, and wedding parties.Materials & Craftsmanship:• Material: Premium Quality 925 Sterling Silver and Durable Steel.• Quantity: Listed as '1' refers to one pair (set) of cufflinks, ensuring clarity for our customers.• Thickness: Our cufflinks boast an exclusive 2mm thickness, an uncommon feature that offers superior durability and design.• Weight: Crafted with an average silver weight of 8-10 grams, depending on the selected letters, ensuring longevity and a premium feel.• Finish: Sterling Silver, 18K Gold Filled, Dark Grey (RHODIUM).• Production Method: Every pair is handmade, reflecting our commitment to quality.Customization Options:Tailor your cufflinks to suit your preferences. Whether it's a name, text, letters, number, or any other engravings, we've got you covered.Ordering Process:For a seamless experience, simply specify your desired engravings in the 'NOTES' section upon ordering.Gift Wrapping:Each set of our cufflinks comes in a beautifully designed gift box, making it perfect for occasions like birthdays, anniversaries, or just a special treat for yourself. Let us know if you'd like to include a personalized message for your loved one.Shipping & Delivery:• Handmade Just For You: Your order will be crafted in 1-3 business days.• Shipping Options: Choose between standard shipping (7-9 days) or expedite with UPS Express (2-4 business days).Connect With Us:For our full collection and exclusive offers, visit:www.etsy.com/shop/jewellerydesignstoreFrom the crafting table to your wardrobe, each piece is made with passion and precision. Warm wishes, ♡, Huseyin----------------------------------------------• All images are copyrighted by PersonalCufflinks. All rights reserved •",
    "reviews": [
      "Perfect for my future husband on our wedding day! He absolutely LOVED them! The sterling silver is beautiful! \nThank you so much!!!",
      "Great product! Well made and arrived super fast!",
      "Beautiful quality, fast shipping. So excited to give these to the guys in our wedding party!"
    ]
  },
  {
    "productId": "5ViaJkBISh",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=e787b86f27e07efc01c6c3ccb7f2c9c99fa67620%3A654638870&click_sum=a5555c39&ref=search_recently_viewed-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you."
    ]
  },
  {
    "productId": "lCGRgPJeFn",
    "url": "https://www.etsy.com/listing/1355783916/draw-my-child-and-me-family-line-drawing?click_key=af0c782c6168db3e58ac2ecb6d4a25fdf5c7862a%3A1355783916&click_sum=66c1835e&ref=search_recently_viewed-3&pro=1&frs=1&sts=1",
    "title": "Draw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "description": "Hello,First of all, thank you for visiting my store, I would like to give you some brief information.I am new here but have more than 20 years of experience in drawing.That's why I give you a 100% satisfaction guarantee.It is very easy to draw for yourself or for a loved one.All you have to do is choose the number of characters, complete the payment process and send me your photo via Etsy message. This much.Family photos, group photos, pets, etc. I will turn your photos into drawings in the style you want with minimalist modern lines.You can also send me the text you want me to write via Etsy message.I can combine multiple photos.If you have any questions, please do not hesitate to send me a message.Please note that this is a digital file and no physical items will be sent.Thanks!GokhanDraw my child and me, Family Line Drawing, Personalized Gifts, Family Portrait, Anniversary Gift, Line Art, Hand Drawing, draw my baby",
    "reviews": [
      "Perfect very pretty it was very fast",
      "Absolutely loved my drawing and will be buying another soon!",
      "It turned out great! Buy it!"
    ]
  },
  {
    "productId": "nzjsoGIdAv",
    "url": "https://www.etsy.com/listing/1411614241/luxe-pendant-hanging-lamp-l-plug-in-lamp?click_key=d01d7aba33976ca7cb1cbf1582968a2f449e9763%3A1411614241&click_sum=9e242390&ref=search_recently_viewed-4&pro=1&frs=1",
    "title": "Luxe Pendant Hanging Lamp l Plug in Lamp | Hanging Lamp",
    "description": "ORDER COMES WITH BULB AND CORDThe Luxe hanging lamp is a versatile and timeless piece that can be used in your home as well as commercially. The geometric structure creates a fascinating form where every detail has been designed with care by our designers.This Pendant Lamp has cozy lighting inspiring comfort and casualness. This is perfect for homes coast to coast. Let this lamp hang alone or couple with a few other of our amazing lamps to create a custom statement!Our stunning Hanging Pendant Lamps, the perfect addition to any home or office. These beautifully crafted lamps are designed to add elegance and sophistication to your space while providing the perfect lighting solution.Our Hanging Pendant Lamps come in a variety of styles and designs, from sleek and modern to classic and traditional.Color: WhiteDimensions: 10in x 8in x 8in🎧 FeaturesEco Friendly PlasticLightweightDurableMade in the USA with International Shipping Available",
    "reviews": [
      "I would like to return this item, it’s not what I expected, I’m sorry",
      "Beautiful lamp, still remodeling the area I need it for, but makes a lovely focal point and a lot of light. Thank you! Just as pretty as the listing. 😊",
      "Got it for my grandsons bathroom and ut looks so good !!!",
      "Beautiful product.  Arrived early.  Highly quality"
    ]
  },
  {
    "productId": "SENPQmPMQy",
    "url": "https://www.etsy.com/listing/999136086/pendant-ceramic-lamp-hanging-lampshade?click_key=1432853624673378a85adad4c65e1dc724ebace4%3A999136086&click_sum=176b45b5&ref=search_recently_viewed-5",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "A ceramic lamp in light and homely colorCombines bare terracotta and glossy ceramic in shades of green with a slight touch of orange-red on top.Made by hand in a small boutique studio in Tel AvivThis lamp is 7.9-inch \\ 24 cm in height (without the bulb) and 7.9-inch \\ 20 cm diameter.It comes with 60 inches \\ 150 cm golden textile cable and a terracotta 4-inch \\ 10 cm ceiling rose.it is suitable for standard E27 bulb, Voltage 110V-250V | 25 to 40W maxEnergy-saving LED light bulbs are recommended.The bulb in the picture is a LED Edison Vintage style Bulb.Note that the bulb is not included.this product is made to order by hand so that it may be slightly different from the one in the photoplease allow 1-2 weeks production time before shipping.This object can be ordered in various colors and prints. Talk to me for more info.This piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.",
    "reviews": [
      "Beautiful and perfect for the spaces we are using them in. Definitely check the measurements on them to make sure they fit whatever spot you want since they are smaller than what they appear in the photos.",
      "Love!!! Thank you.",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!"
    ]
  },
  {
    "productId": "ZnFHGxYjRf",
    "url": "https://www.etsy.com/listing/1440285597/digital-custom-moon-phase-print-the?click_key=846afd7d63fc69fce98e3c742cf525a50e9bef21%3A1440285597&click_sum=12000b5e&ref=search_recently_viewed-6&pro=1&sts=1",
    "title": "Digital Custom Moon Phase Print, The Night We Met, Astrology Print, Moon Print Mothers Day Anniversary, Special Date, For Her, Special #243",
    "description": "Paper Emporium Co - Moon Phase Range - The Night We Met or Custom TitleOur Personalised 'Moon Phase Prints' are fully personalised to mark that special date for a newborn baby. A stylish addition to existing or new nursery décor and great gift for friends and family!C U S T O M I S A T I O N:Before you print! I will always send a proof image prior can make amendments where needed :) Wording is fully customisable to the location, date and time! Please enter these in the personalisation box when ordering!Paper Emporium Co - Map Prints - MONO Range - Digital DownloadThese stylish map prints are a perfect addition to your wall décor for the bedroom, lounge, office, hallway or practically any room in your home. We have many popular locations to choose from 'as they come' alternatively just pick your you own locations for a 100% custom design at no extra cost.C U S T O M I S A T I O N:For the perfect gift - Use our custom option to have a Town/City country created to order, along with a personalised message or tag line of your choosing. Once created, if there is something you would like changing, dont worry, i can do that to your request!S I Z E  OPTIONS:- A5 - 14.8cm x 21cm / 5.8 x 8.3 inches- A4 - 21cm x 30cm / 8.3 x 11.7 inches- A3 - 30cm x 42cm / 11.7 x 16.5 inches- A2 - 42cm x 59.4cm / 16.5 x 23.4 inches- A1 - 59.4cm x 84.1cm / 23.4 x 33.1 inches- 12.7 x 17.8cm / 5 x 7 inches- 20.3 x 25.4cm / 8 x 10 inches- 27.9 x 35.6cm / 11 x 14 inches- 40 x 50cm / 16 x 20 inches- 45.7 x 61cm / 18 x 24 inches- 50 x 70cm / 20 x 28 inches- 60 x 90cm / 24 x 36 inchesLooking for another size? Just send me a message :)S H I P P I N G:- Digital Only Option, Sent Electronically Within 2 working days**Please Note - During peak times / holiday season the order times fluctuate, so please check your estimated delivery and dispatch date when purchasingA D D I T I O N A L:Any questions please do not hesitate to drop me a message :)",
    "reviews": [
      "Fab product with great communication",
      "I absolutely loved it ❤️  this print was the best I found by far. The print met my expectations and more. Thank you for the beautiful gift I was able to give to my grandaughter for her 21st birthday..",
      "Great item!  Easy to communicate with!"
    ]
  }
]
