[
  {
    "productId": "eTAPaFXniC",
    "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=67f57a62ec1a949149def95cbcf0496c570b5f06%3A724851215&click_sum=1fc9d423&ref=stl_listing-1",
    "title": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Unique Light Fixture",
    "description": "Pendant Ceramic Lamp, Hanging Ceiling Lamp, Handmade Design,Printed Decoration of Green Leaves, Clay-light Artwork, Unique Light Fixture  Art Creation , Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by past traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for the sense of belonging through the local material culture.Color: Forest green,  white, Mint, burgundy, orangeMeasurements:Height\t17.7 inchDiameter 7.9 inch",
    "reviews": [
      "Great lamps! I enjoy looking at them every day!",
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!",
      "Amazing product! Really good quality !"
    ]
  },
  {
    "productId": "KLOUePsDoj",
    "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=807a87aee657465efb1475fac7fafd6d22e268db%3A654638870&click_sum=14d67385&ref=stl_listing-2",
    "title": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
    "description": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift, Suitable for Living Room Center & Office by Noa RazerThis piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‏traditional ceramics as a cultural carrier and ‏searching for a sense of belonging through the local material culture.Color: Green, pink, tealMeasurements:Height\t5.9 inchDiameter of 5.5 inch",
    "reviews": [
      "Amazing, delicate yet sturdy. Beautiful craftsmanship.",
      "Great item and customer service",
      "Soooo gorgeous, they're in my daughter's room. Everyone new to her space notices them and shares how lovely they are. Thank you.",
      "This light is stunning!"
    ]
  },
  {
    "productId": "tRCNgJwRaz",
    "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=2caf231bffea39981ef480a7e7ed0c2cada2b28a%3A776223242&click_sum=89f01e98&ref=stl_listing-3",
    "title": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture",
    "description": "Give your home a boost of warmth and a homely feel with a delicate natural terracotta lamp.Made by hand in a small boutique studio in Tel AvivAll necessary fitting parts are included.Technical:Lamp holder: E27Transparent cable : 150 cm / 60 inchesCeiling rose: 10 cm / 4 inchesEnergy-saving LED light bulbs are recommended. We prefer the Edison Vintage style Bulb.Voltage 110V-250V | 25 to 40W maxThis piece is part of the Apilar collection.The Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless of creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.Please note that this object is handmade, and each piece is unique.This object can be ordered in various colors and prints, talk to us for more info.You can see similar models here:https://www.etsy.com/il-en/listing/776245646/ceiling-lamp-pendant-terra-cotta-lamphttps://www.etsy.com/il-en/listing/776221084/hanging-terracotta-ceramic-lamp-colorfu",
    "reviews": [
      "Amazing planter! Even better in person! Super high quality all around and attention to detail!!! Took expected time to arrive and it was extremely well wrapped, even came with hardware and home made hardware package artwork!",
      "Amazing product! Really good quality !",
      "Beautifully made. Packaged with care. Arrived as scheduled."
    ]
  },
  {
    "productId": "qOcRzPgyex",
    "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=c903d4709c2a290e39b383e19a5cd37ef31291cb%3A712573399&click_sum=c114cf45&ref=stl_listing-1",
    "title": "Vintage Armchair from Mid Century, Mustard, Restored",
    "description": "Attention! Please contact us before order the chair if you are customer from United Kingdom - regarding to the Brexit.Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standardThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.Wood has been sanded and secured with high quality oil to expose the beautiful wood grains.The shape has been preserved in every detail as original.Dimensions:Width - 22.8 in, 58 cmHeight - 31.4 in, 80 cmDepth - 24.8 in, 63 cmSeat Width - 18.1 in, 46 cmSeat Height - 14.2 in, 36 cm",
    "reviews": [
      "Beautiful chair with crafted wood finish. Slightly firmer than expected but very comfortable. Gorgeous colour.",
      "Item quality is excellent, however I find the chair a little small. There was a problem with delivery, but the seller was as helpful as he could be on the matter."
    ]
  },
  {
    "productId": "IQmtAXaEdn",
    "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=e874f60bcc20bd611e385662577ef6ac65190383%3A649720699&click_sum=5493a154&ref=stl_listing-2",
    "title": "Completely restored Black and White cocktail chair from 1970's",
    "description": "Dimensions in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in------------------------------------------------------------------------------------------The mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white colored upholstery fabric for the refurbishment.Our manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.",
    "reviews": [
      "Very beautiful cocktail chairs, they arrived well packed. I’m very happy with this purchase!",
      "this is the second chair I buy. they are wonderful.",
      "It's reallly a beautiful and comfortable cocktail chair, looks like shown on the pictures and came quickly and safely packed. Thank you very much!",
      "I am very happy with this purchase. The seller was friendly and honest and the communication was fast. Shipping (to Germany) is not cheap, but executed professionally. I was able to phone the driver and ask for the exact hour of delivery. The chairs were wrapped well and arrived without a scratch. They looked exactly the same like the one I already had and now make a great set around my dining table. I can definitely recommend this shop!"
    ]
  },
  {
    "productId": "ynHqNRdRso",
    "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=66c15e91dbfce836081f10f3a7c38d9a102302c2%3A1110352719&click_sum=017c5f85&ref=stl_listing-3",
    "title": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade Sherpa chair mid century set, small comfy armchair for living room",
    "description": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade furniture Sherpa chair  bring a 60's Furniture feel into your home with this solid wood Mid century Armchair Upholstered in boucle teddy soft fabricOur Mid century armchair is made from solid wood and upholstered with brown faux leather.⚒ All furniture is handmade in our shop!Armchairs can be upholstered in another fabric or stained in another color, contact me for more info➤ **note for NON-EU buyers - please be aware of possible import fees and taxes, these are calculated additionally when the items are sent and these fees are collected by the delivery company and paid on your behalf to your government. The amount of these fees varies in every non-EU country.*** We are sending from Croatia which is a part of the EU - for EU buyers there are no additional fees *➤ Check out my shop for more Mid Century Vintage Furniture ➤https://www.etsy.com/shop/RetroDesignCRODimensions:• Overall height: 74 Centimeters / 29.6 inches• Overall width: 63 Centimeters / 25.2 inches• Overall depth: 70 Centimeters / 28 inches• Seat height: 40 Centimeters / 16 inches• Seat width: 50 Centimeters / 20 inches• Seat depth: 50 Centimeters / 20 inchesMaterials:• Stained Solid Beech Wood• Boucle teddy fabric• High quality furniture foam density 30*simple assembly required instructions included",
    "reviews": [
      "Lovely chair, exactly what we wanted",
      "Very good quality armchair that meets our expectations.\nThe follow-up is top notch: thank you Marija!",
      "Very nice armchair! Comfortable and very pretty",
      "The armchair is beautiful, completely in line with the photos and our expectations. The curls are very soft and the seat is comfortable, especially with the footrest.\nVery good responsiveness of the saleswoman and good follow-up. The delays were a little long to receive it, but everything was in accordance with what had been announced."
    ]
  },
  {
    "productId": "iCrbiqYPwK",
    "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=e98dfa13c5c2c7d3b6a8b1dc7b6df3b21f97a151%3A903050205&click_sum=f789a129&ref=stl_listing-1",
    "title": "Large Vegan Suede Yellow Desert Knot Floor Cushion ,suede ottoman, Knot Floor Pillow, Modern pouf, ottoman cushion, pouf ottoman, suede pouf",
    "description": "Soft, cozy with beautiful earthy tones. We can't get enough of the new vegan suede collection!  The vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. These floor cushions are beautiful and functional. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner.Size: 75X75 cm / 30X30 inchHeight: 35 cm / 14 inchMaterials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric.Care: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean.Production and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase.Custom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout.Please Read about our shipping, refunds and exchanges policies.For any thoughts or questions please send us a Message and We'll be happy to answer ASAP.Buyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs.",
    "reviews": [
      "Love, love, love this stool.!  So unique and adds a touch of elegance and unexpected whimsy to my vanity.",
      "She is great to deal with. Very responsive. It’s exactly as beautiful as the photos! It’s very well built, strong and sturdy. A work of art. Love it!",
      "I love how it turns out.",
      "Better than expected. Absolutely gorgeous and super quick communication."
    ]
  },
  {
    "productId": "zYBcGMnWSw",
    "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=441db023f87a2992371d1aba4ad5d99d2602ed45%3A904960951&click_sum=b104d085&ref=stl_listing-2",
    "title": "Floor Pillow | Meditation Cushion | Floor Cushion | Floor Pouf | Floor Seating | Round Floor Pillow | Square Floor Pillow | Teal Home Decor",
    "description": "Get ready to get comfy with my new floor pillows!Imagine moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. With my new floor pillows those dreams are now realities!The original print for this floor pillow was created in my design studio in Maine & the floor pillow is made to order thanks to the help of my fabulous sewing partner.Two different shapes-the circle and the square-plus two different sizes... All those choices equals soft, comfy, and oh-so-pretty floor pillows that are great on their own, or stacked for even more comfort. Let's be honest-chairs are so last year.••• PLEASE NOTE •••The pillows have a small \"X\" stitch detail in the center of the pillow... tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time... keeping your pillow plump and comfy sit after sit after sit :)PRODUCT DIMENSIONS(Please note there is a 1\"-2\" tolerance on all printed textile products)23\" Round : 23\" x 7\" Tall26\" Round : 26\" x 7\" Tall23\" Square : 23\" x 23\" x 7\" Tall26\" Square : 26\" x 26\" x 7\" TallPRODUCT DETAILS100% woven polyester printed fabricSewn closed with premium poly fillCARE INSTRUCTIONSSpot clean onlyPRODUCTIONPlease allow up to 5 - 10 business days for production of your custom made item.• PLEASE NOTE •I am currently unable to deliver to PO Boxes. Please provide a physical mailing address with your order. Thanks!RETURN POLICY FOR THIS PRODUCTYour floor pillow is custom made just for you and as a result I am unable to offer returns/exchanges unless your item arrives damaged or defective.",
    "reviews": [
      "Beautiful cutting board, just as pictured.",
      "Beautiful original art made into fabric! Artist was very responsive!",
      "This is a beautiful comforter and arrived just in time for my birthday thanks to the excellent customer service!  Thanks so much!!",
      "Just moved to Honolulu for few years, and this was so appropriate for our space."
    ]
  },
  {
    "productId": "SBhGqMqISI",
    "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=347ea032b6e45a9812c0a59ad090931d3411e40f%3A266515154&click_sum=e1ec314e&ref=stl_listing-3&sts=1",
    "title": "Kids Knitted Footstool, Crochet Pouf Ottoman, Grey Knitted Pouf Kids, Knitted Pouffe Ottoman, Nursery Pouf Ottoman, Scandinavian Decor",
    "description": "Welcome to Zuri House!Children just love to play and explore new objects and textures. They are sure to love this cozy knitted pouffe to sit, play, climb and rest. You will love it too! This pouffe is a beautiful addition to any nursery or young child's room.This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.ABOUT THIS POUFFEMaterial:-fabric inner bag filled with polystyrene beads-knitted cover made with chunky cotton cordColour: LIGHT GREYSizes:SMALL:Diameter: Approximately 45cm (18”)Height: Approximately 30cm (12”)MEDIUM:Diameter: Approximately 50cm (20”)Height: Approximately 40cm (16”)Care:-the knitted cover can be removed for washing (it can be washed in 30 degrees in the washing machine)-the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.MORE OF OUR KNITTED POUFFESIN SMALL SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332437IN MEDIUM SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27316506IN LARGE SIZEhttps://www.etsy.com/uk/shop/ZuriHouse?ref=seller-platform-mcnav&section_id=27332459PLEASE NOTEI always try to describe my items as accurate as possible. I provide detailed information about used materials and the product dimensions. Please make sure that the item you would like to order meets your expectations. I always try to show the actual colours of my products but please remember that they may slightly vary from the colour on your screen due to monitor colour restrictions.FOLLOW ME!www.facebook.com/nebozuri/www.instagram.com/zuri_house/www.pinterest.com/zurihouse/www.zurihouse.comQUESTIONS?If you have a question about this pouffe or would like it in another size or color, please use the Message Seller button below and I’ll get right back to you!Thank you for shopping at Zuri House!",
    "reviews": [
      "Absolutely lovely item beautifully made and packaged. Very quick and helpful communication. LOVE it !",
      "Thank you!:)",
      "Such a nice addition to my son's room, he loves it and so do I. Purchased a medium too!",
      "Amazing quality, just what I wanted to finish off my nursery",
      "High quality product and super soft. Just like the photos on the sellers page. Love it!"
    ]
  },
  {
    "productId": "GdxxhqlCQg",
    "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=545dacd438767645e5627d9f955fdcde22e978ec%3A811521978&click_sum=113247fe&ref=stl_listing-1&sts=1",
    "title": "Illustrated Parian Porcelain Vase - Stroke / Brushstroke",
    "description": "With it’s assured, bold brushstrokes against a bright white base the Stroke Long Vase is a declaration of a love of pattern and bold design. Perfect as a stand out piece for a mantlepiece, sideboard, or as a centre piece for your dining table. Ideal for holding bundles of your favourite blooms and leafy bouquets, the Stroke Long Vase will be sure to make an impact with or without foliage.Slipcast in Parian porcelain, the Big Pot is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent. Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with.From start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.Material: Parian porcelainFinish: Matte outside, glossy insideSize: 21.5cm x 9cm (ø)",
    "reviews": [
      "Exactly as described and such a beautiful piece. Love the matt exterior and the glazed interior as well as the semi-translucent nature of the material. The perfectly positioned hand painted strokes show the care and thought that went into producing it.",
      "I love this mug! It is so beautiful. It was very well packaged too!",
      "I only wish it came in a larger version too! Love it!",
      "Very well made sturdy little ceramic cup!"
    ]
  },
  {
    "productId": "nSHsVHtjrt",
    "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=7c16e5ec7caf40b7723317da85c35009836787a1%3A986518800&click_sum=d8b857d2&ref=stl_listing-2",
    "title": "Small amphora vase, old Greek pottery inspired vase, handmade ceramic vase",
    "description": "A beautiful hand-built small amphora vase with black and white triangle pattern.It works great as a decorative item or can carry beautifully a bouquet of small flowers/a little tree branch...It was made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white upon which it was fired to cone 8 (1250C) in an electric kiln. The base was left unglazed and is impressed with my maker's mark.DIMENSIONS & MATERIALS:~ speckled stoneware clay, non toxic glossy white glaze~ app. 13.5cm high and 9cm wide (5.3\" x 3.5\")Dishwasher safe.CONDITION OF THE PRODUCTSBecause all our pieces are handcrafted, there may be minor variations form item to item.SHIPPING INFORMATION:All orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days.All EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of Slovenia. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days.There is a shipping upgrade option to Express DHL for European orders. Please see listing \"Shipping Upgrade\" for further details.",
    "reviews": [
      "The quality is excellent and the shipping was fast.",
      "The quality is excellent and the shipping was fast.",
      "The quality is excellent and the shipping was fast."
    ]
  },
  {
    "productId": "ZVCMIaRxsQ",
    "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6f6b46634ccffd375e33cffc533d8b26c76e84dd%3A908084516&click_sum=5403d238&ref=stl_listing-3",
    "title": "Burlap Jute Glass Vase, Hand Painted, Black and White, Home Decor Art, Unique Gifts",
    "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.- Handcrafted with jute, burlap fabric, and glass bottle.- Dimensions - 5\" tall; base 5.5\" wide.- Beautiful addition to your home or office decor.- Indoor use only.",
    "reviews": [
      "love these vases I have 4 now and I love them, True ART!",
      "Unlike any vase I've seen. DenzCrafts has a unique style and aesthetic. I will be adding to my collection :)",
      "These are So Gorgeous. Truly works of art. Very unique and looks so high end!"
    ]
  },
  {
    "productId": "bP1qcBAhQC",
    "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4269d007a8b91da4d418463e4aa4421f28672782%3A1206357075&click_sum=59533414&ref=stl_listing-1",
    "title": "Cushion covers - Exclusive pattern - Unique design - Handmade - Decorative cushion - Cushion cover - Handmade - Exclusive pattern",
    "description": "🔵 CUSHION COVER 🟧💻 Exclusive pattern digitally designed - Exclusive pattern digitally designed🖨 Printed in the South of France - Printed in South of France✂ Handcrafted in my workshop - Handcrafted in my workshop⚡ Creation in limited series - Limited edition designMAIN FEATURES :- Wallet closure- Face fabric = Water-repellent and UV-resistant fabric- Back fabric = Heavy duty 100% cotton twill- Slightly textured print quality- Fully overlocked on the reverse🧼 MAINTENANCE:Wash at 30°C. Natural drying. Do not wring. Iron at low temperature.📮 Shipments by post with tracking",
    "reviews": [
      "Deliciously retro but with shimmering colors",
      "Seller was super helpful and very responsive in helping me track the package",
      "Amazing colors and design!! Gifted for a friend and wishing I had one :)",
      "Stunning! The hat is even cuter in person, and the seller was wonderful to work with. Highly recommend!"
    ]
  },
  {
    "productId": "ChmVnHtFkl",
    "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=abdf7a6d3c6cc38b2c1c8cdd205803fc08ac9899%3A566822148&click_sum=7054d814&ref=stl_listing-2",
    "title": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow",
    "description": "Color Therapy Pillow/Colorful Pillow/Modern Pillow Cover/Striped Pillow Cover/Square Pillow/Multi-Colored Pillow/Rainbow/LGBTQ Pillow-------------------------------Let sparks of happiness fly with this gem of a pillow! We dare you to find something happier than this line-up of colorful stripes. We believe that lovely things and bright colors can give hope during difficult times and joy on gloomy winter days—especially when they come to us with an inspiring origin story. This cloth is made by an indigenous family who came to Cuenca to sell their handiwork, the colorful stripes are woven on an antique loom and take weeks to make. Of course, the pattern caught our eye from a mile away and while there are many stripe options available, this is our favorite. When you see this pillow in your home, imagine the women and girls of this community who wear this cloth as a skirt, and remember that we are all connected to each other in a sisterhood of love and empowerment.-------------------------------Striped Fabric: 100% hand-loomed cotton.Size: 19\" x 19\"**Stripes vary slightly in each one**-------------------------------Very soft to the touch. Hidden zipper at bottom. Pillow insert not included. For a fuller look, get a pillow an inch or two larger. Sewn for About Love by an interior design studio in Ecuador.-------------------------------Notes from Other Women:\"This pillow is even better in person!\"",
    "reviews": [
      "This sweater is soooo soft and warm!  It is a tiny bit tight around the armpit, but other than that, it is as beautiful as in the photos!  It also stretches and conforms to my body!  I love it!  And because it is wool, it will be easy to clean.  This was the best present my hubby could have given me.  Thank you to A Shop About Love",
      "Love my new sweater! I have wanted a nice white sweater for dress up or dress down and this is it.",
      "This is an incredibly cozy sweater,  made of the softest wool ever (think cashmere); 10 stars for that!  I purchased size XL, looking for relaxed fit - I am usually a size 12 and could have probably gone with a size L.  Wouldn't have been much of an issue except that with the XL, the pockets come down almost mid-thigh, and I am not petite (5'8\").  Last and not least, for the cost, my sweater came with several loose ends, that I will take care of to ensure no unraveling of stitches in the future.  Overall a great purchase - thank you!",
      "Hello, Tutti! Thanks so much for sharing about the sweater. So glad you’re enjoying the coziness. And so sorry about the yarn ends. We work with many knitters in villages in the Andes and I’m sorry this slipped through our own quality checks. But thank you for mentioning it and we’ll work to improve that detail on our end!"
    ]
  },
  {
    "productId": "dSGniRkeSR",
    "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=6e42447ac0e277837052252f5954af2c530a9185%3A1168874671&click_sum=344b8587&ref=stl_listing-3",
    "title": "Throw Pillow • Parquet Design • modern mid century mod red orange stripe gift design couch living room colorful party cotton pillow cover",
    "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.100% cotton with zipper closing16\" squareDesigned in Canada • Made in IndiaPillow form not included.",
    "reviews": [
      "Love this calendar, I was looking for a smaller one and this one is perfect!",
      "I’ve ordered a calendar two years in a row now and I don’t plan on stopping for 2025. They’re on gorgeous paper, the designs themselves are great and it’s the perfect size to not take up too much space on my wall.\n\nLove it!",
      "love the designs and looks great on my wall :)"
    ]
  },
  {
    "productId": "lRy74OowRa",
    "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=4912c05687bdbc4f521c8fe1b5149d0528c33ae7%3A790049531&click_sum=934e8063&ref=stl_listing-1&sts=1",
    "title": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign",
    "description": "Wood Address Sign-Note in the personalization area your address. If your address is not obvious with only numbers and a street name please specify which goes on the top of the graphic bar and which goes on the bottom.FINISHESThese will come painted with black exterior grade paint if ordering painted unless otherwise specified (See our color chart). Unpainted comes sanded and ready to be finished at home. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.MEASUREMENTSThe sign is 14.5\" wide and the height will vary depending on the length of the address.MATERIALWe use a high-quality cabinet grade 1/4\" thick baltic birch wood.HANGINGThese come with two drill holes in the graphic bar. Be careful not to drill too far and crack the wood when installing.All designs and photos owned by Michael Miles Creations: © Copyright 2017-present | All Rights Reserved --------We have SOLE OWNERSHIP of any and all designs we create. We do not give anyone permission to copy our designs.FINISH OPTIONSIf you order painted and do not note a color in the personalization area, your cutout will automatically be painted black.Unfinished means your order comes sanded and ready to be painted or stained at home.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.",
    "reviews": [
      "Love it. It matches my house trim perfectly.",
      "Perfect. Exactly what we expected.\nImpressive communicationskills from Supplier.",
      "Exactly as expected. It’s best house number display in the neighborhood 😊",
      "Very happy with purchase.. Fast shipping....Thanks"
    ]
  },
  {
    "productId": "eQHEZvJlWQ",
    "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=c4cc9807f50e04deb41e78c52803a20189f9a8b9%3A1439690652&click_sum=3b3bb46b&ref=stl_listing-2&sts=1",
    "title": "Round Address Sign, Geometric Address Sign, Round House Numbers, Modern Address Plaque, Custom Address Sign, House Number Plaque",
    "description": "Geometric carved design with acrylic house numbers - the perfect modern piece for your home address sign. These are great housewarming gifts, realtor closing gifts or just to spruce up your front porch or door decor.HOW TO ORDER- Choose Your Size- Note Your Text Color- Note your background paint or stain color choice in the personalization area.They come with a sawtooth hanger to hang.",
    "reviews": [
      "Absolutely love it.  Looks amazing in my sons room.",
      "Beautiful item! True to size. Makes a great mantle piece!",
      "Wishing I ordered the bigger size it is absolutely perfect!!",
      "Thank you!",
      "Very pleased with the quality and design. It arrived with no damage and was easy to mount. Highly recommend. I will purchase from here again.",
      "Thank you so much!"
    ]
  },
  {
    "productId": "xFiA0Rxqkh",
    "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=7f7a15cedfc7a173857a187a18e0c27c5e7c8a08%3A1453867189&click_sum=16aacf8f&ref=stl_listing-3&sts=1",
    "title": "Herringbone Address Sign, Modern House Number Sign, House Numbers, Address Plaque, Realtor Closing Gift, Personalized Housewarming Gift",
    "description": "Modern Herringbone House Number Sign - UnframedThe perfect address sign for your modern home exterior. The backer is made out of wood and the numbers are acrylic - the wood is sealed with an exterior grade sealer to help preserve the life. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.HOW TO ORDER- The backer can be any stain or paint color shown on our color charts -  note in the personalizationarea what paint or stain you would like.-  The text can only be black or white-  Select if you want it vertical or horizontalThe numbers will be made to fit the sign regardless of how many numbers you order. Less numbers will be taller and centered on the sign. If you need a custom size please reach out and I would be happy to help.MEASUREMENTSThe sign is 7\" x 21\" shown with early american stain. Keep in mind all wood will stain differently.MATERIALWe use a high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted.HANGINGThese come with either a sawtooth hanger on the back or a d-ring.Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.",
    "reviews": [
      "Absolutely love it.  Looks amazing in my sons room.",
      "Beautiful item! True to size. Makes a great mantle piece!",
      "Wishing I ordered the bigger size it is absolutely perfect!!",
      "Thank you!",
      "Very pleased with the quality and design. It arrived with no damage and was easy to mount. Highly recommend. I will purchase from here again.",
      "Thank you so much!"
    ]
  },
  {
    "productId": "UZqJTOIcVI",
    "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=d5e8655c755670e2ac919ccf12cc7206f0041229%3A630678328&click_sum=ab6126fe&ref=stl_listing-1",
    "title": "Faux olive wreath , Every Day Wreath",
    "description": "Hooray!! This wreath was picked by the ETSY Design team for 2019 Holiday Advertisement!Watch on YouTube link:https://www.youtube.com/watch?v=trS4fmZ3puQWhat a great piece for your rustic home decoration!This wreath is made to order.This wreath is made on a rustic grapevine base with artificial olives and leaves.This beautiful olive wreath is the perfect accent to your home or gift to your friends.The grapevines wreath is natural so all the grapevines are different.And it's great for double doors. Just add 2 in the cart. This wreath is ideal for inside or outside.Made from 14\", 18\" and 24\" natural rustic grapevines.Size approx: 18\". 22\"and 28\" (tip to tip)If you are sending this as a gift, please write the message in the notes area on check out and let me know if the item is being shipped to the person directly.I would write your gift message on a  pretty card and would not add any receipt.This wreath is great for indoor or outdoor use, but a covered or sheltered area is recommended.  Direct sunlight and rain will fade your wreath over time.Please feel free to contact me with any questions or to request a custom order!Thank you so much.",
    "reviews": [
      "Love the wreath!!! Very well made. It’s exactly what I wanted for my front door. Thanks Jim!!!",
      "Beautiful, a little squished in shipping but simply beautiful, thank you so much.\nEnjoy a Blessed, Happy and Holy Christmas.🙏🌲",
      "Looks terrific. I even placed a ribbon on it for Christmas."
    ]
  },
  {
    "productId": "oUlpQFMjGh",
    "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=7d6362c9bc58ec5e8d77ba83185dade8751904c8%3A962426777&click_sum=17d67ad1&ref=stl_listing-2&sts=1",
    "title": "Lavender Hoop Wreath,Modern Summer Lavender Wreath,Spring Lambs Ear Wreath,Farmhouse Front Door Decor,Simple Eucalyptus Door Wreath,Mom Gift",
    "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.𝗪𝗿𝗲𝗮𝘁𝗵 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Arrives ready to display• Made on an 12\" 14\" 16\" or 18\" wooden or gold metal ring• Hand designed using premium materials• Wreath is sprayed with a UV protectant𝗪𝗿𝗲𝗮𝘁𝗵 𝗖𝗮𝗿𝗲• Indoor/Outdoor covered use only• This wreath cannot be directly exposed to moisture𝗜𝘁𝗲𝗺 𝗗𝗲𝘁𝗮𝗶𝗹𝘀• Some greenery may vary slightly• I do hand pick each wreath and take great care in finding quality grapevine.• Do to the nature of the grapevine wreath, I cannot guarantee a perfectly round wreath, or exact measurement(within 1-2 inches)𝗦𝘁𝗮𝘆 𝗜𝗻 𝗧𝗼𝘂𝗰𝗵Instagram.com/twistedpine.wreaths/pinterest.com/twistedpinewreaths/View our Entire Collection of Wreaths:www.etsy.com/shop/twistedpinewreathsTHE FRAUDULENT WEBSITE WREATHFALL /FACEBOOK HAS COPIED SEVERAL OF MINE & OTHER ETSY SELLERS ORIGINAL IMAGES.. PLEASE DO NOT BUY FROM THAT SITE. THEY ARE NOT ORIGINAL PRODUCTS",
    "reviews": [
      "I love this wreath and have had several comments of how nice it looks.",
      "This item is very high quality and matched the description exactly. The seller was very communicative, reaching out when she could not obtain a hoop and offering alternatives. I would definitely recommend and buy again.",
      "This is my second wreath I’ve gotten from Twisted Pines and they do not disappoint. I love them. Well made and a beautiful designs."
    ]
  },
  {
    "productId": "eNKBewKyAg",
    "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=34cc7459f07d41c070678dd7b81aacf70124969e%3A1223343994&click_sum=aee66bab&ref=stl_listing-3&sts=1",
    "title": "Farmhouse wreath for front door, Eucalyptus wreath, Greenery decor, French country decor, Farmhouse kitchen, Year round wreath",
    "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\" Can be enjoyed inside or outside year round for curb appeal!Handmade in Northern, Virginia with love. This item is made to order.View my other wreaths here:https://www.etsy.com/shop/NovaWreathsVisit me on Instagram @NovaWreaths: https://www.instagram.com/novawreaths© 2023, Lauren Cleary",
    "reviews": [
      "Look even nicer in person! Beautiful wreath",
      "This wreath is exactly as pictured and absolutely beautiful. It’s exactly what I wanted for my front door!",
      "Very unique piece high quality",
      "Absolutely stunning will be back for more ."
    ]
  },
  {
    "productId": "oJXsqgRtXK",
    "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=56bd3983d7b112ddde7576eb0fac277991d59074%3A1168985443&click_sum=58c60869&ref=stl_listing-1&bes=1&sts=1",
    "title": "Last Name Doormat, Housewarming Gift, Wedding Gift, Closing Gift, Custom Personalized Doormat, Welcome Doormat, Front Door Mat, Monogram Rug",
    "description": "Our high-quality doormats are made from all-natural coir fibers, making them eco-friendly. They feature a vinyl back for durability and sturdiness.____________________CARE INSTRUCTIONSWe recommend that coir doormats be used in a covered area to be sheltered from the elements. When coir doormats get wet and cannot dry properly, the fibers can soak up the water. The water then pushes the natural coconut oil to the surface of the fibers giving it a darker and stained appearance. This can also deteriorate the design causing it to fade quickly.Shedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help. All rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers. All mats are hand cut, so please allow for a 1 inch +/- variance in length. If you are needing an exact measurement, please reach out to us so we can verify that we can provide one that fits your needs. Doormats are .5 to .75 inches thick.____________________CUSTOM DESIGN OR PERSONALIZATION ADD-ONThis listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing. If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below. Please note that we DO NOT offer proofs for pre-designed items unless specifically requested. All custom orders will get a proof, including orders with personalization add-ons. No proofs will be provided until after purchase.PERSONALIZATION ADD-ON: https://bit.ly/PersonalizedAddOnCUSTOM DESIGN LISTING: https://bit.ly/CustomDesignDoormatIf you have questions regarding proofs, personalizations, or custom options, please feel free to send us a message. We would be glad to answer them for you.____________________BLEMISHED OPTIONSometimes we get mats with dark spots or other stains and blemishes beyond the natural ones mentioned above. However, they do not inhibit the actual function of the doormat. As a company, we try to be mindful of our waste and genuinely hate the thought of throwing them in a landfill; therefore, we choose to offer them at cost. Please note that we do not provide photos of our blemished doormats because our items are made to order, and we cannot guarantee which one you will receive.We usually have at least a few blemished items in stock. If you are interested in purchasing the blemished option, please let us know, and we will be glad to add one if available to the listing inventory. There is a limit of 1 per customer per purchase. By buying a blemished mat, you agree to its flaws, and all sales are final.____________________RESOURCESSHOP HOME PAGE:https://www.etsy.com/shop/hamlinrowshopMORE PERSONALIZED DOORMATS: https://bit.ly/PersonalizeDoormats",
    "reviews": [
      "Item was perfect! There was minimal shedding. It made the perfect engagement gift.",
      "Great, showed up sooner then expected and good quality .",
      "Love item. Great quality and size for front door",
      "These were a perfect gift! Great quality!"
    ]
  },
  {
    "productId": "mmymaGAGHR",
    "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=14d89c34ddb06c462c87c67b586f70549c041501%3A612462127&click_sum=29f045a6&ref=stl_listing-2&sts=1",
    "title": "pizza doormat . welcome mat . gift for her . coir mat . custom door mat . cute doormat . housewarming gift . bridesmaid gift . wedding gift",
    "description": "Charm every pizza loving guest by adding this hand painted pizza doormat to your front step! Or give this coir welcome mat as a housewarming gift or wedding gift to your loved ones.Each welcome mat is made from a durable PVC back and a natural coir front that's perfect for the outdoors or inside. While coir doormats are extremely durable, they will last much longer if placed under an awning to protect them from the elements. Simply give your mat a good shake to clean!Looking for a custom doormat? I'd love to chat - send me a message!/ DETAILS∘ Doormat measurement: 18\" x 30\"∘ Materials: PVC backing, natural coir (coconut husk) front, acrylic paint∘ Care instructions: simply shake it or spot cleanHas your doormat design started to fade?Touching up a faded design is easy! Use black acrylic paint and a small firm bristle brush to trace the design and bring new life to a mat that is getting worn out.Thank you for choosing Grateful Paper Co.!✚ View all doormats:https://etsy.me/3yn6A8H✚ View all mini mats:https://etsy.me/2Vp6eQn✚ Need a custom doormat?Custom full size mat:https://etsy.me/3xhZxgdCustom mini mat:https://etsy.me/3C8AEqYCustom doormat dimensions:https://etsy.me/3lFMfbjLove the designs you're seeing in the shop? Join our mailing list and get a bundle of 3 wall art printables absolutely free! Sign up here: https://bit.ly/3Gx6fot",
    "reviews": [
      "This doormat is the perfect housewarming gift! It is very well made and matches the description perfectly.  The mat arrived quickly and exceeded my expectations. I would definitely order from this seller again.",
      "I love this doormat so much. ❤️ It’s sturdy, high quality, and most importantly, fun and unique! My husband and I bought this for our new home in Colorado, and it was one of the first things I unpacked. 😊",
      "Amazing doormat but even better customer service! Heather is the sweetest and got the item out to me TWO DAYS after I ordered it! I needed the item within 7 days and she got it to me in two… I couldn’t believe it when I saw the package today! The quality of the doormat is exceptional too."
    ]
  },
  {
    "productId": "DYVabMzedc",
    "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=93dfa958c2ac8975616bf0345db1c8abe3e3c9fe%3A1183106995&click_sum=f869a953&ref=stl_listing-3&sts=1",
    "title": "Custom Last Name Retro Doormat, home decor, custom doormat, welcome mat, housewarming, front door mat, welcome doormat, closing gift",
    "description": "Personalized Welcome DoormatPLEASE READ, IMPORTANT INFORMATION ABOUT PERSONALIZATIONWe will copy and paste the personalization exactly as you type it into the personalization box for the last name on this design. \"THE\" is automatically applied to the top of the doormat (just like the listing photo) UNLESS you specifically ask us to leave it off in the personalization box. If you do not give us an EST. date, we will automatically leave that off. We can also put anything else on this design besides a last name, PLEASE make sure that you are very clear in your description when placing your order. If you have any questions, please send us a message and we'd be happy to help!Our doormats are high quality 100% coir. They are hand painted by me with outdoor industrial paint that has a built in UV protection to help protect the design from wear and fading. Each mat is backed with a slip-resistant sturdy PVC rubber backing. We offer a variety of sizes and all of our mats are 1 inch thick.The mats are best placed under a covered area such as a porch, we do not recommend placing mat in areas of direct sunlight, rain, or snow.CARE: clean by giving the mat a good shake. Best to keep in a dry area such as a covered entryway, we DO NOT recommend direct sunlight, rain or snow as that will fade & cause wear to your doormat!Due to the nature of our product, RETURNS WILL NOT BE ACCEPTED DUE TO WEAR OR FADING. Doormats will not be refunded or replaced from wear.*FLAWED DOORMATS: When we order our doormats, some come with slight imperfections such as dark spots, slight staining, small chipped corner or a small hole on the back of the mat not visible from the front of the doormat. If you are interested in a flawed doormat please send us a message and we will let you know if we have any in stock. If we do have any available, we will send you a photo of the doormat for you to approve before moving forward on the order. PLEASE NOTE, all flawed doormats are sold at a HUGE discounted price and all sales are FINAL. You are agreeing to the flaws during messaging and finalize the sale when you purchase the doormat.We suggest replacing your doormat every few months as doormats tend to be a seasonal item. We are always adding more items so be sure to check back here for our new designs :)Each mat is unique. Some may be darker or lighter than the photo, coir is made from the husks of coconuts and some fibers might be thicker or thinner than others. There may also be chunks of the husks in the fibers.We love CUSTOM ORDERS! Message us and let us know what you have in mind and we'll make it happen",
    "reviews": [
      "So so so cute! I love it",
      "so cute & exactly what i wanted!",
      "Love our doormat so cute great quality",
      "Exactly as pictured. Very happy!"
    ]
  },
  {
    "productId": "oHUBYWLqqc",
    "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=a67042db1104d8c98bfd27bb22d270150d95613e%3A775841802&click_sum=d86cbad9&ref=stl_listing-1&bes=1&sts=1",
    "title": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign",
    "description": "Welcome sign for front porchThis adorable WELCOME sign will add a colorful touch to your front door is our latest design, capturing the trendy floral designs so prevalent in today's decor. The sign is made of solid wood with painted on letters.✔HAND PAINTED on letters, NOT VINYL STICKERS SO LETTERS WILL NOT CURL WITH AGE and NOT SPRAY PAINTED SO YOU DON'T GET THE FUZZY EDGES✔SPACING & CENTERING ACCURACY: NEW AND IMPROVED!✔Distressed look✔CAN BE HUNG ON A WALL (SEE \"CUSTOM OPTIONS\" SECTION BELOW)✔GREAT AS A GIFT! We're happy to insert a card with a personal note from you. Just let us know what you would like it to say!✔MADE IN USA✔CUSTOM ORDERS ACCEPTED!⭐️⭐️⭐️⭐️⭐️ 5 STAR RATINGS! People say: \"Love it\", \"Beautiful\", \"Very well done\", \"Just like the pictures\", \"She loves it!\"✎ADDITIONAL DETAILS:PRODUCT DESCRIPTIONThis adorably delightful WELCOME sign will add a charming touch to your front door. The sign is made of solid wood with painted on letters, highly durable and it looks great! Our top seller is our 5' x 10\" sign. Check out our reviews! We stain and then give it a distressed and rustic look. Please note, these signs are indeed RUSTIC, and are made one-by-one to that effect which means that each piece has some variation. The distressed look means that the painted letters are given an \"aged\" look. Please review all of the photos and note that parts of the letters have \"aged\" away giving a partly \"erased\" or \"smudged\" look, perhaps even creating some asymmetry in the letters, as well as some color variation in the stain. Given that distressing is done on each piece individually each piece is unique, so expect some slight variation from the model pictured. ✔CHECK OUT THE PHOTOS TO SEE MORE DETAILS.SPACING & CENTERING ACCURACY: We've made & sold over 15,000 Welcome Signs and one of the things we've been striving for is more precision in the spacing and centering of the letters on our signs. We've invested in new technology and tools that allow us to finely tune the spacing and centering of the letters on our signs so you can be sure that when you receive one of our signs it doesn't look off center or have spacing errors between the letters.SIZESRead our sizes as Height x Width. So if it is a 5' x 10\" sign when reading the measurements the first figure is the height, so 5 feet, and the second number is the width, so 10 inches (technically 9 1/4\" in lumber measurements).  This WELCOME sign comes in 4 sizes!  5 feet x 9 1/4\" , 4 feet by 6 1/2\", 3 feet by 5.5\" inches, and 2 feet by 5.5 inches wide.HOW TO USE ITYour new solid wood welcome sign can be placed anywhere you like by simply resting it back against something as pictured  (For a long life we keep it in a covered location such as a porch with an awning, etc.). Most folks place them near their front door, on a porch, a patio, a deck, walkway or even in a guest room.  If you would like a freestanding sign it is possible to attach a stake on the back and stake it into the ground.PRODUCT CAREWe use one of the most expensive and most durable paints available. This ensures the durability of your sign.  However, like anything exposed to the natural elements (sun, wind, water, etc.) it will wear. We recommend that you place this sign in a covered location, such as a covered porch area.***WHEN YOU PLACE YOUR ORDER PLEASE DOUBLE CHECK YOUR ADDRESS AND THE COLOR & SIZE YOU SELECTED IN YOUR ORDER. THIS IS IMPORTANT AND WILL HELP YOU AVOID UNNECESSARY SHIPPING CHARGES.BROWSE OUR SHOPSee our other stuff:https://www.etsy.com/shop/NativeRange*Native Range, LLC",
    "reviews": [
      "This sign is exactly what we needed for our front door. Very well made too!",
      "Looks great and is great quality!",
      "Loved the rustic look of the welcome sign!",
      "Just what I was looking for and absolutely love it"
    ]
  },
  {
    "productId": "zfpqyGjyVc",
    "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=dd65e3e70696be2959630d1074532c825260baac%3A511215666&click_sum=9d60ca37&ref=stl_listing-2&sts=1",
    "title": "large wooden porch vases, welcome sign, reclaimed wood, rustic, floor vases, farmhouse decor, large floor vase,  porch decor, set of 2",
    "description": "This set of 2 large wooden porch vases will add a little rustic charm to your porch or living room! A welcome sign and rustic vases all in one! Unique farmhouse and  porch decor will welcome your guests to your home! Fill with large stems or branches and you will have a beautiful eye-catching entry. The large vase measures 24\" x 6 and the smaller one measures 18\" x 6\".  These vases are made form reclaimed wood that has been sanded and stained gray.",
    "reviews": [
      "So fun! Look great! Love!",
      "I absolutely love these! They are adorable on my front porch thank you",
      "Super cute!! Had them put my house number on the second one. Sometimes delivery people mistakes my unit between my neighbor so hopefully this will also help them! Recommended!",
      "Nice product. A little shorter than I expected"
    ]
  },
  {
    "productId": "qoKeXWdXwb",
    "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=6edd23ea6f301dc8cad832d297185982e2c4704b%3A1095987590&click_sum=b89ba745&ref=stl_listing-3",
    "title": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming Gift",
    "description": "Family Gift| Family Name Welcome Sign | Wedding Sign | Metal Wall Art | Custom Last Name Signs l Personalized Metal Sign | Housewarming GiftElevate your home decor with a beautiful metal sign. Made with 18 guage steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. Add a touch of elegance to your home on the inside, outside, or both!Each sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.• 18 Gauge Steel• 5 Color Options (Black, Red, White, Copper, Silver)• 6 Sizes - 36\", 30\", 24\", 18\", 14\", 12\" *Selected size is based on the maximum height or width of the sign depending on physical orientation• Mounting Hardware Not IncludedHave another design in mind? We'd love to help your vision come to life. (Additional design fee may apply.)",
    "reviews": [
      "loved it! It’s the perfect gift!",
      "Great quality, fast shipping! Will order again :)"
    ]
  },
  {
    "productId": "ZSvdyRbAGK",
    "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=ed45cb5a553182b4c6340497e0801ff631cd0c5a%3A615762911&click_sum=418790d7&ref=stl_listing-1&sts=1",
    "title": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911",
    "description": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture - Model No. 2911This utility style sconce is perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.The sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.FINISH OPTIONS-----------------------• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 10\"Width: 10\"Depth: 12.5\"ShadeHeight: 3.25\"Width: 10\"5\" Wall CanopyClearance From Wall: 2\"This light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Turns on and off at socket.Installation: Direct Wired into wall (Installation Hardware Included)If you would like to make this light a plug-in fixture:Please visit our Add Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!",
    "reviews": [
      "Love, looks great in my room.",
      "Nice !  Seller was helpful with issue ! Thank you Donna",
      "Item as described, highly recommend this Etsy Shop.",
      "Exactly as shown.  Works great!"
    ]
  },
  {
    "productId": "FdhEWFHHmF",
    "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=1ab5cd8260668d31b14e204a74ed62a997aac30d%3A1165269880&click_sum=cffecdf3&ref=stl_listing-2&sts=1",
    "title": "Outdoor Modern Wall Lantern With Integrated LED's and Unique Reflective Center Cone - Farmhouse Design",
    "description": "19703 Lantern-Modern Unique Design: Contemporary and Minimalist European Lantern design with sleek integrated LED that provides an ample amount of light. This wall sconce creates a distinct yet tasteful appearance wherever you choose to install.-Excellent Quality: All ECD Lighting Fixtures are made of sturdy die-caste aluminum and sealed with a weather-proof coating that will ensure the longevity of your fixtures.-ETL Certified: All ECD Lighting fixtures have ETL certifications for the driver and fixture. This fixture is suitable for wet locations and all climates.-Energy Efficient: Integrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours and putting an end to the constant need to change burnt out bulbs. SAVE THOUSANDS on bulbs!!-Variety of Use: Perfect for residential spaces such as exterior entrances, garage, patio, porch, etc.. Additionally a great fixture for commercial use in restaurants, common buildings, office spaces, and multi-use buildings.Easy InstallationAll ECD Lighting fixtures include our patented easy installation hardware!No electrician required and every fixture can be installed with 3 steps in less than 10 minutes.ALWAYS make sure your power is turned off before installation*1. Attach the back plate to the junction box.2. Connect the corresponding wires with the screw caps provided.3. Secure the fixture to the junction box with the provided screws.The ECD WayFrom the moment you switch these lights on, they will improve the look of your home and your quality of living. Choose ECD to light the way for you!",
    "reviews": [
      "Beautiful light. Makes our outdated kitchen look so much better until we can do some more remodel projects.",
      "Love this fixture. It fits perfectly in our midcentury home. Simple, yet elegant and modern. We paired it with a warm Edison-type bulb that really complements the glass and design.",
      "These are stunning and exactly as described.  The seller was very accommodating and jumped through hoops to get these delivered - thank you",
      "Light fixture is beautiful, exactly as pictured. Casts the most amazing light / shadows on the wall due to the blown glass formations! A note to buyer though; 25 watts is very low. This is more of a night light."
    ]
  },
  {
    "productId": "jLkXKsTpxz",
    "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=9a09e0ac67e351434f3536e3c99ab4fe77763d47%3A1051791566&click_sum=721a9894&ref=stl_listing-3&sts=1",
    "title": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748",
    "description": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade.FINISH OPTIONS-----------------------• Our Raw Brass finish features solid unfinished brass that is hand cleaned before leaving our shop. The brass will age and patina over time giving the finish a soft natural look.Please wear gloves while installing all fixtures. Touching raw brass with bare hands will tarnish the brass.If you would like the brass to be sealed:Please purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section.• Black - Durable satin powder coated finish• Brushed Nickel - Lightly brushed with a semi-satin finish• Polished Nickel - Mirror like metallic finish with a warm feel• Antique Brass - Made of solid brass that has been aged and lacquer sealedThis lamp is UL listed and thoroughly tested before leaving our shop!BULBS NOT INCLUDEDRecommended Bulb:LED Edison 7w (60w)Bulbs for your light can be purchased in our Bulbs sectionDIMENSIONS-------------------Height: 9\"Width: 7\"Depth: 10\"Shade:Height: 4.25\"Width: 7\"Clearance from Wall: 2.55\" Wall CanopyThis light fixture is compatible with a dimmer switch.LAMP SPECS------------------Socket: Standard Medium Base (e26/e27)On/off type: Controlled from light switchInstallation: Direct Wired into Wall  (Installation Hardware Included)If you would like to add an On/Off switch or make this light a plug-in fixture:Please visit our Add-Ons for Fixtures section to customize your fixture.This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts.In order to keep the lamp temperature cool, please use LED bulbs only.Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.Don't hesitate to reach out if you have questions!",
    "reviews": [
      "Love the style of the lamps",
      "Beautiful brass lighting piece! Love it! Well crafted!! Only difference from picture is the dome piece is more black sheen than the brushed iron look.",
      "Beautiful! Just got it today and it's now installed. Wow. I love it!"
    ]
  },
  {
    "productId": "OybxtGOIgp",
    "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=6ad5a848c56f6ac47496babdc395645d4423f936%3A1316603667&click_sum=f49f0cc9&ref=stl_listing-1",
    "title": "Linen bedding set, Double king duvet cover and pillows in Green color, 100% natural flax sheets set custom sizes",
    "description": "Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.Here at SOUTH, we don't do shortcuts. We are crazy about effortless luxury, comfort, sustainability, and quality. That means we use only top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home - the more you use it, the more fabulous, soft, and YOURS it will become!WHY OUR LINEN IS SO AMAZING?Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. Also, we use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.🎁 READY AS A GIFTA linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.randed card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Green;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUS CA King + Standard pillowcasesDuvet 104x94” / 264x239cm, pillowcases\t20x26” / 51x66cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cmCUSTOM SIZES:If your comforters are a different size than our standards - no worries, just message us with your measurements and we will make you your perfect bedding set. No extra charge💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
    "reviews": [
      "Beautiful bedding, color quality is perfect.  Delivery without problems.  I recommend",
      "Great custom bedding, easy communication!",
      "Great custom bedding, easy communication!"
    ]
  },
  {
    "productId": "Mrc8SjQAWA",
    "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=8671eb1b2fba806343de58869d4a196cc30d3d45%3A1295727796&click_sum=36fb03a9&ref=stl_listing-2",
    "title": "Linen Pillowcase. Linen Pure Pillowcase. Linen Pillow Cover King, Queen, Standard, Euro sizes. Cappuccino linen pillowcover",
    "description": "Pure 100% Linen pillow cover will provide you maximum comfort.Because of linen's natural qualities, you will feel better and sleep deeper.- Price includes 1 Pillowcase- Pillowcase closure type - envelope;- Color: Almon- 100%  Extra Soft Linen ;- Fabric is: Oeko Tex 100 certified;- Made in Lithuania;Match it with almond sheets:https://www.etsy.com/listing/1110228783/linen-sheet-set-2-pillows-in-white-color?click_key=2a2aec771cf355711397c8539c706045b93a164a%3A1110228783&click_sum=fab2cb5a&ga_search_query=sheet%2Bset&ref=shop_items_search_10&frs=1&crt=1&variation1=2319224371And Beige duvet cover:https://www.etsy.com/listing/1071423946/linen-duvet-cover-in-beige-washed-linen?click_key=b88991db21dcd007eb5748e547ab74cc709bf561%3A1071423946&click_sum=5503be5b&ref=shop_home_active_10&frs=1💌SIZE CHART:US Standard 20x26\"US Queen 20x30\"US King 20x36\"US Body 20x54\"US Boudoir 12x16\"US Deco 18x18\"EU Deco Small 30x40 cmEU Deco Square 40x40 cmEU Standard 50x70 cmEU IKEA 50x60 cmEU Square 65x65 cmUK Standard 20x30\"UK Large Square 26x26\"DE Standard 40x80 cmDE King 80x80 cmCustom sizes available - write us a message to find out more.The actual colours may vary slightly because every computer monitor has a different capability to display colours.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: this shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems.",
    "reviews": [
      "Great custom bedding, easy communication!",
      "Great custom bedding, easy communication!",
      "Great custom bedding, easy communication!",
      "Great custom bedding, easy communication!"
    ]
  },
  {
    "productId": "BMpYyJGWDL",
    "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=041b1eeb37ca60bce3ecf3d78aec7849ba6a2b92%3A1066602418&click_sum=bce63b15&ref=stl_listing-3",
    "title": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes",
    "description": "Airy and lightweight, SAUTHS linen bedding is all about the effortless luxury we love to embrace. Our OEKO-TEX certified linen( this means that it is made free of harmful chemicals and is safe for human use) duvet covers are also incredibly durable, and their texture – can you believe it? – only improves with time.Top-quality European linen outperforms all other materials and makes all our products naturally strong, lustrous, and durable. Our products are organic and fully biodegradable.The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance.Pre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting.We accept CUSTOM ORDERS, so if you haven't found the size needed, let us know!🎁 Linen bedding can be the perfect gift for your beloved one and we will beautifully pack it for you, just give it as a note. Personalized Gift messages are available on our branded card.💌  DETAILS:- Includes one duvet cover + 2 pillowcases;- Composition: 100% linen;- Color: Cinnamon;- Duvet cover closure type - buttons.- Pillowcase closure type - envelope (please contact us if you want to have a pillows with button closure)- Hypoallergenic, thermoregulating, breathable.- Ethically made in Lithuania;- Write in the comments if you need to attach ties to the corners of your duvet cover.💌SIZE CHART:UNITED STATESUS Twin + Standard pillowcasesDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cmUS Full + Standard pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cmUS Full + Queen pillowcasesDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cmUS Queen + Standard pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cmUS Queen + Queen pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cmUS Queen + King pillowcasesDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cmUS King + Standard pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cmUS King + Queen pillowcasesDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cmUS King + King pillowcasesDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cmUK / EUROPEEU Single + Standard pillowcasesDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cmEU Double + Standard pillowcasesDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cmEU King + Standard pillowcasesDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cmUK Single + Standard pillowcasesDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cmUK Double + Standard pillowcasesDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cmUK King + Standard pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cmUK King + King pillowcasesDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cmAUSTRALIAAU Queen + Standard pillowcasesDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cmAU King + Standard pillowcasesDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm💌  EFFICIENCYUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.💌  CARE GUIDE:- Wash at or below 60 C/140F;- Do not bleach;- Tumble dry on low heat;- Iron on low heat;- Do not dry clean.✈️ SHIPPING:We ship worldwide:- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
    "reviews": [
      "Great quality and color, feels incredible.  Thank you!",
      "Great custom bedding, easy communication!",
      "Great custom bedding, easy communication!"
    ]
  },
  {
    "productId": "WhePxYivVy",
    "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=abbeeaf4547691a7b12d97527fa6a4c4e28ba8ec%3A576508683&click_sum=b59d1032&ref=stl_listing-1",
    "title": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - INTERIOR II -",
    "description": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life.- INTERIOR II -This print is available in three optional sizes:A4 - 9” x 12” (21 x 29.7 cm)A3 - 11.7\" x 16.5\" (29.7 x 42 cm)A2 - 16.5\" x 23.4\" (42 x 59.4 cm)Each print is signed and including a white border for framing.Important note: The frame is not includedThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.",
    "reviews": [
      "Im Happy\nAnd very good",
      "Love this print, so happy I was able to find it again!",
      "Gorgeous necklace and beautiful packaging. Delivery was speedy! Thank you.",
      "Good design! Even the box was cute!!"
    ]
  },
  {
    "productId": "Rfy5xMYnmF",
    "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=b77c2b021203282e61aa7da482fd23c44d2474ae%3A834853057&click_sum=13d42f25&ref=stl_listing-2&sts=1",
    "title": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable",
    "description": "Mid Century Modern, Fine Art Prints, Contemporary Art Prints, Abstract Art Style, Mid Century Poster, Midcentury Art Print, Abstract Print File, Fine Art Print For Sale Online, Entrance Wall Art, Apartment Wall Decor, Printable Guest Room, Printable Women Gift, Downloadable Art Prints._________________________________________________________THIS IS A DIGITAL DOWNLOAD, originated from Kala's original painting. Perfect for your home or office decor. Instant download and easy to print, without paying the shipping fee.Your order will consist of TWO high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7.This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.Upon purchase of this listing, Etsy will immediately provide you with a link to your download. Click on the link to download the file and save it to your computer! It’s that simple! You can print the artwork at your local printing center or by using online printing services.KINDLY NOTE:No physical product will be shipped and the frame is not included. Colors may vary slightly due to different color monitors and/or your printer or printing company's settings.TERMS & CONDITIONS:The images that are being provided to you are licensed copies for any reasonable PERSONAL PURPOSES, including but not limited to: printing, copying, emailing, and web publishing.Your license does not include use that results in financial gain, including but not limited to: advertising, stock photography, print sale profits, or resale of any nature.IMPORTANT:- Please do not! Share or sell digital files or printed versions via any online or physical channel.- I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.For a much bigger size than this, I only sell the limited edition original painting, both on high-quality paper (Fedrigoni Paper or Hahnemuehle Paper) or on canvas, and the size is according to your preference. To discuss for a custom abstract original painting like this, please contact me through email:  kalamasa.gallery [!at] gmail.comThank you for your purchase, It will surely help me as a small artist to keep creating and growing.CLICK here for similar individual art print:https://www.etsy.com/listing/833978801/abstract-green-prints-minimalist?ref=shop_home_active_16https://www.etsy.com/listing/833958685/abstract-emerald-green-prints-emerald?ref=shop_home_active_15https://www.etsy.com/listing/833971655/abstract-green-prints-emerald-green?ref=shop_home_active_14https://www.etsy.com/listing/833944255/abstract-botanical-prints-emerald-green?ref=shop_home_active_13CLICK here for the similar set of 2 prints option:https://www.etsy.com/listing/834855825/emerald-green-print-set-abstract-art?ref=shop_home_active_19&crt=1CLICK here for the similar set of 3 prints option:https://www.etsy.com/listing/830353484/emerald-green-wall-art-set-of-3-prints?ref=shop_home_active_4Please visit my main SHOP to see what is new and exciting!https://www.etsy.com/shop/KALAMASArtgallery",
    "reviews": [
      "love em, they're lovely, thanks",
      "thank you for your support. Glad you like my Abstract mountain art print. Happy decorating!",
      "Beautiful digital download!  I printed and framed mine and they’re perfect for my living room!",
      "Thank you for purchasing my Abstract Landscape National Park Print. Glad you really like it. Thanks for the support! 🫶🏽"
    ]
  },
  {
    "productId": "PcXoLJwIFf",
    "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=eb5939d95e32f05f68e2cec2307b349bc0612426%3A991191051&click_sum=e6c9e0a8&ref=stl_listing-3",
    "title": "Dip dye tapestry, Ombre wall art, Macrame dip dye, Dip dye decor, Dip dye wall hanging, Green wall hanging, Green Décor, Boho wall hanging",
    "description": "ALL  A B O U T ...This is a made-to-order tapestry, please allow 2-3 weeks for it to be made and shipped.This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel.•\tThis piece is a made to order item, so feel free to contact me if you would like to order this piece in a different size or colour.•\tEach wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.•\tPlease note slight colour variations may occur.D I M E N S I O N S…Height 120cmWidth 90cmF O L L O W  U S  O N   S O C I A L   M E D I A…https://www.instagram.com/bourneandthread/https://www.pinterest.co.uk/bourneandthread/https://www.etsy.com/uk/shop/bourneandthreadA N D  F I N A L L Y…If you have any questions about the item, just click the 'Ask a question' button next to the price and I will get right back to you.I hope you love your wall hanging as much as I love making it for you.From my loving home to yours …Much Love xThis is an original design © bourneandthread 2019. All rights reserved.",
    "reviews": [
      "I am so happy with my purchase, perfect addition to my tall ceilings in the living room! Shipping to the US was a breeze and arrived earlier than anticipated.",
      "I looked everywhere for something that would fit on one of the walls in my bedroom. After a year of searching, I finally found it. It is more beautiful in person. It goes really well with the green wall on the other side. I just love it. The whole experience was great. Thank you!",
      "Haven’t yet been able to hang it, but it looks like the photo and is solid quality."
    ]
  },
  {
    "productId": "NlvopbrUGm",
    "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=d3a35b8b2d891ee851c0518f9dd5fff6e1d3fb33%3A774551709&click_sum=f90d7739&ref=stl_listing-1&sts=1",
    "title": "Bubble Cube Shaped Candle, Home Decor, Custom candle, Soy Beeswax, Housewarming gift, Air freshener, Handmade Gift, Mother's Day Gift",
    "description": "HANDMADE! MADE TO ORDER!❤REMINDER❤Do you like a \"Bubble Cup\" in the video?  It is beautiful because of its specialty, that's why it needs your more careful treatment. The correct burning way can bring you a wonderful burning experience! An inappropriate burning way may cause a large amount of wax to flow out.  PLEASE READ THE BURNING TIPS BELOW, or you can find them on the Thank You card in your package.❤THE CORRECT WAY TO BURN YOUR \"BUBBLE\" TO AVOID MESS!!!❤❤ Keep away from drafty areas.❤ Always keep your \"Bubble\" on a dish.❤ Before lighting, please trim the wick to 1/8\"-1/4\" and center it.❤ ❤ ❤VERY IMPORTANT: DO NOT BURN IT FOR MORE THAN 2 HOURS AT A TIME!!!❤❤❤Material: Natural Soy Wax, Pure White Beeswax, Candle Dyed, Cotton WickColor: Ivory (undyed), Gray, Dark Gray, Light Brown, Dusty RoseScent: Unscented, High Tide, Pink Sugar Crystals, Magnolia Peony, Pine ForestDimension: 2 3/8\" H,  2 3/8\" WMade in the USAThe super unique bubble-shaped candle is perfect for home decor, gifts! Light up your life and warm the people you love！We use high-quality, pure soy wax and blended it with white beeswax. When it is burning, the aroma released is healthy and environmentally friendly.  We offer different scents for you. Hope the following scents introduction below can help you to choose your favorite scent. Each one is hand-poured the moment you place your order.***Scent***❤High Tide❤Immerse yourself in the aromas of waves crashing onto a rocky coastline with a storm brewing in the distance. The churn of the sea, wrapping the water, sand, and salt together into a clean and ozonic scent. Top notes of lemon, orange, and fresh ozone give way to a heart of briny sea salt and a hint of jasmine. Powder and light musk balance the woody violet and cedar in the base. It is infused with natural essential oils, including cedarwood, orange, and elemi.Top: Ozone, CitrusMiddle: Sea Salt, JasmineBase: Violet, Cedar, Powder, Light Musk❤Pink Sugar Crystals❤A sweetly sophisticated take on a cotton candy fragrance. This sugary scent is enhanced by fruity notes of strawberry, raspberry, and black currant, while base notes of tonka, vanilla, and a hint of light musk keep this ultra-sweet scent grounded.Top: Black Currant, Strawberry, RaspberryMiddle: Sugar, FreesiaBase: Tonka, Vanilla, Light Musk❤Magnolia Peony❤Top: Cherry blossom, BergamotMiddle: Magnolia, Peony, Green Leaves, FreesiaBase: Amber, Powder❤Pine Forest❤Top: Eucalyptus, MintMiddle: Cypress, PineBase: Smoke, Tonka Bean❤Moonflower❤Top: Agave, PearMiddle: Cherry Blossom, Rose, MarineBase: Amber, Dark Musk, Powder***NOTICE***Each one is handmade and wrapped by hand, and due to the nature of this, they may vary slightly, some small imperfections may be present, which does not affect the use.***ABOUT SHIPPING***Made just for you. Candles take 3-5 business days to make. Ready to ship in 1 week.***BURNING INSTRUCTIONS***1. THE MOST IMPORTANT TIP: ALWAYS KEEP IT AWAY FROM DRAFTY AREAS & ALWAYS STAY STRAIGHT!2. WICK CARE: Before lighting, please trim the wick to 1/8\"-1/4\" and center it. Once the wick is too long or not centered during burning, please extinguish the flame in time, trim the wick, and center it.3. BURNING TIME: For regular candles, do not burn them for more than 4 hours at a time. For irregular candles, we recommend not burning more than 2 hours at a time.4. FOR SAFETY: Always keep the candle on a heat-safe plate or a candle holder. Keep away from combustible materials/things. Do not leave lighted candles in unattended places and out of the reach of pets or children.***ABOUT BULK PURCHASE***Wholesale quantities and prices are also available on request. If you have any questions feel free to contact me.Thank you!",
    "reviews": [
      "These candies are very pretty and unique. The case well-packaged. No imperfections in the wax. They’re exactly what I wanted.",
      "Have bought from this shop multiple times now. Quality product, beautiful packaging, brand is on point. I highly recommend!",
      "Great quality! Super cute and smells wonderful!"
    ]
  },
  {
    "productId": "YcikUxAkCk",
    "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=51b4f89df8e6d2a78eb916537a1e3256222e7f46%3A785763623&click_sum=a79f0bcc&ref=stl_listing-2",
    "title": "PALO SANTO - 8 oz Soy Candle - Hand-Poured - Candlefolk",
    "description": "PALO SANTOPeruvian palo santo wood blended with top notes of neroli and saffron - this rich and woody scent also has hints of cedarwood, amber, and moss.Top: Neroli, SaffronMiddle: Cedarwood, Palo SantoBase: Amber, MossABOUT OUR SOY CANDLESHand-poured in small batches, made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks.All of our candles are made, packaged, and shipped from our New York Studio.BURN TIMEThis candle will burn for approximately 45-50 hours.CANDLE CAREOn the first burn, allow the melt pool to reach the edges of the metal tin.This will help to prevent tunneling and give your candle a nice even burn. Trim the wick to about 1/4\" before each use.---------------------------------------------------------------------------------------------------------CONNECT WITH USInstagram: www.instagram.com/candlefolkcoFacebook: CandlefolkTwitter: @candlefolkco",
    "reviews": [
      "I use these candles on a warmer plate instead of burning, and they last a long time. This one smells very earthy and masculine without being overpowering.",
      "Wonderful customer service and my candles smell amazing! Thank you!",
      "Fast shipping.  Nice quality candle. Smells terrific!"
    ]
  },
  {
    "productId": "NIPFOICJKJ",
    "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=81b508953ed1396f2b335765b5b23670e2430c13%3A879866486&click_sum=b9747b28&ref=stl_listing-3&sts=1",
    "title": "HINOKI Essential Oil Candle ///  Grapefruit, Hinoki, Cypress",
    "description": "HINOKI :  100% Natural Soy + Essential Oil CandleCypress / Hinoki / GrapefruitThe scent of fresh mountain air.A cloud of cool mist, rolling through old-growth forests.The clean aroma of Japanese Cypress and dry Cedar,washed clean in a bath of sparkling Pink Grapefruit,create an atmosphere of clarity and tranquility.Use for:  Clarity and Awareness ( see below )+ 100% Natural+ Scented exclusively with essential oils+ 8 oz  /  up to 50 hr+ Vegan+ USA Made Vessel+ Hand-poured in Rhode Island+ 3.5\" high x 2.5\" wide---- Folklore ----The Tree of PurityOnce worshiped as a symbol of the sun goddess, The Hinoki tree has been revered as sacred in Japan for centuries. An emblem of purity and grace, the timber of the fragrant wood has been a traditionally used to build the most sacred of places; shrines and temples.Still used in many Shinto ceremonies today, Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.Uniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.",
    "reviews": [
      "Always a pleasure doing business with this shop..\nThey are truly amazing on all counts!\nLove & Light…",
      "This candle scents the upstairs & downstairs at the same time & smells amazing ~ thank you!",
      "Excellent, as described and love the scent! Looking forward to purchasing more in the near future,"
    ]
  },
  {
    "productId": "ZJmnpVFqRP",
    "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=debcf06eae27460f4bea1d37d952466d20200046%3A570862928&click_sum=05d1a16c&ref=stl_listing-1&sts=1",
    "title": "Small Wooden Stool, Scandinavian decor side table Short Wooden Stool, Scandinavian Stool, Wood Plant Stool, Walnut stool,Midcentury home",
    "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.STOOL DETAILS⚬ COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or BlackWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.⚬ Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.⚬ Finished with a natural hard wax oil.⚬ Weight limit is 120kg⚬ You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.⚬ Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.⚬ Easy to assemble in 5 minutes.STOOL DIMENSIONS⚬ Seat diameter: 32 cm (12.59\")⚬ Height: 41 cm (16.14\")IMPORTANTYou have three way to see our stains:⚬ Third photo shows our samples of colors⚬ When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option⚬ You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want",
    "reviews": [
      "LOVE this stool! Solid quality and gorgeous stain",
      "Simple, well made, nice finish, stylish and solid, and it arrived with home made fudge, too. Easy to assemble, arrived in perfect condition, too. Great product, great value.",
      "really nice stool, shipped on time!"
    ]
  },
  {
    "productId": "cfRhFIBgVj",
    "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=5266896508acc642ec692ad9f5ad1d0bd8701906%3A793579884&click_sum=5ba03dbf&ref=stl_listing-2",
    "title": "Cork Stools, Home & Living, Bedroom, Living room, Eco-friendly, Home Decor",
    "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.The stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.This collection combines the use of a natural material and simple forms.Collection: Furniture CollectionMaterial: Natural CorkDimensions:Cork stool #1 - Ø 30 x H 39 cmCork stool #2 - Ø 32 x H 45 cmYear: 2020Care instructionsYou should:> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;You should not:>clean it with any type of chemical and abrasive product;> place hot or sharp objects on the surfaces;> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years;",
    "reviews": [
      "Perfect for my Eames lounge",
      "Great product, great design, great customer service\nThank you Mariana",
      "The cutest bowl!! So beautifully made & adds the perfect touch to my kitchen! Will be buying again from this shop!",
      "Exactly as described and pictured!"
    ]
  },
  {
    "productId": "YEGMBhDOoU",
    "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=2fec5f77b4c4a7e6ca5472d2d3996734a91ade55%3A1198929077&click_sum=2dbc375a&ref=stl_listing-3",
    "title": "Bonnet Wood Stool (Golden Yellow) | Scandinavian Design | Excellent for Plants and Seating",
    "description": "The Bonnet Stool is a hardy, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand and will look dynamite in combination with just about any thoughtfully decorated space.  It is Handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels.  The Bonnet Stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow.  It's available in two sizes and a variety of colors.  Also, feel free to reach out for custom colors and sizes either through our Etsy store or through email at  info [!at] whalecreek.co.",
    "reviews": [
      "This is the second one of these I purchased. I really like the look and feel of this item and would highly recommend it.",
      "Good quality and attractive design",
      "Set of 3, custom sizes and a custom color. PERFECT. Super sturdy, well finished… even the packaging was perfect - brown paper padding. The cardboard box was extra heavy and wisely taped so it arrived without a scratch. With all my customizations they were delivered in just a couple of weeks. Highly recommend!"
    ]
  },
  {
    "productId": "mMSgZqBiZY",
    "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=20db6132ce587066f927ec161f2a0640b3600867%3A865339439&click_sum=448d152d&ref=stl_listing-1&sts=1",
    "title": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
    "description": "The Coiled was designed to dress your plants in style, just like the owner! Our planters will modernize and bring out the beauty of your plants. \"The Coiled\" exudes a bauhaus/Japanese cool!They all come with a drainage hole and 3 little \"feet\". If you prefer not to have the hole or feet, please leave me a note.Sizes (Inside diameter and all measurements are approximate):2.5\" diameter x 2.25\" tall (6.4 cm x 5.7 cm) (fits standard 2 inch pots)4.18\" diameter x 3.75\" tall (10.6 cm x 9.5 cm) (fits standard 4 inch pots) (video shown in this size)6.18\" diameter x 5.4\" tall (15.7 cm x 13.7 cm) (fits standard 6 inch pots)The colors come in a matte or sheen finish. This listing is for the matte finish colors only. You can find the sheen finish colors in my other listings. I have 2 blacks: the matte black is a soft non-reflective finish while the sheen black has a slight shine to it and a darker black finish. The white and light grey is a sheen finish but appears matte.All products are 3D printed out of a plant based bioplastic eco-friendly material. The natural wood and black wood matte finish is mixed with real recycled wood. They're all lightweight, durable and won't break if you accidentally drop them!*Free domestic shipping on orders $35 and more.*International customers contact us for a $20 discount code on orders over $150!*3D printed, sustainable and eco-friendly.*Design is original to Morse Studio Co.*Follow us on Instagram @morsestudioco for all the latest news and specials!",
    "reviews": [
      "This was a gift and she loved it!",
      "Small planter, but cute and nice",
      "I purchased this as a gift for a friend and she loved it! It arrived really quickly, too."
    ]
  },
  {
    "productId": "PJjaDPjvww",
    "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=dba9124b9326c2410de124fb9163129c5fbdcd16%3A728731403&click_sum=efc3b34f&ref=stl_listing-2",
    "title": "Nude Pink and Brass Metal Floor Planter / Metal Plant Pot / Brass Planter Stand / Gold and Pink",
    "description": "MATERIALS: Brass, Aluminium with Static PaintCOLOR: Nude PinkDIMENSIONS:Pot Diameter: 20cm ,  Height (total): 30cm,  Brass Stand Height: 18cmGlobe Planter is now suitable for all house plants with its maxi size! Especially for the ones who like facing the sun... As being able to rotate to any direction on its brass stand, Globe Planter lets you to adjust your plants position easily. And it can now be placed on the floor with longer and spreading plants.With the perforated seperator inside, excessive water is collected at the bottom not to harm the roots. Plants can also be placed with their pots inside Globe Planter. In that case the seperator functions as a platform for your your pot.* The plants in photographs are for visual. They're not included in the product.--SHIPPING:We only ship with Express Shipping worldwide. Please check the dates with us if you are shopping for an anniversary or a special date and we’ll make sure that your shipment arrives timely.IMPORT FEES:*USA orders are free of import charges up to 800$ total of purchase.*For EU orders, VAT is collected at checkout by ETSY and no import charges apply at delivery below 150€.Please beware that import fees may occur on international shipments according to your government's customs regulations. Buyers are responsible for local taxes and customs fees that may apply.--",
    "reviews": [
      "Customer service and delivery was quick.",
      "Such a sweet planter! Make sure to check the dimensions. I thought it would be larger but I had miscalculated the dimensions. It is really more for table top than floor.",
      "Really cute! I like that you can adjust the pot on the base and LOVE that it has a drain insert."
    ]
  },
  {
    "productId": "XbNsqTPQku",
    "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=22aeb5126233a62a826206b384874a11d127d29a%3A1435558019&click_sum=73127900&ref=stl_listing-3",
    "title": "Tile Pattern Ceramic Planter / Small Indoor Planter / Cactus Plant Pot / Succulent Plant Pot",
    "description": "THIS PIECE IS MADE TO ORDER AND WILL SHIP IN 2-3 WEEKS.Stoneware planter with hand carved details in a bright red and pink combo. Perfect size for a small cactus or succulent.  Small hole in bottom of pot for water drainage.Approx 2.5” height x 3” diameter",
    "reviews": [
      "Arrived SO fast (thank you for saving Christmas lol) and was packaged beautifully. My best friend loved it, and it has a place of honour in her flat now. :)",
      "This is my favourite mug. I use it everyday! It is the perfect size, the handle is really comfortable, and it's so pretty!!",
      "Love the mug it's very well made"
    ]
  },
  {
    "productId": "jKqoYIayKW",
    "url": "https://www.etsy.com/listing/461000746/gps-coordinates-longitude-latitude-sign?click_key=fe40dc38affe3a6dd6efc9a6b99610d94bcd72ea%3A461000746&click_sum=6d1dc457&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-1&frs=1&etp=1&sts=1",
    "title": "GPS Coordinates Longitude Latitude Sign, Realtor Closing Gift, Housewarming Gift, Christmas Gift, Coordinates Sign, Memorial Sign",
    "description": "ABOUT THIS WOOD SIGN:• Made to order• approx. 8\" x 12\" w/ hanging hardware• Displays ONE (1) Coordinate• Pick from Dark Walnut, Briarsmoke, or Early American• Coordinates will be converted to the style that is pictured• Hand painted (NO DECALS)• back of sign is stained and stamped with my logoABOUT SHIPPING:• Please see \"estimated shipment date\" prior to purchasing• Handmade in the order in which received• \"In stock quantity\" is so that multiple people can purchase at one time• Cancellations are not accepted• Mailed USPS Ground Advantage 2-4 day; mail delays are out of my controlIMPORTANT: Please leave your coordinates in the personalization or note to seller section if you're using an older version of the Etsy Mobile App. If you're not sure how to find the coordinates to your special location, feel free to leave a note with the address and I'll get it for you.MUST READ:ALL COORDINATES WILL BE CONVERTED TO THE STYLE THAT IS PICTURED00°00'00\"N00°00'00\"WBecome a Bluebird Watcher: mailchi.mp/0d4232f1d64f/welcomeSubscribe and get 15% off your next order. Be the first to know about new products, sales, and giveaways each weekAll items found in this shop are made from natural material such as wood and grapevine. Signs and trays are made of real wood and are either stained and/or painted (no vinyl here). Due to the nature of wood, knots and grains will vary from sign/tray to sign/tray. These are meant to look rustic and may have varying imperfections including (but not limited to): dents and cracks. Napkin rings use natural grapevine forms and faux floral/greenery. Due to the natural of wood not all forms are perfectly round. We do our best at picking wood and/or wreath rounds that are as perfect as possible. Everything in this shop is made to order and due to the nature of The Mountain Bluebird Co, we do not accept returns.  Please note that all sizes are approximate and may vary up to an inch.Copyright © the Mountain Bluebird Co. 2015-present",
    "reviews": [
      "I purchased this as a gift, and they loved it.",
      "Thanks for shopping TMBC. I’m so happy your gift was a hit. I look forward to creating for you again in the future.",
      "Before I ordered, I had questions which were answered quickly. This was a gift so I did not see the final product. Recipient seemed happy.",
      "Mary,\nThank you for shopping The Mountain Bluebird Co. I'm so happy you're overall experience with my shop went so well. I'm even more happy the gift was well received. I look forward to creating for you again sometime soon.",
      "This is my third purchase with this shop. Quality work! Thank you!",
      "Kimberly,\nThank you for your continued support with The Mountain Bluebird Co. I'm so happy you continue to love the coordinates sign. I look forward to creating for you again sometime soon.",
      "The sign exceeded my expectations! Amazing quality and the seller is exceptionally helpful and easy to work with!!!"
    ]
  },
  {
    "productId": "hATbNjdcpS",
    "url": "https://www.etsy.com/listing/483839218/congrats-on-your-happy-new-home-candle?click_key=1879dee9c82d41a389b8a9dcb742296a26223f67%3A483839218&click_sum=b92cbce3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-2&pro=1",
    "title": "Congrats on your Happy New Home Candle Gift - Housewarming Gift | Relocation Gift | Moving Gift | New Home Gift | Hostess Gift | Soy Candle",
    "description": "Hi, welcome to Hello You Candles!  Our Housewarming Candles are made with 100% American grown, eco-friendly soy wax, and we only use clean burning fragrance and essential oils to scent our candles. Our candles are always free of dyes, harsh chemicals and pollutants and are hand poured in our shop in Laguna Hills, California.  A clean candle is a better candle, better for you and better for the environment.WHAT YOU WILL RECEIVE:1 - 4 oz, 9 oz or 16 oz soy candle in the design shown in the first image.  Your candle will arrive perfectly packaged in our signature gift box, complete with complimentary Hello You matches.Make it personal, add a custom message to the back of your candle (no additional charge :)CANDLE SCENTS:♥ VANILLA:  Vanilla | Bourbon | Buttercream♥ LAVENDER:  Lavender | Eucalyptus | Cedarwood♥ POP THE BUBBLY: Champagne | Strawberries | Guava♥ BOUQUET:  Roses | Ylang Ylang | Green Leaves♥ WEDDING CAKE:  Champagne | Buttercream | Vanilla♥ SPICED HONEY:  Spiced Honey | Dried Tobacco | Tonka Bean♥ BEACH DAY:  Sea Salt | Coconut | Tonka Bean♥ SPA DAY:  Aloe | Green Florals | Patchouli♥ GREAT OUTDOORS:  Pine | White Birch | Cedar♥ BLUE SKY:  Sea Salt | Ozone | Cottom Blossom♥ HEALING WOOD:  Cardamom | Palo Santo | Sandalwood♥ SUNSHINE CITRUS:  Grapefruit | Orange | Lemon | Vanilla♥ HERB GARDEN:  Eucalyptus | Rosemary | Sage♥ HAPPY HOUR:  Cardamom | Butterscotch | Bourbon♥ ENCHANTED FOREST:  Oakmoss | Amber | Sandalwood♥ STRONG COFFEE:  Coffee | Cream | Sugar♥ BIRTHDAY CAKE:  Buttercream | Vanilla | SugarSIZE GUIDE:~ 4 oz candle measures approximately 2.5 inches tall and 2 inches in diameter, 20 hours burn time.~ 9 oz candle measures approximately 3.75 inches tall and 2.75 inches in diameter, 50 hours burn time.~ 16 oz candle measures approximately 4 inches tall and 4 inches in wide, 80 hours burn time.We ship all candles via USPS 2–3-day priority mail. Please check our shop announcement for our current lead time.OTHER HELPFUL INFO:We do offer a discount on bulk orders, please contact me for details.",
    "reviews": [
      "Cute. New home gift to",
      "Love these candles. Scent and quality are great",
      "Great gift for my niece's first home purchase.",
      "I purchased this for my daughters new 🏠 home purchase and she said, “it smells so good”!"
    ]
  },
  {
    "productId": "PAynpxweXb",
    "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=55a03a92b413873a3e2502f75ae4641ed322c0e1%3A214526797&click_sum=73e99195&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-3&pro=1&frs=1&sts=1",
    "title": "Engraved Compass, Personalized Gifts for Men, Custom Working Compass, Handwriting Engraving, Anniversary Gift for Him",
    "description": "Engraved Compass, Personalized Gifts for Men, Custom Working Compass, Handwriting Engraving, Anniversary Gift for HimThis custom engraved made from top quality solid brass, and durable for outdoor use.Checkout my other compasses!https://www.etsy.com/shop/SFdizayn?ref=seller-platform-mcnav§ion_id=16459965Diameter: 1.96 inchMaterial: BrassChain: Comes with the same chain as in the listing picturesCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.Engraving: We can engrave whatever you want and we can use every font that you want.This engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.*IMPORTANT MESSAGE ABOUT DELIVERY and TURNAROUND TIMEIf you add your phone number to your order notes; delivery would be faster than usual.Turnaround time is 1 business day and I ship your order in 1 day after your purchase. You can choose the Express delivery method at checkout.* HOW TO SEND YOUR ENGRAVING INSTRUCTIONSPlease put all your engraving instructions for each side in the '' add your personalization '' box on the product page. For example:Front side: abc...Inside: xyz...Leather pouch: klm...If you want me to engrave an image or images; please attach the image to the ETSY message box ( conversation box ) after your purchase.For handwriting engraving; please use white unlined ( blank ) paper with a black pen and take a picture of the paper. After your purchase please attach the image of your handwriting via the conversation box. Just send us a message.We can engrave one of the same mountain, lake, river, wave, waterfall, sun, and stars design as in our listing pictures or we can engrave your own design.",
    "reviews": [
      "It is even more beautiful than I imagined!",
      "Gift for my son. Says it’s nice I haven’t seen it yet  was shipped to him",
      "Beautiful Christmas gift for my husband as our first Christmas husband and wife",
      "Amazing, my nephew loved it."
    ]
  },
  {
    "productId": "RMczClQZz9",
    "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=48b495f8d0902e70e3224ad6dd54d7a4492de568%3A207134258&click_sum=92c4ed42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-4&pro=1&frs=1&sts=1",
    "title": "5th Anniversary Gift, Photo on Wood, Picture on Wood, Wood Anniversary Gift, 5 Year Anniversary, Wood Wedding Gift, Custom Wood Burning",
    "description": "If you're searching for the perfect 5th anniversary gift or gift for any other occasion, look no further than our rustic wood photos. A wood anniversary gift is a great, traditional option for your 5th year of marriage. Not only are our custom pictures on wood ideal for anniversaries, but also make perfect gifts for weddings, housewarmings and so much more!ABOUT OUR WOOD PHOTOS:Have your own custom photo printed directly onto round basswood, with no margins or gaps. The photograph becomes an integral part of the wood, ensuring that it will stand the test of time. The natural wood shows through the photo for a beautiful, rustic, and \"worn\" look. It is said that wood elements within your home can bring balance to your space and life.Purchasing as a GIFT? Add-on our gift wrapping option and have your custom wood photo wrapped in a natural burlap gift bag -https://www.etsy.com/listing/522661329/burlap-gift-bags-gift-wrapping-add-onDETAILS:• Because this is wood from a real tree, pieces may have knots which we try to place in the best spots possible for the photo provided.• Each piece of wood will vary in wood grain, making each one completely unique.• Several size options available to choose from. Due to the natural characteristics of the product, there may be slight variations of approximately ~0.5\" smaller or larger.• Photos will be cropped around the corners/edges, as this is the only way to fit a rectangular photo onto an oval piece of wood. All important aspects of the photo should not be located along the very edges of the picture.• Horizontal photos will be placed horizontally on the wood & vertical photos will be placed vertically unless otherwise requested.• White ink is not printed on the wood. This allows the natural grain of the wood to show through the photo. Colors of the photo on the wood may vary, as these are printed onto natural wood and not bright white paper.• A clear protective coating is applied over your wood photo to help protect against stains, water and scratching.• All wood photos come with complimentary hardware for hanging. If ordering a stand, hanging hardware is not included.• Stands are not included, but can be purchased separately.• The bark of the wood is not removed from the wood in order to preserve the natural look of our wood photos.• All orders are securely packaged with extra bubble wrap for added protection during shipping.• Made and Handcrafted in Florida, U.S.ACHOOSING YOUR PHOTO:• The better quality the photo, the better the results will be on the wood.• A 300 dpi photo taken in good lighting will give you the best possible print results.• Lower quality photos can be used, but please know that the quality will be the same on the wood.• Extremely dark, blurry, grainy or low-quality photos do not typically transfer well.• We ask that you DO NOT add any text to your photo, due to cropping reasons.ENGRAVINGS:• Looking for a way to make the back of the wood as beautiful as the front? Consider adding on one of our engraving options.• Select from a variety of premade and personalized designs and have them ENGRAVED onto the back of your wood photo.• Scroll through listing photos to see available engraving options.• Our custom text engraving option allows you to have any custom text engraved onto the back of the wood in the font that is shown. There is no character limit, but the longer the text is, the smaller it will be to fit onto the wood.• Our custom handwritten text engraving option allows you to add handwritten text to the back of the wood. For handwritten text, please send us a message through Etsy with an attachment that includes a digital or scanned copy of the handwritten text that you'd like engraved. Handwritten text MUST BE ON A PLAIN PAPER BACKGROUND. Text written on lined paper or paper with background designs will not work. The clearer the text is, the better the engraving will be.• Please keep in mind that because this is real wood, there may be some natural knots/marks on the piece. These may be more noticeable on the back of the wood than on the front, as there is no photo to cover them.HOW TO PLACE AN ORDER:1. Purchase this wood photo listing along with any upgrades that you'd like from the drop-down menus.2. Send us a high-quality digital photo to use through Etsy messages by simply clicking the \"ask a question\" link or \"contact\" link on our shop. You can also click this link:https://www.etsy.com/messages/new?with_id=15274040&referring_id=9226174&referring_type=shop&recipient_id=15274040Attach your photo to the message by clicking on \"attach image\" or the camera button and selecting your desired photo.FULL PRODUCT LINE:View our complete line of products and size options at www.woodphotos.com",
    "reviews": [
      "Beautiful work for my 5th wedding anniversary gift! I know my husband will enjoy it.",
      "Fantastic quality. Wife loved it for our anniversary",
      "Quality wood print that came in looking fantastic, if not a little faded which just adds to the wood aesthetic",
      "The seller was helpful and the item was made and shipped very fast!"
    ]
  },
  {
    "productId": "YxCyiZcqTQ",
    "url": "https://www.etsy.com/listing/96383212/acorn-doorstops-set-of-2-door-wedges?click_key=a7527abae260e322672a4bc64a6f4ef01d54555f%3A96383212&click_sum=02a87555&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-5&frs=1&etp=1",
    "title": "Acorn Doorstops, Set of 2 Door Wedges, Wood Door Stop Set, Wood Door Holder, Stocking Stuffer, Hostess Gift, Housewarming Gift",
    "description": "Everyone has a door or two that will not stay open with summer breezes or just one that wants to be difficult. These little wooden stops will do the trick. A lovely little item for your self or as a gift, some folks buy one to tie on a gift with the ribbon and tag.Wonderful gift for someone who travels, adds extra security to a hotel room door.These are turned and nicely sanded and finished, this listing is for two stops.The Red Oak is our provincial tree and acorns nature's wonderful little works of art. There is a bit of country folklore where it is believed if you have an acorn in your home you will be blessed with good luck and safe from harm.",
    "reviews": [
      "Beautiful. I have 2 sets of the door stoppers. Nice touch.",
      "Beautifully made. Use two in my home. Excellent!",
      "I really love these doorstops. Beautifully crafted and just what I was hoping for! The only grumbling I have is that shipping took a little longer than expected.",
      "Thank you very much! They are beautiful for using in my pantry which has a glass door. I only needed one but will save the other one for a gift. Your work is perfect."
    ]
  },
  {
    "productId": "VEufTheUgT",
    "url": "https://www.etsy.com/listing/216584231/mailed-print-custom-quote-custom-quote?click_key=e5653ec5488164b95493fe4e3bc19e5affbcf665%3A216584231&click_sum=b53e518f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-6&etp=1",
    "title": "Mailed Print / Custom Quote / Custom Quote Print / Personalized Quote Print / Custom Poster / Dorm Art",
    "description": "Custom Quote / Custom Quote Print / Personalized Quote Print / Custom Poster / Dorm Art / Mailed PrintWords can change our lives, so if you've found some good ones, why not infuse your surroundings with their wisdom?Choose your own font, background color and quote for a print that will be perfect for you. Please note that, along with the quote you'd like, you'll need to write down the background color you'd like in the \"notes to seller\" when you check out.I'll use a black font over light colors and a white font over the darker colors unless you specify otherwise.Please note that the colors shown in the third photograph are not the only colors I can do. Feel free to request a custom color for either your text or background!Would you like it framed? Click on this link to purchase:https://www.etsy.com/listing/276881236/8x10-gold-frame-11x14-gold-frame-thin-----------------------------------------------Choose from four sizes:5 x 78 x 1011 x 1413 x 19-----------------------------------------------For additional formats available for custom prints please click these links:https://www.etsy.com/listing/216646923/custom-handwritten-quote-custom-quotehttps://www.etsy.com/listing/245186536/custom-calligraphy-print-black-and-whitehttps://www.etsy.com/listing/216657514/custom-handwritten-quote-custom-quoteTurn-around time is only 2-4 days before your custom print is on its way to you! I'll send you a file within 24 hours so you can let me know if I got it just right before it is printed and sent out to you.-----------------------------------------------Each print is professionally printed on an acid-free 68 lb. specialty paper with archival inks and mailed flat in an envelope protected by cardboard and a cello sleeve (5x7, 8x10) or rolled securely in a sturdy tube (11x14, 13x19).-----------------------------------------------Listing is for print only, frame and styling objects are not included.",
    "reviews": [
      "I would definitely buy from this seller again.",
      "Fast great service and my husband got chocked up after seeing it. Thanks so much for helping me give such a meaningful gift.",
      "Thank you, @Madkitty Media. For years, I have wanted these printed and hung, but didn't have the resources of my own to do so. Cheers & Happy New Year",
      "I love this sign! The owner was so great working with me!"
    ]
  },
  {
    "productId": "uBHjSlVKpB",
    "url": "https://www.etsy.com/listing/536496958/tree-rings-print-three-panel-wall-art?click_key=38053f459fdc41218915569be5469b7ce7cc34b1%3A536496958&click_sum=3a15cdb5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-7&frs=1&etp=1",
    "title": "Tree rings Print, Three Panel Wall Art, Woodcut print, Lumber, Tree of Life, Sacred Geometry, Live Edge, Shabby Tree, Each 24x36 inches",
    "description": "Set of 3 tree ring prints made by hand and signed by Erik Linton. Each 24x36 inches.When you buy these tree ring prints, you’re getting actual handmade woodcut prints, not something printed from a machine. That’s because I consider each a work of art that is as unique as the tree I make them from. I also don’t believe in cutting down trees to make my art. I travel to meaningful places to find wood from previously fallen trees. In a way, I’m just publishing the story of a place as written by a tree over decades and sometimes hundreds of years. I sign each print because I stand by my work. If you’re not happy with the artwork I will give you a full refund, no questions asked.In the main photo, the print on the far left is driftwood from Tillamook, Oregon. The middle print is made from a beautiful Ash tree that comes from Midwestern United states. The print on the far right is from the Crater Lake area, just outside of the National Park. The tree is more than 100 years old.  You get a great discount buying these three prints in a set, rather than individually:)****I’m more than happy to customize the color and the paper size for you. Just send me a message.****If you have a piece of wood you’d like me to make art from just send me a message, I’m happy to do personalized pieces.****I’m not currently shipping with frames because I’ve had too many frames get damaged during shipping. But don’t hesitate to ask me for suggestions.________________________________________________________________________________DETAILSMaterial: 100lb acid free paperSize: Each 24x36 inchesType: Driftwood, Ash, PinePaint: High quality textured ink.Ships quickly in a sturdy tube.Signed by me________________________________________________________________________________HERE’S WHAT MY CUSTOMERS ARE SAYING:“I bought this print and another one for my wife for our 1st wedding anniversary. I thought it symbolized the traditional paper theme for the 1st anniversary perfectly. The tree for the main element in paper and the tree rings symbolize the years memories that we will record for our lifetime. Linton Art’s work is beautiful, and will be a perfect feature in our new home.”     -David“My order was stolen but seller replaced with no charge and was super helpful!! And super fast shipping in time for the holidays. Definitely will order from again!! And the prints are so beautiful they made such a great gift!!!”     -Rae“Such a beautiful and clear print and I love that each one is unique. Would definitely order again. Arrived within good time and was well packaged. Couldn’t be happier 🌟”     -Maisie“I’ve been eyeing these prints for a long time...so glad I pulled the trigger! Love them, they are great quality and exactly what I wanted for my living room.”     -Suzanne“I’ve been eyeing these prints for a long time...so glad I pulled the trigger! Love them, they are great quality and exactly what I wanted for my living room.”     -Amy",
    "reviews": [
      "Quality prints and shipped safely!",
      "Better than pictured. Exactly what I was looking for a shipped quickly and safely.",
      "I’m obsessed with these pieces!",
      "These prints are amazing, they add so much to a room!"
    ]
  },
  {
    "productId": "IOb41hWaIJ",
    "url": "https://www.etsy.com/listing/247020065/watercolor-seascape-painting-archival?click_key=8b011e8989f1d734565eb9b844b2caacc6a2a151%3A247020065&click_sum=14ed6aca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-8&frs=1&etp=1&sts=1",
    "title": "Watercolor seascape painting, Archival Print from original painting, Maine, Rowboat Alone at sea, serene moody landscape, coastal art",
    "description": "This is a giclee print of my own original watercolor painting. Printed with colorfast ink on premium archival fine art paper. Prints are signed in the back and have a white border for easy framing.I live on the wild and beautiful coast of Downeast Maine. We moved to an old, old house with a small farm in the forest, near the water. There is nothing I love more than taking quiet time for myself out on the water.Printed on Epson Velvet Fine Art Paper because it is very similar to the original paper these were painted on. Options for paper size are:8.5 X 11 inches  $5013X19 inches     $7017 X 22 inches   $85Not all images fit standard paper sizes and may need custom frames.Most images can be custom printed larger on paper or canvas, just go to \"custom\" or convo me with you wish and I will do everything to make it happen.Each print is packaged in a  protective, acid-free sleeve and shipped in a flat cardboard mailer. I usually ship the print by regular mail the day after I receive the order. I am very happy to accommodate special orders like larger prints or portraits. Prices do apply.Please feel free to convo me with any questions or requests. I love comments and convos from people around the world!",
    "reviews": [
      "Thank you for art is appreciated",
      "Such a beautiful piece! The quality and detail is outstanding.  Will be visiting your shop often! Thank you!!",
      "Very nice- item as pictured",
      "Beautiful print!"
    ]
  },
  {
    "productId": "fRnWnhaPuW",
    "url": "https://www.etsy.com/listing/175265406/engraved-slate-house-number?click_key=8f1eca1e7eeece662ce014f4aa58fedefd59786e%3A175265406&click_sum=cff13348&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-9&etp=1",
    "title": "Engraved Slate House Number",
    "description": "House numbers 1 to 999999 available - usually same day dispatch !- see bottom of listing on how to orderThese attractive slate sign designs are carefully designed to give your house number a modern, clean look.Firstly the slate is beveled and drilled in order to create a softer appearance around the edges and allow it to be attached to a wall.Your chosen number is then classically hand engraved with deep \"V\" cut lettering, not sandblasted or laser engraved like most other numbers. This gives an attractive depth to each number, allowing the number to stand out against the natural slate. Please note only Capital letters available in  \"V\" Cut.The numbers are then given three layers of base paint, and a final layer of high gloss finish, this creates a brilliant white number. The slate is then waxed to bring out the natural colours of the slate and increase its durability and then finally it is carefully wrapped and packed.Size:2 digit numbers - 140mm x 100mm3 digit numbers - 200mm x 100mm4 digit numbers - 250mm x 100mm5 digit numbers - 250 to 300mm x 100mmExamples : 34, 34a, 56B, 78bis, 4567, 86543, 78i    (ie we can make anything)If you request a number with lower case letters we will engrave the sign on our computer engraver which engraves flat digits/letters rather than the \"v\" cut.1&2 digit numbers will be dispatched Same DayOther numbers (3/4/5 digit) will be made and dispatched Next Day(all orders placed up to 3pm)Looking for something bigger? Check out our shop.Postage: Free UK ,  Europe £8 (air mail), Rest of the world £10 (air mail)How to order:Simply select the correct option for your number from the drop down list.Then complete the personalization box with you required house number.(Numbers and letters can be accommodated   eg No 26A is classed as a 3-digit number)Any queries, please do not hesitate to contact us.Guarantee:In the unlikely event you are at all unhappy with your purchase we offer to remake your number or give a full money back guarantee.",
    "reviews": [
      "Really lovely and easy to order",
      "Perfect! I have previously ordered from Atlantic so I know the quality is great. \nI recently moved house and there was already a number plate there which I wanted to replace. I contacted Atlantic to confirm measurements of screw holes and received a very helpful prompt reply. Ordered and item was dispatched the same day. I would not hesitate to recommend. Thank you.",
      "Perfect, amazing quality, delivered so fast and price is great compared to other alternatives available on the Internet!",
      "Good quality product and easy to install."
    ]
  },
  {
    "productId": "ElXpBrgusI",
    "url": "https://www.etsy.com/listing/458504940/personalized-zip-code-pillow?click_key=e7d672b893f0c7b07483a67a84fa3ad6849ba513%3A458504940&click_sum=f6b6ea19&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-10&frs=1&etp=1",
    "title": "Personalized Zip Code Pillow | Personalized Pillow | Dorm Decor | Monogrammed Gift | Rustic Home Decor | Home Decor | Farmhouse Decor",
    "description": "Zip Codes, Dates (Wedding, Graduation, Anniversary), Address ..... Leave any number!  We're happy to accommodate your needs.Need your order in a hurry?  Add a Rush to your order.  For $10 additional receive 24 hour processing and Priority Shipping.  Here's the link:https://etsy.me/2I2vPVFSign up today to receive 10% OFF your first order & keep up to date with new products & sales:(Copy & Paste this URL link)https://sweethooligans.design/pages/subscribe• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •PILLOW DETAILS:You will receive:(1) Numbers Pillow CoverFIT: The pillow covers are professionally fit meaning they will measure a little smaller than the insert to ensure a snug fit. The pillow size reflects the recommended insert NOT the cover.•••PILLOW INSERTS CAN BE INCLUDED•••All inserts are made from a Synthetic Poly-fil. Polyester filling is great for anyone with allergies, as it is hypo-allergenic.• Materials Used: Soft Linen blend fabric• Enclosure: Hidden Zipper• Ink Used: Printed with natural water-based pigmentsYou can choose from any of our signature colors: Natural, Off White, Rose and Light Grey.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •HOW TO PLACE AN ORDER:1. Specify the fabric color.2. Choose the size pillow \"w/ Insert\" or \"Cover Only\".3. Leave the set of numbers desired for your pillow.CUSTOM ORDERS:**IF APPLICABLE LEAVE CUSTOM INFO IN THE \"NOTES SECTION\" AT CHECKOUT! Keep in mind that you are responsible for providing us with the correct spelling, dates, punctuation, and the like. We copy and paste this information to help illuminate mistakes. Don't give information in all caps unless that is how you would like it to appear. Be as detailed as possible when asking for something unique, so we can provide proofs best aimed at what you're looking for.****NOTE:**We provide a proof for all custom requests which go outside the basics of the design for the listing you are ordering from.  Names, dates, initials, GPS coordinates, and the like being plugged in do not require a proof, but I'm happy to provide one if necessary. All proofs require a response and approval within 1 weeks time. After the 1 week deadline, if there is no response, we will move forward and send out your order with our best judgment.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •INSTAGRAM: find us on Instagram for special coupon codes and flash sales! @sweethooligansdesignFACEBOOK: find us on Facebook for special coupon codes and flash sales! @sweethooligansdesignPIN IT! Love the pillow, but not ready to buy? Pin the photos above and save for later!",
    "reviews": [
      "Very nice I would definitely order again",
      "Recipient loved the gift and couldn't be happier!",
      "Order arrived quickly and in great condition, the pillow is just as advertised",
      "I love love love this pillow! I gift it to every one of my friends and family as a housewarming gift!"
    ]
  },
  {
    "productId": "JVDJPNoAXX",
    "url": "https://www.etsy.com/listing/251774155/rainbow-candle-soy-candle-with-6?click_key=f51928538473c615ed8a71bd123a5814c1b5a60f%3A251774155&click_sum=3ad6169a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-11&etp=1&sts=1",
    "title": "Rainbow Candle / Soy Candle with 6 colorful layers of scent / Hand Poured Great Gift",
    "description": "Colorful rainbow candle is six layers of scented soy candle goodness!Each layer has a different scent.  Scents include:  Violet Lime, Sandalwood Vanilla, Carolina Sweetgrass, Apple Orchard, Mandarin Orange, and Vanilla Beans.Makes a great hostess gift, surprise for your bestie, or just a quick pick me up for someone who needs a little color in their life!This candle adds a pop of color to any decor, modern to rustic.Extra long burning, super scent throw.  One mason jar will scent a large room.Each will burn for over 64 hours, with eco-friendly paper and cotton wicks.-16 oz jar-Approx 64 hour burn time-100% Sustainable and low temp soy wax.-All orders arrive in attractive wrapping.  Ready for gift-giving.-Great party host or hostess gift.More Soy Candles:https://www.etsy.com/shop/SoapForYourSoul?section_id=10094470Laundry Soap:https://www.etsy.com/shop/SoapForYourSoul?section_id=10074163Handmade Artisan Soaps:https://www.etsy.com/shop/SoapForYourSoul?section_id=10072815",
    "reviews": [
      "Perfect quality\nExactly matched description\nWill definitely consider buying more :D",
      "Had to get a second of this candle <3",
      "Love the candle it smells great and looks amazing"
    ]
  },
  {
    "productId": "vryisVrjJF",
    "url": "https://www.etsy.com/listing/291976457/strong-coffee-scented-candle-scented-soy?click_key=50e70c0816007373c6b691bacf1eeb4af4531c0d%3A291976457&click_sum=f87fd824&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-12&pro=1",
    "title": "Strong Coffee Scented Candle | Scented Soy Candle | Coffee Candle | Candle Handmade | Personalized Candle | Candle Gift",
    "description": "I love coffee!  But what do I love more than the taste of coffee, the smell of coffee.  Our Strong Coffee scented candle smells like you are brewing a fresh pot.  Now you can enjoy the rich, bold scent of coffee any time of day without the caffeine jitters.Hi, welcome to Hello You Candles!  Our Strong Coffee Candles are made with 100% American grown, eco-friendly soy wax, and we only use clean burning fragrance and essential oils to scent our candles. Our candles are always free of dyes, harsh chemicals and pollutants and are hand poured in our shop in Laguna Hills, California.  A clean candle is a better candle, better for you and better for the environment.WHAT YOU WILL RECEIVE:1 - 4 oz, 9 oz or 16 oz soy candle in the design shown above, complete with your personal message printed on the back of the candle.PLEASE NOTE:  Due to very limited space on the 4 oz mini we we recommend keeping your message to 15-20 words.  Longer messages may need to be printed on a card rather than the back of the candle.CANDLE SCENT:  Please choose your scent choice from the drop down.  If you would like more information on our current scent options please click the link below to visit the \"Current Candle Scent\" section of our shop:https://etsy.me/3x3H5edSIZE GUIDE:~ 4 oz candle measures approximately 3 inches tall and 2 inches in diameter, 20 hour burn time~ 9 oz candle measures approximately 3.75 inches tall and 2.75 inches in diameter, 40 hour burn time~ 16 oz candle measures approximately 5 inches tall and 3 inches in diameter, 70 hour burn timeWe ship all candles via USPS 2-3 day priority mail. Please check our shop announcement for our current lead time.OTHER HELPFUL INFO:We do offer a discount on bulk orders, please contact me for details.",
    "reviews": [
      "Wish I had read the description better and ordered a bigger size. The gift itself came exactly as described and smells wonderful!",
      "These made for such fun gifts",
      "It really smells like coffee.",
      "Such fun candles & they smell amazing"
    ]
  },
  {
    "productId": "EVuXOpOkAO",
    "url": "https://www.etsy.com/listing/267294526/decorative-easter-eggs-artifical-easter?click_key=be68c8e9f32112652986810bbef707f0b3c85f8a%3A267294526&click_sum=eadb8144&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-13&frs=1&etp=1&sts=1",
    "title": "Decorative Easter Eggs, Artifical Easter Eggs, Dyed Easter Eggs, Speckled Egg",
    "description": "Decorative Easter EggsI love Easter.  It marks that time of year when the world bursts forth with color and we greet spring .  These hand dyed artificial eggs bring all those spring colors into your home.   You will receive a set of 12 hand dyed and hand speckled artificial, plastic eggs.  Add them to your Easter Egg Tree or place them in a vase on your dining room table.  If you are feeling adventuresome make a wreath or swag incorporating these beautiful eggs.  Scatter them across your  fireplace mantel or display them in a bowl on your foyer table.You will receive 12... all 12 hand dyed and hand speckled.  The plastic eggs measure approximately 2 1/2 inches by 1 3/4 inches and you have several color choices to choose from.",
    "reviews": [
      "Very realistic great quick service",
      "The seller was responsive and the eggs are  perfect for Easter decorating.",
      "Worked out perfectly to add my table centerpiece. Very good quality",
      "Simply awesome.  Packed carefully too.  Thank you"
    ]
  },
  {
    "productId": "odbooKpfeM",
    "url": "https://www.etsy.com/listing/267098338/pineapple-front-door-wreath-front-door?click_key=b80f13e1e72aa55039644205dbc9579293656d04%3A267098338&click_sum=3aca8d33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-14&pro=1&frs=1&sts=1",
    "title": "Pineapple, Front Door Wreath, Front Door Decor, Pineapple Decor, Door Hangers, Elegant Door Wreath, Door Decorations, outdoor wreath",
    "description": "🌻 Add a touch of charm and cheer,  while giving your home a warm and inviting atmosphere with this Pineapple Door Hanger. This wreath is full and created with love using a  high-quality steel, then powder -coated with a beautiful long-lasting UV finish with the intention of lasting longer than the average wreath in an outdoor setting. This wreath is a classic and will compliment any decor.▬▬▬▬▬▬▬ WHATS INCLUDED ▬▬▬▬▬▬▬*1 EA ( Personalized metal sign like the example photo )**Mounting hardware is NOT included▬▬▬▬▬▬▬ SIZES AVAILABLE ▬▬▬▬▬▬▬• 20\" Tall x 10\" Wide (seen in photo 1&2- color metallic gold)• 26\" Tall x 13\" Wide (seen in photo 3- color golden yellow)Available with or without an over-the-door hook for easy hanging.Over-the-door hook dimensions are1\" wide x 16\" Long🔆FEATURES & DETAILS🔆• Made of Heavy-Duty, American-Sourced, Cold-Rolled Carbon Steel• Each sign is hand-designed and laser cut using top-of-the-line laser technology, which produces superior cuts & and precise edges• Triple sanded for a high-quality, smooth finish so it won't damage your door• Weights approximately- 12\" -2lbs , 18\" - 4lbs , 24\" -6lbs, 30\" -10-12lbs.•Professionally powder coated on both sides for indoor or outdoor use.• Fade & Rust Resistant• All text will be showcased in uppercase lettering like the listing photo.🔆EASY ORDERING INSTRUCTIONS🔆1. Select your preferred SIZE and add-on options. from the first drop-down menu (All sizes are shown in inches.2. Select your POWDER COAT COLOR selection from the second drop-down menu (If your preferred color is not listed in the dropdown menu, please select “Other”, then type the name of your color selection in the “Add Your Personalization” box at the bottom of the form)3. Enter your personalization details if required - see the instructions above the personalization box section. Please be sure to include all personalization that is required.4. Add an item to your cart and proceed through checkout. Add any special notes in the “Notes to Seller” box at checkout.🔆OTHER DETAILS 🔆• Each sign is custom-made to order.• All items are intended for decoration purposes only, not intended for use by children, please handle them with care.•We Proudly offer Free shipping to the Contiguous United States for this item on orders over $35.For shipping to Alaska, Hawaii, and Puerto Rico, please contact us for a shipping quote• We welcome custom orders, contact us with your ideas for a quotation.•If you have any questions or concerns, please contact us! We are always happy to assist.Be Happy and blessed!The HouseSensationsArt Team▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬***Please see store announcements, store policies, and FAQs for additional details.▬▬▬▬▬▬▬ CONTINUE SHOPPING ▬▬▬▬▬▬▬Find our other great home décor items here:https://www.etsy.com/shop/housesensationsartThank you for considering HOUSESENSATIONS Metal Art!▬▬▬▬▬▬▬ LISTING PHOTO DETAILS ▬▬▬▬▬▬▬PHOTO COLOR:  Metallic Gold 20\" tall    Thank you for shopping with HouseSensationsArt",
    "reviews": [
      "Beautiful, love everything about it.",
      "This is a beautiful door hanger. The quality is excellent.",
      "It’s way more pretty in person!",
      "Got this as a gift for son and his fiancé.  He loves it, and she likes it and likes it more because he loves it.  Very pleased with the speed it was sent and based on the reviews from son and fiancé, it was worth it."
    ]
  },
  {
    "productId": "sAxNTudbJr",
    "url": "https://www.etsy.com/listing/110728100/inspirational-wall-decals-youre?click_key=14f503d33291fb7968fabbc164e5d30a8a424c1a%3A110728100&click_sum=cd348afe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-15&frs=1&etp=1",
    "title": "Inspirational Wall Decals - You're Beautiful - Bathroom Wall Decals - Mirror Decals - Mirror Sticker - Wall Decals - Wall Decor - Decals",
    "description": "Welcome to Luxe Loft! All of our designs can be made into decal stickers OR single use stencils for painting on a surface! Simply indicate in the text box when you order whether you would like a DECAL or a STENCIL!Inspirational Wall Decals - You're Beautiful decal by Luxe Loft - The Original you're beautiful mirror decal as seen on the Elvis Duran Morning Show, Glamour Magazine, and Hallmark Home and Family. These decals can be used on mirrors and walls.For many years of my life, I struggled with low self esteem and poor body image. I would look at myself and see an ugly person who was never pretty enough or good enough. In 2012, I came up with the idea to create inspirational mirror decals to put on my mirror to help me remember that I am beautiful. Since then, this design has changed thousands of lives for the better, reminding them that they are truly beautiful.Our You're Beautiful wall decals are so inspirational. Use them as mirror decals for a daily dose of motivation. We're all guilty of looking in the mirror and grumbling about how unattractive we think we are. These mirror stickers say You're Beautiful and are the perfect way to remind someone daily that they truly are beautiful. This decal makes great gifts for mom, gifts for women and gifts for girls. They also make great wall decals for kids who need to hear that they are beautiful.These decals can be used as mirror decals or wall art, and can be applied to any smooth clean surface. All of our wall stickers have a matte surface and are cut out with no backgrounds, so our decals will look like they were just painted on.This product and design is protected by law under DMCA. Any designs or photos stolen will be removed immediately and if not complied with will be punishable by law. If you see anyone selling this design or using my photos, please contact me immediately.This design is property of Luxe Loft LLC (c) 2012.View the rest of our shop here:www.luxeloft.etsy.comLike us on Facebook and be the first to know about our sales and new products: https://www.facebook.com/LuxeLoft/",
    "reviews": [
      "Made my wife happy thank you",
      "Can't wait to put this on my daughter's mirror!!!",
      "So cute and easy to apply"
    ]
  },
  {
    "productId": "NScVeCuRFR",
    "url": "https://www.etsy.com/listing/568318925/last-name-established-sign-personalized?click_key=2a5753110508b8d56532f27c6c283d2d770f4b00%3A568318925&click_sum=b610a374&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-16&pro=1&frs=1&sts=1",
    "title": "Last name established sign, Personalized wedding rustic gift, Custom home wall decor, 3D last name wood sign",
    "description": "These beautiful 3D Family signs are a stunning display piece in your home or or will be a unique wedding or anniversary gift for the coupleThe raised lettering creates an appealing 3D effect that adds depth and character to the piece.Wood signs make amazing Personalized Christmas, Wedding, Anniversary, Housewarming.◈ ABOUT  SIGN ◈All our signs we produce manually.We carefully select each board, and then paint  to give your sign a textured appearance, it serves as a rear plate backgroundThe backboard is made from 1/2\" Baltic Birch plywood giving a strong and sturdy base. The letters and graphics are cut from 1/4\" plywood then mounted on top.The cut raised lettering of these signs gives depth and adds a gorgeous 3D effect.Please note that the lettering is a natural wood color.  You can see this effect as well as the feel to the touch.You will truly be impressed by the level of detail and quality of our signs and decor.Signs can be hung with the provided sawtooth hanger◈ SIZE ◈Approximately 6\" x 13\" or  8\" x 20\"Both with a thickness of 3/4\" that allows items to be more robust.Different Background colors (see photo)The letters on the sign are NOT PAINTED - the letters are the color of natural woodThis item comes with a saw sooth hanger for easy hanging◈ PERSONALIZING YOUR ORDER ◈Please provide the following in the \"personalization\" box upon check out:- Last Name- Est. date (or date)- - - - Example - - - -Complete the pattern:AndersonEst. 08.18.2017 (or August 18, 2017)◈  IMPORTANT ◈Please provide the information exactly in the 'personalization box' EXACTLY how you would like it on the sign.This includes capitalization, punctuation, and spelling.Ensure all names and dates are correct as we custom make the sign exactly to your specifications.Please understand the actual colors may slightly differ from one monitor to another.Please note that all signs and decor are handmade from wood with different grains and natural imperfections. This means that there are slight variations from one piece to the next.Wood is a wonderful product. This makes it possible to make each sign individual and unique.◈ CUSTOM  ORDER  ◈YOU WANT SOMETHING DIFFERENT?  Custom order - for YOU!This sign is completely customize-able so please don't hesitate to message us with specific requests.And we will make a personalized layout for you. We will send you for approval and after your approval we will begin production",
    "reviews": [
      "Gorgeous personalised sign! Made to our exact specifications and packaged securely. Shipped promptly and arrived well ahead of predicted delivery date. Thank you so much! We love it!",
      "The family owned company is located in Ukraine and I was happy to support them! Ordered this for my niece’s wedding and turned out beautifully!! I would buy from them again for sure!! Thank you!",
      "Excellent customer service, answers right back, packaged the item nicely so there wouldn't be any damage, and the wood piece is beautiful. My husband and I both love it!!",
      "It was completely perfect! My parents loved it so much and they cried!! Thank you so much"
    ]
  },
  {
    "productId": "NxvGzKHsky",
    "url": "https://www.etsy.com/listing/175420905/baby-mobile-bird-mobile-for-baby-crib?click_key=d5adbf3929b84076c087fa58809d66de849dfca6%3A175420905&click_sum=c4f60c42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-17&frs=1&etp=1",
    "title": "Baby Mobile, Bird Mobile for Baby, Crib Mobile, Baby Shower Gift, Mobile for Nursery, Modern Mobile, Woodland Mobile, Ceiling Mobile Birds",
    "description": "Beautifully simple.With our bird mobile gently moving overhead, your baby is sure to be delighted. Each baby mobile is carefully made by us from the finest quality 100% merino wool felt. Modern yet timeless; these unique mobiles will bring joy to your entire family.DETAILS>  Premium Wool Felt Imported from Germany>  Felt dyes are colorfast and will not fade like paper/plastic>  Available in 33 beautiful colors>  Drop from ceiling: 42 inches (length of cord can be shortened for use on a mobile arm)>  Width: 14 inches>  Height (from top of wood piece to bottom of lowest bird): 17 inches>  Size of birds: 3.75 inches wide x 2 inches highWe include a free ceiling hook with each purchase. The mobile is designed to hang from a standard 8 ft. ceiling height. For higher ceilings we can also include an extra piece of cord (at no additional charge) that will allow you to adjust the overall height to suit your nursery. Please let us know if you would like this to be included.  This mobile may be hung from a crib arm but it's essential that it must remain completely out of reach at all times.Each mobile is carefully packaged in a gift-able box and shipped in a water-resistant, tear-proof bag for protection.CUSTOM COLORSThis mobile was created using the colors red, orange, yellow, pistachio, turquoise and purple. We are able to create this mobile using your choice of colors at no additional charge. Please add a note to your order specifying which colors you prefer.** Please remember that this mobile is not a toy and should be kept completely out of reach of babies and young children.OTHER MOBILE THEMESAirplanes:https://etsy.me/2WZXfl9Elephants:https://etsy.me/2DJ6kWLHot Air Balloons:https://etsy.me/2USTzzzModern Orbs:https://etsy.me/2To39taMORE DUNDRY HILLwww.etsy.com/shop/dundryhillSTAY IN TOUCHInstagram - www.instagram.com/dundryhillFacebook – www.facebook.com/dundryhillThis is an original design that we've spent months developing.  Please do not copy for resale.© 2019 Dundry Hill LLC - All Rights Reserved",
    "reviews": [
      "Beautiful products that my little one loves looking at. This mobile not only looks good but also my little one adores. It gives me a second to go use the bathroom, clean, or organize knowing they're safe and entertained in  their crib. The colors really pop and the quality is really great.",
      "My son and his wife are just delighted with this mobile for their infant son.  And it arrived quickly even in Canada.",
      "Perfect! It came carefully packed and in the custom colors I requested. It's so incredibly cute and my daughter loves staring up at it.",
      "good quality materials, very nicely made, exactly as pictured."
    ]
  },
  {
    "productId": "bXWgBOkwBT",
    "url": "https://www.etsy.com/listing/211997304/one-pair-of-12-inch-beeswax-candles-tall?click_key=fcdaf2377a9f2780abfc00c57a356e1a18429786%3A211997304&click_sum=f8888142&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-18&pro=1&sts=1",
    "title": "One Pair of 12 Inch Beeswax Candles - Tall Tapers - Beeswax Candles - Beeswax Tapers",
    "description": "Pure beeswax candles made with wax sourced from the finest US east coast apiaries. Handmade, one at a time, by me in my Hudson Valley NY studio. Beautiful beeswax candles have a natural honey scent, burn longer and brighter than other types of wax candles, and are considered “dripless,” if burned correctly, undisturbed, away from any drafts, and in a properly sized holder appropriate for burning candles. There is no guarantee that beeswax candles will not drip or run, so appropriate precautions should be taken to avoid melted beeswax getting on tablecloths, surfaces, etc.  Each pair of 12 x 7/8\" tapers is approximately 6 oz. These candles will fit most standard candle holders. Tapered candles shown in a rainbow selection. See other photos for more colors. Be sure to select ONE color PER PAIR of candles at checkout.-This listing is for ONE PAIR of candles. One pair = two individual taper candles- 100% natural beeswax from established northeast US beekeepers.- Organic cotton wick.- Each 12\" taper burns approximately 12-14 hours, depending on conditions in the environment. Please don’t burn in drafty areas. This negatively affects burn time and promotes dripping.- Smokeless, relatively “dripless” when correctly burned, and non-allergenic.- Handmade candles have naturally occurring imperfections that enhance their rustic loveliness, so please allow for some inconsistencies.- Ivory and yellow candles are un-dyed, un-bleached, pure filtered beeswax.- Colored candles are dyed with eco-friendly, non-toxic dyes. Note that colors may appear slightly different in person due to variations in computer monitors. Colors may also vary slightly from batch to batch.- Handmade candles have naturally occurring imperfections that enhance their rustic loveliness. Please allow for minor inconsistencies.Handmade to order! Please contact me ahead of ordering if you want to arrange a rush order.",
    "reviews": [
      "The candles have arrived and look lovely in the place that I have chosen in my home.",
      "Thank you! I appreciate the photo too. Enjoy!",
      "What an amazing product! The seller is wonderful as well, she noticed a issue with the carrier and worked quickly to solve the issue. I've already told my friends and family this is the shop to order from! I will be buying again!",
      "Thanks a million! Appreciate the repeat biz ✨💫",
      "Elizabeth is a great merchant and her candles are beautiful. I highly recommend this vendor!",
      "Thank you! So happy to help you! 🌟",
      "Colors are beautiful and they were packaged very carefully to ensure no damage.",
      "Thank you for the lovely review. Enjoy your candles!"
    ]
  },
  {
    "productId": "PLniKXWRpU",
    "url": "https://www.etsy.com/listing/477563341/5th-anniversary-gift-for-him-soundwave?click_key=67a651609482da5ac55bd05fb4a81b48c867d341%3A477563341&click_sum=fe3f4d9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-19&frs=1&etp=1",
    "title": "5th Anniversary Gift for Him | Soundwave Art | Wood Anniversary | Voice Recording Gift",
    "description": "A creative traditional 5 year anniversary gift printed on wood. Use a voice recording or a favorite song to create a unique and memorable soundwave art gift for your 5th anniversary or any occasion for your husband or wife. They can scan the optional QR code to play the voice message or song. This personalized gift will bring back memories for years to come.We take your recording and turn it into a piece of art that visually captures the details of your voice, a song, or any sound.See what our customers had to say about our products and customer service:https://judge.me/reviews/artsy-voiceprint.myshopify.com★ WOOD PRINT• Printed directly on 3/4\" thick premium baltic birch wood, each wood print will vary in wood grain• Comes ready to hang• Specialized printing process which prints directly on wood resulting in super vibrant colors, retaining high quality without sacrificing clarity.• Protected against moisture & heat to give you a print that will last for years to come.• Easy to clean. Simply take a take a sponge or rag with water and wipe off without fear of smearing.• Sizes up to 11\"x14\" include a stand.★ HOW TO CUSTOMIZEPlease refer to the \"Add your personalization\" section above to see what we need to create your custom print and enter your information in the text box provided.CUSTOMIZE WITH A SONG - In most cases, we only need a link to the song on YouTube. If you have an MP3 file of the song, please email it to [support@artsyvoiceprint.com] with your order number and last name in the subject line.CUSTOMIZE WITH A VOICE MESSAGE  - You can easily record a voice message on your mobile phone using your Voice Memos or Voice Recorder app. You can also use the video recording feature if it's easier. Please email the file to [support@artsyvoiceprint.com] Please email the file to [support@artsyvoiceprint.com] with your order number and last name in the subject line. Please email the file to [support@artsyvoiceprint.com] with your order number and last name in the subject line.★ SCAN QR CODE TO PLAY RECORDING• A small card with the QR code printed on it is included with your order. We can print an optional gift message on the card. The QR code will play the recording for your order when scanned with your phone's camera.• You can also request to have the QR code printed on the art itself.★ FREE PROOF - You can choose to preview the art, but please note it adds 1-3 business days to the processing time. We will send a digital proof to your email for approval. If we don't hear back after 2 attempts, we will send the art to print in order not to delay your order.★ SHIPPING & TURNAROUND TIMES• Wood prints usually ship in 3 business days and arrive in 2-5 business days depending on your location in the US and your order size.• International orders take 6-10 business days, or longer if held in customs. International shipments may be subject to import taxes. It is the customer's responsibility to pay for these taxes.• Expedited shipping is available as an upgrade at check out, but please take note that it only expedites shipping, not production time.• Ships from California, USA★ HAVE A QUESTION?• We're happy to help, send us a message via Etsy Conversation by clicking \"Message the Seller\" below.★ WHY BUY FROM ARTSY VOICEPRINT?We specialize in sound wave art and have been customizing meaningful gifts since 2013. We are fortunate to have taken part in over 45,000 memories and special celebrations in the US & worldwide and are proud of the 5 star reviews we've received from over 7,000 satisfied customers.See what they had to say about our products and customer service:https://judge.me/reviews/artsy-voiceprint.myshopify.com• Shop our entire collection -https://www.etsy.com/shop/artsyvoiceprint5th Anniversary Gift for Him | Sound Wave Art QR Code | Wood Anniversary Voice Recording",
    "reviews": [
      "Perfect gift...wife loved it.  thanks again!",
      "Extremely pleased with what I received! It’s beautiful, sturdy, and exactly how I envisioned it. The process was really quick and I was sent a proof 2 days after I ordered it. My husband absolutely loves it!",
      "This turned out better than I could have imagine!  Great quality and communication!",
      "This gift blew me and my wife away. I had no idea after putting all the information in the boxes how the overall product would turn out! The soundwave was cool, the feel of the board was bery nice and the QR code she scanned worked instantly. We sat and listed to our wedding somg as we exchanged gifts. \n\nAlso, my wife was a huge fan of whatever that wrapping paper was! \n\n\nA plus all around."
    ]
  },
  {
    "productId": "CDlqTVAYoS",
    "url": "https://www.etsy.com/listing/250419092/mini-snowflake-ornaments-from-nestled?click_key=cb5e9facfcb239e37e08e787d6b28019ec87e0dc%3A250419092&click_sum=8790376f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-20&etp=1",
    "title": "Mini Snowflake Ornaments from Nestled Pines - Gift Box set of 15 . All New Designs",
    "description": "Our mini snowflake ornament gift box set features eight brand new snowflake designs in a variety of wood species including Black Cherry, Black Walnut, Red Oak, Maple, Aspen, and Aromatic Red Cedar.  These cute little treasures in a box will make the perfect holiday gift for friends and loved ones!The chocolate colored paper gift box is made in the USA from 100% post consumer materials.  100% recycled polyester material was used to make the cranberry ribbon and bow adorning the box lid.Each of the mini ornaments measure approximately 1 1/2\" in diameter, and are finished with a non-toxic food safe oil to protect the wood and enhance its natural beauty.Free Shipping in the USA for orders over $35!------------------------------------------------------------------***Customer Feedback***--\"Stunning! Great purchase\"--\"Beautiful little snowflakes! They were carefully packed and arrived quickly. I will be buying again\"--\"Love, love, love these ornaments! Beautiful and great detail. And they smell wonderful. Cute packaging as well. Quick delivery too! Thank you!\"------------------------------------------------------------------",
    "reviews": [
      "Beautifully made! Shipped fast and came beautifully packed!",
      "These ornaments look fantastic and well-made.",
      "These ornaments were a little smaller than I expected. But, they added a charming, unique touch to my small Christmas tree."
    ]
  },
  {
    "productId": "dyDJdXYVFX",
    "url": "https://www.etsy.com/listing/541052534/family-name-sign-wedding-gift?click_key=62e6fea644458b293110b4fda3744db1288a0f10%3A541052534&click_sum=7e49fa27&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-21&pro=1&frs=1&sts=1",
    "title": "Family Name Sign | Wedding Gift | Housewarming Gift | Christmas Gift | Last Name Sign | Bridal Shower Gift | Family Name Established Sign",
    "description": "Last Name Sign, Family Name SignWANT A COMPLETELY CUSTOM SIGN? Click the link below to view our customizable listing!https://www.etsy.com/listing/1278969903/customized-wood-sign-custom-sign-for?Family name sign. Frames Wood Established Sign💵 Save 25%  WHEN YOU BUY MORE THAN ONE ITEM! WE HAVE OVER 300 ITEMS LISTED FOR SALE, Click our shop name or the link below to view them all 🤩https://www.etsy.com/shop/rootedngroundedhome?________________________________________________________________________________________________________________________________Dimensions--8x22 inches-10x28 inches-12x32 inches-14x38 inches-16x44 inches-18x47 inches(can vary by a 1/2 inch)________________________________________________________________________________________________________________________________Hanging-We have made hanging very safe and easy. The sign has a hanging system built into the frame and comes with hanging instructions. Only screws or nails are needed to hang.________________________________________________________________________________________________________________________________Shipping and Turn Around Time-Please view turn around time at checkout. Etsy will tell you our estimated processing time before you purchase an item. We typically ship on a 2-5 business day turnaround, though that may be longer during the holiday season. The estimated processing time at checkout is always the most reliable estimation.We use Fedex Home Delivery or Fedex SmartPost to ship, depending on which is more cost effective. If you purchase the shipping upgrade, we will always send it the fastest method, Fedex Home Delivery.________________________________________________________________________________________________________________________________Please note-These are handmade and both the frame and the sign itself are wood. Due to the character of wood, sometimes small knots or natural imperfections are present. We always pick out the best looking pieces of wood, but also feel that slight imperfections help add to the character of our handmade signs. Back of sign is sanded but unpainted.________________________________________________________________________________________________________________________________Why choose Rooted and Grounded?We love what we do and love the idea that what we are making helps you add your personality and character to your home. We are very particular about our product. We take pride in making our signs and make sure we are happy with every piece before we send it out. If for any reason you are not happy with your sign, please let us know and we will work with you and do our best to fix it.________________________________________________________________________________________________________________________________Custom OrdersWould you like a custom order??? We love to do custom orders! We can change any of our current sign or design a new sign for you. Just send us an etsy conversation and we can discuss what you are wanting. We will create a custom listing with your name on it for purchase. Also check out our shop policies for custom signs.***check out our similar signs below***rootedandgroundedhome [!at] etsy.com",
    "reviews": [
      "Great wedding gift! Thank you",
      "Great solid artwork, script is beautiful!",
      "Love every piece I have purchased from rooted and grounded!! Excellent as always!",
      "I have ordered name signs from this etsy shop for four bridal showers, and I truly believe that they are one of the most thoughtful gifts! The quality is amazing, shipping is prompt, and the couples always love them! 😊"
    ]
  },
  {
    "productId": "CsfFhCwUCl",
    "url": "https://www.etsy.com/listing/483162425/stained-glass-spider-web-cornerhome?click_key=23d1d626105c7aea76b58fbb70fac0a1913800d7%3A483162425&click_sum=90414d5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-22&frs=1&etp=1",
    "title": "Stained Glass Spider Web Corner,Home decor, Garden decor,spider web decor, halloween decor, stained glass,garden, corners, magical, unique",
    "description": "These Stained Glass Spiderweb corners truly make awesome magical & whimsical decor!Keep up all year or just for Fall & Halloween, This Handcrafted Piece is a showcase piece all in itself.Adorn in your window & room corners or for your outdoor decor!Each piece is hand crafted to order and will include a variety of different clear textures & types of glass, making each one individually special & unique JUST like a real spider web!To hang your Webbing just apply small screws to the eyelet holes attached to framingMeasuring 7 1/4 by 8 1/4 \"It has four eyelets.  Two on each side to Mount with small screws 💕***This is Authentic Stained Glass, Stained glass can have gorgeous ripples and bubbles in the glass from its creation making it unique. There is no film on my glass to give the iridized look. The iridization was fuzed into the glass when the glass was madeCompletely Authentic Stained Glass****",
    "reviews": [
      "Absolutely gorgeous! I got it for a friend, but I will definitely be getting another for myself!",
      "Beautiful item and fast shipping",
      "So beautiful! My sister in law loved this beautiful piece for her new house. She’s excited to put it up!"
    ]
  },
  {
    "productId": "WnKpygwwCj",
    "url": "https://www.etsy.com/listing/530022913/gather-sign-up-to-42-color-options?click_key=4b0a922270dbdc6eb0de6c9b1d4512b04e13c673%3A530022913&click_sum=603000f8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-23&frs=1&etp=1&sts=1",
    "title": "Gather Sign up to 42\", color options, Gather word cutout, 1/2\" thick wooden letters gather sign, Gather cutout",
    "description": "Welcome to Bell & the Whistle.  We're a small woodshop in rural Arkansas, and we love making unique and special decorations for our customers.Scroll through the pictures above to see our COLOR CHART and KEY HOLE hanging option.We offer 4 stock sizes to choose from.  Please note that the height is measured from the top of the 'th' to the bottom of the 'g'.  The length is measured from the tips of the swashes on each side.42\" x 11\"36\" x 9.5\"28\" x 7.25\"22\" x 5.75HOW IT'S MADE:Lettering is cut from 1/2\" birch plywood using a CNC router which creates a clean and consistent cut.  Each piece is sanded on front and back before being painted to your color choice. If you would like a distressed finish, we sand the paint to create this rustic look. To get this option, mention it in the Notes box at check-out.WALL HANGING:Our key hole hanging option is a ready-to-hang system and includes all the hardware you need for mounting to wood or drywall.  Key hole slots are cut in the back of the word and screws are included. This hanging method is sturdy and invisible. All you will need is a Phillips-head screwdriver.  Select this option in the dropdown menu on the left before adding to your cart.Our standard option does not include hanging hardware.  Some good methods for hanging are: Command Strips, glue, or small nails in the open spaces of the letters.Because of the nature of the lettering, it is somewhat fragile and we recommend hanging it securely and out of reach of kids or pets.LEAD TIME:Each item is made to order. Our lead time is approximately 1-2 weeks after receiving payment. Items are shipped using USPS priority mail which arrives in 2-3 days. We cannot guarantee shipping times; these are just estimates. We pack our orders carefully with double-wall corrugated cardboard. Recycled packaging materials may be used.",
    "reviews": [
      "I am really happy with with this product!",
      "I love the simplicity of this piece in my home. Even a simple as it may seem…it speaks volumes in our home. Thank you.",
      "Just as pictured. Very satisfied, looks great to bring the room together",
      "Good quality sign. Looks great in my kitchen."
    ]
  },
  {
    "productId": "bN1iWUTcUK",
    "url": "https://www.etsy.com/listing/260512255/greyhound-dog-ornament-with-heart-made?click_key=f61ea2b665a8a57adaf4835d6cf0a35c3c4bc91e%3A260512255&click_sum=c25a8d97&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-24&frs=1&etp=1&sts=1",
    "title": "Greyhound Dog Ornament with Heart made from Recycled Raw Steel Rustic Farmhouse Pet memorial Pet Loss Gift Dog Love Sustainable Christmas",
    "description": "Size: 1.25\" x  5.25\"Allow us to personalize this ornament with the name of your favorite pooch, or in remembrance of a beloved pet that has passed on.Personalization is limited to 12 characters with no font options available.  A character represents a single letter or number.ABOUT THE MAKERS: Each piece is thoughtfully designed and created from scratch by us, Brandon and Erin Spangler, in Northwest Georgia. We use a CNC laser table to cut out our raw steel creations and then run each item through our finishing machine. Afterwards we hand tie a piece twine along with our story / care instructions card to every item.MATERIALS:Our creations are made out of 14 gauge hot-rolled mild steel covered with a thin layer of black oxide (magnetite) which is responsible for its dark gray/bluish tint. While this provides a level of protection against corrosion, a beautiful patina of rust can be brought out by a minimal amount of exposure to humidity. If the rust is unwelcome you may rub grade 3 coarse steel wool over the top to remove any and/or all rust.RAW STEEL MATERIAL: We use raw 14 gauge hot-rolled mild industrial steel, which the most recycled material in the world. The color, shades, and variations in the raw steel (raw metal) appearance varies from sheet to sheet. Due to the nature of working with recycled materials each piece will likely vary from the picture.Since metals are inherently recyclable and can be used over and over again, minimizing their negative environmental impacts and saving energy. So please keep in mind that each piece may vary from the picture as our raw metal is created from recycled steel giving little variations (such as color) to each sheet.****PLEASE NOTE*****Please make sure that you fill in the correct shipping address at the time of purchase in the provided shipping information section (not the special notes), or the destination of your order is not guaranteed.",
    "reviews": [
      "Perfect for our Sandy Paws event! Thank you!",
      "Perfect for our Sandy Paws event! Thank you!",
      "Thank you for the ornament!",
      "Ornaments were exactly as pictured"
    ]
  },
  {
    "productId": "wBghmOwdXQ",
    "url": "https://www.etsy.com/listing/226367204/small-desk-sign-office-decor-quote-block?click_key=e722d1fb502277da1d59e0cd670bbe1b0f51a189%3A226367204&click_sum=87612c10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-25&etp=1&sts=1",
    "title": "Small desk sign, Office decor, Quote block, Funny quote, Wooden sign, Fun gift, Mini sign, Desk accesssory, Of course I talk to myself,",
    "description": "Wooden quote block with the quote \"Of course I talk to myself. Sometimes I need expert advice\".Ever been caught talking to yourself? Now you have a great comeback.🌼 COLOUR OPTIONS (see photos for samples)Distressed Black -https://www.etsy.com/ca/listing/1169425605Whitewash - Wood grain shows through the whitewash. Text is black.🌼 FEATURES- Free-standing, so no need to damage your walls- Available in 2 colour options to fit into any decor- Made from salvaged construction lumber to reduce waste- Small size makes it the perfect accessory to add a touch of inspiration to your home- Over 100 pre-designed quotes to choose from🌼 SIZEWidth- 3\" (7.5cm)Height- 3\" (7.5cm)Thickness- 1.5\" (3.5cm)🌼 USESPlace on a desk, dresser, shelf, night table, kitchen counter, side table, window sill... or wherever!Don't like it in that spot? Just pick it up and move it.🌼 CARE-Wipe with a dry or slightly damp cloth.-Blocks are intended for indoor use.-Front of the block is sealed with a water based varnish for durability.🌼 CUSTOM ORDERSCan't find what you're looking for? Let us design a custom block just for you!https://www.etsy.com/ca/listing/562124061/custom-sign-corporate-gifts-business?ref=shop_home_feat_2&bes=1(if the link doesn't work, we may not be accepting custom orders, but you can always message me to be put on the waiting list)🌼 PROCESSING TIMESU.S. orders ship once a week with USPS. Orders placed by Tuesday will ship on Friday.Canadian and International orders generally ship on Wednesdays with Canada Post.Please check out our full policies here:www.etsy.com/ca/shop/DaisyThirteen?ref=hdr_shop_menu#policies🌼 GIFTSIf you mark your item as a gift, we'll \"pretty it up\" a little for you, free of charge. Your message to the recipient will be printed onto a notecard.🌼CLICK HERE TO SEE MORE OFFICE QUOTEShttps://www.etsy.com/shop/daisythirteen/?section_id=26536289🌼CLICK HERE TO SEE ALL OF OUR BLOCKShttps://www.etsy.com/shop/daisythirteen/",
    "reviews": [
      "Very cute sign to put on my desk at work",
      "My boss loved it! Good quality",
      "Super adorable!!  Great addition to my room as a giggle or conversation starter!!",
      "It was exactly as described. My friend loved it!"
    ]
  },
  {
    "productId": "DmGGfqMkXx",
    "url": "https://www.etsy.com/listing/281537172/moon-phases-wall-hanging-brass-moon-wall?click_key=db055ea411e6f9ff3102266afe591f85f205b03c%3A281537172&click_sum=a544b52f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-26&pro=1&frs=1&sts=1",
    "title": "Moon Phases Wall Hanging Brass Moon Wall Decor Full Moon Wall Art -  Moon Mobile - Moon Child - Lunar",
    "description": "This unique moon phases brass wall hanging is shiny and vibrant and works with more classic decor as well as colorful decor. It looks beautiful hanging on a wall or on a cupboard.Each of the elements is hammered differently and the big full moon in the centreApproximate size:Length 22.6\"/57.5cmWide 2.6\"/ 6.6cmFor other celestial wall hangings in my shop:https://www.etsy.com/uk/shop/CarmelsArt?section_id=31160045Please note: My work is 100% handmade items that are unique and no two items are identical. That's the beauty of the product! Please allow for slight variations from what is shown in the made to order picture.",
    "reviews": [
      "This is really so very beautiful. The Moon Phases Wall Hanging will make a great gift for a friend. She will love it.\nThank you.",
      "Thank you! I'm so happy that you like it :)",
      "am very satisfied, it fits perfectly in my apartment.",
      "Thank you for the good review!",
      "Beautiful very well packed good quality",
      "Thank you so much!",
      "Got four a gift and they loved it!!",
      "I'm so glad they liked it! thank you"
    ]
  },
  {
    "productId": "HEYwXGxhTZ",
    "url": "https://www.etsy.com/listing/201547702/christmas-gift-christmas-nativity?click_key=a5f1ee6e2365d60d731dff1f3eca68182038ae2c%3A201547702&click_sum=db210ce5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-27&frs=1&etp=1",
    "title": "Christmas Gift-Christmas-Nativity-Nativity Set-Nativity Scene-Gift-Manger Scene-Gift for Sister-Gift for Mom-Ceramic Nativity-Wedding Gift",
    "description": "NOMINATED FOR ETSY 2023 DESIGN AWARD! This handcrafted pottery nativity creche is a free-standing, one-piece manger scene debuting my new contemporary style.Perfect for the collectors!  Combining Speckled Buff with a white clay, each work of art is rolled, textured and assembled by me in my Arizona studio.  After the first trip through the kiln, the bodies and manger are coated with my new Peacock blue before its second firing at 2250 degrees.  Back support brackets are then added for easy display.Not just for Christmas, anymore...These make EXCELLENT gifts for the hard-to-buy-for, the collector, even for the newlyweds!  Many clients report how they display their set year-round.  They are fairly sturdy, yet not recommended for little ones hands, for obvious reasons.Piece measures 5” tall x 7” long x 2” deepFREE USPS GROUND ADVANTAGE SHIPPING! Order by December 16th to receive by Christmas!ALLOW FOR SLIGHT VARIATIONS IN THE GLAZE, AS EACH PIECE IS 100% HANDMADE!!!  I am more than happy to send a pic of your set prior to shipment.**  Here a blog, there a blog, everywhere a blog-blog... stop by and visit me on my new blog: http://artsyfartsydaina.blogspot.com/As per U.S. Copywrite law, this design is specific to Pottery by daina and therefore protected.",
    "reviews": [
      "This was a wonderful, artistic piece! I was thrilled with the quality and with the immediate, friendly interaction with the artist.  I would certainly recommend looking at all of her work if you need a unique, beautiful gift for yourself or someone you love!",
      "Beautiful simple nativity scene. Could be used just for Christmas but I have it up all the time. Gorgeous,. Thoroughly recommend I bought several things from this maker. All of them lovely",
      "I have ordered from here before. I’m just as happy with this as I was my other items. 5 stars",
      "Beautiful simple piece of art!  Perfect Nativity for our sailing room!",
      "Carrie- it looks wonderful!"
    ]
  },
  {
    "productId": "VYAqOjWxEI",
    "url": "https://www.etsy.com/listing/246131668/vintage-tropical-botanical-print-set-no?click_key=614601d5d77785858c3b4cd1e01a0981a4de34bb%3A246131668&click_sum=dfb8fef3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-28&frs=1&etp=1&sts=1",
    "title": "Vintage Tropical Botanical Print Set No. 1, Giclee Prints, Pineapple, Art, Beach Decor, Coastal Art, Botanical Print Set, Poster, Palm Trees",
    "description": "***We Now Offer a Gallery Wrapped Canvas option for all of our prints and sets. This option is available in the \"Art on Canvas\" Category in the shop. ***Vintage Tropical Botanical Print Set No. 1 - Fine Art Giclee Print SetThis set features a set of 4 hand colored etchings from the 1770's by noted botanical illustrator George Ehret. Each illustration has been digitally enhanced and added to a lightly tinted background which enhances its vintage charm.***Frames are for display purposes and are not included.SIZES-----------------------------Available sizes & prices are displayed in the drop down menuBACKGROUNDS-------------------------------A picture of the background used with each print or set is also shown in the description photos.ARCHIVAL PAPER-------------------------------We have 2 premium archival options to choose from.Archival Canvas Textured Paper – an acid-free, PH-neutral Archival paper that has a beautiful matte, textured finish.Archival Smooth Matte – a substantial weight, acid-free, PH-neutral Archival paper that has a beautiful matte finish.PROCESS--------------------------------We use professional wide format Fine-Art Giclee Epson printers and Epson archival quality pigment based inks, which provide the most beautiful color gamut. The depth and clarity of color is truly impressive.Our prints arrive ready to frame and are sized to fit “off the shelf” standard retail frames.* Please be aware that actual colors may vary slightly from those shown due to the nature of handmade products in addition to how colors are displayed by individual computer monitor settings.OUR THANKS TO YOU----------------------------------Thank you for visiting Belle Mer Graphics and please don’t hesitate to contact us with any questions!Please visit our other Etsy shops for more vintage inspired art:Belle Botanica – Vintage Garden & Nature Inspired Fine Art Giclee Printswww.bellebotanica.etsy.comwww.bellebotanica.comBelle Maison Art – An eclectic mix of Natural History, Decorative Arts and Botanical Fine Art Giclee Prints.www.bellemaisonart.etsy.comwww.bellemaisonart.comBelle Mer Graphics – Vintage Fine Art Giclee Prints Inspired by the Seawww.bellemergraphics.etsy.comBelle Art Prints - DIY Printable Art for the Homewww.BelleArtPrints.etsy.com",
    "reviews": [
      "I purchased this as a gift for my sister-in-law, and she loved them! Quality shipping and paper.",
      "Great prints! Shipped quick and packaged well.",
      "Very beautiful prints. I hung them in my salon suite and I receive many compliments on them. 10/10"
    ]
  },
  {
    "productId": "VFYtsfKzmg",
    "url": "https://www.etsy.com/listing/157475413/giclee-art-print-of-abstract-painting?click_key=3e73d6198b9dbc85ed431386ce672009b3235a87%3A157475413&click_sum=c0f7240b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-29&pro=1&frs=1&sts=1",
    "title": "Giclée art print of Abstract painting signed by artist, pink, abstract prints, cloud landscape print, Wall Art prints, art gift, artwork,",
    "description": "Giclée Art print, Abstract painting, Colourful art, Pink abstract painting print, abstract wall art, contemporary artwork pink, sky clouds printThis is high quality and gorgeous giclee print from one of my original oil paintings.Title: Floating Clouds 02* It is professionally printed with Epson Ultrachrome k3 ink, which lasts up to 200 years.* It is optional printed on heavy weight, smooth and bright white matte paper, OR ultra thick and textured fine art paper. Please choose the type of the paper from the drop box on the right.* Matte paper: 192 gsm weight and 10.3 mil thicknessFine art paper: 330 gsm weight and 17mil thickness* Print is signed by artist in the border beneath the image and will come protected in a protective clear sleeve. It will ship to you in a rigid envelope or mailing tube depending on size.* Sizes Available (Listed in inches):10.2\" x 13.3\" image, printed on 11x 14 inches paper,12\" x 15\" image, printed on 13 x 17 inches paper,16\" x 20\" image, printed on 17x 22 inches paper,20\" x 25\" image, with an extra 2\" white border around image,For large print on canvas, here is the link:https://www.etsy.com/ca/listing/221723582/canvas-printscloud-print-abstract?ref=shop_home_active_3&frs=1&crt=1Framing Suggestions:All prints come unframed. Please kindly have it framed and it will definitely brighten up your room!!Picture credit: http://www.vanessafrancis.com",
    "reviews": [
      "Loved it - perfect in room",
      "I was looking for an abstract or impressionistic floral piece of artwork for a very long time.  I wanted to add a bit of softness to my mid century and Scandinavian decor; it worked nicely!   This art print is beautiful, and the quality of it is stellar.  Very pleased!",
      "Looks just as pictured. Fast delivery."
    ]
  },
  {
    "productId": "tyVFQEYVji",
    "url": "https://www.etsy.com/listing/508901284/winter-wreath-winter-decor-summer-wreath?click_key=06838a584b24a5d5e06b024894435e6bd13ce9e0%3A508901284&click_sum=7742fa38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-30&frs=1&etp=1",
    "title": "Winter Wreath, Winter Decor, Summer Wreath, Summer Decor, Farmhouse Wreath, Farmhouse Decor,Front Door Wreath,Home Decor, Spring Wreath",
    "description": "Welcome to The Brighter Side shop!  This is a place for creativity, expression, fun, and most importantly, beauty.  Creating is a passion of mine!  Everything you see was handmade by me, so please take your time and enjoy my shop. Make sure to check out my Instagram (thebrightersideco) page, and don’t forget to stop Pinterest for all my fun projects!This wreath is a perfect accent to any front door or empty wall space.  I personally love the rustic grapevine wreath contrasted with the white artificial hydrangea, burlap rose and soft pastel textures of Spring.  The beautiful hints of green with the natural beauty of the white flowers and blue foliage will bring warmth and add charm to any front door or wall.  The wreath shown is 18 inches across, 22 inches in length and 4 inches deep.Thank you so much for stopping by.  I hope my work has inspired and brought a smile to your face!  Find the bright side to each day!#thebrightersideco #dowhatyouloveCheck me out on Instagram, Facebook, and PinterestInstagram: thebrightersidecoFacebook: The Brighter Side CoPinterest: The Brighter Side Co***IMPORTANT***Please be aware that wreaths placed outdoors will weather or deteriorate over time from exposure to elements.  The wreath should be hung under a covered porch away from moisture or constant direct sun.",
    "reviews": [
      "Item arrived as listed, it’s beautiful",
      "Lovely wreath!! Exactly what I was looking for.",
      "This wreath arrived nicely packaged and exactly as pictured.  I'm very happy with it!",
      "Beautiful wreath…..I love it!!…..the colors are perfect and very well made\nThe seller was fabulous to work with….I will purchase from this seller again"
    ]
  },
  {
    "productId": "AGXXsPUepH",
    "url": "https://www.etsy.com/listing/170835267/custom-house-warming-gift-personalized?click_key=ba886c9a39f996703ea3754bf3e4179053043e62%3A170835267&click_sum=c1e47643&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-31&etp=1",
    "title": "Custom House warming gift, Personalized house ornament, Christmas ornament, Wood burning, New home, New house gift, Real estate gift, Couple",
    "description": "PLEASE ATTACH THE PICTURE WHILE YOU CHECK OUT OR RIGHT AFTER YOU PLACE YOUR ORDER.-The picture has to be 1000 pixels wide, .jpg, 300k in file size.-I NEED A GOOD PICTURE of the house, no persons or cars in front of it. I CAN'T PIECE TOGETHER DIFFERENT PARTS OF THE HOUSE FROM DIFFERENT PICTURES. I NEED THE WHOLE HOUSE IN ONE PICTURE. Pictures that are too dark or sunny won't let me see the details that I need in my work.************************************************************************************************************This is a unique personalized house ornament, the wood burnt version of the picture attached by you to a message.In my work I use the ancient technique of Pyrography, slow burning, by hand, of the design with quite a few different hot pens.This 4\" ornament will YEAR-ROUND pleasantly surprise anybody who will receive it as a gift: new homeowner, couples or family.OCCASIONS: new home, wedding, birthday, Valentine's Day, first home, newlyweds, First Christmas, new house, Just Moved, etc.Also, this wood burnt ornament makes a unique housewarming gift from a Real estate agency for their customers.PERSONALIZATION: I can fit one short line of writing at the top, and the year or a short address at the bottom of the ornament. Upon checkout, please write your instructions in the \"note from buyer\":DIMENSIONS:  4\" plywood circle, 1/8\" thick***************************************************************************************************IMPORTANT:-Please provide the picture of the house and the personalization/writing when you check out, or you can attach the picture of the house to any message, here on Etsy.All these requirements are for a good cause: before I start the drawing and then the burning, I look at the picture to understand the structure, materials, details, and then the SOUL of that particular house. My ornament has to \"speak\" to the owners, they have to have fun seeing their house on a 4\" little thing! :)For more GIFT IDEAS, you are welcome to visit the other sections in my shop (upper left side of this page:https://www.etsy.com/uk/shop/RivdomArtThank you so much for stopping by!",
    "reviews": [
      "Excellent service, very cordial interactions with the seller. This was the 4th purchase of these personalized Christmas ornaments for my children, over multiple years. Same great service every time! Thank you kindly!",
      "A beautiful piece of art that made such a heartfelt impression on the recipient. The artisan was communicative and got our order to us on time! If you are on the fence, go for it, you won't be dissappointed.",
      "This turned out so beautifully! Could not be happier",
      "Gabriela was so lovely to work with — all 3 of my ornaments were beautifully crafted, the details and nuances for each home were spot on! The order arrived quickly, with a cute boxes for gifting included. Highly recommend!"
    ]
  },
  {
    "productId": "e1HaqNpjF8",
    "url": "https://www.etsy.com/listing/66281583/owl-art-print-unique-home-decor-for?click_key=80f5c67268dd3e2357c69192fd02a52db1c8bb28%3A66281583&click_sum=009cdba9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-32&pro=1&frs=1",
    "title": "Owl Art Print - Unique Home Decor For Living Room and Bedroom - Illustration Print - Wall Decor - Owl Drawing - House Warming Gift - kitchen",
    "description": "Owl Art Print By Ashley Percival. Signed on the front (Frame not included).Printed on Beautiful Fine Art Paper 315gsm.PRINT SIZES:Standard UK Sizes:A4 - 8.27 x 11.69 inches, 21.0 x 29.7cmA3 - 11.69 x 16.53 inches, 29.7 x 42.0cmA2 - 16.53 x 23.39 inches, 42.0 x 59.4cmA1 - 23.39 x 33.11 inches, 59.4 x 84.1cmStandard US Sizes:8x10 inches14x11 inches20x16 inches18x24 inchesSHIPPING INFO:All orders ship within 2 working days. UK orders are sent 1st class. International orders are sent with tracking. All of my US orders are printed and shipped locally from US so none of my US customers will incur any additional customs cost.MORE ART PRINTS:https://www.etsy.com/uk/shop/AshleyPercivalPlease message with any questions.Thank you for looking!",
    "reviews": [
      "Absolutely love it, thank you.",
      "Looks so cute! Thank you!",
      "Looks great on the wall, would highly recommend",
      "Great art work, which I bought as a gift"
    ]
  },
  {
    "productId": "sRAkDhwmxu",
    "url": "https://www.etsy.com/listing/499244464/pressed-mimosa-smc-originals-watercolor?click_key=5861acbf184a9ede905923f8299cbde30ac5f86e%3A499244464&click_sum=82cbfe4e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-33&etp=1",
    "title": "Pressed Mimosa - SMc. Originals, watercolor painting, floral, modern, original artwork, silhouette, black and white art, deckled edge",
    "description": "SMc. Originals makes decorating easy with Watercolor Art Prints. Each print is a reproduction of my original watercolor painting and is perfect for any room in your home. Each design is printed on SAVOY 100% cotton paper. Prints work well alone or choose several to create a series of your own.Prints come unframed and are mailed with thick cardboard backing for added protection. Other sizes available (up to 30x40!) Custom Framing + Artist Canvas also available (see below links).PLEASE NOTE: The print in the photograph has a \"deckled edge\" which is an additional charge. If you would like this addition, please make sure to select the \"deck edge...\" option from the drop down menu.CUSTOM FRAMING : Click on the link below to see framing options.https://www.etsy.com/shop/SMcOriginals?ref=hdr_shop_menu§ion_id=19085117ARTIST CANVAS : Click on the link below to print on an Artist Canvas.https://www.etsy.com/listing/291478695/canvas-print-smc-originals-art-on-canvas?ref=shop_home_active_1I love custom work, so don't be afraid to ask.Visit www.smcoriginals.com to see my latest designs.Copyright SMc. Originals. All rights reserved.Copyrights are not transferable with sale.",
    "reviews": [
      "The quality is high and It looks exactly like the photo.  I messaged the seller and she responded back very promptly.",
      "Very nice quality print. Thanks",
      "Absolutely beautiful! Classy. Timeless. Quality.",
      "Love the picture and the quality was fantastic!!!"
    ]
  },
  {
    "productId": "xYndyHSkLI",
    "url": "https://www.etsy.com/listing/521660723/bohemian-yarn-tapestry-yarn-wall-hanging?click_key=3bb3dff4df6bca209f236a8bd2a1f54b6772a186%3A521660723&click_sum=57a39196&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-34&frs=1&etp=1",
    "title": "Bohemian Yarn Tapestry, Yarn Wall Hanging",
    "description": "Bohemian Yarn Tapestry - Grey, red, orange, cream.Sizes:Small: Length across 12'' x height 28''Medium: Length across 18'' x height 32''Medium/large: Length across 24''(2ft) x height 32''Large: Length across 36''(3ft) x height 32''Extra large: Length across 48''(4ft) x height 32''Extra Extra Large: Length across 60'' (5ft) x height 40''The length across or horizontal length is the length of the wood stick. The tapestry is a few inches shorter on both sides to allow room for tying the hanging string onto the ends of the stick.The height or vertical length is measured form the wooden rod to the bottom of the yarn. The measurement does not include the string that the tapestry hangs from, which is an additional 6-9 inches.I spend a lot of time browsing for unique and quality yarn. I love to mix different textures and sizes to give some of the tapestries more depth and dimensions. I have begun to see my tapestries as an art form!I do love custom orders. It gives me the opportunity to be creative and make something new! If you have a certain color scheme for a room please allow me to make it for you! That being said, please understand that yarn color is not like paint. I cannot mix it to create the perfect match to your dresser or bedspread. If you want \"harvest orange\" when I go to the craft store there may only be three options of orange color of which \"harvest orange\" is not one of them. I do try to match them as close as possible. Computerized images of color schemes are more effective then photos taken with your phone because lighting can really alter the actual color.Expedited Shipping Information: If you need your tapestry sooner then the allotted time required to make it, please purchase the \"Work on My Order Next and Expedite the Shipping\" listed in my shop for $40.  I truly wish I had hand weaving superpowers and the ability to ship them quicker! Unfortunately, I do not :)CURRENT SHIPPING TIMES: The expected delivery time is just an ESTIMATE. Please understand that USPS and I are working as fast as we can, but there may be some orders where the delivery time is a bit later than the listed expected date. I am also a high school teacher and some weeks I'm very busy volunteering and working late with students, parents or staff. I just want to be as transparent as possible. I ask that you only place your order if you are willing to accept that depending on my work week, the package could be a bit later then expected.ALL proceeds go to a miniature horse rescue and a kids summer camp where they learn to care for mini horses.Returns and exchanges: Please be considerate about returns (for not only my shop but other Etsy shops as well). Keep in mind that we spend time shopping for material, prepping for your purchase, creating the product, packaging, and delivering for shipment. We are not Amazon, but individual crafters. When you return something that means we pay out money for shipping and processing fees, plus hours of working on your order. I will   most definitely accept a return however, the cost of shipping it back is the responsibility of the purchaser. Once the tapestry is returned, I will refund you for the price of the tapestry. I writing this as a friendly reminder/informative information :)",
    "reviews": [
      "Looks good. X x x",
      "Perfect addition to my living room!",
      "Love the colors and well made.  I used it for my window in my back door so it filters the light in.  I used magnets to hang since I have a steel door.  It looks very creative."
    ]
  },
  {
    "productId": "rFGRYzlLWL",
    "url": "https://www.etsy.com/listing/205198072/personalized-candle-holder-rustic-home?click_key=25a92807da9c71e5a66e619285b7553c16850f0d%3A205198072&click_sum=19bb9e0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-35&pro=1",
    "title": "Personalized Candle Holder, Rustic Home Decor, Personalized Gift, Rustic Decor, For her, For him, Couple Gift, Engagement Gift, Wedding Gift",
    "description": "Looking for a unique and personalized gift for your loved ones this Valentine's Day? Our handmade and eco-friendly Rustic Candle Holder is a perfect choice! Custom Hand Burned with initials, this beautiful candle holder makes a thoughtful gift for an engagement or anniversary. Made from reclaimed wood, this Rustic Candle Holder is also a great addition to any home decor. Whether you're shopping for him, her, or a couple, our Personalized Candle Holder is sure to be cherished for years to come!DETAILS:*Logs will not be completely smooth, These are rough sanded. Will contain Splits, Pits, And groves*♥ Set of 3 Log Candle Holders♥ ONLY the middle holder has a Heart♥ HAND BURNED - Not Machine-made or Laser engraved♥ Tealights/Votives not included♥ Real Natural Logs, May have splits, pits, and groves - rough sanded♥ These candleholders are wood. Faux flame candles are recommendedMEASUREMENTS:3,4,5\" Height3.5\" Diameter (each Log)Hand Burned Middle Heart Approx. 1 1/2\".CARE INSTRUCTIONS:♥ Clean with a dry cloth or brush. Wet cleaners may cause Discolorations/Expansion of the Wood.♥ This item is made from reclaimed wood and may have knots, grooves, or imperfections unique to the wood being used.♥ This Simple rustic design is completely handcrafted from start to finish!♥ Great for Wedding Centerpieces, Thanksgiving Tables, Holiday Coffee Tables, And much more!SAFETY INSTRUCTIONS:● These candleholders are wood. Faux flame candles are recommended.● For real flame candles, Please exercise caution when using:● If smoking occurs, extinguish the candle.● Do not allow the flame to touch the side of the container.● Never move your candle while it is burning or still hot.● Never leave your candle unattended.● Burn candles indoors, away from drafts, other heat sources, and any flammable objects or materials.SHIPPING/RETURNS:● All items shipped to you directly from our Shop in New Jersey● Free Shipping over $35 (USA), Insurance included at no extra charge. Priority upgrade available at checkout● Buyers are responsible for any customs and import taxes that may apply. I'm not responsible for delays due to customs.● We ship within 1-2 Weeks (Monday - Friday).● Rush orders by request only - Please contact for availability● Returns/Exchanges accepted - Please see shipping policy or FAQ for details● DELAYS are inevitable during the Holidays. We can not guarantee delivery dates (unless agreed upon prior to order)● See FAQ below or contact us with any additional questions(Photo props not included)More Beautiful Items here! -www.etsy.com/shop/GFTWoodcraft",
    "reviews": [
      "Love the product. Delivery date got pushed out as the original delivery date approached. It took a month to receive from order date.",
      "Makes a great personalized gift!",
      "Thank you for your feedback!",
      "Suer fast reply to questions. These made a great gift for my sister in law",
      "Thank you for your feedback!",
      "Got these for my mom for the holidays. She absolutely loved them! The fresh smell of the wood was probably her favorite part!",
      "Thank you for your feedback!"
    ]
  },
  {
    "productId": "LfQlrNvyCF",
    "url": "https://www.etsy.com/listing/517770482/moon-wall-clock-moon-glow-clock?click_key=ac30560cf6b2c86846ac245e6902e459fe33cf23%3A517770482&click_sum=32ed6886&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-36&pro=1&frs=1&sts=1",
    "title": "Moon Wall Clock, Moon Glow Clock, Planetary Decor, Glow In The Dark, Large Wall Clock, Space Clock, Cancer Sign, Oversized Clock,Lunar Clock",
    "description": "Planet:  MoonZodiac Sign: CancerElement: Water☽ ♋️ ASSEMBLED WITH:→ high-quality, extremely SILENT quartz movement.→ on the upper side of the mechanism, a heavy-duty (triangle-shaped) METAL HANGER stands for hanging.→ the clock takes one \"AA\" 1,5V battery (sometimes it needs a bit more pressure to get inside the compartment)→ 10\" and 14\" - with second hands→ 20\" and 24\" - no second hands (+ small cap instead)☽ ♋️ GLOW EFFECT:Phosphorescent paint has a glowing effect that lasts for hours after being charged for several minutes in a bright sun or lamp light.The intense glowing effect continues for about 30–40 minutes; later, it will continue to glow for up to 6 hours, but much dimmer. This is called afterglow, and all glow-in-the-dark pigments do this. To see the glow during the afterglow period, you need to be viewing them in complete darkness with your eyes adjusted to the dark.☽ ♋️ Please note: As the intense period of glowing is the first 30–40 minutes, we don't state that you will be able to see what time it is during the whole night.✈️  SHIPPING AND DELIVERYIt takes from 3 to 5 days for your magical item to be made.If you need priority, please convo us, we will offer \"RUSH my order\" option.Orders are shipped via priority mail and arrive approximately within:*1-2 weeks to USA and Europe*2-3 weeks Canada*3-4 weeks to Australia & everywhere else⚪ CAREPlease avoid leaving your glass object in direct sunlight for an extended amount of the day time as it is a living work of art. Even though each piece is individually painted using acrylic and environmentally friendly glass paints, this could significantly alter the hues. Remember that because each piece of this hand-crafted artwork is unique and individual, the item you receive may slightly differ from the image.••••••••••••••• ABOUT MILLIART GLASS ••••••••••••••💛 DESIGNED AND MADE IN VARNA, BULGARIA. To ensure we give our customers the greatest quality, we must import some parts from foreign companies while supplying other just down the street in our town.📦 We use RECYCLED PAPER for our specifically designed packaging boxes, and we have successfully shipped our glass clock safe and sound worldwide for years.♻️ Our hand-crafted glass pieces have the unique quality that the majority of them are constructed from custom-produced TEMPERED GLASS which makes them sustainable over time.✉️ Feel free to convo us If you have any QUESTIONS!  We're here working on some new items.If there are no rush orders during the weekend and holidays, together with our little twin boys, we will explore the Bulgarian nature sites. :)🌀 Keep exploring our ART here:http://etsy.me/2a4tQN5✨ If you are interested in ASTROLOGY - check our Astro shop:www.etsy.com/shop/AquariesAstroStay inspired and thank you forsupporting small business🙏🏼💛Milica",
    "reviews": [
      "A beautiful watch with a high-quality finish and attention to detail. It really glows brilliantly in the dark. I wanted to give it as a Christmas present and to make sure it arrived on time and undamaged in Germany, it was sent by express delivery at no extra charge. A big thank you from me for this great work of art and the excellent service.",
      "Beautiful piece of art from an amazing artist! She messaged me when it was mailed off and contacted me to ensure delivery and assembly happened without issue. The clock is mesmerizing!\n\nWith its high gloss face and shiny rose gold, it is like a subtle piece of celestial jewelry in the home.",
      "Quality is very good,Best of luck",
      "So beautiful and well made.  Worth every penny.  I wanted this clock for a long time.  Now I wish I'd gotten it sooner."
    ]
  },
  {
    "productId": "NgqBVmgpGx",
    "url": "https://www.etsy.com/listing/505137090/personalized-family-map-pillow-gift-for?click_key=90c9c1676b134d3f06f88201038c56d86c0956da%3A505137090&click_sum=81312685&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-37&pro=1&frs=1&sts=1",
    "title": "Personalized Family Map Pillow, Gift For Mom, Parents Anniversary Gift, Thoughtful Gifts From Siblings, Christmas Gifts For Parents",
    "description": "This thoughtful gift pillow is a meaningful family Holiday gift or for the Mom or Dad you love. . Sweet for a birthday, or living room decor for your own home. Up to 20 locations, $1.00 for each additional location (a link will be sent after purchase to pay for those). Hawaii or Alaska can be included as well as a mini Country to the side to represent someone abroad.∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹HOW TO PERSONALIZE 🔹Enter your details in the \"Add Personalization\" box.  Scroll through the product photos to find options offered.∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹WE SEND A FREE PROOF AFTER PURCHASE🔹In 1-2 business days a free proof (a preview of the design) will be sent to you via ETSY messaging to check for errors. Approve your proof ASAP to prevent delays.We often need to reach out if we have questions, so please be on the look out.  We only use ETSY messaging to keep all details in one place;)∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹PRODUCTION TIME & SHIPPING 🔹👉🏼Be sure to change the \"SHIP TO\" address if sending to another location.▶︎ All items are handmade-to-order, from us to you!▶︎ We ship all orders with USPS Ground Advantage 1-5 day Mail. Priority mail and other faster upgrades are available in the \"Shipping Upgrades\" menu found on the checkout page.▶︎ See shipping times on product pages, they may change during holiday seasons. We typically ship out in 2-4 business days.▶︎ If you choose Express 1-2 day shipping please keep in mind it still takes a few days to make before shipping.*Note that international orders may still arrive later than stated by the postal service.∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹GIFT MESSAGE + GIFT WRAPPING 🔹▶︎ Don't forget to fill out the gift message section so your recipient knows who sent it.. We don't include any receipts. A cute \"With Love\" card will be sent with your message.▶︎Gift wrap is also available .  See all these options during checkout;)∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹 Fabric Types + Care 🔹-Fabrics we may carry are:- Polyester Linen: A new addition that has a zipper. Fabric is thick and has a linen look and feel.- Cotton Duck Canvas: 100% cotton, envelope back.- Rustic Linen: A nubbly high end Linen, envelope back.All have a soft texture.-Covers are removable for dry cleaning, not stitched closed. Please only spot clean or dry clean without harsh chemicals.∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙🔹HAVE A QUESTION? 🔹Feel free to contact us through our main store page.  Click \"contact\" and we'll get back to you as soon as possible;)FIND ALL OUR ITEMS HEREhttps://www.etsy.com/shop/DoveAndDavid♥️♥️♥️ XOX, STEPH + TEAM ♥️♥️♥️",
    "reviews": [
      "beautiful product and responsive sellers",
      "Was very satisfied with the printing and the location.",
      "Beautiful quality and quick shipping too. My in laws will love this as they move away!",
      "On time accurate and exactly what I wanted. What more can you want?"
    ]
  },
  {
    "productId": "KuzVFedOZt",
    "url": "https://www.etsy.com/listing/499400223/custom-record-ledge?click_key=d18a93200292eade3f51eec8b30f1757d5a408db%3A499400223&click_sum=f1abb780&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-38&frs=1&etp=1&sts=1",
    "title": "custom record ledge",
    "description": "This listing is for (1) ledge which can hold 1 record. Measures 14\" long, 1 1/2\" deep and 13/16\" thick, groove is 1/2\". Made in Ohio from solid wood.Our single record ledge is the perfect solution to displaying the record on your turntable.  Can accommodate thick double or triple gatefolds.  Purchase multiple to display your favorite albums around your living space.  Quantity can be adjusted at checkout.Choose your wood and finish combo: Oak, Cherry or Walnut in Clear, Stain A, B or C.  Maple in Clear or Whitewash ONLY.  All finishes are sealed with oil based or water based polyurethane to create a timeless finish.  Made to order; please allow 2-3 weeks for production until shipping.Hardware and instructions (including QR code for detailed installation video) provided.  Hangs with two routed keyholes on the back of the ledge for invisible, floating effect.  Video provided here is shortened example of how to install.--------------------------------Hello!  If you’ve read this far, thank you!  When a buyer reads an entire item description it leads to a happy customer.  I am the co-owner of Divider Records, Brit, writing to inform you of the authenticity of our products.I am an Etsy customer myself.  Upon finding an appealing product, I often find myself questioning the quality and origin.  It leads to a time consuming search for the makers profile, scouring reviews and even checking out their website or Instagram.We started this venture in 2016 and over the course of the following years designed each product you see here. Our products are made by us, a team of 3,  in Ohio, USA.  All of our materials are purchased locally, from independent businesses in our area.  So not only are you getting an awesome product (read our 1,000+ reviews) but you’re supporting 2 families and a local economy!Thanks for reading, we look forward to making something for you!-Brit PratherCo-Owner",
    "reviews": [
      "Beautifully stained work of art to hold other works of art. Great options and messaging.",
      "Great quality, as pictured. Thanks!",
      "love my record holder things!"
    ]
  },
  {
    "productId": "ChuPnRytUY",
    "url": "https://www.etsy.com/listing/245914064/housewarming-gift-new-home-housewarming?click_key=2e4f48bc34bdba324a014c439621136c43fa5e18%3A245914064&click_sum=fb4da3c4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-39&pro=1&sts=1",
    "title": "Housewarming Gift, New Home Housewarming Gift, Our First Home, House Warming Gift, Latitude Longitude Sign Address Sign, Mothers Day Gift",
    "description": "Latitude Longitude Sign | House Warming Gift | Housewarming Gift | Address Sign, Wedding Gift | New Home Housewarming Gift | GPS CoordinatesTurn the coordinates to your special location into a personalized framed piece of art! Just leave a full address at checkout and we will take care of looking up the coordinates. See photo #2 for optional custom map background.Perfect as a unique Valentine's Day gift, wedding gift or anniversary gift! Printed on high quality, textured watercolor paper!Select the print only and frame on your own. Or have your print beautifully framed and ready to hang in a barnwood frame with a glass front and hanging hardware attached. Print design measures 11”x14”. Choice of classic or simple frame. Would you like to see a proof? Let us know! ♡• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •PRINT SPECIFICS:♥ FREE shipping via Priority Mail!♥ NEED YOUR ORDER SHIPPED SOONER?Purchase the Rush My Order Upgrade HERE:http://etsy.me/1xFdwaZ♥ Printed on acid-free, 100% cotton fine art paper. This textured paper has an authentic felt finish to compliment your art print!♥ Every print is made {with love} in our home studio.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •HOW TO ORDER:↓ Copy & Paste the information below into the “Note to EmmaAndTheBean” box at checkout ↓♥ Full Address or Coordinates:PLEASE NOTE:*Leaving a need-by date does not guarantee delivery by this date if not within our stated production times. If you need your order in a hurry, please ask us how to rush your order!**FOR HELP FINDING COORDINATES: visit http://www.gps-coordinates.net/ and simply search the address you'd like to have printed! Or, of course, provide an address and we will assist you!** If we receive coordinates in an alternate format, we will convert them to DMS to match the design template.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •SHIPPINGInternational orders are shipped via USPS First Class International and can take 2-4 weeks for delivery. We take pride in our extremely well packaged shipments.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •♡ Please feel free to contact me with any questions you may have. I am happy to accommodate special requests. Check my Shop Policies for more information:http://etsy.me/1FcVgO0Lisa ♥Back to the Shop:EmmaAndTheBean.etsy.com© 2014 Emma & the Bean - All rights reserved.",
    "reviews": [
      "My Friend LOVED it has a house warming gift. The frame is beautiful!",
      "So personal yet simple, I love this gift !!",
      "Received this item very fast",
      "Nice item and received timely.  Thanks!"
    ]
  },
  {
    "productId": "bcQiZN3UgI",
    "url": "https://www.etsy.com/listing/512439018/custom-constellation-map-star-map-print?click_key=4206efac581b7987c3403423d5c0b478e81498e8%3A512439018&click_sum=1c7660ac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-40&frs=1&etp=1&sts=1",
    "title": "Custom Constellation Map, Star Map Print, Frames Available, Star Map Art, Constellation Map Baby, Wedding Gift Couple, Anniversary Gift",
    "description": "Our best selling custom constellation map is the perfect gift for any occasion! Each one features the unique night sky view from the date and location you provide!◆ HOW TO CUSTOMIZE ◆- Please refer to the \"Add your personalization\" box to see what we need to create your design and enter your information there :)*** If you are not seeing the box, it may not be supported on your browser or app so please put your information in the \"Note to Seller\" section before checkout.- Our swatches and fonts (if applicable) can be found in our product photos.- Have any special requests? Please feel free to include them along with your order information!◆ FREE PROOFS ◆- We will message you via Etsy with a digital proof of your design 1-2 business days after your order has been placed.- Your order will not ship until you have approved the proof :)◆ PRODUCT INFORMATION ◆- All prints are done on professional, heavyweight matte paper using archival inks8x10 Print Only No Mat - 2 inch border around design8x10 Print Only With White Mat - print is 5x711x14 Print Only No Mat - 2 inch border around design11x14 Print Only With White Mat - print is 8x108x10 Framed No Mat & Plexiglass - 2 inch border around design8x10 Framed With White Mat & Plexiglass - print is 5x711x14 Framed No Mat & Plexiglass - 2 inch border around design11x14 Framed With White Mat & Plexiglass - print is 8x10Looking for a larger size? You can find the poster size of this print here:https://www.etsy.com/listing/685940576/custom-constellation-map-poster-night?ga_search_query=star%2Bmap&ref=shop_items_search_4&frs=1◆ SHIPPING & GIFTS ◆- Shipping: US Orders ship in 3-5 business days via USPS Priority Mail with tracking if you approve your proof asap.- Gift Options: Include a gift message at checkout and we'll include a beautiful card for free :) You can also add our premium gift wrapping option for $5 at checkout.◆ HAVE A QUESTION? ◆- We love to help! Just send us a message via an Etsy Conversation by clicking \"ask a question\" above :)- Shop our full line herehttps://www.etsy.com/shop/finchandcotter◆ WHY BUY FROM FINCH & COTTER? ◆We (Niki & Jeff) have been fortunate to put over 50,000 personalized prints & pillows in homes in the USA & Canada. We are so proud of our over 10,000 5 Star Reviews. See what our past customers have to say about our handcrafted products and customer servicehttps://www.etsy.com/shop/FinchandCotter/reviewsFinch & Cotter has been creating handcrafted, personalized home decor since 2012 and all the items you see in this shop are created start to finish in our Grand Rapids, MI based studio. We only use American made materials and eco-friendly materials & packaging whenever possible.◆ FEATURING ◆Personalized Wedding Gifts・1st Anniversary Paper Gifts ・ Anniversary Gifts・Bridal Shower Gifts・2nd Anniversary Cotton Gifts ・ Engagement Gifts・Mother’s Day Gifts・Father’s Day Gifts・Birthday Gifts・Valentine’s Day Gifts・Housewarming Gifts・Baby Shower Gifts・Baby Nursery Decor・Rustic Home Decor・Gift Ideas・Gifts for Grandma・Gifts for Grandpa・Gifts for Grandparents・Gifts for Mom・Gifts for Dad・Gifts for Parents・Gifts for Couples◆ EXCLUSIVE SALES, COUPONS, & GIVEAWAYS ◆INSTAGRAM: instagram.com/finchandcotter",
    "reviews": [
      "Beautiful as always. This is our favorite gift to give.",
      "Good quality item. I’m excited to show my boyfriend!",
      "The person I got them for loved them.",
      "Love these!! Because of illness, we just got to give them to our family for their Christmas gifts. They were thrilled! Thank you!"
    ]
  },
  {
    "productId": "AqQsqerVMr",
    "url": "https://www.etsy.com/listing/226750008/dragon-hanging-stained-glass-sun-catcher?click_key=700d6075ec7c335c953a26d41243ef5a2d664ad4%3A226750008&click_sum=1496c0e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-41&frs=1&etp=1&sts=1",
    "title": "Dragon Hanging Stained Glass Sun Catcher",
    "description": "HOLIDAY SHIPPING NOTICE:  This item will not arrive in time for Christmas. Instead, please choose the Gift Dragon Adoption (Certificate) found here:https://www.etsy.com/listing/566539010/gift-dragon-adoption-gift-certificateThe gift certificate option features a printable certificate and a code that you may give your gift recipient, and they can choose their own dragon colors, which will arrive 4-6 weeks later.----------------------------------Everyone needs a dragon!  This one is hand made, with a metal body and stained glass double wings.  His body is about 4 inches long, with a wingspan of approximately 6 inches.  He hangs from a 4 inch chain (not pictured).  You may choose your wing color & body may be black or silver in tone.Each one is hand made from art glass, and each piece is unique.  Yours will vary from the one shown due to natural variances in the glass and the hand made nature of the piece.If you would like a color not currently shown, please contact me and I'll see if I can arrange it for you.IMPORTANT DRAGON TRAVEL TIME INFORMATION:Dragons typically take about 4 weeks to housetrain (roughly--sometimes they're quick learners, sometimes they're feisty).If you need your dragon faster, you may consider adding the RUSH OPTION to your order, when available.  You can find it here if it is currently available:https://www.etsy.com/listing/1039130235/Rush Orders will get your dragon a crash course in housetraining, and have him out to you in 1-2 weeks instead.While I always do my best to get your dragon out quickly, housetraining may occasionally take longer than estimated if many dragons need training around the same time.  If that happens, please bear with me, I'm the only dragon trainer here.  Also, the Rush Option will only be available when I am available to work overtime, and will not appear if I am already backed up or traveling for shows.Be sure to check out my other items, too!  :)",
    "reviews": [
      "These little guys are made to order and do take some time to ship, as communicated by the shop owner. Great gift if you order 2-3 months in advance. Niece loves him! She says: “He's so pretty! Thank you! ❤️” She’s happy, I’m happy.",
      "This looks amazing, arrived better than pictured.  I can't wait to give it to my daughter, she's going to love it",
      "Gorgeous little dragon! My sister owns a microbrewery named Dragonsgate (in Milton-Freewater, OR—look it up!), and I wanted to give her something neat to hang in the tasting room. This little guy fits in perfectly! Beautifully made. I’ll be getting one for my dad, who’s obsessed w dragons! Thanks!",
      "Beautiful! Can't wait to hang it in the sun!"
    ]
  },
  {
    "productId": "GFhdIxFtdP",
    "url": "https://www.etsy.com/listing/90334056/deluxe-beer-styles-print-poster-for-home?click_key=0ec5929f0d3ac2405404cd0b147e0878177b4be8%3A90334056&click_sum=49753a42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-42&etp=1",
    "title": "Deluxe Beer Styles Print | Poster for Home | Gift for Craft Brewers & Alcohol Lovers",
    "description": "Deluxe Beer Types Poster Wall Art Print For Craft Brewers DrinkersFeaturing 89 varieties of beer with over 200 representative quaffs, including glassware recommendations for each variety, this print covers six square feet with beer-soaked goodness.24” x 36”WHO WE AREAt Pop Chart, we chart everything—from nature to sports to the far reaches of outer space—as beautiful wall art.  This includes our bestselling, first-of-their-kind scratch-off posters, featuring our National Parks scratch-off, our Major League Baseball Stadiums scratch-off, our Horror Movie scratch-off, and more!SIZESAll posters come in the sizes shown.OUR PRINTSAll of our posters are printed on the highest quality, eco-friendly, 100lb paper stock.",
    "reviews": [
      "Loved the quality of Photo",
      "Perfect gift for my parents. Arrived on time and in great packaging.",
      "Great quality and looks just like the picture!",
      "These are very high quality posters! I was expecting poster paper quality (like the posters you buy from Walmart or something similar). However, these are thick, high-quality paper! I would happily buy again!"
    ]
  },
  {
    "productId": "hPhGwbMaNv",
    "url": "https://www.etsy.com/listing/385197556/mother-day-gifts-for-wife-unique-mother?click_key=0908aed76e0b91c0524c76c004d76753066499bb%3A385197556&click_sum=f2c1ec3b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-43&pro=1&sts=1",
    "title": "Mother Day Gifts for Wife Unique Mother of the Bride Gift Personalized Gift from Daughter Gifts for Mom Gift Mother of the Groom Gift EP",
    "description": "This personalized print makes the perfect Christmas Gift for mom or grandma. Personalized with your name(s)! Printed on high quality, textured watercolor paper! Change the name at the top to Mom, Dad, Grandma, Grandpa, Nana, Grammy, Mimi, Gigi, Nonna, abuela -whatever you call the special man or woman in your life!SIZING: Print design measures 11”x14”. Artwork is made to fit an 11”x14” frame.Select the print only and frame on your own. Or have your print beautifully framed and ready to hang in your choice of frame with a glass front and hanging hardware attached. Choice of black, classic or simple barnwood frame. Would you like to see a proof? Let us know! ♡NOTE: Our barnwood frames are REAL salvaged barn wood and have the natural rustic elements intact in most of them. You can expect knots, nail holes, splintering and a distressed look in almost all of them. This is NOT a defect and this adds to the natural charm of this frame. Colors vary in the barn wood series, ranging from brown to grey. The images in my shop are sample representations and the actual product may differ from them in hues of the frame. We cannot accept returns or exchanges for these variations.Orders will be created and shipped according to your order note. Design proofs are only sent upon request! Please note this at checkout if you’d like a preview of your design! ♡➸ PLEASE FLIP THROUGH ITEM PHOTOS FOR ITEM DETAILS AND ORDERING PROCESS.• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •HOW TO ORDER:↓ Copy & Paste the information below into the “Note to EmmaAndTheBean” box at checkout ↓♥ Name and Date #1:♥ Name and Date #2:♥ Name and Date #3:♥ Name and Date #4:♥ Name and Date #5:♥ Name and Date #6:PLEASE NOTE:*Leaving a need-by date does not guarantee delivery by this date if not within our stated production times. If you need your order in a hurry, please ask us how to rush your order!*Design allows for 2-6 Names and Dates! Please contact us if you have any questions BEFORE purchasing your print. At 6 or more names & dates, we will divide the details into 2 columns. To include a larger # of dates, we recommend purchasing the 11x14 upgrade for up to 20 dates! Available here:• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •♡ Want to view our entire Collection? Click here:http://etsy.me/1BrwzWN♡ Please feel free to contact me with any questions you may have. I am happy to accommodate special requests. Check my Shop Policies for more information:http://etsy.me/1FcVgO0Lisa ♥Back to the Shop:EmmaAndTheBean.etsy.com© 2014 Emma & the Bean - All rights reserved.",
    "reviews": [
      "My mom loved it for Christmas!",
      "This turned out to be exactly how I had hoped. The quality was very good and kudos for the careful packaging. Especially because I had to mail it from my house to my Mom. She opened the gift and it made her happy cry. Nuff said ;)",
      "Great product. My wife loved it. Highly recommend this seller",
      "Mom loved it and cried her eyes out"
    ]
  },
  {
    "productId": "tamFgSENxt",
    "url": "https://www.etsy.com/listing/85706663/rustic-christmas-mistletoe-mistletoe?click_key=29fc7b1620c914fc465ff1cc0c8fb870c11c7483%3A85706663&click_sum=d9a89805&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-44&etp=1&sts=1",
    "title": "Rustic Christmas Mistletoe / mistletoe, Christmas party decorations mistletoe ball hostess gift stocking stuffer",
    "description": "Rustic Christmas Mistletoe...perfect for Christmas party decorations, Shabby Chic Christmas decor,  stocking stuffer, &/or hostess gifts.This artificial mistletoe is fashioned after the old vintage style. You can choose from long & wispy or short & full. Add a handmade frayed ribbon or a grosgrain bow. It can be left blank or stamped with YOUR words. It's ready to hang & waiting for you to pucker up underneath it! This mistletoe has been dusted in glitter.SIZES:Long & wispy: measures roughly between 7-9 inches long.Short & full: measures roughly between 5-7 inches long* Berry & pinecone placement will vary as each mistletoe is hand arranged & made to order just for you.HOW TO ORDER:Choose bow ribbon type, color & to personalize or not.Word choice: plain (no words) or your words. If your words, we can stamp up to 25 characters including spaces. Please add your request to the personalization box or \"Add a Note\" box at checkout. Type \"BLANK\" if no words.♥ This is artificial mistletoe, NOT real. It has been dusted in glitter.♥ Size, berry & pinecone placement will vary as each mistletoe is arranged by hand & made to order just for you.",
    "reviews": [
      "Great seller! recommend, just as described.",
      "Adorable. Can’t wait to hang this up for the holidays. Lovely packaging was a nice touch.",
      "This bundle of mistletoe made a great addition to my holiday decorations! It works too ;-)\nThanks for the great product and customer service!",
      "Beautiful craftsmanship. Lovely holiday piece."
    ]
  },
  {
    "productId": "QUZtohLbFv",
    "url": "https://www.etsy.com/listing/280013394/french-bulldog-pillow-decorative-pillow?click_key=938c89213cd2072c43551efc23d712c460a8fdc1%3A280013394&click_sum=f90787e0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-45&etp=1&sts=1",
    "title": "French Bulldog Pillow, Decorative Pillow, Frenchie Dog Pillow, Frenchie Pillow, French Bulldog Decor, Gift Idea, Birthday Gift Idea",
    "description": "French Bulldog Hand Block Print Pillow - Decorative throw pillow cushion cover - Your Choice of Ticking StripeThe front of the cover is constructed out of your choice of ticking fabric with the stripes running horizontally.  A piece of taupe cotton is appliqued with a block print image of black French Bulldog laying down in black fabric ink. The back is constructed out of taupe cotton with a black exposed zipper with for easy removal of the insert and a added touch.Sizes available 14\"x14\", 16\" x 16\" or 18\" x 18\" can be purchased as a cover only, with poly fil pillow insert or 95/5 goose down pillow insert.You can select the print color (black and tan are photographed and other colors available upon request)If adding your dog's name, let me know in the not portion of the order and please note that the 18\"x18\" size works best proportionally.All block prints are carved by hand by Ecarlate BoutiqueVisit our other dog & cat pillowshttps://www.etsy.com/shop/ecarlateboutique?section_id=11267690Visit our other home decor items athttp://www.ecarlateboutique.etsy.com",
    "reviews": [
      "Excellent in all respects. I needed a different size pillow and asked if that was possible. Received immediate and positive response. Thank you.",
      "Very happy with my purchase",
      "Love these pillows. Item arrived well-packaged and quickly.",
      "Perfect!"
    ]
  },
  {
    "productId": "QcByAsmTaW",
    "url": "https://www.etsy.com/listing/253109971/new-home-gift-personalized-realtor-gift?click_key=a73d45e9a7b54fda1ef3f3b4dc65ef45ed70a44d%3A253109971&click_sum=8d59019e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-46&etp=1&sts=1",
    "title": "New home gift, personalized, realtor gift, housewarming, first home ornament, wedding gift,",
    "description": "THE BASICS:-Please leave house number and street name in \"NOTE TO SELLER\" box at checkout.**if you leave additional information in 'note to seller' box at checkout, it WILL NOT be added to your tag.  Your tag WILL include HOUSE NUMBER and STREET NAME and YEAR only.-If you would like a year other than 2024, please leave that in the 'note to seller' box at checkout.  If no year is indicated, 2024 will  be default year.-Item will be sent packaged in an off white ORGANZA BAG appropriate for gifting.  No invoice will be included unless a specific request is made to send printed invoice.THE DETAILS:Commemorate your first Holiday in your new home with this custom ornament...Each key is a lightweight  metal which is 3 1/8 inch long.  The  quatrefoil tag is approximately 1 1/4 inch and will be hand-stamped, expect subtle differences in spacing ,depth and alignment of text. Please see photos for examples.Please leave house number and street ONLY along with year you would like stamped on the tag.  (2024 will be default year if you don't leave a year).  City and state are not available on this item.  *House number and street name only!!I will work with your custom address and may or may not abbreviate common terms (ie st., ave., blvd. etc.) as necessary and based on artistic license as to  how your address best formats on the tag.",
    "reviews": [
      "Great Christmas gift for my friend",
      "Got this for my sister and her fiance for their new house. They loved it!",
      "Came out super cute. Bought it as a gift and the quality was even better than expected.",
      "Purchased for a couple who just purchased their new home"
    ]
  },
  {
    "productId": "snsohxEfUa",
    "url": "https://www.etsy.com/listing/218888463/your-choice-set-of-three-11x14-literary?click_key=7c75eb4137b30e016be801ae943a2a043c04f94b%3A218888463&click_sum=874b0014&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-47&frs=1&etp=1&sts=1",
    "title": "YOUR CHOICE Set of Three 11x14 Literary Prints Wall Art, Living Room Art Print, Book Lover Gift for Bibliophile",
    "description": "SAVE ON A SET OF THREEChoose from over 150 prints in our catalog!Our original illustrations are inspired by popular authors, including: Jane Austen, William Shakespeare, Kate Chopin, Oscar Wilde, Edna St. Vincent Millay, F Scott Fitzgerald, Emily Dickinson, Edgar Allan Poe, Virginia Woolf, T S Eliot and Mary Shelley. The bold, statement making illustrations are printed on premium, heavy archival paper with an elegant eggshell finish.Browse our entire art collection here:https://www.etsy.com/shop/ObviousState/items?section_id=16642187ART PRINT DETAILS:• 11x14 inch art print with white border• Premium, fine art paper made in New York• Elegant eggshell finish• Protective sleeve, backing board and info sheet• Ships in a a rigid, flat mailer. No need to unroll!• Fits into standard 11x14 frames (or a 16x20 frame matted to 11x14)HOW TO ORDER YOUR SET OF THREE PRINTS:1. Purchase this listing2. Indicate the AUTHOR AND QUOTE for each print in the “notes\" section at checkout. Some authors have multiple designs, and not including the quotation may delay your order.See all of our literary art prints and book lover gifts:https://www.etsy.com/shop/ObviousStateOriginal artwork by Obvious State, not endorsed by or affiliated with the attributed author. All applicable rights reserved.",
    "reviews": [
      "Gorgeous print, great quality and beautiful design. Will buy more soon.",
      "Lovely! The top corners were slightly bent, but nothing too noticeable, especially because I’m going to frame the prints.",
      "Love, the prince would definitely order again, and recommend!",
      "Came carefully shipped and they're lovely!"
    ]
  },
  {
    "productId": "cqFOBKbSIP",
    "url": "https://www.etsy.com/listing/520013000/new-home-gift-boho-macrame-decor-wall?click_key=e64b7530ca887973ff4ae1f4891e5cfa3c717691%3A520013000&click_sum=49a04791&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-48&pro=1&sts=1",
    "title": "New home gift, Boho macrame decor, wall hanging tapestry",
    "description": "New home gift, Boho macrame decor, wall hanging tapestryThis diamond macrame design is a perfect one for all home decor styles.This lovely handmade wall hanging is a great gift idea, original and one of a kind.It is a great decor for your Living Room, Kids Room or your Bedroom. Good combination with all home decor styles retro, vintage, minimal...Width 11 inch (29cm)Height 25 inch (70cm)(70cm from the stick/dowel till the end of the fringes)Please NOTE, none of our items are coming with Dowels but you can get one from Home Depot like all our other customers. You can also try DIY stores.Express Shipping with Fedex.",
    "reviews": [
      "Thank you for this product!",
      "Great service communication and product",
      "We have not yet hung this work of art but have the right place picked out. It looks beautiful and I’m thinking I should plan for the bed headboard design next.",
      "These are beautiful! The packaging was done with care and everything was in pristine shape when I unwrapped it (all the way in the US!). Thank you!"
    ]
  }
]
