[
  {
    "data": {
      "product": "Ceramic Lamp, Hanging Ceiling Lamp",
      "description": "Handmade Design,Printed Decoration of Green Leaves, Clay-light Artwork, Unique Light Fixture  Art Creation , Suitable for Living Room Center & Office by Noa\nThis piece was created in the innovative studio of the designer-maker Noa which is located in Tel Aviv, Israel, and It is part of the Apilar collection.The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.On top of the pieces are ceramic prints, inspired by past traditions from different cultures, creating a contemporary cultural collage.The designer is engaged in ongoing research, visual as well as theoretical, focusing on ‍itional ceramics as a cultural carrier and ‏searching for the sense of belonging through the local material culture.Color: Forest green,  white, Mint, burgundy, orangeMeasurements:Height\t17.7 inchDiameter 7.9 inch",
      "targetAudience": [
        {
          "targetAudience": "Individuals with an appreciation for unique and handmade home decor",
          "useCase": "This hanging ceiling lamp adds a touch of artistry to any space, providing both illumination and a conversation piece."
        },
        {
          "targetAudience": "Homeowners and interior designers seeking to create a sophisticated and stylish living or office space",
          "useCase": "The lamp's intricate ceramic print and organic shape make it an eye-catching accent that complements a variety of decor styles."
        },
        {
          "targetAudience": "Art collectors and enthusiasts interested in supporting emerging artists",
          "useCase": "This lamp is a unique work of art, representing the innovative designs and cultural influences of its creator, Noa Razer."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=67f57a62ec1a949149def95cbcf0496c570b5f06%3A724851215&click_sum=1fc9d423&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:26:30.037407",
      "productId": "eTAPaFXniC"
    }
  },
  {
    "data": {
      "product": "Ceramic Lamp, Hanging Shade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
      "description": "This ceramic lamp is a handmade design by Noa and is part of the Apilar collection. The Apilar collection is inspired by Spanish ceramics and features nine different shapes that can be stacked to create unique and complex compositions. This particular lamp is made up of green, pink, and teal ceramic pieces and has a height of 5.9 inches and a diameter of 5.5 inches.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying as a unique and decorative piece in their homes or galleries."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating into stylish and contemporary living spaces and offices to create a statement."
        },
        {
          "targetAudience": "Gift-givers seeking unique and meaningful presents",
          "useCase": "Gifting as a special and memorable item for special occasions and celebrations."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=807a87aee657465efb1475fac7fafd6d22e268db%3A654638870&click_sum=14d67385&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:26:38.459551",
      "productId": "KLOUePsDoj"
    }
  },
  {
    "data": {
      "product": "TerraCotta Lamp Hanging Light Fixture",
      "description": "Give your home a boost of warmth and a homely feel with a delicate natural terracotta lamp.\nMade by hand in a small boutique studio in Tel Aviv\nAll necessary fitting parts are included.\nTechnical:\nLamp holder: E27\nTransparent cable : 150 cm / 60 inches\nCeiling rose: 10 cm / 4 inches\nEnergy-saving LED light bulbs are recommended. We prefer the Edison Vintage style Bulb.\nVoltage 110V-250V | 25 to 40W max\nThis piece is part of the Apilar collection.\nThe Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless of creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.\nPlease note that this object is handmade, and each piece is unique.\nThis object can be ordered in various colors and prints, talk to us for more info.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to add a touch of warmth and homeliness to their living spaces.",
          "useCase": "Using the lamp to create a cozy and inviting atmosphere in living rooms, bedrooms, or dining areas."
        },
        {
          "targetAudience": "Interior designers and decorators seeking unique and handmade lighting solutions for their clients.",
          "useCase": "Incorporating the lamp into eclectic or bohemian-style interiors, or as a statement piece in minimalist spaces."
        },
        {
          "targetAudience": "Individuals interested in sustainable and eco-friendly home decor.",
          "useCase": "Using the lamp as a durable and energy-efficient lighting option that complements their environmentally conscious lifestyle."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=2caf231bffea39981ef480a7e7ed0c2cada2b28a%3A776223242&click_sum=89f01e98&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:27:00.918581",
      "productId": "tRCNgJwRaz"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair from Mid Century",
      "description": "Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standard\nThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.\nWood has been sanded and secured with high quality oil to expose the beautiful wood grains.\nThe shape has been preserved in every detail as original.\nDimensions:\nWidth - 22.8 in, 58 cm\nHeight - 31.4 in, 80 cm\nDepth - 24.8 in, 63 cm\nSeat Width - 18.1 in, 46 cm\nSeat Height - 14.2 in, 36 cm",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate vintage and mid-century modern furniture.",
          "useCase": "Using the chair as a statement piece in a living room or bedroom."
        },
        {
          "targetAudience": "Individuals who are looking for a comfortable and stylish accent chair.",
          "useCase": "Using the chair for reading, relaxing, or entertaining guests."
        },
        {
          "targetAudience": "Interior designers and home stagers.",
          "useCase": "Using the chair to add a touch of vintage charm to a space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=c903d4709c2a290e39b383e19a5cd37ef31291cb%3A712573399&click_sum=c114cf45&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:27:09.589492",
      "productId": "qOcRzPgyex"
    }
  },
  {
    "data": {
      "product": "Black and White cocktail chair from 1970's",
      "description": "H 66 cm (seat 40 cm) W 52 cm x D 47 cmin\nichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in\n--------------------------------------------------------------------------------\nThe mass production of this iconic piece so\nof the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of theeighties. Mirroring the\nof the times its turned legs were\nshape typically with a nude che\nfinish. The fan\nsteaming of the upholstery elegantly emphasizes the curve of the back.\nDue to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white\nupholstery fabric for the refurbishment.\nOur manufactory is\nin the\nof mid century modern\nfrom the 50’s, 60’s, and 70’s.",
      "targetAudience": [
        {
          "targetAudience": "Retro design enthusiasts and collectors",
          "useCase": "Adding a stylish and iconic piece of mid-century modern furniture to their collection or home décor."
        },
        {
          "targetAudience": "Homeowners looking for unique and comfortable seating",
          "useCase": "Using the cocktail chair as a versatile and eye-catching seating solution in their living room or other living spaces."
        },
        {
          "targetAudience": "Interior designers seeking distinctive and high-quality pieces",
          "useCase": "Incorporating the cocktail chair into their clients' interior design projects to create a sophisticated and stylish ambiance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=e874f60bcc20bd611e385662577ef6ac65190383%3A649720699&click_sum=5493a154&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:27:26.901634",
      "productId": "IQmtAXaEdn"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set",
      "description": "This mid-century armchair and ottoman set is made from solid wood and upholstered in soft, teddy-like boucle fabric. It's a great way to add a touch of vintage style to your home. The armchair is 29.6 inches tall, 25.2 inches wide, and 28 inches deep. The seat is 16 inches high, 20 inches wide, and 20 inches deep. The ottoman is 17.7 inches tall, 23.6 inches wide, and 15.7 inches deep. The set is easy to assemble and comes with instructions. It's also available in other fabrics and colors. Please note that non-EU buyers may be subject to import fees and taxes.",
      "targetAudience": [
        {
          "targetAudience": "People who own or rent homes and are looking for stylish and comfortable furniture.",
          "useCase": "The product can be used to create a cozy and inviting living space."
        },
        {
          "targetAudience": "Interior designers and home decorators.",
          "useCase": "The product can be used to create a unique and stylish interior design."
        },
        {
          "targetAudience": "People who are looking for a comfortable and stylish chair to use in their home office.",
          "useCase": "The product can be used to create a comfortable and stylish workspace."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=66c15e91dbfce836081f10f3a7c38d9a102302c2%3A1110352719&click_sum=017c5f85&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:27:42.003006",
      "productId": "ynHqNRdRso"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion",
      "description": "Soft, cozy with beautiful earthy tones. We can't get enough of the new vegan suede collection! The vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. These floor cushions are beautiful and functional. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner.\nSize: 75X75 cm / 30X30 inch\nHeight: 35 cm / 14 inch\nMaterials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric.\nCare: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean.\nProduction and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase.\nCustom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a stylish and functional home decor item",
          "useCase": "Adding a touch of elegance and unexpected whimsy to their living space"
        },
        {
          "targetAudience": "Vegan-conscious consumers seeking eco-friendly home decor",
          "useCase": "Incorporating a beautiful and durable piece that aligns with their values"
        },
        {
          "targetAudience": "Vanity owners seeking a unique and sophisticated seating option",
          "useCase": "Providing a comfortable and aesthetically pleasing place to sit while getting ready"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=e98dfa13c5c2c7d3b6a8b1dc7b6df3b21f97a151%3A903050205&click_sum=f789a129&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:27:51.723438",
      "productId": "iCrbiqYPwK"
    }
  },
  {
    "data": {
      "product": "Floor Pillow",
      "description": "The floor pillow is available in two shapes (circle and square) and two sizes (23 inches and 26 inches). The round floor pillow is 23 inches in diameter and 7 inches tall, while the 26-inch round floor pillow is 26 inches in diameter and 7 inches tall. The square floor pillow is 23 inches by 23 inches and 7 inches tall, while the 26-inch square floor pillow is 26 inches by 26 inches and 7 inches tall. The floor pillow is made from 100% woven polyester printed fabric and is sewn closed with premium poly fill. The floor pillow is spot clean only. Please allow up to 5 - 10 business days for production of your custom made item.",
      "targetAudience": [
        {
          "targetAudience": "Families with young children",
          "useCase": "Creating a comfortable and inviting playroom or lounging area where children can play and relax."
        },
        {
          "targetAudience": "Individuals who enjoy meditation or yoga",
          "useCase": "Providing a comfortable and supportive cushion for meditation or yoga practice."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Adding a touch of style and comfort to living rooms, bedrooms, or other indoor spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=441db023f87a2992371d1aba4ad5d99d2602ed45%3A904960951&click_sum=b104d085&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:28:00.383732",
      "productId": "zYBcGMnWSw"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool",
      "description": "This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.\n\nABOUT THIS POUFFEMaterial:-fabric inner bag filled with polystyrene beads-knitted cover made with chunky cotton cord\nColour: LIGHT GREYSizes:SMALL:Diameter: Approximately 45cm (18”)\nHeight: Approximately 30cm (12”)\nMEDIUM:Diameter: Approximately 50cm (20”)\nHeight: Approximately 40cm (16”)\nCare:-the knitted cover can be removed for washing (it can be washed in 30 degrees in the washing machine)-the inner fabric bag can be easily filled/refilled with polystyrene beads for the best shape and comfort of using.",
      "targetAudience": [
        {
          "targetAudience": "Parents with young children",
          "useCase": "As a comfortable and stylish seating option for their children's playroom or nursery"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "As a unique and trendy accent piece to enhance the aesthetics of a room"
        },
        {
          "targetAudience": "Individuals seeking a comfortable and portable seating solution",
          "useCase": "For use as an extra seat in a living room, bedroom, or other shared space"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=347ea032b6e45a9812c0a59ad090931d3411e40f%3A266515154&click_sum=e1ec314e&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:28:14.101979",
      "productId": "SBhGqMqISI"
    }
  },
  {
    "data": {
      "product": "Illustrated Parian Porcelain Vase",
      "description": "With it's assured, bold brushstrokes against a bright white base the Long Vase is a declaration of a love of pattern and bold design. Perfect as a stand out piece for a piece, sideboard, or as a centre piece for your dining table. Ideal for holding bundles of your favourite and leafy bouquets, the Long Vase will be sure to make an impact with or without foliage.\nSlipcast in Parian porcelain, the Big Pot is inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent. Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with.\nFrom start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.\nMaterial: Parian porcelain\nFinish: Matte outside, glossy inside\nSize: 21.5cm x 9cm (ø)",
      "targetAudience": [
        {
          "targetAudience": "Individuals with an appreciation for bold and unique home décor",
          "useCase": "Displaying the vase as a statement piece on a mantlepiece, sideboard, or dining table, complementing their existing interior design and adding a touch of artistic flair."
        },
        {
          "targetAudience": "Florists and flower enthusiasts",
          "useCase": "Utilizing the vase to showcase fresh blooms and leafy bouquets, creating visually stunning floral arrangements that enhance the beauty of any room."
        },
        {
          "targetAudience": "Art collectors and lovers of handmade ceramics",
          "useCase": "Acquiring the vase as a collectible piece or as a functional work of art, appreciating its intricate hand-painted strokes and celebrating the unique qualities of Parian porcelain."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=545dacd438767645e5627d9f955fdcde22e978ec%3A811521978&click_sum=113247fe&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:28:28.062489",
      "productId": "GdxxhqlCQg"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "A beautiful hand-built small amphora vase with black and white triangle pattern.\nIt works great as a decorative item or can carry beautifully a bouquet of small flowers/a little tree branch.\nIt was made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white upon which it was fired to cone 8 (1250C) in an electric kiln.\nThe base was left unglazed and is impressed with my maker's mark.\nDIMENSIONS & MATERIALS:\n~ speckled stoneware clay, non toxic glossy white glaze\n~ app. 13.5cm high and 9cm wide (5.3\" x 3.5\")\nDishwasher safe.\nCONDITION OF THE PRODUCTS\nBecause all our pieces are handcrafted, there may be minor variations form item to item.\nSHIPPING INFORMATION:\nAll orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days.\nAll EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of Slovenia. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days.\nThere is a shipping upgrade option to Express DHL for European orders. Please see listing \"Shipping Upgrade\" for further details.",
      "targetAudience": [
        {
          "targetAudience": "Decorators",
          "useCase": "This handmade ceramic vase adds a touch of elegance and history to any home decor, making it ideal for interior designers, home decorators, and design enthusiasts."
        },
        {
          "targetAudience": "History Buffs",
          "useCase": "The vase's design is inspired by ancient Greek pottery, making it a unique and educational piece for history buffs, collectors, and anyone interested in ancient civilizations."
        },
        {
          "targetAudience": "Florists and Plant Enthusiasts",
          "useCase": "Its small size and delicate design make it a perfect vessel for small arrangements or single stems, appealing to florists and plant enthusiasts who appreciate unique and stylish vases for their floral creations."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=7c16e5ec7caf40b7723317da85c35009836787a1%3A986518800&click_sum=d8b857d2&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:28:43.125935",
      "productId": "nSHsVHtjrt"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase",
      "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.\n- Handcrafted with jute, burlap fabric, and glass bottle.\n- Dimensions - 5\" tall; base 5.5\" wide.\n- Beautiful addition to your home or office decor.\n- Indoor use only.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate unique and artistic home decor",
          "useCase": "Adding a touch of elegance and sophistication to their living space with a hand painted burlap vase featuring an abstract mosaic design."
        },
        {
          "targetAudience": "Art enthusiasts who are looking for one-of-a-kind pieces to add to their collection",
          "useCase": "Displaying the burlap vase as a conversation piece or as part of a gallery wall, showcasing their appreciation for handcrafted works of art."
        },
        {
          "targetAudience": "Gift givers who want to find a special and memorable present for a loved one",
          "useCase": "Gifting the burlap vase as a unique and thoughtful gift, expressing their appreciation and love through a piece of functional art."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6f6b46634ccffd375e33cffc533d8b26c76e84dd%3A908084516&click_sum=5403d238&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:28:52.337163",
      "productId": "ZVCMIaRxsQ"
    }
  },
  {
    "data": {
      "product": "Cushion cover",
      "description": "**Exclusive pattern - Unique design - Handmade - Decorative cushion - Cushion cover - Handmade - Exclusive pattern**\n\n🔵 CUSHION COVER 🟧\n\n- Exclusive pattern digitally designed\n\n- Printed in the South of France\n\n- Handcrafted in my workshop\n\n- Creation in limited series\n\nMAIN FEATURES :\n\n- Wallet closure\n\n- Face fabric = Water-repellent and UV-resistant fabric\n\n- Back fabric = Heavy duty 100% cotton twill\n\n- Slightly textured print quality\n\n- Fully overlocked on the reverse\n\n🧼 MAINTENANCE:\n\n- Wash at 30°C. Natural drying. Do not wring. Iron at low temperature.\n\n📮 Shipments by post with tracking",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and stylish home décor",
          "useCase": "Adding a touch of exclusivity to their living spaces with the cushion cover's unique design and limited-edition availability."
        },
        {
          "targetAudience": "People who appreciate handmade crafts and support local artisans",
          "useCase": "Using the cushion cover to celebrate handmade artistry and contribute to the preservation of traditional techniques."
        },
        {
          "targetAudience": "Homeowners looking for functional and durable cushion covers",
          "useCase": "Protecting their cushions from wear and tear with the cover's water-repellent and UV-resistant fabric, while enjoying its decorative appeal."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4269d007a8b91da4d418463e4aa4421f28672782%3A1206357075&click_sum=59533414&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:29:01.820018",
      "productId": "bP1qcBAhQC"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "This pillow is made from 100% hand-loomed cotton and features a colorful striped pattern. It is 19\" x 19\" in size and has a hidden zipper at the bottom. The pillow insert is not included. The pillow is very soft to the touch and is made by an indigenous family in Cuenca, Ecuador. The colorful stripes are woven on an antique loom and take weeks to make. The pattern is inspired by the traditional clothing worn by the women and girls of this community. The pillow is a reminder that we are all connected to each other in a sisterhood of love and empowerment.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value vibrant and unique home decor",
          "useCase": "Adding a touch of color and personality to their living spaces to uplift their mood and create a welcoming atmosphere."
        },
        {
          "targetAudience": "LGBTQ+ community and allies",
          "useCase": "Displaying a symbol of pride and support for diversity and inclusion in their homes."
        },
        {
          "targetAudience": "People who appreciate handmade and ethically sourced products",
          "useCase": "Supporting indigenous artisans and connecting with the cultural heritage behind the pillow's design."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=abdf7a6d3c6cc38b2c1c8cdd205803fc08ac9899%3A566822148&click_sum=7054d814&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:29:13.492316",
      "productId": "ChmVnHtFkl"
    }
  },
  {
    "data": {
      "product": "Parquet Design Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski. 100% cotton with zipper closing 16\" square Designed in Canada • Made in India Pillow form not included.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking for a stylish and unique pillow cover for their couch or living room.",
          "useCase": "The Parquet print pillow cover can be used to add a pop of color and pattern to any room. It is perfect for those who want to create a modern or mid-century modern look in their home."
        },
        {
          "targetAudience": "People who are looking for a gift for a friend or family member who loves home décor.",
          "useCase": "The Parquet print pillow cover is a thoughtful and stylish gift that is sure to be appreciated by anyone who loves to decorate their home."
        },
        {
          "targetAudience": "People who are looking for a high-quality pillow cover that is made from durable materials.",
          "useCase": "The Parquet print pillow cover is made from 100% cotton and has a zipper closure. It is durable and easy to care for, making it a great choice for everyday use."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=6e42447ac0e277837052252f5954af2c530a9185%3A1168874671&click_sum=344b8587&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:29:21.830980",
      "productId": "dSGniRkeSR"
    }
  },
  {
    "data": {
      "product": "Address Sign",
      "description": "The Address Sign is a modern house number sign that can be personalized with your address. It is made from high-quality cabinet grade 1/4\" thick baltic birch wood and comes with two drill holes in the graphic bar for easy hanging. The sign is 14.5\" wide and the height will vary depending on the length of the address. It comes painted with black exterior grade paint if ordering painted unless otherwise specified. Unpainted comes sanded and ready to be finished at home.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a modern and stylish way to display their address",
          "useCase": "Installing the address sign on their house to improve its curb appeal and make it easier for visitors to find."
        },
        {
          "targetAudience": "People who live in areas with difficult-to-see house numbers",
          "useCase": "Using the address sign to make their house number more visible, improving safety and convenience."
        },
        {
          "targetAudience": "Individuals who want to add a personal touch to their home",
          "useCase": "Customizing the address sign with their own design or color to reflect their unique style."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=4912c05687bdbc4f521c8fe1b5149d0528c33ae7%3A790049531&click_sum=934e8063&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:29:31.106363",
      "productId": "lRy74OowRa"
    }
  },
  {
    "data": {
      "product": "Round Address Sign, Geometric Address Sign, Round House Numbers, Modern Address Plaque, Custom Address Sign, House Number Plaque",
      "description": "Geometric carved design with acrylic house numbers - the perfect modern piece for your home address sign. These are great housewarming gifts, realtor closing gifts or just to spruce up your front porch or door decor.\n\nHOW TO ORDER\n- Choose Your Size\n- Note Your Text Color\n- Note your background paint or stain color choice in the personalization area.\n\nThey come with a sawtooth hanger to hang.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to enhance their home's curb appeal",
          "useCase": "Displaying the house number prominently on a stylish and modern address plaque for easy visibility and aesthetic appeal."
        },
        {
          "targetAudience": "Individuals seeking unique housewarming or realtor closing gifts",
          "useCase": "Gifting a personalized address sign that adds a touch of sophistication and functionality to the recipient's home."
        },
        {
          "targetAudience": "Decor enthusiasts aiming to elevate their front porch or door decor",
          "useCase": "Incorporating the address plaque into their outdoor decor to add a geometric and modern element that enhances the overall aesthetic."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=c4cc9807f50e04deb41e78c52803a20189f9a8b9%3A1439690652&click_sum=3b3bb46b&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:29:40.460993",
      "productId": "eQHEZvJlWQ"
    }
  },
  {
    "data": {
      "product": "Modern Herringbone House Number Sign",
      "description": "**Material:**\n- Backer: 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF (if painted)\n- Numbers: Acrylic\n\n**Dimensions:**\n- 7\" x 21\" (as shown in the picture with early American stain)\n\n**Customization:**\n- Backer can be stained or painted in any color from the provided color charts\n- Text color can only be black or white\n- Orientation can be vertical or horizontal\n\n**Mounting:**\n- Comes with either a sawtooth hanger or a d-ring\n\n**Additional Notes:**\n- Wood is sealed with an exterior grade sealer to extend its lifespan\n- It is recommended to keep the sign under a covered area for added protection\n- Shipping to AK and HI may incur additional charges",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to modernize their home exterior",
          "useCase": "Displaying their house number in a stylish and contemporary manner."
        },
        {
          "targetAudience": "Realtors seeking unique closing gifts for new homeowners",
          "useCase": "Providing a personalized and practical housewarming present that enhances the property's curb appeal."
        },
        {
          "targetAudience": "Individuals seeking a unique and thoughtful housewarming gift",
          "useCase": "Expressing their congratulations and well wishes with a personalized address sign that can be treasured for years to come."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=7f7a15cedfc7a173857a187a18e0c27c5e7c8a08%3A1453867189&click_sum=16aacf8f&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:29:49.436096",
      "productId": "xFiA0Rxqkh"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath , Every Day Wreath",
      "description": "This wreath is made to order on a rustic grapevine base with artificial olives and leaves. \nThe grapevines wreath is natural so all the grapevines are different. \nMade from 14\", 18\" and 24\" natural rustic grapevines.\nSize approx: 18\". 22\"and 28\" (tip to tip) \nThis wreath is great for indoor or outdoor use, but a covered or sheltered area is recommended.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in rustic home decoration",
          "useCase": "Adding a touch of rustic charm to their living space"
        },
        {
          "targetAudience": "Homeowners looking for a unique and stylish wreath",
          "useCase": "Enhancing the curb appeal of their home"
        },
        {
          "targetAudience": "Individuals seeking a thoughtful and meaningful gift",
          "useCase": "Expressing love and appreciation to friends and family"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=d5e8655c755670e2ac919ccf12cc7206f0041229%3A630678328&click_sum=ab6126fe&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:29:57.419976",
      "productId": "UZqJTOIcVI"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.\nThe pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.\nThe natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.\nThis high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.\nThis beauty can be hung at any angle.\nI include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.\n\n𝗪𝗿𝗲𝗮𝘁𝗵 𝗗𝗲𝘁𝗮𝗶𝗹𝘀\n• Arrives ready to display\n• Made on an 12\" 14\" 16\" or 18\" wooden or gold metal ring\n• Hand designed using premium materials\n• Wreath is sprayed with a UV protectant\n\n𝗪𝗿𝗲𝗮𝘁𝗵 𝗖𝗮𝗿𝗲\n• Indoor/Outdoor covered use only\n• This wreath cannot be directly exposed to moisture\n\n𝗜𝘁𝗲𝗺 𝗗𝗲𝘁𝗮𝗶𝗹𝘀\n• Some greenery may vary slightly\n• I do hand pick each wreath and take great care in finding quality grapevine.\n• Do to the nature of the grapevine wreath, I cannot guarantee a perfectly round wreath, or exact measurement(within 1-2 inches)",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and apartment dwellers who want to add a touch of rustic charm to their front door or living space.",
          "useCase": "The wreath can be hung on the front door, above the fireplace, or on a wall in the living room to create a welcoming and inviting atmosphere."
        },
        {
          "targetAudience": "People who are looking for a unique and stylish gift for a friend or family member.",
          "useCase": "The wreath can be given as a gift for a birthday, Mother's Day, or any other special occasion."
        },
        {
          "targetAudience": "Event planners who are looking for a way to add a touch of elegance to a wedding or other special event.",
          "useCase": "The wreath can be used as a centerpiece for a table, hung on a wall, or used as a door decoration."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=7d6362c9bc58ec5e8d77ba83185dade8751904c8%3A962426777&click_sum=17d67ad1&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:30:09.838589",
      "productId": "oUlpQFMjGh"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath for front door",
      "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\". Can be enjoyed inside or outside year round for curb appeal!",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters seeking to enhance the curb appeal of their homes",
          "useCase": "Decorating their front doors with a natural and elegant wreath that exudes a farmhouse aesthetic"
        },
        {
          "targetAudience": "Interior designers and decorators aiming to create a warm and inviting ambiance in living spaces",
          "useCase": "Incorporating the wreath as a focal point on walls, above fireplaces, or as a centerpiece on tables to elevate the overall décor"
        },
        {
          "targetAudience": "Event planners and wedding decorators searching for rustic and charming accents",
          "useCase": "Utilizing the wreath as a backdrop for photo booths, adorning arches and entrances, or adding a touch of nature to reception tables to create a memorable and aesthetically pleasing atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=34cc7459f07d41c070678dd7b81aacf70124969e%3A1223343994&click_sum=aee66bab&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:30:18.647494",
      "productId": "eNKBewKyAg"
    }
  },
  {
    "data": {
      "product": "Last Name Doormat",
      "description": "Eco-friendly doormat made from all-natural coir fibers with a vinyl back for durability.  \n\nCARE INSTRUCTIONS\nWe recommend that coir doormats be used in a covered area to be sheltered from the elements. When coir doormats get wet and cannot dry properly, the fibers can soak up the water. The water then pushes the natural coconut oil to the surface of the fibers giving it a darker and stained appearance. This can also deteriorate the design causing it to fade quickly.\nShedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help. \n\nAll rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers. \n\nAll mats are hand cut, so please allow for a 1 inch +/- variance in length. If you are needing an exact measurement, please reach out to us so we can verify that we can provide one that fits your needs. \n\nDoormats are .5 to .75 inches thick.\n\nCUSTOM DESIGN OR PERSONALIZATION ADD-ON\nThis listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing. If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below. \n\nPlease note that we DO NOT offer proofs for pre-designed items unless specifically requested. All custom orders will get a proof, including orders with personalization add-ons.\n\nNo proofs will be provided until after purchase.\n\nPERSONALIZATION ADD-ON: https://bit.ly/PersonalizedAddOn\nCUSTOM DESIGN LISTING: https://bit.ly/CustomDesignDoormat\n\nIf you have questions regarding proofs, personalizations, or custom options, please feel free to send us a message. We would be glad to answer them for you.\n\nBLEMISHED OPTION\nSometimes we get mats with dark spots or other stains and blemishes beyond the natural ones mentioned above. However, they do not inhibit the actual function of the doormat. As a company, we try to be mindful of our waste and genuinely hate the thought of throwing them in a landfill; therefore, we choose to offer them at cost. \n\nPlease note that we do not provide photos of our blemished doormats because our items are made to order, and we cannot guarantee which one you will receive.\n\nWe usually have at least a few blemished items in stock. If you are interested in purchasing the blemished option, please let us know, and we will be glad to add one if available to the listing inventory. There is a limit of 1 per customer per purchase. By buying a blemished mat, you agree to its flaws, and all sales are final.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who prioritize personalization and curb appeal",
          "useCase": "Enhancing the aesthetics of their front door with a custom-made doormat that reflects their family name or a special message, adding a touch of warmth and welcoming ambiance."
        },
        {
          "targetAudience": "Housewarming and wedding guests seeking thoughtful and practical gifts",
          "useCase": "Providing a meaningful and functional item that celebrates the new homeowners or couple, offering a durable and stylish way to welcome guests into their home."
        },
        {
          "targetAudience": "Individuals looking for eco-friendly and sustainable home decor options",
          "useCase": "Offering an eco-conscious alternative to traditional doormats, made from natural coir fibers and featuring a vinyl back for durability, catering to those concerned about environmental impact."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=56bd3983d7b112ddde7576eb0fac277991d59074%3A1168985443&click_sum=58c60869&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T20:30:43.789662",
      "productId": "oJXsqgRtXK"
    }
  },
  {
    "data": {
      "product": "Pizza Doormat",
      "description": "A hand painted pizza doormat made from a durable PVC back and a natural coir front. The doormat measures 18\" x 30\" and is perfect for the outdoors or inside. It is easy to clean, simply give it a good shake. Custom doormats are also available.",
      "targetAudience": [
        {
          "targetAudience": "Housewarming gift givers",
          "useCase": "To give as a thoughtful and unique housewarming gift to friends or family members."
        },
        {
          "targetAudience": "Pizza lovers",
          "useCase": "To add a touch of personality and humor to their doorstep."
        },
        {
          "targetAudience": "People looking for durable outdoor mats",
          "useCase": "To protect their floors from dirt and debris."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=14d89c34ddb06c462c87c67b586f70549c041501%3A612462127&click_sum=29f045a6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:30:52.580602",
      "productId": "mmymaGAGHR"
    }
  },
  {
    "data": {
      "product": "Personalized Welcome Doormat",
      "description": "Personalized Welcome Doormat\nPLEASE READ, IMPORTANT INFORMATION ABOUT PERSONALIZATION\nWe will copy and paste the personalization exactly as you type it into the personalization box for the last name on this design. \"THE\" is automatically applied to the top of the doormat (just like the listing photo) UNLESS you specifically ask us to leave it off in the personalization box. If you do not give us an EST. date, we will automatically leave that off. We can also put anything else on this design besides a last name, PLEASE make sure that you are very clear in your description when placing your order. If you have any questions, please send us a message and we'd be happy to help!\nOur doormats are high quality 100% coir. They are hand painted by me with outdoor industrial paint that has a built in UV protection to help protect the design from wear and fading. Each mat is backed with a slip-resistant sturdy PVC rubber backing. We offer a variety of sizes and all of our mats are 1 inch thick.\nThe mats are best placed under a covered area such as a porch, we do not recommend placing mat in areas of direct sunlight, rain, or snow.\nCARE: clean by giving the mat a good shake. Best to keep in a dry area such as a covered entryway, we DO NOT recommend direct sunlight, rain or snow as that will fade & cause wear to your doormat!\nDue to the nature of our product, RETURNS WILL NOT BE ACCEPTED DUE TO WEAR OR FADING. Doormats will not be refunded or replaced from wear.*FLAWED DOORMATS: When we order our doormats, some come with slight imperfections such as dark spots, slight staining, small chipped corner or a small hole on the back of the mat not visible from the front of the doormat. If you are interested in a flawed doormat please send us a message and we will let you know if we have any in stock. If we do have any available, we will send you a photo of the doormat for you to approve before moving forward on the order. PLEASE NOTE, all flawed doormats are sold at a HUGE discounted price and all sales are FINAL. You are agreeing to the flaws during messaging and finalize the sale when you purchase the doormat.\nWe suggest replacing your doormat every few months as doormats tend to be a seasonal item. We are always adding more items so be sure to check back here for our new designs :)\nEach mat is unique. Some may be darker or lighter than the photo, coir is made from the husks of coconuts and some fibers might be thicker or thinner than others. There may also be chunks of the husks in the fibers.\nWe love CUSTOM ORDERS! Message us and let us know what you have in mind and we'll make it happen",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who prioritize personalization and unique home decor",
          "useCase": "Using the doormat to add a touch of customization to their entryway, showcasing their family name or a special message."
        },
        {
          "targetAudience": "Individuals seeking functional and stylish home accessories",
          "useCase": "Utilizing the doormat to enhance the aesthetics of their home while also providing a practical solution for wiping shoes."
        },
        {
          "targetAudience": "People looking for thoughtful housewarming or closing gifts",
          "useCase": "Gifting the doormat to new homeowners or those celebrating a special occasion, offering a personalized and memorable present."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=93dfa958c2ac8975616bf0345db1c8abe3e3c9fe%3A1183106995&click_sum=f869a953&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:31:08.135905",
      "productId": "DYVabMzedc"
    }
  },
  {
    "data": {
      "product": "WELCOME SIGN",
      "description": "This adorable welcome sign will add a colorful touch to your front door. It is made of solid wood with painted on letters, not vinyl stickers or spray paint, ensuring durability and a clean look. The sign has a distressed and rustic look, giving it a charming and aged appearance. It is available in four sizes: 5 feet x 9 1/4 inches, 4 feet by 6 1/2 inches, 3 feet by 5.5 inches, and 2 feet by 5.5 inches wide. The sign can be placed anywhere you like, simply resting it back against something or attaching a stake to it for a freestanding display. It is recommended to place the sign in a covered location to extend its life. ",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of rustic charm to their front door",
          "useCase": "Displaying the sign on their front porch or entryway to greet guests and create a welcoming atmosphere"
        },
        {
          "targetAudience": "Individuals who appreciate handmade and unique home decor",
          "useCase": "Using the sign as a statement piece in their living room, bedroom, or other living space"
        },
        {
          "targetAudience": "People who value durability and longevity in their home decor",
          "useCase": "Choosing the sign for its solid wood construction and durable paint, ensuring it will withstand the elements and provide years of enjoyment"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=a67042db1104d8c98bfd27bb22d270150d95613e%3A775841802&click_sum=d86cbad9&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T20:31:19.547894",
      "productId": "oHUBYWLqqc"
    }
  },
  {
    "data": {
      "product": "Set of 2 Large Wooden Porch Vases with Welcome Sign",
      "description": "These wooden porch vases add rustic charm to your porch or living room. They feature a welcome sign and rustic vases in one. The vases are made from reclaimed wood that has been sanded and stained gray. The large vase measures 24\" x 6\" and the smaller one measures 18\" x 6\".",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters who value rustic and farmhouse decor",
          "useCase": "Adding a touch of rustic charm to their porch or living room by displaying the vases with large stems or branches."
        },
        {
          "targetAudience": "Individuals searching for unique and eye-catching entryway decor",
          "useCase": "Using the welcome sign and vases to create a welcoming and inviting atmosphere for guests."
        },
        {
          "targetAudience": "People looking for a practical way to display house numbers",
          "useCase": "Customizing one of the vases with their house number for easy identification and improved delivery accuracy."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=dd65e3e70696be2959630d1074532c825260baac%3A511215666&click_sum=9d60ca37&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:31:27.357584",
      "productId": "zfpqyGjyVc"
    }
  },
  {
    "data": {
      "product": "Metal Wall Art",
      "description": "Made with 18 guage steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. \nAdd a touch of elegance to your home on the inside, outside, or both! \nEach sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.\n• 18 Gauge Steel\n• 5 Color Options (Black, Red, White, Copper, Silver)\n• 6 Sizes - 36\", 30\", 24\", 18\", 14\", 12\" *Selected size is based on the maximum height or width of the sign depending on physical orientation\n• Mounting Hardware Not Included",
      "targetAudience": [
        {
          "targetAudience": "Families looking for a personalized way to welcome guests to their home",
          "useCase": "Displaying the sign on the front door or in the entryway to create a warm and inviting atmosphere"
        },
        {
          "targetAudience": "Couples getting married who want a unique and meaningful way to commemorate their wedding",
          "useCase": "Using the sign as a wedding decoration or as a keepsake to display in their home"
        },
        {
          "targetAudience": "Homeowners looking for a stylish and durable way to add personality to their home decor",
          "useCase": "Hanging the sign on a wall in the living room, bedroom, or kitchen to create a focal point or to complement the existing decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=6edd23ea6f301dc8cad832d297185982e2c4704b%3A1095987590&click_sum=b89ba745&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:31:37.370273",
      "productId": "qoKeXWdXwb"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce",
      "description": "This utility style sconce is perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.\nThe sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.\n\nFINISH OPTIONS\n-----------------------\n\n• Black - Durable satin powder coated finish\n• Brushed Nickel - Lightly brushed with a semi-satin finish\n• Antique Brass - Made of solid brass that has been aged and lacquer sealed\nThis lamp is UL listed and thoroughly tested before leaving our shop!\n\nBULBS NOT INCLUDED\nRecommended Bulb:\nLED Edison 7w (60w)\nBulbs for your light can be purchased in our Bulbs section\n\nDIMENSIONS\n--------------------\n\nHeight: 10\"\nWidth: 10\"\nDepth: 12.5\"\n\nShade\nHeight: 3.25\"\nWidth: 10\"\n\n5\" Wall Canopy\nClearance From Wall: 2\"\n\nThis light fixture is compatible with a dimmer switch.\n\nLAMP SPECS\n------------------\n\nSocket: Standard Medium Base (e26/e27)\nOn/off type: Turns on and off at socket.\nInstallation: Direct Wired into wall (Installation Hardware Included)\n\nIf you would like to make this light a plug-in fixture:\nPlease visit our Add Ons for Fixtures section to customize your fixture.\n\nThis Light fixture is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts.\n\nPlease provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.\nDon't hesitate to reach out if you have questions!",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking an industrial-style lighting solution for their homes or businesses",
          "useCase": "Installing the sconce in a bedroom, bathroom, or workspace for ambient lighting and a touch of industrial flair."
        },
        {
          "targetAudience": "Design enthusiasts who appreciate the versatility and aesthetics of adjustable lighting",
          "useCase": "Utilizing the adjustable shade to direct light for specific tasks or create a unique ambiance in a room."
        },
        {
          "targetAudience": "Homeowners who prioritize safety and durability in their lighting fixtures",
          "useCase": "Choosing the UL-listed sconce for peace of mind and its durable finish for longevity in various indoor environments."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=ed45cb5a553182b4c6340497e0801ff631cd0c5a%3A615762911&click_sum=418790d7&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:31:50.422788",
      "productId": "ZSvdyRbAGK"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern",
      "description": "This contemporary and minimalist European Lantern design features sleek integrated LED that provides ample light. The sturdy die-caste aluminum construction with a weather-proof coating ensures longevity. ETL certified for wet locations and all climates, this energy-efficient fixture boasts integrated LED lights that last an average of 40,000 hours, eliminating the need for frequent bulb replacements. Versatile for both residential and commercial use, it's perfect for exterior entrances, garages, patios, porches, restaurants, common buildings, office spaces, and multi-use buildings. Installation is a breeze with the patented easy installation hardware, requiring no electrician and taking less than 10 minutes.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to upgrade their outdoor lighting with a modern, energy-efficient fixture.",
          "useCase": "Installing the wall lantern on the exterior of their home to provide ample lighting for entrances, patios, or porches."
        },
        {
          "targetAudience": "Commercial property owners or managers seeking durable, weather-proof lighting for their buildings.",
          "useCase": "Utilizing the fixture in common areas, office spaces, or multi-use buildings to enhance safety and curb appeal."
        },
        {
          "targetAudience": "Architects or designers seeking a stylish and functional lighting solution for residential or commercial projects.",
          "useCase": "Incorporating the wall lantern into their designs to create a contemporary and inviting atmosphere."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=1ab5cd8260668d31b14e204a74ed62a997aac30d%3A1165269880&click_sum=cffecdf3&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:32:02.250051",
      "productId": "FdhEWFHHmF"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce",
      "description": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated finish. FINISH OPTIONS - Our Brass finish features solid unfinished brass that is hand burnished before leaving our shop. The finish will age and patina over time giving the finish a soft natural look. Please wear gloves while installing all fixtures. Installing raw brass with bare hands will tarnish the finish. If you would like the finish to be protected: Please purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section. - Black - Durable satin powder coated finish - Brushed Nickel - Lightly brushed with a semi-satin finish -Polished Nickel - Mirror like finish with a warm feel - Antique Brass - Made of solid brass that has been antiqued and lacquer coated This lamp is UL listed and safety tested before leaving our shop! BULBS NOT INCLUDED Suggested Bulbs for your light can be purchased in our bulb section DIMENSIONS Height: 9\" Width: 7\" Depth: 10\" Shade: Height: 4.25\" Width: 7\" Clearance from Wall: 2.55\" Wall Canopy This light fixture is compatible with a dimmer switch. SPECS Socket: Standard Medium Base (e26/e27) On/off type: Controlled from light switch Installation: Direct Wired into Wall (Installation Hardware Included) If you would like to add an On/Off switch or make this light a plug-in fixture: Please visit our Add-Ons for Fixtures section to customize your fixture. This Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts. In order to keep the lamp temperature cool, please use LED bulbs only. Please provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box. Don’t hesitate to reach out if you have questions!",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and interior designers interested in adding a modern farmhouse touch to their living spaces.",
          "useCase": "Installing the sconce in hallways, living rooms, bedrooms, or dining areas to provide ambient lighting and create a warm and inviting atmosphere."
        },
        {
          "targetAudience": "Business owners and contractors seeking stylish and durable lighting solutions for commercial spaces.",
          "useCase": "Utilizing the sconce in hotels, restaurants, offices, or retail stores to enhance the ambiance and complement various interior design aesthetics."
        },
        {
          "targetAudience": "DIY enthusiasts and lighting aficionados looking for unique and customizable fixtures.",
          "useCase": "Purchasing the sconce to personalize their living spaces, experiment with different finish options, and create a bespoke lighting design."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=9a09e0ac67e351434f3536e3c99ab4fe77763d47%3A1051791566&click_sum=721a9894&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:32:14.847418",
      "productId": "jLkXKsTpxz"
    }
  },
  {
    "data": {
      "product": "Linen bedding set, Double king duvet cover and pillows in Green color, 100% natural flax sheets set custom sizes",
      "description": "Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.\nHere at SOUTH, we don't do shortcuts. We are crazy about effortless luxury, comfort, sustainability, and quality. That means we use only top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home - the more you use it, the more fabulous, soft, and YOURS it will become!\n\nWHY OUR LINEN IS SO AMAZING?\nLinen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. Also, we use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.\n\nREADY AS A GIFT\nA linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.\n\nDETAILS:\n- Includes one duvet cover + 2 pillowcases;\n- Composition: 100% linen;\n- Color: Green;\n- Duvet cover closure type - buttons.\n- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)\n- Hypoallergenic, thermoregulating, breathable.\n- Ethically made in Lithuania;\n- Write in the comments if you need to attach ties to the corners of your duvet cover.\n\nSIZE CHART:\nUNITED STATES\nUS Twin + Standard pillowcases\nDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cm\nUS Full + Standard pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cm\nUS Full + Queen pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cm\nUS Queen + Standard pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cm\nUS Queen + Queen pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cm\nUS Queen + King pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cm\nUS King + Standard pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cm\nUS King + Queen pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cm\nUS King + King pillowcases\nDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cm\nUS CA King + Standard pillowcases\nDuvet 104x94” / 264x239cm, pillowcases\t20x26” / 51x66cm\nUK / EUROPE\nEU Single + Standard pillowcases\nDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cm\nEU Double + Standard pillowcases\nDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cm\nEU King + Standard pillowcases\nDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cm\nUK Single + Standard pillowcases\nDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cm\nUK Double + Standard pillowcases\nDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cm\nUK King + Standard pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cm\nUK King + King pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cm\nAUSTRALIA\nAU Queen + Standard pillowcases\nDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cm\nAU King + Standard pillowcases\nDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm\n\nCUSTOM SIZES:\nIf your comforters are a different size than our standards - no worries, just message us with your measurements and we will make you your perfect bedding set. No extra charge\n\nEFFICIENCY\nUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.\n\nCARE GUIDE:\n- Wash at or below 60 C/140F;\n- Do not bleach;\n- Tumble dry on low heat;\n- Iron on low heat;\n- Do not dry clean.\n\nSHIPPING:\nWe ship worldwide:\n- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).\n- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking luxurious and comfortable bedding",
          "useCase": "Upgrading their sleep experience with soft and durable linen sheets that provide year-round comfort."
        },
        {
          "targetAudience": "People with allergies or sensitive skin",
          "useCase": "Choosing hypoallergenic and breathable linen bedding that promotes a healthy sleep environment."
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Opting for sustainable and ethically made linen bedding that minimizes environmental impact."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=6ad5a848c56f6ac47496babdc395645d4423f936%3A1316603667&click_sum=f49f0cc9&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:32:41.980148",
      "productId": "OybxtGOIgp"
    }
  },
  {
    "data": {
      "product": "Linen Pillowcase",
      "description": "Pure 100% Linen pillow cover will provide you maximum comfort.\nBecause of linen's natural qualities, you will feel better and sleep deeper.\n- Price includes 1 Pillowcase\n- Pillowcase closure type - envelope;\n- Color: Almon\n- 100%  Extra Soft Linen ;\n- Fabric is: Oeko Tex 100 certified;\n- Made in Lithuania",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking quality sleep with natural materials",
          "useCase": "Using the pillowcase for a comfortable and restful night's sleep, benefiting from linen's natural temperature-regulating and moisture-wicking properties."
        },
        {
          "targetAudience": "Homeowners and interior designers looking for stylish and durable bedding",
          "useCase": "Incorporating the pillowcase into their home décor, choosing from a range of available sizes and colors to complement their existing bedding and furniture."
        },
        {
          "targetAudience": "Individuals with sensitive skin or allergies",
          "useCase": "Using the pillowcase made from Oeko Tex 100 certified linen, which is gentle on the skin and free from harmful chemicals, providing a hypoallergenic and comfortable sleeping environment."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=8671eb1b2fba806343de58869d4a196cc30d3d45%3A1295727796&click_sum=36fb03a9&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:32:51.710724",
      "productId": "Mrc8SjQAWA"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases",
      "description": "Airy and lightweight, SAUTHS linen bedding is all about the effortless luxury we love to embrace. Our OEKO-TEX certified linen duvet covers are also incredibly durable, and their texture – can you believe it? – only improves with time. Top-quality European linen outperforms all other materials and makes all our products naturally strong, lustrous, and durable. Our products are organic and fully biodegradable. The natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance. Pre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting. We accept CUSTOM ORDERS, so if you haven't found the size needed, let us know! Linen bedding can be the perfect gift for your beloved one and we will beautifully pack it for you, just give it as a note. Personalized Gift messages are available on our branded card.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a comfortable and luxurious bedding experience",
          "useCase": "Upgrading their bedroom with high-quality linen bedding that offers breathability, thermoregulating properties, and durability."
        },
        {
          "targetAudience": "Those with sensitive skin or allergies",
          "useCase": "Finding relief from skin irritation or allergies caused by harsh or synthetic bedding materials, as linen is naturally hypoallergenic and gentle on the skin."
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Supporting sustainable and environmentally friendly practices by choosing bedding made from organic and biodegradable linen, reducing their environmental impact."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=041b1eeb37ca60bce3ecf3d78aec7849ba6a2b92%3A1066602418&click_sum=bce63b15&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:33:03.895234",
      "productId": "BMpYyJGWDL"
    }
  },
  {
    "data": {
      "product": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration",
      "description": "Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life.\n- INTERIOR II -\nThis print is available in three optional sizes:\nA4 - 9” x 12” (21 x 29.7 cm)\nA3 - 11.7\" x 16.5\" (29.7 x 42 cm)\nA2 - 16.5\" x 23.4\" (42 x 59.4 cm)\nEach print is signed and including a white border for framing.\nImportant note: The frame is not included\nThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "To enhance the aesthetic appeal of their clients' homes and create unique, personalized living spaces."
        },
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "To add a touch of sophistication and style to their own homes or to give as thoughtful gifts."
        },
        {
          "targetAudience": "Individuals who appreciate modern and contemporary art",
          "useCase": "To express their personal style and create a visually stimulating environment in their homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=abbeeaf4547691a7b12d97527fa6a4c4e28ba8ec%3A576508683&click_sum=b59d1032&ref=stl_listing-1",
      "dateCreated": "2024-02-20T20:33:12.906594",
      "productId": "WhePxYivVy"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable",
      "description": "This is a digital download of two high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7. This file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crisp print. \n\nThe images are licensed copies for any reasonable PERSONAL PURPOSES, including but not limited to: printing, copying, emailing, and web publishing. Your license does not include use that results in financial gain, including but not limited to: advertising, stock photography, print sale profits, or resale of any nature.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking for unique and stylish wall art to enhance their living spaces.",
          "useCase": "Using the high-resolution JPEG images to print and frame the art, creating a focal point in their living room, bedroom, or office."
        },
        {
          "targetAudience": "Art enthusiasts who appreciate abstract and contemporary styles.",
          "useCase": "Displaying the prints as a gallery wall or using them as inspiration for their own artistic endeavors."
        },
        {
          "targetAudience": "Individuals looking for affordable and convenient home decor options.",
          "useCase": "Downloading and printing the images at their convenience, saving time and money compared to traditional art purchases."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=b77c2b021203282e61aa7da482fd23c44d2474ae%3A834853057&click_sum=13d42f25&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T20:33:23.249706",
      "productId": "Rfy5xMYnmF"
    }
  },
  {
    "data": {
      "product": "Dip dye tapestry, Ombre wall art, Macrame dip dye, Dip dye decor, Dip dye wall hanging, Green wall hanging, Green Décor, Boho wall hanging",
      "description": "This is a made-to-order tapestry, please allow 2-3 weeks for it to be made and shipped.\nThis beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel.\n•\tThis piece is a made to order item, so feel free to contact me if you would like to order this piece in a different size or colour.\n•\tEach wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.\n•\tPlease note slight colour variations may occur.\nHeight 120cm\nWidth 90cm",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and bohemian home decor",
          "useCase": "Add a touch of natural texture and style to their living spaces, creating a warm and inviting ambiance."
        },
        {
          "targetAudience": "Home decorators looking for sustainable and eco-friendly options",
          "useCase": "Incorporate a piece made from upcycled materials, reducing their environmental impact while enhancing their home aesthetics."
        },
        {
          "targetAudience": "Renters or individuals with temporary living situations",
          "useCase": "Easily add a personal touch to their space without causing permanent alterations, creating a sense of home and comfort."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=eb5939d95e32f05f68e2cec2307b349bc0612426%3A991191051&click_sum=e6c9e0a8&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:33:49.975798",
      "productId": "PcXoLJwIFf"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "Handmade, made to order candle with a unique bubble shape. Perfect for home decor or as a gift. Made with natural soy wax and pure white beeswax, it releases a healthy and environmentally friendly aroma when burning. Available in different scents, including High Tide, Pink Sugar Crystals, Magnolia Peony, Pine Forest, and Moonflower. Comes in a variety of colors, including ivory (undyed), gray, dark gray, light brown, and dusty rose. Dimensions: 2 3/8\" H, 2 3/8\" W. Made in the USA.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators",
          "useCase": "Using the candle as a unique and eye-catching decorative piece to enhance the aesthetic appeal of their living spaces."
        },
        {
          "targetAudience": "Gift-givers",
          "useCase": "Purchasing the candle as a thoughtful and visually appealing present for housewarmings, Mother's Day, and other special occasions."
        },
        {
          "targetAudience": "Home fragrance enthusiasts",
          "useCase": "Choosing the candle for its pleasant and customizable scents, which can create a relaxing and inviting ambiance in their homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=d3a35b8b2d891ee851c0518f9dd5fff6e1d3fb33%3A774551709&click_sum=f90d7739&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:33:58.994875",
      "productId": "NlvopbrUGm"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle - Hand-Poured",
      "description": "Peruvian palo santo wood blended with top notes of neroli and saffron - this rich and woody scent also has hints of cedarwood, amber, and moss.\nTop: Neroli, Saffron\nMiddle: Cedarwood, Palo Santo\nBase: Amber, Moss",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a natural and earthy home fragrance",
          "useCase": "Using the candle to create a relaxing and inviting atmosphere in their living spaces."
        },
        {
          "targetAudience": "Candle enthusiasts who appreciate hand-crafted and unique scents",
          "useCase": "Collecting and displaying the candle as a decorative piece or using it to enhance their candle-burning experience."
        },
        {
          "targetAudience": "People with a preference for eco-friendly and sustainable products",
          "useCase": "Choosing the candle as a conscious and responsible purchase that aligns with their values."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=51b4f89df8e6d2a78eb916537a1e3256222e7f46%3A785763623&click_sum=a79f0bcc&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:34:12.575982",
      "productId": "YcikUxAkCk"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle ///  Grapefruit, Hinoki, Cypress",
      "description": "100% Natural Soy + Essential Oil Candle\nCypress / Hinoki / Grapefruit\n\nThe scent of fresh mountain air.\nA cloud of cool mist, rolling through old-growth forests.\nThe clean aroma of Japanese Cypress and dry Cedar, washed clean in a bath of sparkling Pink Grapefruit, create an atmosphere of clarity and tranquility.\n\nUse for: Clarity and Awareness ( see below )\n\n+ 100% Natural\n+ Scented exclusively with essential oils\n+ 8 oz  /  up to 50 hr\n+ Vegan\n+ USA Made Vessel\n+ Hand-poured in Rhode Island\n+ 3.5\" high x 2.5\" wide\n\n---- Folklore ----\nThe Tree of Purity\n\nOnce worshiped as a symbol of the sun goddess, The Hinoki tree has been revered as sacred in Japan for centuries. An emblem of purity and grace, the timber of the fragrant wood has been a traditionally used to build the most sacred of places; shrines and temples.\n\nStill used in many Shinto ceremonies today, Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.\n\nUniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking relaxation and tranquility in their living spaces",
          "useCase": "Using the candle to create a calming and refreshing atmosphere in their homes, offices, or meditation areas, benefiting from its clean and invigorating scent."
        },
        {
          "targetAudience": "Nature enthusiasts and those passionate about Japanese culture",
          "useCase": "Appreciating the candle's connection to traditional Japanese practices and its embodiment of the purity and grace attributed to the Hinoki tree, fostering a sense of connection with nature and cultural heritage."
        },
        {
          "targetAudience": "Individuals prioritizing natural and sustainable living",
          "useCase": "Choosing the candle for its 100% natural ingredients and vegan composition, aligning with their values of environmental consciousness and ethical consumption."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=81b508953ed1396f2b335765b5b23670e2430c13%3A879866486&click_sum=b9747b28&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T20:34:25.345927",
      "productId": "NIPFOICJKJ"
    }
  },
  {
    "data": {
      "product": "Small Wooden Stool",
      "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.\n\n**STOOL DETAILS**\n\n- COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or Black\nWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.\n\n- Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.\n\n- Finished with a natural hard wax oil.\n\n- Weight limit is 120kg\n\n- You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.\n\n- Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.\n\n- Easy to assemble in 5 minutes.\n\n**STOOL DIMENSIONS**\n\n- Seat diameter: 32 cm (12.59\")\n- Height: 41 cm (16.14\")\n\n**IMPORTANT**\n\nYou have three way to see our stains:\n\n- Third photo shows our samples of colors\n\n- When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option\n\n- You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want",
      "targetAudience": [
        {
          "targetAudience": "Interior designers and homeowners seeking a touch of Scandinavian minimalism",
          "useCase": "Incorporating the stool as a versatile side table, plant stand, or extra seating in living rooms, bedrooms, or hallways"
        },
        {
          "targetAudience": "Apartment dwellers with limited space",
          "useCase": "Utilizing the stool's compact size and multi-functionality to maximize space and create a stylish and practical living environment"
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Choosing the stool for its natural wood construction and sustainable hard wax oil finish, contributing to a healthier and more environmentally friendly home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=debcf06eae27460f4bea1d37d952466d20200046%3A570862928&click_sum=05d1a16c&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:34:39.537734",
      "productId": "ZJmnpVFqRP"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.\n\nThe stools are available in two dimensions: \n- Cork stool #1 - Ø 30 x H 39 cm\n- Cork stool #2 - Ø 32 x H 45 cm\n\nThe recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.\n\nThis collection combines the use of a natural material and simple forms.\n\nCollection: Furniture Collection\nMaterial: Natural Cork\nYear: 2020\n\nCare instructions\nYou should:\n> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;\n\nYou should not:\n>clean it with any type of chemical and abrasive product;\n> place hot or sharp objects on the surfaces;\n> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years;",
      "targetAudience": [
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Using the stools as environmentally friendly seating options in homes or public spaces."
        },
        {
          "targetAudience": "Interior designers and architects",
          "useCase": "Incorporating the stools into interior design projects for their versatility and aesthetic appeal."
        },
        {
          "targetAudience": "Businesses and organizations",
          "useCase": "Using the stools as stylish and functional seating solutions in offices, waiting areas, and other commercial settings."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=5266896508acc642ec692ad9f5ad1d0bd8701906%3A793579884&click_sum=5ba03dbf&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:34:49.982157",
      "productId": "cfRhFIBgVj"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "The product is a handmade, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand. It is made of 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels. The product is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow. It is available in two sizes and a variety of colors.",
      "targetAudience": [
        {
          "targetAudience": "Homemakers or interior designers looking for stylish and functional home decor",
          "useCase": "Using the Bonnet Stool as an end table, side table, or plant stand to enhance the aesthetics of their living spaces."
        },
        {
          "targetAudience": "Plant enthusiasts seeking a durable and visually appealing way to display their greenery",
          "useCase": "Utilizing the Bonnet Stool as a plant stand to elevate their plants and create a focal point in their homes or offices."
        },
        {
          "targetAudience": "Professionals or students seeking a sturdy and aesthetically pleasing seating solution for their workspaces",
          "useCase": "Using the Bonnet Stool as a stool to provide additional seating or as a side table to keep essential items within reach."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=2fec5f77b4c4a7e6ca5472d2d3996734a91ade55%3A1198929077&click_sum=2dbc375a&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:34:59.724804",
      "productId": "YEGMBhDOoU"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "The Coiled was designed to dress up your plants in style. It modernizes and brings out the beauty of your plants. \"The Coiled\" exudes a bauhaus/Japanese cool! They all come with a drainage hole and 3 little \"feet\".\n\nSizes (Inside diameter and all measurements are approximate):\n\n2.5\" diameter x 2.25\" tall (6.4 cm x 5.7 cm) (fits standard 2 inch pots)\n4.18\" diameter x 3.75\" tall (10.6 cm x 9.5 cm) (fits standard 4 inch pots) (video shown in this size)\n6.18\" diameter x 5.4\" tall (15.7 cm x 13.7 cm) (fits standard 6 inch pots)\n\nThe colors come in a matte or sheen finish. This listing is for the matte finish colors only. You can find the sheen finish colors in other listings. \n\nI have 2 blacks: the matte black is a soft non-reflective finish while the sheen black has a slight shine to it and a darker black finish. The white and light grey are a sheen finish but appear matte.\n\nAll products are 3D printed out of a plant based bioplastic eco-friendly material. The natural wood and black wood matte finish is mixed with real recycled wood. They're all lightweight, durable and won't break if you accidentally drop them!",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and apartment dwellers who want to add a touch of style to their indoor plants",
          "useCase": "They can use the planter to display their plants in a modern and sophisticated way."
        },
        {
          "targetAudience": "People who are looking for a sustainable and eco-friendly way to pot their plants",
          "useCase": "The planter is made from a plant-based bioplastic material that is durable and won't break if dropped."
        },
        {
          "targetAudience": "People who are looking for a gift for a plant lover",
          "useCase": "The planter is a unique and stylish gift that any plant lover would appreciate."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=20db6132ce587066f927ec161f2a0640b3600867%3A865339439&click_sum=448d152d&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T20:35:13.898351",
      "productId": "mMSgZqBiZY"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter",
      "description": "A floor planter with a nude pink aluminum pot and a brass stand. The pot is 20 cm in diameter and 30 cm tall. The brass stand is 18 cm tall. The planter has a perforated separator inside to collect excess water and protect the roots of plants. Plants can also be placed inside the planter with their pots. The planter can be rotated on its stand to adjust the position of plants. The planter is suitable for all houseplants, especially those that like facing the sun.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts and home decorators",
          "useCase": "Enhancing indoor living spaces with greenery and creating a stylish décor element."
        },
        {
          "targetAudience": "Individuals seeking functional plant solutions",
          "useCase": "Providing a practical and aesthetically pleasing way to display plants, with drainage and adjustable positioning."
        },
        {
          "targetAudience": "Interior designers and home stagers",
          "useCase": "Adding a touch of sophistication and elegance to residential and commercial spaces, complementing various interior design styles."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=dba9124b9326c2410de124fb9163129c5fbdcd16%3A728731403&click_sum=efc3b34f&ref=stl_listing-2",
      "dateCreated": "2024-02-20T20:35:21.620945",
      "productId": "PJjaDPjvww"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter",
      "description": "This handmade stoneware planter features intricate hand-carved details in a vibrant combination of red and pink. With a size of approximately 2.5 inches in height and 3 inches in diameter, it is ideal for housing small cacti or succulents. A small hole at the bottom allows for proper water drainage.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts looking for a unique and stylish way to display their succulents or cacti",
          "useCase": "Using the planter to add a touch of greenery and personality to their home or office space"
        },
        {
          "targetAudience": "Individuals who appreciate handmade and artisan-crafted items",
          "useCase": "Using the planter as a decorative piece in their home or as a thoughtful gift for a friend or family member"
        },
        {
          "targetAudience": "People who are looking for a small and functional planter for their small plants",
          "useCase": "Using the planter to grow and display small plants, such as succulents, cacti, or herbs"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=22aeb5126233a62a826206b384874a11d127d29a%3A1435558019&click_sum=73127900&ref=stl_listing-3",
      "dateCreated": "2024-02-20T20:35:28.707193",
      "productId": "XbNsqTPQku"
    }
  },
  {
    "data": {
      "product": "GPS Coordinates Longitude Latitude Sign",
      "description": "Made to order\nApprox. 8\" x 12\" w/ hanging hardware\nDisplays ONE (1) Coordinate\nPick from Dark Walnut, Briarsmoke, or Early American\nCoordinates will be converted to the style that is pictured\nHand painted (NO DECALS)\nBack of sign is stained and stamped with a logo",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and real estate agents",
          "useCase": "Displaying the coordinates of a special location, such as a house, on a decorative sign."
        },
        {
          "targetAudience": "People who have recently moved",
          "useCase": "Creating a housewarming gift that is both personal and meaningful."
        },
        {
          "targetAudience": "People who are interested in geography or travel",
          "useCase": "Marking the coordinates of a memorable location on a sign that can be displayed as a reminder."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/461000746/gps-coordinates-longitude-latitude-sign?click_key=fe40dc38affe3a6dd6efc9a6b99610d94bcd72ea%3A461000746&click_sum=6d1dc457&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-1&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:35:37.577360",
      "productId": "jKqoYIayKW"
    }
  },
  {
    "data": {
      "product": "Housewarming Candle Gift",
      "description": "Hi, welcome to Hello You Candles!  Our Housewarming Candles are made with 100% American grown, eco-friendly soy wax, and we only use clean burning fragrance and essential oils to scent our candles. Our candles are always free of dyes, harsh chemicals and pollutants and are hand poured in our shop in Laguna Hills, California.  A clean candle is a better candle, better for you and better for the environment.\n\nWHAT YOU WILL RECEIVE:\n\n1 - 4 oz, 9 oz or 16 oz soy candle in the design shown in the first image.  Your candle will arrive perfectly packaged in our signature gift box, complete with complimentary Hello You matches.\n\nMake it personal, add a custom message to the back of your candle (no additional charge :)\n\nCANDLE SCENTS:\n\n♥ VANILLA:  Vanilla | Bourbon | Buttercream\n♥ LAVENDER:  Lavender | Eucalyptus | Cedarwood\n♥ POP THE BUBBLY: Champagne | Strawberries | Guava\n♥ BOUQUET:  Roses | Ylang Ylang | Green Leaves\n♥ WEDDING CAKE:  Champagne | Buttercream | Vanilla\n♥ SPICED HONEY:  Spiced Honey | Dried Tobacco | Tonka Bean\n♥ BEACH DAY:  Sea Salt | Coconut | Tonka Bean\n♥ SPA DAY:  Aloe | Green Florals | Patchouli\n♥ GREAT OUTDOORS:  Pine | White Birch | Cedar\n♥ BLUE SKY:  Sea Salt | Ozone | Cottom Blossom\n♥ HEALING WOOD:  Cardamom | Palo Santo | Sandalwood\n♥ SUNSHINE CITRUS:  Grapefruit | Orange | Lemon | Vanilla\n♥ HERB GARDEN:  Eucalyptus | Rosemary | Sage\n♥ HAPPY HOUR:  Cardamom | Butterscotch | Bourbon\n♥ ENCHANTED FOREST:  Oakmoss | Amber | Sandalwood\n♥ STRONG COFFEE:  Coffee | Cream | Sugar\n♥ BIRTHDAY CAKE:  Buttercream | Vanilla | Sugar\n\nSIZE GUIDE:\n\n~ 4 oz candle measures approximately 2.5 inches tall and 2 inches in diameter, 20 hours burn time.\n~ 9 oz candle measures approximately 3.75 inches tall and 2.75 inches in diameter, 50 hours burn time.\n~ 16 oz candle measures approximately 4 inches tall and 4 inches in wide, 80 hours burn time.\n\nWe ship all candles via USPS 2–3-day priority mail. Please check our shop announcement for our current lead time.\n\nOTHER HELPFUL INFO:\n\nWe do offer a discount on bulk orders, please contact me for details.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who have recently purchased a new home or are relocating to a new place",
          "useCase": "The candle serves as a thoughtful housewarming gift that creates a warm and inviting atmosphere in their new home."
        },
        {
          "targetAudience": "People looking for a unique and personalized gift for a special occasion",
          "useCase": "The customizable message on the back of the candle adds a personal touch, making it a meaningful present for birthdays, anniversaries, or other milestones."
        },
        {
          "targetAudience": "Individuals who prioritize eco-friendly and sustainable products",
          "useCase": "The candle is made with 100% American-grown, eco-friendly soy wax and clean-burning fragrance, appealing to those who value environmentally conscious choices."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/483839218/congrats-on-your-happy-new-home-candle?click_key=1879dee9c82d41a389b8a9dcb742296a26223f67%3A483839218&click_sum=b92cbce3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-2&pro=1",
      "dateCreated": "2024-02-20T20:35:56.455132",
      "productId": "hATbNjdcpS"
    }
  },
  {
    "data": {
      "product": "Engraved Compass",
      "description": "This custom engraved compass is made from top quality solid brass, and is durable for outdoor use.\n\nDiameter: 1.96 inch\nMaterial: Brass\nChain: Comes with the same chain as in the listing pictures\nCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.\n\nEngraving: We can engrave whatever you want and we can use every font that you want.\nThis engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating anniversaries",
          "useCase": "Engraving the compass with a special message or date to commemorate their love and commitment."
        },
        {
          "targetAudience": "Adventurers and outdoor enthusiasts",
          "useCase": "Using the compass for navigation and exploration, while also carrying a personalized keepsake of their experiences."
        },
        {
          "targetAudience": "Individuals seeking unique and sentimental gifts",
          "useCase": "Creating a customized compass with a meaningful engraving, such as a loved one's handwriting or a special symbol, to express their care and connection."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=55a03a92b413873a3e2502f75ae4641ed322c0e1%3A214526797&click_sum=73e99195&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-3&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:36:06.883861",
      "productId": "PAynpxweXb"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift, Photo on Wood",
      "description": "A custom photo printed directly onto round basswood, with no margins or gaps. \nThe photograph becomes an integral part of the wood, ensuring that it will stand the test of time.\nThe natural wood shows through the photo for a beautiful, rustic, and \"worn\" look.\nIt is said that wood elements within your home can bring balance to your space and life.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "A unique and meaningful gift that commemorates their special day and adds a personalized touch to their home."
        },
        {
          "targetAudience": "Individuals looking for a rustic and artistic home décor piece",
          "useCase": "A visually appealing and conversation-starting addition to their living room, bedroom, or office, adding warmth and character to their space."
        },
        {
          "targetAudience": "Photographers and artists seeking a unique medium for displaying their work",
          "useCase": "A creative and eye-catching way to showcase their photographs or artwork, giving their creations a natural and organic feel."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=48b495f8d0902e70e3224ad6dd54d7a4492de568%3A207134258&click_sum=92c4ed42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-4&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:36:16.104174",
      "productId": "RMczClQZz9"
    }
  },
  {
    "data": {
      "product": "Acorn Doorstops",
      "description": "Set of 2 wooden doorstops, hand-turned from Red Oak. Perfect for keeping doors open in summer breezes or for adding extra security to a hotel room door. Each doorstop is a unique work of art, and is believed to bring good luck and safety to the home.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters with doors that don't stay open easily",
          "useCase": "To keep doors open for ventilation or to prevent them from slamming shut"
        },
        {
          "targetAudience": "People who travel frequently and want to add extra security to their hotel room doors",
          "useCase": "To wedge under the door to prevent unauthorized entry"
        },
        {
          "targetAudience": "People who appreciate handcrafted and rustic home decor",
          "useCase": "To add a touch of charm and function to their homes"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/96383212/acorn-doorstops-set-of-2-door-wedges?click_key=a7527abae260e322672a4bc64a6f4ef01d54555f%3A96383212&click_sum=02a87555&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-5&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:36:28.235601",
      "productId": "YxCyiZcqTQ"
    }
  },
  {
    "data": {
      "product": "Custom Quote Print",
      "description": "Create a personalized quote print with your choice of font, background color, and quote. Perfect for dorm decor or as a thoughtful gift. Choose from four sizes: 5x7, 8x10, 11x14, or 13x19. Printed on acid-free paper with archival inks and mailed flat in an envelope protected by cardboard and a cello sleeve (5x7, 8x10) or rolled securely in a sturdy tube (11x14, 13x19). Listing is for print only, frame and styling objects are not included.",
      "targetAudience": [
        {
          "targetAudience": "Students living in dorms who want to personalize their space with meaningful quotes.",
          "useCase": "Students can choose a quote that inspires them or reflects their personality, and have it printed on a custom poster to display in their dorm room."
        },
        {
          "targetAudience": "People who want to create a unique and personalized gift for a loved one.",
          "useCase": "Individuals can choose a quote that is special to the recipient, and have it printed on a custom quote print to give as a gift."
        },
        {
          "targetAudience": "Interior designers and home decorators who want to add a touch of personality to a client's space.",
          "useCase": "Designers can work with clients to choose a quote that complements the client's home décor, and have it printed on a custom poster to display in a prominent location."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/216584231/mailed-print-custom-quote-custom-quote?click_key=e5653ec5488164b95493fe4e3bc19e5affbcf665%3A216584231&click_sum=b53e518f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-6&etp=1",
      "dateCreated": "2024-02-20T20:36:40.036364",
      "productId": "VEufTheUgT"
    }
  },
  {
    "data": {
      "product": "Set of 3 tree ring prints made by hand and signed by Erik Linton. Each 24x36 inches.",
      "description": "You're getting actual handmade woodcut prints. As unique as the tree I make them from. I don't believe in cutting down trees to make my art. I travel to meaningful places to find wood from previously fallen trees.\nIn the main photo, the print on the far left is driftwood from Tillamook, Oregon. The middle print is made from a beautiful Ash tree that comes from Midwestern United states. The print on the far right is from the Carter Lake area, just outside of the National Park. The tree is more than 100 years old.\nI'm more than happy to customize the color and the paper size for you. Just send me a message.\nIf you have a piece of wood you'd like me to make art from just send me a message, I'm happy to do personalized pieces.\nI'm not currently shipping with frames because I've had too many frames get damaged during shipping. But don't hesitate to ask me for suggestions.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Decorating their homes or workspaces with unique and handmade artwork that celebrates the beauty and history of trees"
        },
        {
          "targetAudience": "Nature lovers and environmentalists",
          "useCase": "Appreciating the sustainable and ethical approach to creating art, using wood from fallen trees to tell the story of a place over time"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Adding a touch of natural beauty and warmth to residential or commercial spaces, creating a sense of connection with the outdoors"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/536496958/tree-rings-print-three-panel-wall-art?click_key=38053f459fdc41218915569be5469b7ce7cc34b1%3A536496958&click_sum=3a15cdb5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-7&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:36:54.297191",
      "productId": "uBHjSlVKpB"
    }
  },
  {
    "data": {
      "product": "Watercolor seascape painting",
      "description": "This is a giclee print of my own original watercolor painting. Printed with colorfast ink on premium archival fine art paper. Prints are signed in the back and have a white border for easy framing.\nI live on the wild and beautiful coast of Downeast Maine. We moved to an old, old house with a small farm in the forest, near the water. There is nothing I love more than taking quiet time for myself out on the water.\nPrinted on Epson Velvet Fine Art Paper because it is very similar to the original paper these were painted on. Options for paper size are:\n8.5 X 11 inches  $50\n13X19 inches     $70\n17 X 22 inches   $85\nNot all images fit standard paper sizes and may need custom frames.\nMost images can be custom printed larger on paper or canvas, just go to \"custom\" or convo me with you wish and I will do everything to make it happen.\nEach print is packaged in a  protective, acid-free sleeve and shipped in a flat cardboard mailer. I usually ship the print by regular mail the day after I receive the order. I am very happy to accommodate special orders like larger prints or portraits. Prices do apply.\nPlease feel free to convo me with any questions or requests. I love comments and convos from people around the world!",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Collecting and displaying the print as part of their art collection, appreciating its aesthetics and emotional resonance."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the print into home decor, enhancing the ambiance and creating a serene and coastal atmosphere in living spaces."
        },
        {
          "targetAudience": "Individuals seeking coastal-inspired artwork",
          "useCase": "Displaying the print in their homes or offices to evoke a sense of tranquility and connection to the natural beauty of the ocean."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/247020065/watercolor-seascape-painting-archival?click_key=8b011e8989f1d734565eb9b844b2caacc6a2a151%3A247020065&click_sum=14ed6aca&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-8&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:37:07.784213",
      "productId": "IOb41hWaIJ"
    }
  },
  {
    "data": {
      "product": "Engraved Slate House Number",
      "description": "These attractive slate sign designs are carefully designed to give your house number a modern, clean look.\n\nFirstly the slate is beveled and drilled in order to create a softer appearance around the edges and allow it to be attached to a wall.\n\nYour chosen number is then classically hand engraved with deep \"V\" cut lettering, not sandblasted or laser engraved like most other numbers. This gives an attractive depth to each number, allowing the number to stand out against the natural slate. Please note only Capital letters available in  \"V\" Cut.\n\nThe numbers are then given three layers of base paint, and a final layer of high gloss finish, this creates a brilliant white number. The slate is then waxed to bring out the natural colors of the slate and increase its durability and then finally it is carefully wrapped and packed.\n\nSize:\n2 digit numbers - 140mm x 100mm\n3 digit numbers - 200mm x 100mm\n4 digit numbers - 250mm x 100mm\n5 digit numbers - 250 to 300mm x 100mm\n\nExamples : 34, 34a, 56B, 78bis, 4567, 86543, 78i    (ie we can make anything)\n\nIf you request a number with lower case letters we will engrave the sign on our computer engraver which engraves flat digits/letters rather than the \"v\" cut.\n\n1&2 digit numbers will be dispatched Same Day\nOther numbers (3/4/5 digit) will be made and dispatched Next Day\n(all orders placed up to 3pm)\n\nLooking for something bigger? Check out our shop.\n\nPostage: Free UK ,  Europe £8 (air mail), Rest of the world £10 (air mail)\n\nHow to order:\nSimply select the correct option for your number from the drop down list.\nThen complete the personalization box with you required house number.\n(Numbers and letters can be accommodated   eg No 26A is classed as a 3-digit number)\nAny queries, please do not hesitate to contact us.\n\nGuarantee:\nIn the unlikely event you are at all unhappy with your purchase we offer to remake your number or give a full money back guarantee.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a stylish and durable house number",
          "useCase": "Displaying the house number clearly and prominently on the exterior of their home, improving visibility for visitors and delivery services."
        },
        {
          "targetAudience": "Businesses and organizations seeking a professional and eye-catching way to display their address",
          "useCase": "Enhancing the visibility and accessibility of their premises, making it easier for customers and clients to locate."
        },
        {
          "targetAudience": "Architects and designers involved in residential or commercial projects",
          "useCase": "Incorporating the house number into the overall design of a building, complementing the architectural style and enhancing the aesthetic appeal."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/175265406/engraved-slate-house-number?click_key=8f1eca1e7eeece662ce014f4aa58fedefd59786e%3A175265406&click_sum=cff13348&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-9&etp=1",
      "dateCreated": "2024-02-20T20:37:25.621152",
      "productId": "fRnWnhaPuW"
    }
  },
  {
    "data": {
      "product": "Personalized Zip Code Pillow",
      "description": "The Personalized Zip Code Pillow is a unique and thoughtful gift for any occasion. It can be customized with any number, making it perfect for commemorating a special date, address, or event. The pillow is made from a soft linen blend fabric and features a hidden zipper closure. It is printed with natural water-based pigments and is available in a variety of colors. \n\n**Details:**\n\n* Size: 18\"x18\" or 20\"x20\"\n* Fabric: Soft linen blend\n* Closure: Hidden zipper\n* Ink: Natural water-based pigments\n* Colors: Natural, Off White, Rose, and Light Grey\n\n**How to Order:**\n\n1. Specify the fabric color.\n2. Choose the size pillow \"w/ Insert\" or \"Cover Only\".\n3. Leave the set of numbers desired for your pillow.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or home decorators looking to add a personalized touch to their living space",
          "useCase": "Using the pillow to add a unique element to their home decor, showcasing their address or a special date"
        },
        {
          "targetAudience": "Individuals looking for a thoughtful and unique gift for a housewarming, wedding, or anniversary",
          "useCase": "Gifting the pillow to a special someone to commemorate a milestone or to add a personalized touch to their new home"
        },
        {
          "targetAudience": "People who frequently move or have a strong connection to their address",
          "useCase": "Using the pillow to display their current or former address as a nostalgic or sentimental reminder"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/458504940/personalized-zip-code-pillow?click_key=e7d672b893f0c7b07483a67a84fa3ad6849ba513%3A458504940&click_sum=f6b6ea19&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-10&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:37:36.514948",
      "productId": "ElXpBrgusI"
    }
  },
  {
    "data": {
      "product": "Rainbow Candle",
      "description": "This colorful rainbow candle is made with six layers of scented soy wax, each with a different scent including Violet Lime, Sandalwood Vanilla, Carolina Sweetgrass, Apple Orchard, Mandarin Orange, and Vanilla Beans. It makes a great gift for a hostess, friend, or anyone who needs a little color in their life. The candle adds a pop of color to any decor, whether modern or rustic, and has a long burn time of over 64 hours. It is made with eco-friendly paper and cotton wicks, and comes in a 16 oz jar. All orders arrive in attractive gift wrapping.",
      "targetAudience": [
        {
          "targetAudience": "Homemakers looking to add a touch of color and fragrance to their living spaces",
          "useCase": "Using the candle as a decorative piece and a source of pleasant scents to create a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Gift seekers searching for unique and thoughtful presents",
          "useCase": "Purchasing the candle as a gift for friends, family, or acquaintances to show appreciation or brighten their day."
        },
        {
          "targetAudience": "Individuals seeking relaxation and stress relief",
          "useCase": "Lighting the candle during meditation, yoga, or simply unwinding at home to create a calming and soothing ambiance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251774155/rainbow-candle-soy-candle-with-6?click_key=f51928538473c615ed8a71bd123a5814c1b5a60f%3A251774155&click_sum=3ad6169a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-11&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:37:45.152956",
      "productId": "JVDJPNoAXX"
    }
  },
  {
    "data": {
      "product": "Strong Coffee Scented Candle",
      "description": "This candle is made with 100% American grown, eco-friendly soy wax, and scented with clean burning fragrance and essential oils. It is free of dyes, harsh chemicals, and pollutants, and is hand poured in Laguna Hills, California. The candle comes in three sizes: 4 oz, 9 oz, and 16 oz. The 4 oz candle has a burn time of 20 hours, the 9 oz candle has a burn time of 40 hours, and the 16 oz candle has a burn time of 70 hours. The candle can be personalized with a message printed on the back.",
      "targetAudience": [
        {
          "targetAudience": "Coffee enthusiasts who enjoy the aroma of coffee without the caffeine effects",
          "useCase": "Using the candle to create a cozy and inviting atmosphere while relaxing or working."
        },
        {
          "targetAudience": "Individuals seeking natural and eco-friendly home fragrances",
          "useCase": "Using the candle as a non-toxic alternative to air fresheners or other synthetic scents."
        },
        {
          "targetAudience": "People looking for personalized and thoughtful gifts",
          "useCase": "Giving the candle as a gift with a special message printed on it, creating a unique and memorable present."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/291976457/strong-coffee-scented-candle-scented-soy?click_key=50e70c0816007373c6b691bacf1eeb4af4531c0d%3A291976457&click_sum=f87fd824&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-12&pro=1",
      "dateCreated": "2024-02-20T20:37:54.979869",
      "productId": "vryisVrjJF"
    }
  },
  {
    "data": {
      "product": "Decorative Eggs, Artifical Eggs, Red Eggs, Speckled Egg",
      "description": "Decorative Eggs\nI love.  It marks that time of year when the world bursts forth with color and we greet spring .  These hand dyed eggs bring all those spring colors into your home.   You will receive a set of 12 hand dyed and hand-painted, plastic eggs.  Add them to your Egg Tree or place them in a vase on your room table.  If you are feeling adventuresome make a wreath or swag incorporating these beautiful eggs.  Scatter them across your  fireplace mantel or display them in a bowl on your foyer table.\nYou will receive 12... all 12 hand dyed and hand-painted.  The plastic eggs measure approximately 2 1/2 inches by 1 3/4 inches and you have several colors to choose from.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy decorating their homes for Easter",
          "useCase": "Using the eggs to add a festive touch to their Easter décor, such as by placing them in a vase on the dining room table or scattering them across the fireplace mantel."
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Incorporating the eggs into Easter-themed wreaths, swags, or other decorative projects."
        },
        {
          "targetAudience": "Parents with young children",
          "useCase": "Using the eggs for Easter egg hunts or other Easter-themed activities with their children."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/267294526/decorative-easter-eggs-artifical-easter?click_key=be68c8e9f32112652986810bbef707f0b3c85f8a%3A267294526&click_sum=eadb8144&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-13&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:38:10.074555",
      "productId": "EVuXOpOkAO"
    }
  },
  {
    "data": {
      "product": "Pineapple Door Hanger",
      "description": "Add a touch of charm and cheer to your home with this Pineapple Door Hanger. This wreath is full and created with love using a high-quality steel, then powder -coated with a beautiful long-lasting UV finish with the intention of lasting longer than the average wreath in an outdoor setting. This wreath is a classic and will compliment any decor.\n\n**WHAT'S INCLUDED**\n*1 EA ( Personalized metal sign like the example photo )\n*Mounting hardware is NOT included\n\n**SIZES AVAILABLE**\n• 20\" Tall x 10\" Wide (seen in photo 1&2- color metallic gold)\n• 26\" Tall x 13\" Wide (seen in photo 3- color golden yellow)\n\nAvailable with or without an over-the-door hook for easy hanging.\nOver-the-door hook dimensions are\n1\" wide x 16\" Long\n\n**FEATURES & DETAILS**\n• Made of Heavy-Duty, American-Sourced, Cold-Rolled Carbon Steel\n• Each sign is hand-designed and laser cut using top-of-the-line laser technology, which produces superior cuts & and precise edges\n• Triple sanded for a high-quality, smooth finish so it won't damage your door\n• Weights approximately- 12\" -2lbs , 18\" - 4lbs , 24\" -6lbs, 30\" -10-12lbs.\n•Professionally powder coated on both sides for indoor or outdoor use.\n• Fade & Rust Resistant\n• All text will be showcased in uppercase lettering like the listing photo.\n\n**EASY ORDERING INSTRUCTIONS**\n1. Select your preferred SIZE and add-on options. from the first drop-down menu (All sizes are shown in inches.\n2. Select your POWDER COAT COLOR selection from the second drop-down menu (If your preferred color is not listed in the dropdown menu, please select “Other”, then type the name of your color selection in the “Add Your Personalization” box at the bottom of the form)\n3. Enter your personalization details if required - see the instructions above the personalization box section. Please be sure to include all personalization that is required.\n4. Add an item to your cart and proceed through checkout. Add any special notes in the “Notes to Seller” box at checkout.\n\n**OTHER DETAILS**\n• Each sign is custom-made to order.\n• All items are intended for decoration purposes only, not intended for use by children, please handle them with care.\n•We Proudly offer Free shipping to the Contiguous United States for this item on orders over $35.\nFor shipping to Alaska, Hawaii, and Puerto Rico, please contact us for a shipping quote\n• We welcome custom orders, contact us with your ideas for a quotation.\n•If you have any questions or concerns, please contact us! We are always happy to assist.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to enhance their front door decor with a stylish and durable wreath",
          "useCase": "The wreath's UV-resistant finish and high-quality construction make it suitable for year-round outdoor use, providing a welcoming touch to the home."
        },
        {
          "targetAudience": "Individuals seeking a unique and personalized gift for a housewarming, birthday, or other special occasion",
          "useCase": "The wreath's customizable metal sign allows for personalized messages or names, making it a thoughtful and meaningful present."
        },
        {
          "targetAudience": "Interior designers or home decorators searching for a versatile and elegant accent piece",
          "useCase": "The wreath's timeless design and available color options make it compatible with various home decor styles, adding a touch of charm and sophistication to any space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/267098338/pineapple-front-door-wreath-front-door?click_key=b80f13e1e72aa55039644205dbc9579293656d04%3A267098338&click_sum=3aca8d33&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-14&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:38:33.838445",
      "productId": "odbooKpfeM"
    }
  },
  {
    "data": {
      "product": "Inspirational Wall Decals - You're Beautiful",
      "description": "These decals can be used on mirrors and walls.\n\nFor many years of my life, I struggled with low self esteem and poor body image. I would look at myself and see an ugly person who was never pretty enough or good enough. In 2012, I came up with the idea to create inspirational mirror decals to put on my mirror to help me remember that I am beautiful. Since then, this design has changed thousands of lives for the better, reminding them that they are truly beautiful.\n\nOur You're Beautiful wall decals are so inspirational. Use them as mirror decals for a daily dose of motivation. We're all guilty of looking in the mirror and grumbling about how unattractive we think we are. These mirror stickers say You're Beautiful and are the perfect way to remind someone daily that they truly are beautiful. This decal makes great gifts for mom, gifts for women and gifts for girls. They also make great wall decals for kids who need to hear that they are beautiful.\n\nThese decals can be used as mirror decals or wall art, and can be applied to any smooth clean surface. All of our wall stickers have a matte surface and are cut out with no backgrounds, so our decals will look like they were just painted on.",
      "targetAudience": [
        {
          "targetAudience": "Women with low self-esteem and poor body image",
          "useCase": "Using the decal as a daily reminder to challenge negative self-talk and promote self-love."
        },
        {
          "targetAudience": "Parents of young children",
          "useCase": "Applying the decal to their children's mirrors to instill positive self-image and body acceptance from a young age."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the decal into bathroom or dressing room designs to create an inspiring and uplifting atmosphere."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/110728100/inspirational-wall-decals-youre?click_key=14f503d33291fb7968fabbc164e5d30a8a424c1a%3A110728100&click_sum=cd348afe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-15&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:38:46.222895",
      "productId": "sAxNTudbJr"
    }
  },
  {
    "data": {
      "product": "Personalized 3D Family Sign",
      "description": "The beautiful 3D Family sign is a stunning display piece to add to your home or will be a unique wedding or anniversary gift for a couple. The raised lettering creates an appealing 3D effect that adds depth and character to the piece. These wood signs make amazing personalized gifts for Christmas, weddings, anniversaries, and housewarmings.\n\nThe sign is produced manually, with each board carefully selected and painted to give it a textured appearance. The backboard is made from 1/2\" Baltic Birch plywood for a strong and sturdy base, while the letters and graphics are cut from 1/4\" plywood and mounted on top. The cut raised lettering gives depth and adds a gorgeous 3D effect.\n\nThe sign is approximately 6\" x 13\" or 8\" x 20\", with a thickness of 3/4\" for added robustness. Different background colors are available, and the letters on the sign are not painted but are the color of natural wood. The item comes with a sawtooth hanger for easy hanging.\n\nTo personalize the order, provide the last name and established date (or date) in the \"personalization\" box upon checkout. The sign is completely customizable, so don't hesitate to message with specific requests.",
      "targetAudience": [
        {
          "targetAudience": "Newlywed couples",
          "useCase": "As a unique and personalized wedding gift that commemorates their special day and adds a touch of rustic charm to their home decor."
        },
        {
          "targetAudience": "Homeowners or decorators",
          "useCase": "As a custom home wall decor piece that reflects their family's name and adds a warm and inviting touch to their living space."
        },
        {
          "targetAudience": "Gift-givers",
          "useCase": "As a thoughtful and meaningful gift for anniversaries, housewarmings, or any other special occasion where a personalized touch is desired."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/568318925/last-name-established-sign-personalized?click_key=2a5753110508b8d56532f27c6c283d2d770f4b00%3A568318925&click_sum=b610a374&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-16&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:38:58.856528",
      "productId": "NScVeCuRFR"
    }
  },
  {
    "data": {
      "product": "Baby Mobile, Bird Mobile for Baby",
      "description": "This baby mobile is made from 100% merino wool felt and features a variety of colorful birds. It is available in 33 different colors and comes with a free ceiling hook. The mobile is designed to hang from a standard 8 ft. ceiling height, but an extra piece of cord can be included for higher ceilings. It is not a toy and should be kept completely out of reach of babies and young children.",
      "targetAudience": [
        {
          "targetAudience": "Parents with infants",
          "useCase": "Provides a gentle and soothing distraction for babies in their cribs, allowing parents to attend to other tasks."
        },
        {
          "targetAudience": "Individuals seeking unique and modern nursery décor",
          "useCase": "Enhances the aesthetic appeal of a nursery with its stylish and contemporary design."
        },
        {
          "targetAudience": "People looking for high-quality, eco-friendly baby products",
          "useCase": "Offers a sustainable and durable mobile made from premium materials that are safe for babies."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/175420905/baby-mobile-bird-mobile-for-baby-crib?click_key=d5adbf3929b84076c087fa58809d66de849dfca6%3A175420905&click_sum=c4f60c42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-17&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:39:08.477863",
      "productId": "NxvGzKHsky"
    }
  },
  {
    "data": {
      "product": "One Pair of 12 Inch Beeswax Candles - Tall Tapers - Beeswax Candles - Beeswax Tapers",
      "description": "Pure beeswax candles made with wax sourced from the finest US east coast apiaries. Handmade, one at a time, in a Hudson Valley NY studio. Beautiful beeswax candles have a natural honey scent, burn longer and brighter than other types of wax candles, and are considered “dripless,” if burned correctly, undisturbed, away from any drafts, and in a properly sized holder appropriate for burning candles. There is no guarantee that beeswax candles will not drip or run, so appropriate precautions should be taken to avoid melted beeswax getting on tablecloths, surfaces, etc.\nEach pair of 12 x 7/8\" tapers is approximately 6 oz. These candles will fit most standard candle holders.\nTapered candles shown in a rainbow selection. See other photos for more colors.\nBe sure to select ONE color PER PAIR of candles at checkout.-This listing is for ONE PAIR of candles. One pair = two individual taper candles\n- 100% natural beeswax from established northeast US beekeepers.\n- Organic cotton wick.\n- Each 12\" taper burns approximately 12-14 hours, depending on conditions in the environment. Please don’t burn in drafty areas. This negatively affects burn time and promotes dripping.\n- Smokeless, relatively “dripless” when correctly burned, and non-allergenic.\n- Handmade candles have naturally occurring imperfections that enhance their rustic loveliness, so please allow for some inconsistencies.\n- Ivory and yellow candles are un-dyed, un-bleached, pure filtered beeswax.\n- Colored candles are dyed with eco-friendly, non-toxic dyes. Note that colors may appear slightly different in person due to variations in computer monitors. Colors may also vary slightly from batch to batch.\n- Handmade candles have naturally occurring imperfections that enhance their rustic loveliness. Please allow for minor inconsistencies.\n\nHandmade to order! Please contact me ahead of ordering if you want to arrange a rush order.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who prioritize natural and eco-friendly products",
          "useCase": "Using these candles as a sustainable and non-toxic alternative to traditional paraffin candles, enhancing indoor air quality and creating a cozy ambiance."
        },
        {
          "targetAudience": "Decor enthusiasts seeking unique and artisanal home decor",
          "useCase": "Incorporating these handmade candles into their living spaces to add a touch of rustic charm and create a warm and inviting atmosphere."
        },
        {
          "targetAudience": "Candle enthusiasts who appreciate high-quality and long-burning candles",
          "useCase": "Enjoying the extended burn time and bright illumination provided by these 100% natural and pure filtered  beeswax candles, creating a lasting and enjoyable ambiance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/211997304/one-pair-of-12-inch-beeswax-candles-tall?click_key=fcdaf2377a9f2780abfc00c57a356e1a18429786%3A211997304&click_sum=f8888142&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-18&pro=1&sts=1",
      "dateCreated": "2024-02-20T20:39:21.221964",
      "productId": "bXWgBOkwBT"
    }
  },
  {
    "data": {
      "product": "5th Anniversary Gift for Him | Sound Wave Art QR Code | Wood Anniversary Voice Recording",
      "description": "A creative traditional 5 year anniversary gift printed on wood.\n\nUse a voice recording or a favorite song to create a unique and memorable soundwave art gift for your 5th anniversary or any occasion for your husband or wife.\n\nThey can scan the optional QR code to play the voice message or song.\n\nThis personalized gift will bring back memories for years to come.\n\nWe take your recording and turn it into a piece of art that visually captures the details of your voice, a song, or any sound.\n\n★ WOOD PRINT\n\n• Printed directly on 3/4\" thick premium baltic birch wood, each wood print will vary in wood grain\n\n• Comes ready to hang\n\n• Specialized printing process which prints directly on wood resulting in super vibrant colors, retaining high quality without sacrificing clarity.\n\n• Protected against moisture & heat to give you a print that will last for years to come.\n\n• Easy to clean. Simply take a take a sponge or rag with water and wipe off without fear of smearing.\n\n• Sizes up to 11\"x14\" include a stand.\n\n★ HOW TO CUSTOMIZE\n\nPlease refer to the \"Add your personalization\" section above to see what we need to create your custom print and enter your information in the text box provided.\n\nCUSTOMIZE WITH A SONG - In most cases, we only need a link to the song on YouTube. If you have an MP3 file of the song, please email it to [support@artsyvoiceprint.com] with your order number and last name in the subject line.\n\nCUSTOMIZE WITH A VOICE MESSAGE  - You can easily record a voice message on your mobile phone using your Voice Memos or Voice Recorder app. You can also use the video recording feature if it's easier. Please email the file to [support@artsyvoiceprint.com] with your order number and last name in the subject line.\n\n★ SCAN QR CODE TO PLAY RECORDING\n\nA small card with the QR code printed on it is included with your order. We can print an optional gift message on the card. The QR code will play the recording for your order when scanned with your phone's camera.\n\nYou can also request to have the QR code printed on the art itself.\n\n★ FREE PROOF - You can choose to preview the art, but please note it adds 1-3 business days to the processing time. We will send a digital proof to your email for approval. If we don't hear back after 2 attempts, we will send the art to print in order not to delay your order.\n\n★ SHIPPING & TURNAROUND TIMES\n\n• Wood prints usually ship in 3 business days and arrive in 2-5 business days depending on your location in the US and your order size.\n\n• International orders take 6-10 business days, or longer if held in customs. International shipments may be subject to import taxes. It is the customer's responsibility to pay for these taxes.\n\n• Expedited shipping is available as an upgrade at check out, but please take note that it only expedites shipping, not production time.\n\n• Ships from California, USA\n\n★ HAVE A QUESTION?\n\n• We're happy to help, send us a message via Etsy Conversation by clicking \"Message the Seller\" below.\n\n★ WHY BUY FROM ARTSY VOICEPRINT?\n\nWe specialize in sound wave art and have been customizing meaningful gifts since 2013. We are fortunate to have taken part in over 45,000 memories and special celebrations in the US & worldwide and are proud of the 5 star reviews we've received from over 7,000 satisfied customers.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "Preserve a special moment or message from their wedding day or relationship as a unique and meaningful keepsake."
        },
        {
          "targetAudience": "Individuals looking for a thoughtful and personalized gift for a loved one",
          "useCase": "Create a custom soundwave art piece that captures a special song, voice message, or other meaningful audio recording."
        },
        {
          "targetAudience": "Music enthusiasts and collectors",
          "useCase": "Display a visually stunning representation of their favorite song or album as a unique and artistic home decor piece."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/477563341/5th-anniversary-gift-for-him-soundwave?click_key=67a651609482da5ac55bd05fb4a81b48c867d341%3A477563341&click_sum=fe3f4d9a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-19&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:39:43.056449",
      "productId": "PLniKXWRpU"
    }
  },
  {
    "data": {
      "product": "Mini Snowflake Ornaments",
      "description": "Our mini snowflake ornament gift box set features eight brand new snowflake designs in a variety of wood species including Black Cherry, Black Walnut, Red Oak, Maple, Aspen, and Aromatic Red Cedar.  These cute little treasures in a box will make the perfect holiday gift for friends and loved ones!\nThe chocolate colored paper gift box is made in the USA from 100% post consumer materials.  100% recycled polyester material was used to make the cranberry ribbon and bow adorning the box lid.\nEach of the mini ornaments measure approximately 1 1/2\" in diameter, and are finished with a non-toxic food safe oil to protect the wood and enhance its natural beauty.",
      "targetAudience": [
        {
          "targetAudience": "Holiday shoppers looking for unique and thoughtful gifts",
          "useCase": "Purchasing the ornament set as a gift for a friend or loved one during the holiday season."
        },
        {
          "targetAudience": "Individuals who enjoy decorating their homes with festive and seasonal décor",
          "useCase": "Using the ornaments to decorate a Christmas tree, mantle, or other areas of their home during the holiday season."
        },
        {
          "targetAudience": "Collectors of miniature or handcrafted ornaments",
          "useCase": "Adding the ornaments to their collection of unique and special pieces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/250419092/mini-snowflake-ornaments-from-nestled?click_key=cb5e9facfcb239e37e08e787d6b28019ec87e0dc%3A250419092&click_sum=8790376f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-20&etp=1",
      "dateCreated": "2024-02-20T20:39:54.318088",
      "productId": "CDlqTVAYoS"
    }
  },
  {
    "data": {
      "product": "Family Name Sign",
      "description": "Customizable family name sign for special occasions such as weddings, housewarming, Christmas, bridal showers, and more. Available in various sizes, with easy hanging instructions and a built-in hanging system. Made from high-quality wood, featuring a beautiful script design. Rooted and Grounded offers a 25% discount on multiple item purchases and provides excellent customer service. Custom orders are also available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Couples who are getting married",
          "useCase": "A family name sign can be a thoughtful and unique wedding gift that the couple can cherish for years to come."
        },
        {
          "targetAudience": "Families who are looking for a way to personalize their home",
          "useCase": "A family name sign can be a beautiful and meaningful way to add a personal touch to any home."
        },
        {
          "targetAudience": "People who are looking for a unique and thoughtful gift for a housewarming, Christmas, or other special occasion",
          "useCase": "A family name sign is a unique and thoughtful gift that is sure to be appreciated by anyone who receives it."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/541052534/family-name-sign-wedding-gift?click_key=62e6fea644458b293110b4fda3744db1288a0f10%3A541052534&click_sum=7e49fa27&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-21&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:40:02.716081",
      "productId": "dyDJdXYVFX"
    }
  },
  {
    "data": {
      "product": "Stained Glass Spider Web Corner",
      "description": "These Stained Glass Spiderweb corners truly make awesome magical & whimsical decor!\nKeep up all year or just for Fall & Halloween, This Handcrafted Piece is a showcase piece all in itself.\nAdorn in your window & room corners or for your outdoor decor!\nEach piece is hand crafted to order and will include a variety of different clear textures & types of glass, making each one individually special & unique JUST like a real spider web!\nTo hang your Webbing just apply small screws to the eyelet holes attached to framing\nMeasuring 7 1/4 by 8 1/4 \"It has four eyelets.  Two on each side to Mount with small screws \n***This is Authentic Stained Glass, Stained glass can have gorgeous ripples and bubbles in the glass from its creation making it unique. There is no film on my glass to give the iridized look. The iridization was fuzed into the glass when the glass was made\nCompletely Authentic Stained Glass***",
      "targetAudience": [
        {
          "targetAudience": "Home décor enthusiasts seeking unique and eye-catching pieces",
          "useCase": "Adding a touch of whimsy and magic to their living spaces by displaying the Stained Glass Spider Web Corner in windows or room corners."
        },
        {
          "targetAudience": "Gardeners and outdoor décor lovers",
          "useCase": "Enhancing their outdoor spaces with a touch of stained glass art by incorporating the Stained Glass Spider Web Corner into their gardens or patios."
        },
        {
          "targetAudience": "Individuals celebrating Halloween or fall-themed events",
          "useCase": "Creating a festive and spooky atmosphere by incorporating the Stained Glass Spider Web Corner into their Halloween decorations or autumnal displays."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/483162425/stained-glass-spider-web-cornerhome?click_key=23d1d626105c7aea76b58fbb70fac0a1913800d7%3A483162425&click_sum=90414d5f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-22&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:40:12.607232",
      "productId": "CsfFhCwUCl"
    }
  },
  {
    "data": {
      "product": "Gather Sign up to 42",
      "description": "Welcome to Bell & the whistle.  We're a small woodshop in rural Arkansas, and we love making unique and special decorations for our customer.  We offer 4 stock sizes to choose from.  Please note that the height is measured from the top of the 'th' to the bottom of the 'g'.  The length is measured from the tips of the swashes on each side.  42\" x 11\",  36\" x 9.5\",  28\" x 7.25\",  22\" x 5.75\" HOW IT'S MADE:  Lettering is cut from 1/2\" birch plywood using a CNC router which creates a clean and consistent cut.  Each piece is sanded on front and back before being painted to your color choice. If you would like a distressed finish, we sand the paint to create this rustic look. To get this option, mention it in the Notes box at check-out.  WALLHANGING:  Our key hole hanging option is a ready-to-hang system and includes all the hardware you need for mounting to wood or.  Key hole slots are cut in the back of the word and screws are included. This hanging method is sturdy and invisible. All you will need is a Phillips-head screwdriver.  Select this option in the drop-down menu on the left before adding to your cart.  Our standard option does not include hanging hardware.  Some good methods for hanging are: Command Strips, glue, or small nails in the open spaces of the letters.  Because of the nature of the lettering, it is somewhat fragile and we recommend hanging it securely and out of reach of kids or pets.  LEAD TIME:  Each item is made to order. Our lead time is approximately 1-2 weeks after receiving payment. Items are shipped using USPS priority mail which arrives in 2-3 days. We cannot guarantee shipping times; these are just estimates. We pack our orders carefully with double-wall corrugated cardboard. Recycled packaging materials may be used.",
      "targetAudience": [
        {
          "targetAudience": "Individuals or families who value home decor and personalized spaces",
          "useCase": "Adding a unique and meaningful touch to their living room, kitchen, or entryway by displaying the custom-made 'Gather' sign as a decorative piece that reflects their values and creates a welcoming atmosphere."
        },
        {
          "targetAudience": "Homeowners who prioritize functionality and convenience",
          "useCase": "Utilizing the 'Gather' sign as a practical and stylish solution for organizing and displaying items in their home, such as keys, mail, or small plants, while also adding an aesthetically pleasing touch to their living space."
        },
        {
          "targetAudience": "People who appreciate handmade and artisanal products",
          "useCase": "Displaying the 'Gather' sign as a unique and cherished piece of home decor that reflects their appreciation for craftsmanship and supports small businesses."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/530022913/gather-sign-up-to-42-color-options?click_key=4b0a922270dbdc6eb0de6c9b1d4512b04e13c673%3A530022913&click_sum=603000f8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-23&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:40:26.575471",
      "productId": "WnKpygwwCj"
    }
  },
  {
    "data": {
      "product": "Greyhound Dog Ornament with Heart",
      "description": "The Greyhound Dog Ornament is made from recycled raw steel and features a rustic farmhouse style. It is 1.25\" x 5.25\" in size and can be personalized with the name of your favorite pooch or in remembrance of a beloved pet that has passed on. The ornament is made by Brandon and Erin Spangler in Northwest Georgia using a CNC laser table to cut out the raw steel creations and a finishing machine to give it a dark gray/bluish tint. The raw steel material is 14 gauge hot-rolled mild industrial steel, which is the most recycled material in the world. The color, shades, and variations in the raw steel appearance vary from sheet to sheet, so each piece will likely vary from the picture.",
      "targetAudience": [
        {
          "targetAudience": "Dog owners who have lost a beloved pet",
          "useCase": "To memorialize their pet and keep their memory alive."
        },
        {
          "targetAudience": "Dog lovers who want to show their appreciation for their furry friends",
          "useCase": "To add a touch of personality to their home décor and celebrate their bond with their dog."
        },
        {
          "targetAudience": "People who are looking for a unique and sustainable gift for a dog lover",
          "useCase": "To show their thoughtfulness and support for their friend or family member's love of dogs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/260512255/greyhound-dog-ornament-with-heart-made?click_key=f61ea2b665a8a57adaf4835d6cf0a35c3c4bc91e%3A260512255&click_sum=c25a8d97&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-24&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:40:36.302823",
      "productId": "bN1iWUTcUK"
    }
  },
  {
    "data": {
      "product": "Wooden quote block",
      "description": "The wooden quote block features the quote \"Of course I talk to myself. Sometimes I need expert advice\". It is available in two color options: distressed black or whitewash. The block is free-standing and measures 3\" x 3\" x 1.5\". It is perfect for adding a touch of inspiration to your home or office decor.",
      "targetAudience": [
        {
          "targetAudience": "People who work in offices",
          "useCase": "Place the sign on their desk to add a touch of humor and inspiration."
        },
        {
          "targetAudience": "People who are looking for a unique and affordable gift",
          "useCase": "Give the sign to a friend, family member, or colleague as a gift."
        },
        {
          "targetAudience": "People who are interested in home decor",
          "useCase": "Add the sign to their home decor to add a touch of personality and style."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/226367204/small-desk-sign-office-decor-quote-block?click_key=e722d1fb502277da1d59e0cd670bbe1b0f51a189%3A226367204&click_sum=87612c10&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-25&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:40:45.036269",
      "productId": "wBghmOwdXQ"
    }
  },
  {
    "data": {
      "product": "Moon Phases Wall Hanging Brass Moon Wall Decor Full Moon Wall Art -  Moon Mobile - Moon Child - Lunar",
      "description": "This unique moon phases brass wall hanging is shiny and vibrant and works with more classic decor as well as colorful decor. It looks beautiful hanging on a wall or on a cupboard. Each of the elements is hammered differently and the big full moon in the centre. \nApproximate size: \nLength 22.6\"/57.5cm \nWide 2.6\"/ 6.6cm",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in celestial decor and lunar symbolism.",
          "useCase": "Enhancing the ambiance of their living spaces with a visually appealing and meaningful piece of wall art."
        },
        {
          "targetAudience": "Gift-givers seeking unique and thoughtful presents for friends or family members who appreciate celestial-themed home decor.",
          "useCase": "Expressing their affection and appreciation through a gift that reflects the recipient's interests and adds a touch of celestial beauty to their home."
        },
        {
          "targetAudience": "Interior designers and home decorators seeking to create unique and visually appealing spaces.",
          "useCase": "Incorporating the moon phases wall hanging as a statement piece to add depth, texture, and a touch of celestial charm to their designs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/281537172/moon-phases-wall-hanging-brass-moon-wall?click_key=db055ea411e6f9ff3102266afe591f85f205b03c%3A281537172&click_sum=a544b52f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-26&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:40:55.449985",
      "productId": "DmGGfqMkXx"
    }
  },
  {
    "data": {
      "product": "Handcrafted pottery nativity creche",
      "description": "This handcrafted pottery nativity creche is a free-standing, one-piece manger scene debuting my new contemporary style. Perfect for the collectors!  Combining Speckled Buff with a white clay, each work of art is rolled, textured and assembled in my Arizona studio.  After the first trip through the kiln, the bodies and manger are coated with my new Peacock blue before its second firing at 2250 degrees.  Back support brackets are then added for easy display. \n\nNot just for Christmas, anymore...These make EXCELLENT gifts for the hard-to-buy-for, the collector, even for the newlyweds!  Many clients report how they display their set year-round.  They are fairly sturdy, yet not recommended for little ones hands, for obvious reasons. \n\nPiece measures 5” tall x 7” long x 2” deep \n\nFREE USPS GROUND ADVANTAGE SHIPPING! \n\nALLOW FOR SLIGHT VARIATIONS IN THE GLAZE, AS EACH PIECE IS 100% HANDMADE!!!  \n\nI am more than happy to send a pic of your set prior to shipment.",
      "targetAudience": [
        {
          "targetAudience": "Art collectors",
          "useCase": "Displaying the nativity scene as a unique and beautiful piece of home décor"
        },
        {
          "targetAudience": "Those looking for a meaningful Christmas gift",
          "useCase": "Gifting the nativity scene to family or friends as a thoughtful and unique holiday present"
        },
        {
          "targetAudience": "Individuals seeking spiritual inspiration",
          "useCase": "Using the nativity scene as a reminder of the birth of Jesus Christ and the Christian faith"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/201547702/christmas-gift-christmas-nativity?click_key=a5f1ee6e2365d60d731dff1f3eca68182038ae2c%3A201547702&click_sum=db210ce5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-27&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:41:07.289236",
      "productId": "HEYwXGxhTZ"
    }
  },
  {
    "data": {
      "product": "Vintage Tropical Botanical Print Set No. 1",
      "description": "This set features a set of 4 hand colored etchings from the 1770's by noted botanical illustrator George Ehret. Each illustration has been digitally enhanced and added to a lightly tinted background which enhances its vintage charm.\n\nFrames are for display purposes and are not included.\n\nSIZES\nAvailable sizes & prices are displayed in the drop down menu\n\nBACKGROUNDS\nA picture of the background used with each print or set is also shown in the description photos.\n\nARCHIVAL PAPER\nWe have 2 premium archival options to choose from.\nArchival Canvas Textured Paper – an acid-free, PH-neutral Archival paper that has a beautiful matte, textured finish.\nArchival Smooth Matte – a substantial weight, acid-free, PH-neutral Archival paper that has a beautiful matte finish.\n\nPROCESS\nWe use professional wide format Fine-Art Giclee Epson printers and Epson archival quality pigment based inks, which provide the most beautiful color gamut. The depth and clarity of color is truly impressive.\n\nOur prints arrive ready to frame and are sized to fit “off the shelf” standard retail frames.\n\n* Please be aware that actual colors may vary slightly from those shown due to the nature of handmade products in addition to how colors are displayed by individual computer monitor settings.",
      "targetAudience": [
        {
          "targetAudience": "Individuals with an interest in vintage décor and coastal aesthetics.",
          "useCase": "To enhance the ambiance of their homes or workspaces with visually appealing and nostalgic artwork that evokes a tropical paradise."
        },
        {
          "targetAudience": "Art collectors and enthusiasts seeking unique and high-quality botanical prints.",
          "useCase": "To add to their existing collections or start a new one, appreciating the historical significance and artistic value of these digitally enhanced etchings."
        },
        {
          "targetAudience": "Interior designers and home decorators.",
          "useCase": "To incorporate these prints into their projects, creating visually cohesive and stylish spaces for their clients."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/246131668/vintage-tropical-botanical-print-set-no?click_key=614601d5d77785858c3b4cd1e01a0981a4de34bb%3A246131668&click_sum=dfb8fef3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-28&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:41:19.720989",
      "productId": "VYAqOjWxEI"
    }
  },
  {
    "data": {
      "product": "Giclée art print of Abstract painting",
      "description": "This is high quality and gorgeous giclee print from one of my original oil paintings.\nTitle: Floating Clouds 02\n* It is professionally printed with Epson Ultrachrome k3 ink, which lasts up to 200 years.\n* It is optional printed on heavy weight, smooth and bright white matte paper, OR ultra thick and textured fine art paper. Please choose the type of the paper from the drop box on the right.\n* Matte paper: 192 gsm weight and 10.3 mil thickness\nFine art paper: 330 gsm weight and 17mil thickness\n* Print is signed by artist in the border beneath the image and will come protected in a protective clear sleeve. It will ship to you in a rigid envelope or mailing tube depending on size.\n* Sizes Available (Listed in inches):\n10.2\" x 13.3\" image, printed on 11x 14 inches paper,\n12\" x 15\" image, printed on 13 x 17 inches paper,\n16\" x 20\" image, printed on 17x 22 inches paper,\n20\" x 25\" image, with an extra 2\" white border around image,\nFor large print on canvas, here is the link:\nhttps://www.etsy.com/ca/listing/221723582/canvas-printscloud-print-abstract?ref=shop_home_active_3&frs=1&crt=1\nFraming Suggestions:\nAll prints come unframed. Please kindly have it framed and it will definitely brighten up your room!!\nPicture credit: http://www.vanessafrancis.com",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors looking for unique and high-quality abstract prints to enhance their home décor.",
          "useCase": "Displaying the print as a statement piece in a living room, bedroom, or office space to create a visually appealing and sophisticated ambiance."
        },
        {
          "targetAudience": "Interior designers and home decorators seeking artwork that complements contemporary and modern interior design styles.",
          "useCase": "Incorporating the print into their design projects to add a touch of color, texture, and visual interest to their clients' homes or commercial spaces."
        },
        {
          "targetAudience": "Individuals seeking meaningful and inspiring artwork that evokes emotions and sparks creativity.",
          "useCase": "Hanging the print in a personal space, such as a home office or meditation room, to create a stimulating and introspective environment."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/157475413/giclee-art-print-of-abstract-painting?click_key=3e73d6198b9dbc85ed431386ce672009b3235a87%3A157475413&click_sum=c0f7240b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-29&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:41:33.443272",
      "productId": "VFYtsfKzmg"
    }
  },
  {
    "data": {
      "product": "Winter Wreath, Winter Decor, Summer Wreath, Summer Decor, Farmhouse Wreath, Farmhouse Decor,Front Door Wreath,Home Decor, Spring Wreath",
      "description": "This wreath is a perfect accent to any front door or empty wall space.  I personally love the rustic grapevine wreath contrasted with the white artificial hydrangea, burlap rose and soft pastel textures of Spring.  The beautiful hints of green with the natural beauty of the white flowers and blue foliage will bring warmth and add charm to any front door or wall.  The wreath shown is 18 inches across, 22 inches in length and 4 inches deep.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to add a touch of rustic charm to their front door or home decor.",
          "useCase": "The wreath's combination of grapevine, hydrangea, and burlap creates a warm and inviting ambiance, making it an ideal accent piece for a variety of home styles."
        },
        {
          "targetAudience": "Individuals who appreciate handmade and unique items.",
          "useCase": "The wreath is handcrafted with attention to detail, providing a one-of-a-kind and personal touch to any space."
        },
        {
          "targetAudience": "Those seeking a low-maintenance and durable decoration.",
          "useCase": "The wreath's artificial flowers and weather-resistant materials ensure longevity and minimize the need for upkeep, making it a practical and convenient choice for busy individuals or those living in areas with harsh weather conditions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/508901284/winter-wreath-winter-decor-summer-wreath?click_key=06838a584b24a5d5e06b024894435e6bd13ce9e0%3A508901284&click_sum=7742fa38&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-30&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:41:45.433311",
      "productId": "tyVFQEYVji"
    }
  },
  {
    "data": {
      "product": "Custom House warming gift, Personalized house ornament, Christmas ornament, Wood burning, New home, New house gift, Real estate gift, Couple",
      "description": "This is a unique personalized house ornament, the wood burnt version of the picture attached by you to a message. \n\nIn my work I use the ancient technique of Pyrography, slow burning, by hand, of the design with quite a few different hot pens.\n\nThis 4\" ornament will YEAR-ROUND pleasantly surprise anybody who will receive it as a gift: new homeowner, couples or family.\n\nOCCASIONS: new home, wedding, birthday, Valentine's Day, first home, newlyweds, First Christmas, new house, Just Moved, etc.\n\nAlso, this wood burnt ornament makes a unique housewarming gift from a Real estate agency for their customers.\n\nPERSONALIZATION: I can fit one short line of writing at the top, and the year or a short address at the bottom of the ornament. Upon checkout, please write your instructions in the \"note from buyer\":\n\nDIMENSIONS:  4\" plywood circle, 1/8\" thick",
      "targetAudience": [
        {
          "targetAudience": "New homeowners",
          "useCase": "Gift to commemorate the purchase of a new home, capturing the unique details of the property for a cherished keepsake"
        },
        {
          "targetAudience": "Couples",
          "useCase": "Anniversary gift, celebrating their home as a symbol of their shared life and memories"
        },
        {
          "targetAudience": "Real estate agents",
          "useCase": "Housewarming gift for clients, offering a personalized and meaningful way to welcome them into their new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/170835267/custom-house-warming-gift-personalized?click_key=ba886c9a39f996703ea3754bf3e4179053043e62%3A170835267&click_sum=c1e47643&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-31&etp=1",
      "dateCreated": "2024-02-20T20:41:57.047767",
      "productId": "AGXXsPUepH"
    }
  },
  {
    "data": {
      "product": "Owl Art Print",
      "description": "Owl Art Print By Ashley Percival. Signed on the front. Printed on Beautiful Fine Art Paper 315gsm. PRINT SIZES: Standard UK Sizes: A4 - 8.27 x 11.69 inches, 21.0 x 29.7cm A3 - 11.69 x 16.53 inches, 29.7 x 42.0cm A2 - 16.53 x 23.39 inches, 42.0 x 59.4cm A1 - 23.39 x 33.11 inches, 59.4 x 84.1cm Standard US Sizes: 8x10 inches 14x11 inches 20x16 inches 18x24 inches SHIPPING INFO: All orders ship within 2 working days. UK orders are sent 1st class. International orders are sent with tracking. All of my US orders are printed and shipped locally from US so none of my US customers will incur any additional customs cost.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts looking for unique home decor",
          "useCase": "Decorating living rooms, bedrooms, and other living spaces with visually appealing artwork"
        },
        {
          "targetAudience": "Individuals seeking thoughtful housewarming gifts",
          "useCase": "Gifting a visually appealing and meaningful present to celebrate a new home"
        },
        {
          "targetAudience": "Homeowners looking to enhance their kitchen decor",
          "useCase": "Adding a touch of artistic flair to the kitchen for a more inviting and visually stimulating cooking and dining experience"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/66281583/owl-art-print-unique-home-decor-for?click_key=80f5c67268dd3e2357c69192fd02a52db1c8bb28%3A66281583&click_sum=009cdba9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-32&pro=1&frs=1",
      "dateCreated": "2024-02-20T20:42:06.516235",
      "productId": "e1HaqNpjF8"
    }
  },
  {
    "data": {
      "product": "Pressed Mimosa",
      "description": "Watercolor painting print of an original artwork by SMc. Originals. Depicts a floral silhouette in black and white. Printed on 100% cotton paper. Custom framing and artist canvas options are available. Unframed prints come with thick cardboard backing for protection. Deckled edge option available for an additional charge. Copyright protected.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and sophisticated home decor",
          "useCase": "Enhancing the aesthetic appeal of living rooms, bedrooms, or offices with a modern and elegant touch."
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Adding a valuable and original watercolor painting to their collection, showcasing their appreciation for contemporary art."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the artwork into their design concepts, creating a cohesive and visually appealing space for clients."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/499244464/pressed-mimosa-smc-originals-watercolor?click_key=5861acbf184a9ede905923f8299cbde30ac5f86e%3A499244464&click_sum=82cbfe4e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-33&etp=1",
      "dateCreated": "2024-02-20T20:42:13.787502",
      "productId": "sRAkDhwmxu"
    }
  },
  {
    "data": {
      "product": "Bohemian Yarn Tapestry, Yarn Wall Hanging",
      "description": "Bohemian Yarn Tapestry\n\nGrey, red, orange, cream.\n\nSizes:\n- Small: Length across 12'' x height 28''\n- Medium: Length across 18'' x height 32''\n- Medium/large: Length across 24''(2ft) x height 32''\n- Large: Length across 36''(3ft) x height 32''\n- Extra large: Length across 48''(4ft) x height 32''\n- Extra Extra Large: Length across 60'' (5ft) x height 40''\n\nThe length across or horizontal length is the length of the wood stick. The tapestry is a few inches shorter on both sides to allow room for tying the hanging string onto the ends of the stick.\n\nThe height or vertical length is measured form the wooden rod to the bottom of the yarn. The measurement does not include the string that the tapestry hangs from, which is an additional 6-9 inches.\n\nThe maker spends a lot of time browsing for unique and quality yarn. She loves to mix different textures and sizes to give some of the tapestries more depth and dimensions.\n\nShe views her tapestries as an art form!\n\nCustom orders are welcome. It gives the maker an opportunity to be creative and make something new! If you have a certain color scheme for a room, she can make it for you!\n\nHowever, please understand that yarn color is not like paint. The maker cannot mix it to create the perfect match to your dresser or bedspread. If you want \"harvest orange\" when the maker goes to the craft store there may only be three options of orange color of which \"harvest orange\" is not one of them. The maker will try to match them as close as possible.\n\nComputerized images of color schemes are more effective then photos taken with your phone because lighting can really alter the actual color.\n\nExpedited Shipping Information:\n\nIf you need your tapestry sooner then the allotted time required to make it, please purchase the \"Work on My Order Next and Expedite the Shipping\" listed in the shop for $40.\n\nCURRENT SHIPPING TIMES:\n\nThe expected delivery time is just an ESTIMATE. Please understand that USPS and the maker are working as fast as they can, but there may be some orders where the delivery time is a bit later than the listed expected date.\n\nThe maker is also a high school teacher and some weeks she is very busy volunteering and working late with students, parents or staff. She just wants to be as transparent as possible. She asks that you only place your order if you are willing to accept that depending on her work week, the package could be a bit later then expected.\n\nALL proceeds go to a miniature horse rescue and a kids summer camp where they learn to care for mini horses.\n\nReturns and exchanges:\n\nPlease be considerate about returns (for not only this shop but other Etsy shops as well). Keep in mind that the maker spends time shopping for material, prepping for your purchase, creating the product, packaging, and delivering for shipment. The maker is not Amazon, but an individual crafter. When you return something that means the maker pays out money for shipping and processing fees, plus hours of working on your order.\n\nThe maker will   most definitely accept a return however, the cost of shipping it back is the responsibility of the purchaser. Once the tapestry is returned, the maker will refund you for the price of the tapestry.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and aesthetically pleasing home décor",
          "useCase": "Enhancing the ambiance of their living spaces by adding a bohemian and handmade touch"
        },
        {
          "targetAudience": "Interior designers and home stylists",
          "useCase": "Incorporating the tapestry into their design schemes to create a warm and inviting atmosphere for their clients"
        },
        {
          "targetAudience": "Individuals with an appreciation for handmade crafts and unique artwork",
          "useCase": "Displaying the tapestry as a statement piece in their homes, showcasing their appreciation for artisan skills and supporting independent artists"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/521660723/bohemian-yarn-tapestry-yarn-wall-hanging?click_key=3bb3dff4df6bca209f236a8bd2a1f54b6772a186%3A521660723&click_sum=57a39196&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-34&frs=1&etp=1",
      "dateCreated": "2024-02-20T20:42:36.363149",
      "productId": "xYndyHSkLI"
    }
  },
  {
    "data": {
      "product": "Personalized Candle Holder",
      "description": "Looking for a unique and personalized gift for your loved ones this Valentine's Day? Our handmade and eco-friendly Rustic Candle Holder is a perfect choice! Custom Hand Burned with initials, this beautiful candle holder makes a thoughtful gift for an engagement or anniversary. Made from reclaimed wood, this Rustic Candle Holder is also a great addition to any home decor. Whether you're shopping for him, her, or a couple, our Personalized Candle Holder is sure to be cherished for years to come!\n\nDETAILS:\n*Logs will not be completely smooth, These are rough sanded. Will contain Splits, Pits, And groves\n*♥ Set of 3 Log Candle Holders\n♥ ONLY the middle holder has a Heart\n♥ HAND BURNED - Not Machine-made or Laser engraved\n♥ Tealights/Votives not included\n♥ Real Natural Logs, May have splits, pits, and groves - rough sanded\n♥ These candleholders are wood. Faux flame candles are recommended\n\nMEASUREMENTS:\n3,4,5\" Height\n3.5\" Diameter (each Log)\nHand Burned Middle Heart Approx. 1 1/2\"\n\nCARE INSTRUCTIONS:\n♥ Clean with a dry cloth or brush. Wet cleaners may cause Discolorations/Expansion of the Wood.\n♥ This item is made from reclaimed wood and may have knots, grooves, or imperfections unique to the wood being used.\n♥ This Simple rustic design is completely handcrafted from start to finish!\n♥ Great for Wedding Centerpieces, Thanksgiving Tables, Holiday Coffee Tables, And much more!\n\nSAFETY INSTRUCTIONS:\n● These candleholders are wood. Faux flame candles are recommended.\n● For real flame candles, Please exercise caution when using:\n● If smoking occurs, extinguish the candle.\n● Do not allow the flame to touch the side of the container.\n● Never move your candle while it is burning or still hot.\n● Never leave your candle unattended.\n● Burn candles indoors, away from drafts, other heat sources, and any flammable objects or materials.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a unique and personalized gift for their loved ones, particularly for special occasions such as Valentine's Day, engagements, anniversaries, or weddings.",
          "useCase": "The Personalized Candle Holder offers a thoughtful and sentimental way to commemorate special moments and show appreciation for loved ones."
        },
        {
          "targetAudience": "Homeowners and interior decorators looking to enhance their rustic or natural home decor.",
          "useCase": "The Rustic Candle Holder, with its reclaimed wood construction and rough-sanded finish, adds a charming and authentic touch to any living space, creating a cozy and inviting ambiance."
        },
        {
          "targetAudience": "Individuals who value eco-friendly and sustainable products.",
          "useCase": "The Handmade and Eco-friendly Rustic Candle Holder aligns with the growing trend towards sustainable living and provides a stylish way to reduce environmental impact."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/205198072/personalized-candle-holder-rustic-home?click_key=25a92807da9c71e5a66e619285b7553c16850f0d%3A205198072&click_sum=19bb9e0b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-35&pro=1",
      "dateCreated": "2024-02-20T20:42:54.339398",
      "productId": "rFGRYzlLWL"
    }
  },
  {
    "data": {
      "product": "Moon Wall Clock",
      "description": "**Glow Effect:**\n\nPhosphorescent paint has a glowing effect that lasts for hours after being charged for several minutes in a bright sun or lamp light.\n\nThe intense glowing effect continues for about 30–40 minutes; later, it will continue to glow for up to 6 hours, but much dimmer. This is called afterglow, and all glow-in-the-dark pigments do this.\n\nTo see the glow during the afterglow period, you need to be viewing them in complete darkness with your eyes adjusted to the dark.\n\n**Please note:** As the intense period of glowing is the first 30–40 minutes, we don't state that you will be able to see what time it is during the whole night.\n\n**Care:**\n\nPlease avoid leaving your glass object in direct sunlight for an extended amount of the day time as it is a living work of art. Even though each piece is individually painted using acrylic and environmentally friendly glass paints, this could significantly alter the hues.\n\nRemember that because each piece of this hand-crafted artwork is unique and individual, the item you receive may slightly differ from the image.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who are interested in space, astrology, or planetary decor.",
          "useCase": "Use the Moon Wall Clock as a decorative piece in their home or office to add a celestial touch."
        },
        {
          "targetAudience": "People who are looking for a unique and stylish wall clock.",
          "useCase": "Use the Moon Wall Clock as a statement piece in their living room, bedroom, or hallway."
        },
        {
          "targetAudience": "Those who are looking for a gift for someone who is interested in space or astrology.",
          "useCase": "Give the Moon Wall Clock as a gift to a friend or family member who is interested in space or astrology."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/517770482/moon-wall-clock-moon-glow-clock?click_key=ac30560cf6b2c86846ac245e6902e459fe33cf23%3A517770482&click_sum=32ed6886&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-36&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:43:06.421680",
      "productId": "LfQlrNvyCF"
    }
  },
  {
    "data": {
      "product": "Personalized Family Map Pillow",
      "description": "A thoughtful gift pillow that is a meaningful family holiday gift or for the Mom or Dad you love. Sweet for a birthday, or living room decor for your own home. Up to 20 locations, $1.00 for each additional location. Hawaii or Alaska can be included as well as a mini Country to the side to represent someone abroad.\n\n**How to Personalize**\nEnter your details in the \"Add Personalization\" box. Scroll through the product photos to find options offered.\n\n**We Send a Free Proof After Purchase**\nIn 1-2 business days a free proof (a preview of the design) will be sent to you via ETSY messaging to check for errors. Approve your proof ASAP to prevent delays.\n\n**Production Time & Shipping**\nBe sure to change the \"SHIP TO\" address if sending to another location.\n\nAll items are handmade-to-order, from us to you!\n\nWe ship all orders with USPS Ground Advantage 1-5 day Mail. Priority mail and other faster upgrades are available in the \"Shipping Upgrades\" menu found on the checkout page.\n\nSee shipping times on product pages, they may change during holiday seasons. We typically ship out in 2-4 business days.\n\nIf you choose Express 1-2 day shipping please keep in mind it still takes a few days to make before shipping.\n\n*Note that international orders may still arrive later than stated by the postal service.\n\n**Gift Message + Gift Wrapping**\nDon't forget to fill out the gift message section so your recipient knows who sent it.. We don't include any receipts. A cute \"With Love\" card will be sent with your message.\n\nGift wrap is also available .  See all these options during checkout\n\n**Fabric Types + Care**\n- Fabrics we may carry are:\n- Polyester Linen: A new addition that has a zipper. Fabric is thick and has a linen look and feel.\n- Cotton Duck Canvas: 100% cotton, envelope back.\n- Rustic Linen: A nubbly high end Linen, envelope back.\n\nAll have a soft texture.\n\n- Covers are removable for dry cleaning, not stitched closed. Please only spot clean or dry clean without harsh chemicals.",
      "targetAudience": [
        {
          "targetAudience": "Families looking for a thoughtful and personalized gift to commemorate a special occasion or milestone.",
          "useCase": "Creating a custom pillow that features the locations of family members or significant places in their lives, capturing memories and fostering a sense of connection."
        },
        {
          "targetAudience": "Parents celebrating an anniversary or a special event.",
          "useCase": "Receiving a personalized pillow as a keepsake that symbolizes their journey together, with the locations of special moments or meaningful places represented."
        },
        {
          "targetAudience": "Individuals seeking a unique and heartfelt gift for a loved one.",
          "useCase": "Creating a personalized pillow that reflects the recipient's interests, hobbies, or special moments, expressing care and thoughtfulness."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/505137090/personalized-family-map-pillow-gift-for?click_key=90c9c1676b134d3f06f88201038c56d86c0956da%3A505137090&click_sum=81312685&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-37&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-20T20:43:20.807389",
      "productId": "NgqBVmgpGx"
    }
  },
  {
    "data": {
      "product": "custom record ledge",
      "description": "This listing is for (1) ledge which can hold 1 record. Measures 14\" long, 1 1/2\" deep and 13/16\" thick, groove is 1/2\". Made in Ohio from solid wood.\n\nOur single record ledge is the perfect solution to displaying the record on your turntable.  Can accommodate thick double or triple gatefolds.  Purchase multiple to display your favorite albums around your living space.  Quantity can be adjusted at checkout.\n\nChoose your wood and finish combo: Oak, Cherry or Walnut in Clear, Stain A, B or C.  Maple in Clear or Whitewash ONLY.  All finishes are sealed with oil based or water based polyurethane to create a timeless finish.  Made to order; please allow 2-3 weeks for production until shipping.\n\nHardware and instructions (including QR code for detailed installation video) provided.  Hangs with two routed keyholes on the back of the ledge for invisible, floating effect.",
      "targetAudience": [
        {
          "targetAudience": "Audiophiles and vinyl record enthusiasts",
          "useCase": "Displaying and organizing their valuable record collection in a stylish and functional manner."
        },
        {
          "targetAudience": "Home decorators and interior designers",
          "useCase": "Adding a unique and sophisticated touch to living spaces by incorporating the record ledge as a decorative element."
        },
        {
          "targetAudience": "Music lovers and collectors",
          "useCase": "Showcasing their favorite albums and creating a personalized display that reflects their musical tastes and interests."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/499400223/custom-record-ledge?click_key=d18a93200292eade3f51eec8b30f1757d5a408db%3A499400223&click_sum=f1abb780&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-38&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:43:33.155217",
      "productId": "KuzVFedOZt"
    }
  },
  {
    "data": {
      "product": "Latitude Longitude Sign",
      "description": "A personalized framed piece of art that turns the coordinates of a special location into a unique gift. Perfect for housewarmings, weddings, anniversaries, or Valentine's Day. Printed on high-quality, textured watercolor paper and available framed or unframed. The framed option features a barnwood frame with a glass front and hanging hardware attached.",
      "targetAudience": [
        {
          "targetAudience": "Individuals moving into a new home",
          "useCase": "To commemorate the special occasion and create a personalized piece of décor that reflects their new address."
        },
        {
          "targetAudience": "Friends and family of individuals moving into a new home",
          "useCase": "To give a thoughtful and unique housewarming gift that will be cherished for years to come."
        },
        {
          "targetAudience": "Couples celebrating a wedding or anniversary",
          "useCase": "To create a meaningful and personalized memento of their special day that can be displayed in their home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/245914064/housewarming-gift-new-home-housewarming?click_key=2e4f48bc34bdba324a014c439621136c43fa5e18%3A245914064&click_sum=fb4da3c4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-39&pro=1&sts=1",
      "dateCreated": "2024-02-20T20:43:41.550009",
      "productId": "ChuPnRytUY"
    }
  },
  {
    "data": {
      "product": "Custom Constellation Map",
      "description": "Our best selling custom constellation map is the perfect gift for any occasion! Each one features the unique night sky view from the date and location you provide!\n\n◆ HOW TO CUSTOMIZE ◆\n- Please refer to the \"Add your personalization\" box to see what we need to create your design and enter your information there :)\n*** If you are not seeing the box, it may not be supported on your browser or app so please put your information in the \"Note to Seller\" section before checkout.\n- Our swatches and fonts (if applicable) can be found in our product photos.\n- Have any special requests? Please feel free to include them along with your order information!\n\n◆ FREE PROOFS ◆\n- We will message you via Etsy with a digital proof of your design 1-2 business days after your order has been placed.\n- Your order will not ship until you have approved the proof :)\n\n◆ PRODUCT INFORMATION ◆\n- All prints are done on professional, heavyweight matte paper using archival inks\n8x10 Print Only No Mat - 2 inch border around design\n8x10 Print Only With White Mat - print is 5x7\n11x14 Print Only No Mat - 2 inch border around design\n11x14 Print Only With White Mat - print is 8x10\n8x10 Framed No Mat & Plexiglass - 2 inch border around design\n8x10 Framed With White Mat & Plexiglass - print is 5x7\n11x14 Framed No Mat & Plexiglass - 2 inch border around design\n11x14 Framed With White Mat & Plexiglass - print is 8x10\nLooking for a larger size? You can find the poster size of this print here:\nhttps://www.etsy.com/listing/685940576/custom-constellation-map-poster-night?ga_search_query=star%2Bmap&ref=shop_items_search_4&frs=1\n\n◆ SHIPPING & GIFTS ◆\n- Shipping: US Orders ship in 3-5 business days via USPS Priority Mail with tracking if you approve your proof asap.\n- Gift Options: Include a gift message at checkout and we'll include a beautiful card for free :) You can also add our premium gift wrapping option for $5 at checkout.\n\n◆ HAVE A QUESTION? ◆\n- We love to help! Just send us a message via an Etsy Conversation by clicking \"ask a question\" above :)\n- Shop our full line here\nhttps://www.etsy.com/shop/finchandcotter\n\n◆ WHY BUY FROM FINCH & COTTER? ◆\nWe (Niki & Jeff) have been fortunate to put over 50,000 personalized prints & pillows in homes in the USA & Canada. We are so proud of our over 10,000 5 Star Reviews. See what our past customers have to say about our handcrafted products and customer service\nhttps://www.etsy.com/shop/FinchandCotter/reviews\nFinch & Cotter has been creating handcrafted, personalized home decor since 2012 and all the items you see in this shop are created start to finish in our Grand Rapids, MI based studio. We only use American made materials and eco-friendly materials & packaging whenever possible.\n\n◆ FEATURING ◆\nPersonalized Wedding Gifts・1st Anniversary Paper Gifts ・ Anniversary Gifts・Bridal Shower Gifts・2nd Anniversary Cotton Gifts ・ Engagement Gifts・Mother’s Day Gifts・Father’s Day Gifts・Birthday Gifts・Valentine’s Day Gifts・Housewarming Gifts・Baby Shower Gifts・Baby Nursery Decor・Rustic Home Decor・Gift Ideas・Gifts for Grandma・Gifts for Grandpa・Gifts for Grandparents・Gifts for Mom・Gifts for Dad・Gifts for Parents・Gifts for Couples\n\n◆ EXCLUSIVE SALES, COUPONS, & GIVEAWAYS ◆\nINSTAGRAM: instagram.com/finchandcotter",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating anniversaries or weddings",
          "useCase": "Personalized gift to commemorate a special date and location, creating a unique and sentimental keepsake."
        },
        {
          "targetAudience": "Parents or grandparents of newborns",
          "useCase": "Custom art piece featuring the night sky on the day their child was born, serving as a meaningful and cherished nursery decoration."
        },
        {
          "targetAudience": "Individuals seeking unique home decor",
          "useCase": "Stylish addition to a living room or bedroom, adding a touch of celestial charm and creating a conversation starter."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/512439018/custom-constellation-map-star-map-print?click_key=4206efac581b7987c3403423d5c0b478e81498e8%3A512439018&click_sum=1c7660ac&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-40&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:44:01.250071",
      "productId": "bcQiZN3UgI"
    }
  },
  {
    "data": {
      "product": "Dragon Hanging Stained Glass Sun Catcher",
      "description": "This hand made dragon has a metal body and stained glass double wings.  His body is about 4 inches long, with a wingspan of approximately 6 inches.  He hangs from a 4 inch chain.  You may choose your wing color & body may be black or silver in tone.\nEach one is hand made from art glass, and each piece is unique.  Yours will vary from the one shown due to natural variances in the glass and the hand made nature of the piece.\nIf you would like a color not currently shown, please contact me and I'll see if I can arrange it for you.",
      "targetAudience": [
        {
          "targetAudience": "Dragon lovers",
          "useCase": "Displaying the dragon in their homes or offices to show their love for these mythical creatures."
        },
        {
          "targetAudience": "People who appreciate handmade art",
          "useCase": "Purchasing the dragon as a unique and beautiful piece of art to add to their collection or to give as a gift."
        },
        {
          "targetAudience": "Those who seek a meaningful and thoughtful gift",
          "useCase": "Buying the dragon as a special gift for someone who loves dragons, art, or unique items."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/226750008/dragon-hanging-stained-glass-sun-catcher?click_key=700d6075ec7c335c953a26d41243ef5a2d664ad4%3A226750008&click_sum=1496c0e5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-41&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:44:10.484062",
      "productId": "AqQsqerVMr"
    }
  },
  {
    "data": {
      "product": "Deluxe Beer Styles Print",
      "description": "A poster with 89 varieties of beer with over 200 representative quaffs, including glassware recommendations for each variety. It covers six square feet with beer-soaked goodness. Printed on high-quality, eco-friendly, 100lb paper stock.",
      "targetAudience": [
        {
          "targetAudience": "Craft beer enthusiasts",
          "useCase": "Displaying the poster in their home or bar area as a visual guide to different beer styles and glassware recommendations."
        },
        {
          "targetAudience": "Gift givers",
          "useCase": "Purchasing the poster as a thoughtful present for individuals who appreciate craft beer or home brewing."
        },
        {
          "targetAudience": "Home decorators",
          "useCase": "Incorporating the poster into their interior design to add a touch of beer-related interest and style."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/90334056/deluxe-beer-styles-print-poster-for-home?click_key=0ec5929f0d3ac2405404cd0b147e0878177b4be8%3A90334056&click_sum=49753a42&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-42&etp=1",
      "dateCreated": "2024-02-20T20:44:18.101895",
      "productId": "GFhdIxFtdP"
    }
  },
  {
    "data": {
      "product": "Mother Day Gifts for Wife Unique Mother of the Bride Gift Personalized Gift from Daughter Gifts for Mom Gift Mother of the Groom Gift",
      "description": "This personalized print makes the perfect Christmas Gift for mom or grandma. Personalized with your name(s)! Printed on high quality, textured watercolor paper! Change the name at the top to Mom, Dad, Grandma, Grandpa, Nana, Grammy, Mimi, Gigi, Nonna, abuela -whatever you call the special man or woman in your life!\nSIZING: Print design measures 11”x14”. Artwork is made to fit an 11”x14” frame.\nSelect the print only and frame on your own. Or have your print beautifully framed and ready to hang in your choice of frame with a glass front and hanging hardware attached. Choice of black, classic or simple barnwood frame.\nWould you like to see a proof? Let us know!\n♡NOTE: Our barnwood frames are REAL salvaged barn wood and have the natural rustic elements intact in most of them. You can expect knots, nail holes, splintering and a distressed look in almost all of them. This is NOT a defect and this adds to the natural charm of this frame. Colors vary in the barn wood series, ranging from brown to grey. The images in my shop are sample representations and the actual product may differ from them in hues of the frame. We cannot accept returns or exchanges for these variations.\nOrders will be created and shipped according to your order note. Design proofs are only sent upon request! Please note this at checkout if you’d like a preview of your design!\n♡➸ PLEASE FLIP THROUGH ITEM PHOTOS FOR ITEM DETAILS AND ORDERING PROCESS.\n• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •\nHOW TO ORDER:\n↓ Copy & Paste the information below into the “Note to EmmaAndTheBean” box at checkout ↓\n♥ Name and Date #1:\n♥ Name and Date #2:\n♥ Name and Date #3:\n♥ Name and Date #4:\n♥ Name and Date #5:\n♥ Name and Date #6:\nPLEASE NOTE:\n*Leaving a need-by date does not guarantee delivery by this date if not within our stated production times. If you need your order in a hurry, please ask us how to rush your order!\n*Design allows for 2-6 Names and Dates! Please contact us if you have any questions BEFORE purchasing your print. At 6 or more names & dates, we will divide the details into 2 columns. To include a larger # of dates, we recommend purchasing the 11x14 upgrade for up to 20 dates! Available here:\n• • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • • •\n♡ Want to view our entire Collection? Click here:\nhttp://etsy.me/1BrwzWN\n♡ Please feel free to contact me with any questions you may have. I am happy to accommodate special requests. Check my Shop Policies for more information:\nhttp://etsy.me/1FcVgO0\nLisa ♥\nBack to the Shop:\nEmmaAndTheBean.etsy.com\n© 2014 Emma & the Bean - All rights reserved.",
      "targetAudience": [
        {
          "targetAudience": "Mothers who want a personalized gift from their children",
          "useCase": "A personalized print with the names and dates of the mother's children would be a thoughtful gift for Mother's Day, Christmas, or any other special occasion."
        },
        {
          "targetAudience": "Children who want to give their mother a unique and meaningful gift",
          "useCase": "A personalized print with the names and dates of the mother's children would be a unique and meaningful gift that she will cherish for years to come."
        },
        {
          "targetAudience": "Grandmothers who want to commemorate their grandchildren",
          "useCase": "A personalized print with the names and dates of the grandmother's grandchildren would be a beautiful way to commemorate her family."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385197556/mother-day-gifts-for-wife-unique-mother?click_key=0908aed76e0b91c0524c76c004d76753066499bb%3A385197556&click_sum=f2c1ec3b&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-43&pro=1&sts=1",
      "dateCreated": "2024-02-20T20:44:37.514443",
      "productId": "hPhGwbMaNv"
    }
  },
  {
    "data": {
      "product": "Rustic Christmas Mistletoe",
      "description": "This rustic Christmas mistletoe is perfect for Christmas party decorations, Shabby Chic Christmas decor, stocking stuffers, or hostess gifts. It is made of artificial mistletoe and is fashioned after the old vintage style. You can choose from long and wispy or short and full. Add a handmade frayed ribbon or a grosgrain bow. It can be left blank or stamped with your words. It's ready to hang and waiting for you to pucker up underneath it! This mistletoe has been dusted in glitter.\n\nSIZES:\n\n* Long & wispy: measures roughly between 7-9 inches long.\n* Short & full: measures roughly between 5-7 inches long.\n\n* Berry & pinecone placement will vary as each mistletoe is hand arranged and made to order just for you.\n\nHOW TO ORDER:\n\n* Choose bow ribbon type, color & to personalize or not.\n* Word choice: plain (no words) or your words. If your words, we can stamp up to 25 characters including spaces. Please add your request to the personalization box or \"Add a Note\" box at checkout. Type \"BLANK\" if no words.\n\n♥ This is artificial mistletoe, NOT real. It has been dusted in glitter.\n\n♥ Size, berry & pinecone placement will vary as each mistletoe is arranged by hand & made to order just for you.",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking to add festive decorations to their homes during the Christmas season",
          "useCase": "Decorating homes with a touch of rustic charm, suitable for Christmas parties and other holiday gatherings"
        },
        {
          "targetAudience": "People seeking unique and thoughtful hostess gifts or stocking stuffers",
          "useCase": "Expressing appreciation and spreading holiday cheer by gifting a personalized and decorative item"
        },
        {
          "targetAudience": "Those who appreciate vintage-inspired and handmade crafts",
          "useCase": "Complementing existing Christmas decor with a nostalgic and charming touch, evoking memories and creating a cozy atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/85706663/rustic-christmas-mistletoe-mistletoe?click_key=29fc7b1620c914fc465ff1cc0c8fb870c11c7483%3A85706663&click_sum=d9a89805&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-44&etp=1&sts=1",
      "dateCreated": "2024-02-20T20:44:48.571622",
      "productId": "tamFgSENxt"
    }
  },
  {
    "data": {
      "product": "French Bulldog Pillow",
      "description": "Decorative throw pillow cushion cover with a block print image of a black French Bulldog laying down in black fabric ink. The front of the cover is constructed out of ticking fabric with the stripes running horizontally. The back is constructed out of taupe cotton with a black exposed zipper for easy removal of the insert. Available in sizes 14\"x14\", 16\" x 16\" or 18\" x 18\". Can be purchased as a cover only, with poly fil pillow insert or 95/5 goose down pillow insert. Print color is customizable (black and tan are photographed and other colors available upon request). Adding your dog's name is possible, but the 18\"x18\" size works best proportionally.",
      "targetAudience": [
        {
          "targetAudience": "French Bulldog owners",
          "useCase": "The pillow can be used to decorate their homes and show their love for their pets."
        },
        {
          "targetAudience": "People who love dogs",
          "useCase": "The pillow can be used to add a touch of whimsy and fun to their homes."
        },
        {
          "targetAudience": "People who are looking for a unique and stylish gift",
          "useCase": "The pillow can be given as a gift to a friend or family member who loves dogs or French Bulldogs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/280013394/french-bulldog-pillow-decorative-pillow?click_key=938c89213cd2072c43551efc23d712c460a8fdc1%3A280013394&click_sum=f90787e0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-45&etp=1&sts=1",
      "dateCreated": "2024-02-20T21:27:38.685264",
      "productId": "QUZtohLbFv"
    }
  },
  {
    "data": {
      "product": "Customizable metal ornament with a quatrefoil tag",
      "description": "This lightweight metal key-shaped ornament features a hand-stamped quatrefoil tag that can be personalized with your house number, street name, and year. The tag is approximately 1 1/4 inch in size, and the key is 3 1/8 inch long. The ornament comes packaged in an off-white organza bag for gifting, and no invoice will be included unless requested. Please note that only the house number and street name will be stamped on the tag; city and state are not available on this item.",
      "targetAudience": [
        {
          "targetAudience": "Newlyweds or couples moving into their first home",
          "useCase": "Commemorate their first holiday in their new home with a personalized ornament"
        },
        {
          "targetAudience": "Realtors or housewarming guests",
          "useCase": "Give a thoughtful and personalized gift to new homeowners"
        },
        {
          "targetAudience": "Individuals looking for a unique and meaningful housewarming gift",
          "useCase": "Create a custom ornament that reflects the recipient's new home and address"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/253109971/new-home-gift-personalized-realtor-gift?click_key=a73d45e9a7b54fda1ef3f3b4dc65ef45ed70a44d%3A253109971&click_sum=8d59019e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-46&etp=1&sts=1",
      "dateCreated": "2024-02-20T21:27:50.046453",
      "productId": "QcByAsmTaW"
    }
  },
  {
    "data": {
      "product": "YOUR CHOICE Set of Three 11x14 Literary Prints Wall Art",
      "description": "This set of three 11x14 inch art prints is perfect for any book lover. Choose from over 150 prints in our catalog, featuring illustrations inspired by popular authors such as Jane Austen, William Shakespeare, Kate Chopin, Oscar Wilde, Edna St. Vincent Millay, F Scott Fitzgerald, Emily Dickinson, Edgar Allan Poe, Virginia Woolf, T S Eliot, and Mary Shelley. The prints are made on premium, heavy archival paper with an elegant eggshell finish. They come in a protective sleeve, backing board, and info sheet, and are shipped in a rigid, flat mailer. The prints fit into standard 11x14 frames (or a 16x20 frame matted to 11x14).",
      "targetAudience": [
        {
          "targetAudience": "Literature enthusiasts and book lovers",
          "useCase": "Decorating their homes with literary-themed artwork that reflects their passion for reading and writing."
        },
        {
          "targetAudience": "Educators and teachers",
          "useCase": "Using the prints as visual aids in their classrooms to inspire students and promote a love of literature."
        },
        {
          "targetAudience": "Interior designers and homeowners",
          "useCase": "Adding a touch of sophistication and elegance to living spaces with artwork that complements their existing décor."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/218888463/your-choice-set-of-three-11x14-literary?click_key=7c75eb4137b30e016be801ae943a2a043c04f94b%3A218888463&click_sum=874b0014&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-47&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-20T21:28:05.714635",
      "productId": "snsohxEfUa"
    }
  },
  {
    "data": {
      "product": "New home gift, Boho macrame decor, wall hanging tapestry",
      "description": "This diamond macrame design is a perfect one for all home decor styles.\nThis lovely handmade wall hanging is a great gift idea, original and one of a kind.\nIt is a great decor for your Living Room, Kids Room or your Bedroom. Good combination with all home decor styles retro, vintage, minimal...\nWidth 11 inch (29cm)\nHeight 25 inch (70cm)\n(70cm from the stick/dowel till the end of the fringes)\nPlease NOTE, none of our items are coming with Dowels but you can get one from Home Depot like all our other customers. You can also try DIY stores.\nExpress Shipping with Fedex.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking for unique and stylish home decor",
          "useCase": "Decorating their living room, kids' room, or bedroom with a bohemian-inspired wall hanging"
        },
        {
          "targetAudience": "Individuals seeking one-of-a-kind gifts for housewarmings or other special occasions",
          "useCase": "Presenting the handmade wall hanging as a thoughtful and original gift"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the wall hanging into their design projects to create a warm and inviting atmosphere"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/520013000/new-home-gift-boho-macrame-decor-wall?click_key=e64b7530ca887973ff4ae1f4891e5cfa3c717691%3A520013000&click_sum=49a04791&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-172069-2-48&pro=1&sts=1",
      "dateCreated": "2024-02-20T21:28:14.932352",
      "productId": "cqFOBKbSIP"
    }
  }
]
