[
  {
    "data": {
      "product": "Pendant Ceramic Lamp, Hanging Ceiling Lamp",
      "description": "This lamp is handmade in the innovative studio of the designer-maker Noa Razer in Tel Aviv, Israel. It is part of the Apilar collection, which is inspired by the differentiated and unique Spanish ceramics. The lamp is made of clay and features a printed decoration of green leaves. It is a unique light fixture that is perfect for a living room or office.",
      "uniqueAttributes": {
        "Handmade": "This piece was created in the innovative studio of the designer-maker Noa Razer which is located in Tel Aviv, Israel, and it is part of the Apilar collection.",
        "Unique design": "On top of the pieces are ceramic prints, inspired by past traditions from different cultures, creating a contemporary cultural collage.",
        "Cultural significance": "The designer is engaged in ongoing research, visual as well as theoretical, focusing on traditional ceramics as a cultural carrier and searching for the sense of belonging through the local material culture."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to add a unique and stylish touch to their living spaces",
          "useCase": "Using the lamp as a statement piece in a living room or dining room to create a warm and inviting ambiance."
        },
        {
          "targetAudience": "Interior designers and home decorators seeking one-of-a-kind lighting fixtures",
          "useCase": "Incorporating the lamp into a client's home design to create a focal point and elevate the overall aesthetic."
        },
        {
          "targetAudience": "Art enthusiasts and collectors interested in functional and decorative pieces",
          "useCase": "Displaying the lamp as a collectible item in their homes or offices, appreciating its handmade design and cultural significance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=bbd6dcdb3b7f27cd427fa99cb073862a0ea919a0%3A724851215&click_sum=2ab64d42&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:11:46.420868",
      "productId": "EfJOyTJcIJ"
    }
  },
  {
    "data": {
      "product": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
      "description": "This piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel, and It is part of the Apilar collection.\nThe Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless creation options are formed by stacking the shapes one on top of the other into new complex compositions with spectacular colors.\nOn top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.\nThe designer is engaged in ongoing research, visual as well as theoretical, focusing on traditional ceramics as a cultural carrier and searching for a sense of belonging through the local material culture.\nColor: Green, pink, teal\nMeasurements:Height\t5.9 inch\nDiameter of 5.5 inch",
      "uniqueAttributes": {
        "Handmade": "This piece was created in the innovative studio of the designer-maker Noa Razer, which is located in Tel Aviv, Israel.",
        "Unique design": "The Apilar collection ('stack' in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the differentiated and unique Spanish ceramics.",
        "Cultural inspiration": "On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage.",
        "Research and innovation": "The designer is engaged in ongoing research, visual as well as theoretical, focusing on traditional ceramics as a cultural carrier and searching for a sense of belonging through the local material culture."
      },
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the lamp as a unique and contemporary artwork in their homes or galleries."
        },
        {
          "targetAudience": "Homeowners and interior designers seeking unique and stylish lighting fixtures",
          "useCase": "Using the lamp to create a focal point or add a touch of cultural flair to living rooms, bedrooms, or offices."
        },
        {
          "targetAudience": "Individuals interested in sustainable and handmade products",
          "useCase": "Appreciating the lamp's handcrafted nature and its support of local artisans."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=8c44f5249a49cf18017d3e918affdf9f580901d4%3A654638870&click_sum=6d52ea73&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:12:04.402112",
      "productId": "HMxVfXrrfJ"
    }
  },
  {
    "data": {
      "product": "Terracotta Lamp Pendant",
      "description": "Handmade in a small boutique studio in Tel Aviv, this unique terracotta lamp pendant brings warmth and charm to any space. Its natural terracotta material exudes a delicate and earthy aesthetic, while its distinctive design, inspired by Spanish ceramics, allows for endless customization options. Energy-efficient and versatile, this lamp can be ordered in various colors and prints to complement diverse settings.",
      "uniqueAttributes": {
        "Handmade": "Made by hand in a small boutique studio in Tel Aviv, each piece is unique and embodies the artisan's personal touch.",
        "Natural materials": "Crafted from natural terracotta, the lamp exudes a delicate and earthy aesthetic, distinguishing it from generic counterparts made with synthetic materials.",
        "Unique design": "Inspired by Spanish ceramics, the Apilar collection offers nine distinct shapes that can be stacked to create a multitude of designs. This level of customization and creativity is unmatched by generic lamps.",
        "Energy-efficient": "Designed to use energy-saving LED light bulbs, the lamp promotes environmental sustainability and cost-effectiveness.",
        "Versatility": "Suitable for diverse settings, from cozy living rooms to minimalist spaces, the lamp can be ordered in various colors and prints to complement individual preferences. This versatility sets it apart from generic lamps with limited options."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters seeking to enhance their living spaces with a touch of warmth and natural beauty.",
          "useCase": "Utilizing the lamp to create a cozy and inviting ambiance in living rooms, bedrooms, or dining areas, complementing existing décor with its earthy and organic aesthetic."
        },
        {
          "targetAudience": "Interior designers and architects seeking unique and handmade lighting solutions for their projects.",
          "useCase": "Incorporating the lamp into commercial or residential spaces to create distinctive and eye-catching focal points, leveraging its customizable design to match specific color schemes and design concepts."
        },
        {
          "targetAudience": "Individuals seeking eco-friendly and energy-efficient lighting options for their homes or businesses.",
          "useCase": "Utilizing the lamp to reduce their environmental impact and energy consumption, while still enjoying the warm and inviting glow of traditional lighting, thanks to its compatibility with energy-saving LED bulbs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=f2fd2b66ff35f26c21e9d47606dbb57170531e52%3A776223242&click_sum=e3d53b31&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:12:23.892095",
      "productId": "CdBdMLUjKt"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair from Mid Century",
      "description": "Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standard\nThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.\nWood has been sanded and secured with high quality oil to expose the beautiful wood grains.\nThe shape has been preserved in every detail as original.\nDimensions:\nWidth - 22.8 in, 58 cm\nHeight - 31.4 in, 80 cm\nDepth - 24.8 in, 63 cm\nSeat Width - 18.1 in, 46 cm\nSeat Height - 14.2 in, 36 cm",
      "uniqueAttributes": {
        "Vintage and Restored": "The armchair is a unique piece from the 1960s that has been professionally reupholstered and restored to a high standard, giving it a fresh and updated look while preserving its original character.",
        "Original Frame": "The frame of the armchair is in its original condition and has been retouched, maintaining the authenticity and patina of the vintage piece.",
        "High-Quality Materials": "The wood has been sanded and secured with high-quality oil to expose the beautiful wood grains, showcasing the natural beauty of the material.",
        "Preserved Shape": "The shape of the armchair has been preserved in every detail as original, ensuring that its distinctive mid-century modern design is retained.",
        "Comfort and Durability": "Despite being vintage, the armchair is comfortable and durable, providing both aesthetic appeal and functionality."
      },
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators seeking unique and stylish vintage pieces",
          "useCase": "Incorporating the armchair into mid-century modern or eclectic home decor schemes to enhance the ambiance and create a sophisticated atmosphere."
        },
        {
          "targetAudience": "Collectors of vintage furniture who appreciate the preservation of historical design",
          "useCase": "Adding the armchair to their collection as a prized example of well-preserved mid-century modern craftsmanship."
        },
        {
          "targetAudience": "Homeowners seeking comfortable and stylish seating for their living rooms or reading nooks",
          "useCase": "Utilizing the armchair as a functional and aesthetically pleasing piece of furniture that complements their existing decor and provides a cozy spot for relaxation or reading."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/712573399/vintage-armchair-from-mid-century?click_key=4e43f9123749a3e38998c3a1b8a480f408c64374%3A712573399&click_sum=5d7eeab1&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:12:39.000735",
      "productId": "LYsvcZvAvl"
    }
  },
  {
    "data": {
      "product": "Black and White cocktail chair",
      "description": "This is a completely restored Black and White cocktail chair from the 1970's. Its dimensions are in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in. This iconic piece is characteristic of the Mid-Century modern era, with its turned cone-shaped legs and fan-shaped steaming of the upholstery. It is upholstered in high-quality, black and white colored fabric and is easy to move due to its size. The chair has been restored by a manufactory specializing in the restoration of mid-century modern furniture, ensuring its authenticity and quality.",
      "uniqueAttributes": {
        "Restored": "This cocktail chair has been completely restored, ensuring its longevity and preserving its original design.",
        "Iconic design": "The chair is an iconic piece from the Mid-Century modern era, characterized by its turned cone-shaped legs and fan-shaped steaming of the upholstery.",
        "High-quality materials": "The chair has been reupholstered using high-quality, black and white colored upholstery fabric, ensuring its durability and aesthetic appeal.",
        "Versatile": "Due to its compact size, the chair is easy to move and can be used in various settings.",
        "Specialization": "The chair has been restored by a manufactory specializing in the restoration of mid-century modern furniture, ensuring its authenticity and quality."
      },
      "targetAudience": [
        {
          "targetAudience": "Interior designers and collectors of mid-century modern furniture",
          "useCase": "Add a touch of vintage style to their homes or commercial spaces."
        },
        {
          "targetAudience": "Homeowners looking for unique and stylish furniture pieces",
          "useCase": "Elevate the décor of their living rooms, dining rooms, or bedrooms."
        },
        {
          "targetAudience": "Individuals seeking comfortable and versatile seating options",
          "useCase": "Provide additional seating or create a cozy corner in their homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/649720699/completely-restored-black-and-white?click_key=5a0e17fcfc58963c7bd0d7ba29ab90177b224224%3A649720699&click_sum=4ec35c34&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:12:56.624258",
      "productId": "GukQUEKAhU"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set",
      "description": "This mid-century modern armchair is upholstered in soft boucle teddy fabric and sits on a solid wood frame. It is handmade in Croatia and can be customized with different fabrics or stains. The chair is comfortable and stylish, perfect for adding a touch of vintage flair to any living room.",
      "uniqueAttributes": {
        "Handmade": "All furniture is handmade in our shop!",
        "Customizable": "Armchairs can be upholstered in another fabric or stained in another color, contact me for more info",
        "Vintage design": "bring a 60's Furniture feel into your home with this solid wood Mid century Armchair Upholstered in boucle teddy soft fabric",
        "Solid construction": "Our Mid century armchair is made from solid wood and upholstered with brown faux leather.",
        "Comfortable": "small comfy armchair for living room"
      },
      "targetAudience": [
        {
          "targetAudience": "Design Enthusiasts",
          "useCase": "Seeking a stylish and comfortable statement piece for their living room to elevate their home decor."
        },
        {
          "targetAudience": "Fans of Vintage Aesthetics",
          "useCase": "Looking for a nostalgic and cozy addition to their space that evokes a mid-century modern vibe."
        },
        {
          "targetAudience": "Individuals seeking handmade furniture",
          "useCase": "Appreciating the unique craftsmanship and personalization options offered by handmade furniture."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=29ea2f3eae67b09122a034401ea20fc80201eb54%3A1110352719&click_sum=8bc487b3&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:13:09.424722",
      "productId": "cYSTkrHBDy"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion",
      "description": "This floor cushion is made of soft and cozy vegan suede fabric, which looks and feels like suede but is made of 100% polyester, making it easy to clean, super durable, and vegan-friendly. The cushion is 75X75 cm (30X30 inches) in size and 35 cm (14 inches) in height. It is filled with stiff foam and has handmade wooden rings that tie it together. The cushion is easy to maintain, requiring only spot cleaning with cold water and mild soap. It can be used for multiple purposes, such as a comfortable seating option, a footrest, or a decorative accent piece.",
      "uniqueAttributes": {
        "Vegan-friendly": "The floor cushion is made with 100% vegan suede fabric, which gives it the look and feel of suede but is animal-friendly and more durable.",
        "Handmade wooden rings": "The wooden rings that tie the cushion together are handmade by a wood turner, adding a unique and artisanal touch to the piece.",
        "Customizable": "Customers can choose to have the wooden rings stained or painted in walnut or black, allowing for personalization to match their decor.",
        "Multi-purpose": "The floor cushion can serve multiple functions, such as a comfortable seating option, a footrest, or a decorative accent piece.",
        "Easy maintenance": "The vegan suede fabric is easy to clean with cold water and mild soap, making it a practical choice for everyday use."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators and interior designers",
          "useCase": "Adding a unique and stylish touch to living spaces, creating comfortable seating areas, and complementing earthy and bohemian decor."
        },
        {
          "targetAudience": "Apartment dwellers and those with limited space",
          "useCase": "Maximizing space with a versatile piece that can serve as seating, a footrest, or a decorative accent."
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Enjoying the look and feel of suede without contributing to animal suffering and opting for a durable and easy-to-clean vegan alternative."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=d5c3bd0816cd3a8a7a292f62c0c157a8cf25137a%3A903050205&click_sum=485e6f41&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:13:24.293815",
      "productId": "qggHJzGbaC"
    }
  },
  {
    "data": {
      "product": "Floor Pillow",
      "description": "Imagine moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. With our new floor pillows those dreams are now realities!\nThe original print for this floor pillow was created in our design studio in Maine & the floor pillow is made to order thanks to the help of our fabulous sewing partner.\nTwo different shapes-the circle and the square-plus two different sizes... All those choices equals soft, comfy, and oh-so-pretty floor pillows that are great on their own, or stacked for even more comfort. Let's be honest-chairs are so last year.\n\n••• PLEASE NOTE •••\nThe pillows have a small \"X\" stitch detail in the center of the pillow... tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time... keeping your pillow plump and comfy sit after sit after sit :)\n\nPRODUCT DIMENSIONS\n(Please note there is a 1\"-2\" tolerance on all printed textile products)\n\n23\" Round : 23\" x 7\" Tall\n26\" Round : 26\" x 7\" Tall\n23\" Square : 23\" x 23\" x 7\" Tall\n26\" Square : 26\" x 26\" x 7\" Tall\n\nPRODUCT DETAILS\n100% woven polyester printed fabric\nSewn closed with premium poly fill\n\nCARE INSTRUCTIONSSpot clean only\n\nPRODUCTION\nPlease allow up to 5 - 10 business days for production of your custom made item.\n\n• PLEASE NOTE •\nI am currently unable to deliver to PO Boxes. Please provide a physical mailing address with your order. Thanks!\n\nRETURN POLICY FOR THIS PRODUCTYour floor pillow is custom made just for you and as a result I am unable to offer returns/exchanges unless your item arrives damaged or defective.",
      "uniqueAttributes": {
        "Customizable": "The floor pillow is made to order, allowing customers to choose from two shapes (circle or square) and two sizes (23\" or 26\") to create a pillow that perfectly fits their needs and preferences.",
        "Unique print": "The original print for the floor pillow is created in the designer's Maine studio, making it a one-of-a-kind piece that cannot be found anywhere else.",
        "Durable construction": "The pillow is sewn closed with premium poly fill and has a small \"X\" stitch detail in the center to secure the filling and prevent it from shifting over time, ensuring the pillow's longevity and comfort.",
        "Versatile usage": "The floor pillow is not only comfortable for sitting, but it can also be used as a decorative accent piece, a playroom essential, or a comfortable addition to a reading nook.",
        "Easy care": "The pillow is spot clean only, making it easy to maintain and keep looking its best."
      },
      "targetAudience": [
        {
          "targetAudience": "Families with young children",
          "useCase": "Creating a comfortable and playful space for kids to play and lounge on the floor."
        },
        {
          "targetAudience": "Home decorators and interior design enthusiasts",
          "useCase": "Adding a vibrant and stylish accent piece to any room, complementing the overall décor and creating a cozy atmosphere."
        },
        {
          "targetAudience": "Yoga and meditation practitioners",
          "useCase": "Providing a firm and comfortable support for floor-based exercises, enhancing the comfort and stability during yoga or meditation sessions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=d8826a1660a44880cef0ef6eb575e9878cadf154%3A904960951&click_sum=bb8b70fe&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:13:43.420307",
      "productId": "rHWtdRfFXf"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool, Crochet Pouf Ottoman",
      "description": "A handmade footstool pouffe constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. The knitted cover can be removed for washing, ensuring easy maintenance and cleanliness. Available in different sizes and colors to fit any nursery or young child's room and personal preferences.",
      "uniqueAttributes": {
        "Handmade": "This footstool is handmade with love and inspected carefully for the utmost quality and satisfaction.",
        "Durable materials": "Constructed using durable and thick 100% cotton cord, this pouffe is built to last.",
        "Versatile": "Can be used for sitting, playing, climbing, and resting, making it a versatile addition to any child's room.",
        "Removable cover": "The knitted cover can be removed for washing, ensuring easy maintenance and cleanliness.",
        "Customizable": "Available in different sizes and colors to fit any nursery or young child's room and personal preferences."
      },
      "targetAudience": [
        {
          "targetAudience": "Parents of young children looking for comfortable and stylish seating for their child's room",
          "useCase": "The pouffe can provide a cozy spot for children to sit, play, climb, and rest, adding functionality and comfort to their space."
        },
        {
          "targetAudience": "Interior designers seeking unique and handmade decorative pieces for children's rooms",
          "useCase": "The pouffe's knitted design and neutral color scheme can complement various nursery or child's room aesthetics, adding a touch of warmth and texture."
        },
        {
          "targetAudience": "Individuals seeking sustainable and eco-friendly home décor",
          "useCase": "The pouffe is made from durable and thick 100% cotton cord, ensuring longevity and reducing environmental impact, appealing to those prioritizing sustainability."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=96112436a79e613f5d35b5d8a830e4571a7f5c18%3A266515154&click_sum=b2795a60&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:13:59.914412",
      "productId": "wPeKRitCSu"
    }
  },
  {
    "data": {
      "product": "Stroke / Brushstroke Illustrated Parian Porcelain Vase",
      "description": "This vase is slipcast in Parian porcelain, which is marble smooth and delicately translucent. It is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay. The vase is hand illustrated with bold brushstrokes against a bright white base. Each piece is polished by hand to create a silky smooth finish. The vase is perfect as a stand out piece for a mantlepiece, sideboard, or as a centre piece for your dining table. It is ideal for holding bundles of your favourite blooms and leafy bouquets.",
      "uniqueAttributes": {
        "Handmade": "From start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.",
        "Material": "Slipcast in Parian porcelain, the Stroke Long Vase is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent.",
        "Design": "With it’s assured, bold brushstrokes against a bright white base the Stroke Long Vase is a declaration of a love of pattern and bold design.",
        "Finish": "Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decor enthusiasts who appreciate unique and eye-catching pieces",
          "useCase": "As a statement piece to add a touch of sophistication and personality to their living spaces, such as a mantlepiece, sideboard, or dining table centerpiece."
        },
        {
          "targetAudience": "Art collectors who seek handmade and limited-edition pieces",
          "useCase": "As a collectible item to add to their collection of unique and aesthetically pleasing objects."
        },
        {
          "targetAudience": "Individuals looking for functional and stylish vases for their floral arrangements",
          "useCase": "To hold and display bouquets of flowers, adding a touch of elegance and style to their homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=f454e980ef7a1727335e8ee9bf00b56c6e9d10f8%3A811521978&click_sum=aac3e77b&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:14:16.190407",
      "productId": "Simrnyrp9b"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "A beautiful hand-built small amphora vase with black and white triangle pattern. It works great as a decorative item or can carry beautifully a bouquet of small flowers/a little tree branch. It was made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white upon which it was fired to cone 8 (1250C) in an electric kiln. The base was left unglazed and is impressed with my maker's mark",
      "uniqueAttributes": {
        "Handcrafted": "The vase is hand-built, making it a unique piece of art.",
        "Original design": "The vase is inspired by ancient Greek pottery, giving it a timeless and elegant look.",
        "Versatile": "The vase can be used for decorative purposes or to hold small flowers or a tree branch.",
        "Durable": "The vase is made of stoneware clay and fired to cone 8 (1250C), making it durable and long-lasting.",
        "Dishwasher safe": "The vase is dishwasher safe, making it easy to clean."
      },
      "targetAudience": [
        {
          "targetAudience": "People who appreciate handmade and unique home decor",
          "useCase": "To add a touch of elegance and style to their home"
        },
        {
          "targetAudience": "People who love flowers and plants",
          "useCase": "To display small bouquets or a single stem in a unique and stylish way"
        },
        {
          "targetAudience": "People who are interested in ancient Greek culture and history",
          "useCase": "To own a piece of art that is inspired by ancient Greek pottery"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=5e1754b324c28fdc06d0948aef3b9c2e3cda1157%3A986518800&click_sum=5a6fc16d&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:14:28.785378",
      "productId": "EpOXfkfJZs"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase",
      "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.\n- Handcrafted with jute, burlap fabric, and glass bottle.\n- Dimensions - 5\" tall; base 5.5\" wide.\n- Beautiful addition to your home or office decor.\n- Indoor use only.",
      "uniqueAttributes": {
        "Hand painted": "The vase is hand painted in black, cream, and gold in an abstract mosaic design, making each piece unique and adding an artistic touch to the home decor.",
        "Natural materials": "The vase is handcrafted with jute, burlap fabric, and a glass bottle, combining natural and sustainable materials for a warm and earthy aesthetic.",
        "Unique design": "The abstract mosaic design on the vase is unlike any other, creating a visually striking piece that stands out from generic vases.",
        "Versatility": "The vase can be used for both decorative purposes and to hold flowers, offering versatility in its functionality.",
        "Indoor use only": "The vase is designed for indoor use only, making it a suitable addition to living spaces, bedrooms, or offices."
      },
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Adding a unique and artistic touch to their living spaces, bedrooms, or offices by using the vase as a decorative piece."
        },
        {
          "targetAudience": "Art Collectors",
          "useCase": "Expanding their collection of unique and handcrafted art pieces by acquiring the vase for its abstract mosaic design and natural materials."
        },
        {
          "targetAudience": "Gift Givers",
          "useCase": "Finding a unique and thoughtful gift for friends or family who appreciate handmade items and home decor with a touch of artistry."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=6feda9640107085d2d4c8e6764845f9f8865a564%3A908084516&click_sum=877918f3&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:14:45.271124",
      "productId": "oPFcJQqdvs"
    }
  },
  {
    "data": {
      "product": "Cushion Cover",
      "description": "- Exclusive pattern digitally designed\n- Printed in the South of France\n- Handcrafted in my workshop\n- Creation in limited series\n- Wallet closure\n- Face fabric = Water-repellent and UV-resistant fabric\n- Back fabric = Heavy duty 100% cotton twill\n- Slightly textured print quality\n- Fully overlocked on the reverse\n- Wash at 30°C. Natural drying. Do not wring. Iron at low temperature.\n- Shipments by post with tracking",
      "uniqueAttributes": {
        "Exclusive pattern digitally designed": "The pattern on the cushion cover is exclusive and digitally designed, which sets it apart from generic cushion covers that often use common or mass-produced designs.",
        "Printed in the South of France": "The cushion cover is printed in the South of France, which implies a certain level of quality and craftsmanship associated with the region.",
        "Handcrafted in my workshop": "The cushion cover is handcrafted in the seller's workshop, adding a personal touch and ensuring attention to detail that is not typically found in mass-produced items.",
        "Creation in limited series": "The cushion cover is part of a limited edition design, making it more unique and exclusive compared to widely available generic counterparts.",
        "Wallet closure": "The cushion cover features a wallet closure, which is a unique and functional design element that sets it apart from generic cushion covers."
      },
      "targetAudience": [
        {
          "targetAudience": "Design-conscious individuals seeking unique and exclusive home decor",
          "useCase": "To add a touch of personality and style to their living spaces, creating a visually appealing and distinctive ambiance."
        },
        {
          "targetAudience": "Artisanal enthusiasts who appreciate handmade and limited edition items",
          "useCase": "To incorporate a piece of unique craftsmanship into their homes, showcasing their discerning taste and appreciation for high-quality, small-batch products."
        },
        {
          "targetAudience": "Eco-conscious consumers seeking sustainable and ethically sourced home goods",
          "useCase": "To decorate their homes with products that align with their values of sustainability and support local artisans and businesses."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=4267fbc19523823bb00f050be5abbe67e613464e%3A1206357075&click_sum=e5181a2f&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:15:02.270668",
      "productId": "JQNAGuahkX"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "This Color Therapy Pillow is a vibrant and cheerful home decor piece that is sure to brighten up any space. Handcrafted by an indigenous family in Cuenca, Ecuador, the pillow's colorful stripes are woven on an antique loom, creating a unique and artisanal touch. Made from 100% hand-loomed cotton, the pillow is soft and comfortable, with a hidden zipper at the bottom for easy insertion and removal of the pillow insert. With its versatile design, the Color Therapy Pillow can complement a wide range of interior styles, from modern to traditional. The purchase of this pillow not only adds a touch of color to your home but also supports the empowerment of women and girls in the indigenous community.",
      "uniqueAttributes": {
        "Handwoven": "The fabric is 100% hand-loomed cotton, which gives it a unique and artisanal quality that cannot be replicated by mass-produced items.",
        "Indigenous origin": "The cloth is made by an indigenous family in Cuenca, Ecuador, and the colorful stripes are woven on an antique loom, which adds a cultural and historical significance to the pillow.",
        "Empowering women": "The purchase of this pillow supports the women and girls of this community, who wear this cloth as a skirt, fostering a sense of sisterhood and empowerment.",
        "Soft and comfortable": "The pillow is very soft to the touch and has a hidden zipper at the bottom, providing both comfort and durability.",
        "Versatile design": "The colorful stripes and square shape make this pillow a versatile decorative piece that can complement various interior styles, from modern to traditional."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate unique and artisanal home decor",
          "useCase": "Adding a touch of cultural and historical significance to their living space."
        },
        {
          "targetAudience": "People who support fair trade and ethical consumption",
          "useCase": "Feeling good about purchasing a product that empowers women and preserves indigenous craftsmanship."
        },
        {
          "targetAudience": "Those who prioritize comfort and versatility in their home decor",
          "useCase": "Enjoying the soft and comfortable feel of the pillow, while also adding a splash of color and pattern to their space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/566822148/color-therapy-pillowcolorful?click_key=c51efe61e21eb2ad687f6a114ebb8cac78abd714%3A566822148&click_sum=5c02316e&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:15:18.664062",
      "productId": "bvFxQnoRIE"
    }
  },
  {
    "data": {
      "product": "Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski. 100% cotton with zipper closing 16\" square. \nDesigned in Canada • Made in India. Pillow form not included.",
      "uniqueAttributes": {
        "Customizable design": "The Parquet pattern was designed in 2021 by Vikki Wiercinski, giving it a unique and modern aesthetic that sets it apart from generic pillow shams with common or mass-produced patterns.",
        "High-quality materials": "The pillow sham is made from 100% cotton, providing a soft and comfortable feel that is superior to generic pillow shams made from synthetic or low-quality materials.",
        "Durable construction": "The side zip closure ensures that the pillow sham can be easily removed and washed, extending its lifespan and keeping it looking its best.",
        "Made in India": "The pillow sham is made in India, supporting local artisans and promoting fair trade practices, which is not typically found in generic pillow shams.",
        "Exclusive to Society6": "The Parquet print is exclusive to Society6, making it a unique and exclusive find that cannot be found elsewhere."
      },
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "The pillow sham's unique Parquet print and high-quality materials would appeal to interior designers and home decorators seeking to add a touch of modern elegance to their clients' spaces."
        },
        {
          "targetAudience": "Individuals with a modern or mid-century modern aesthetic",
          "useCase": "The pillow sham's design aligns well with the modern or mid-century modern aesthetic, making it an ideal choice for individuals who prefer these styles in their home decor."
        },
        {
          "targetAudience": "Those who value sustainable and ethical products",
          "useCase": "The pillow sham's exclusive design and fair trade practices would resonate with individuals who prioritize sustainability and ethical consumption in their purchases."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=a1fa1fe56d77ddc1d516a86e5352588bb16eb60c%3A1168874671&click_sum=a77e9ec2&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:15:50.500706",
      "productId": "RjCtcoCVpJ"
    }
  },
  {
    "data": {
      "product": "Address Sign",
      "description": "The Address Sign is a modern and stylish way to display your house number. It is made from high-quality cabinet grade 1/4\" thick baltic birch wood, which ensures its durability and longevity. The sign can be personalized with the address of your choice, allowing you to create a unique and personalized piece for your home. It can be used in both painted and unpainted finishes, giving you the flexibility to match it to your existing home décor. The sign comes with two pre-drilled holes for easy installation, saving you time and hassle. It is proudly made in the USA, supporting local businesses and ensuring high-quality craftsmanship.",
      "uniqueAttributes": {
        "High-quality materials": "The sign is made from a high-quality cabinet grade 1/4\" thick baltic birch wood, which ensures its durability and longevity.",
        "Customizable": "The sign can be personalized with the address of your choice, allowing you to create a unique and personalized piece for your home.",
        "Versatile design": "The sign can be used in both painted and unpainted finishes, giving you the flexibility to match it to your existing home décor.",
        "Easy to install": "The sign comes with two pre-drilled holes for easy installation, saving you time and hassle.",
        "Made in the USA": "The sign is made in the USA, supporting local businesses and ensuring high-quality craftsmanship."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to improve the curb appeal of their property",
          "useCase": "Installing the sign outside their home to display their address in a stylish and modern way, enhancing the overall aesthetic of their property."
        },
        {
          "targetAudience": "Individuals who value personalization and uniqueness in their home decor",
          "useCase": "Customizing the sign with their specific address, creating a one-of-a-kind piece that reflects their personal style and adds a touch of individuality to their home."
        },
        {
          "targetAudience": "DIY enthusiasts and home improvement professionals",
          "useCase": "Utilizing the sign as a project to enhance their home, taking advantage of its easy installation process and versatility to match their existing decor."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/790049531/address-sign-modern-house-numbers-house?click_key=5ac3278d92b87e16842116bc79f6b985b171bc56%3A790049531&click_sum=d2fee15f&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:16:08.113281",
      "productId": "GXADDvEQkq"
    }
  },
  {
    "data": {
      "product": "Round Address Sign",
      "description": "The Round Address Sign is a modern and stylish way to display your house numbers. It features a geometric carved design with acrylic house numbers, and can be customized with your choice of text color and background paint or stain color. The sign comes with a sawtooth hanger for easy hanging, making it a great housewarming gift, realtor closing gift, or a way to spruce up your front porch or door decor.",
      "uniqueAttributes": {
        "Geometric design": "The sign features a geometric carved design with acrylic house numbers, giving it a modern and stylish look.",
        "Customization": "The sign can be customized with the user's choice of text color and background paint or stain color, allowing for a personalized touch.",
        "Sawtooth hanger": "The sign comes with a sawtooth hanger for easy hanging, making it convenient to display.",
        "Gift-worthy": "The sign is described as a great housewarming gift, realtor closing gift, or a way to spruce up the front porch or door decor, suggesting its value as a thoughtful and decorative item."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to update their house numbers",
          "useCase": "The sign provides a modern and stylish way to display house numbers, enhancing the curb appeal of their home."
        },
        {
          "targetAudience": "People looking for a unique and thoughtful gift",
          "useCase": "The sign can be customized to the recipient's preferences, making it a personal and meaningful gift for housewarmings or other special occasions."
        },
        {
          "targetAudience": "Real estate agents looking for a gift for their clients",
          "useCase": "The sign can serve as a practical and decorative addition to a new home, making it a thoughtful closing gift for real estate transactions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1439690652/round-address-sign-geometric-address?click_key=fb8d18c68750ed71292538b0a93dde2bb9aae0e2%3A1439690652&click_sum=a51df7b0&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:16:20.319013",
      "productId": "hWAnpPKhzO"
    }
  },
  {
    "data": {
      "product": "Herringbone Address Sign",
      "description": "The Modern Herringbone House Number Sign is the perfect address sign for a modern home exterior. The backer is made out of wood and the numbers are acrylic - the wood is sealed with an exterior grade sealer to help preserve its life. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood. \n\nThe backer can be any stain or paint color shown on our color charts -  note in the personalizationarea what paint or stain you would like. \n\nThe text can only be black or white \n\nSelect if you want it vertical or horizontal \n\nThe numbers will be made to fit the sign regardless of how many numbers you order. Less numbers will be taller and centered on the sign. If you need a custom size please reach out and I would be happy to help. \n\nThe sign is 7\" x 21\" shown with early american stain. Keep in mind all wood will stain differently. \n\nWe use a high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted. \n\nThese come with either a sawtooth hanger on the back or a d-ring.",
      "uniqueAttributes": {
        "Modern design": "The herringbone pattern and clean lines give this address sign a modern and stylish look that sets it apart from generic counterparts.",
        "Customization options": "The backer can be stained or painted in any color, and the numbers can be black or white, allowing for personalization to match the style of the home exterior.",
        "Durable materials": "The backer is made from high-quality cabinet grade 1/2\" thick baltic birch wood or 3/8\" water-resistant MDF if painted, ensuring durability and longevity.",
        "Sealed for protection": "The wood is sealed with an exterior grade sealer to help preserve its life and protect it from the elements.",
        "Versatile mounting options": "The sign can be mounted either vertically or horizontally, providing flexibility in placement and allowing it to fit in various spaces."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners seeking a stylish and modern address sign to enhance their home's curb appeal.",
          "useCase": "Displaying the address clearly and prominently on the front of their property, making it easy for visitors and delivery personnel to locate their home."
        },
        {
          "targetAudience": "Real estate agents looking for a personalized and meaningful closing gift for their clients.",
          "useCase": "Presenting the new homeowners with a custom-made address sign as a thoughtful and practical way to commemorate their new home."
        },
        {
          "targetAudience": "Individuals seeking a durable and weather-resistant address sign that can withstand the elements.",
          "useCase": "Installing the sign in an exposed location, such as near the mailbox or driveway, where it will be subjected to rain, snow, and sunlight."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1453867189/herringbone-address-sign-modern-house?click_key=fb5a03ed64d65c1c157e136f113a148259ef280c%3A1453867189&click_sum=19c9d815&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:16:37.708172",
      "productId": "naMFfoOHmy"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath",
      "description": "This wreath is made to order on a rustic grapevine base with artificial olives and leaves. It is perfect for rustic home decoration and can be used inside or outside. The wreath is made from 14\", 18\", and 24\" natural rustic grapevines and is available in 18\", 22\", and 28\" sizes (tip to tip). It is great for double doors and can be customized with a gift message.",
      "uniqueAttributes": {
        "Handmade": "This wreath is made to order and is made on a rustic grapevine base with artificial olives and leaves.",
        "Natural materials": "The wreath is made from natural grapevines, giving it a unique and rustic aesthetic.",
        "Versatile": "This wreath is ideal for inside or outside use, making it a versatile decoration option.",
        "Customizable": "The wreath can be made in different sizes and can be customized to include a gift message.",
        "Durable": "The wreath is made from durable materials and is designed to withstand the elements, making it a long-lasting decoration."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators seeking a rustic touch for their living spaces",
          "useCase": "Adding a natural and organic element to their decor, enhancing the ambiance of their homes."
        },
        {
          "targetAudience": "Individuals searching for unique and handmade gifts",
          "useCase": "Expressing their appreciation and thoughtfulness through a personalized and decorative present."
        },
        {
          "targetAudience": "Business owners seeking to enhance the aesthetic appeal of their commercial spaces",
          "useCase": "Creating a welcoming and inviting atmosphere for customers and employees, reflecting the brand's commitment to style and attention to detail."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=3d5f8f3f04a6c494a8e02520a771904919581c03%3A630678328&click_sum=4b02089e&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:16:58.086095",
      "productId": "STNOskZfvq"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons. The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath. The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop. This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery. This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.",
      "uniqueAttributes": {
        "Realistic faux lavender": "The wreath features high-quality faux lavender that looks incredibly realistic, adding a touch of nature and beauty to your front door or any indoor space.",
        "Modern farmhouse vibe": "The natural or darker stained wooden hoop or gold metal hoop gives the wreath a modern farmhouse vibe, making it suitable for a variety of home decor styles.",
        "Artificial lambs ear and eucalyptus accents": "The faux lambs ear and eucalyptus add texture and depth to the wreath, creating a more realistic and visually appealing look.",
        "UV protectant": "The wreath is sprayed with a UV protectant, making it suitable for both indoor and covered outdoor use, ensuring its beauty lasts for seasons to come.",
        "Versatile display options": "The wreath can be hung at any angle, allowing for flexibility in placement and creating a unique focal point in your home."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to enhance their front door or indoor space with a modern and elegant touch.",
          "useCase": "Display the wreath on the front door to create a welcoming and inviting entrance or hang it indoors above a fireplace or in a living room to add a touch of nature and beauty."
        },
        {
          "targetAudience": "Individuals who appreciate farmhouse-style decor and natural elements.",
          "useCase": "Incorporate the wreath into a farmhouse-inspired living room or bedroom to complement existing decor and create a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Those seeking a durable and low-maintenance way to add greenery to their home.",
          "useCase": "Display the wreath in a covered outdoor area, such as a patio or porch, to enjoy the beauty of nature without the hassle of watering or upkeep."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=dcf3edfa922c2f66569b3c94abdff2cd9ac81022%3A962426777&click_sum=1a315c81&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:17:13.963107",
      "productId": "MfaFKvJeQM"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath for front door",
      "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\"",
      "uniqueAttributes": {
        "Handmade": "This wreath is handmade in Northern, Virginia with love, making each piece unique and special.",
        "Customizable": "This wreath is made to order, allowing customers to customize the size, colors, and materials used to create a truly personalized piece.",
        "Versatile": "This wreath can be enjoyed inside or outside year round, making it a versatile addition to any home.",
        "High-quality materials": "This wreath is constructed on a durable grapevine base and decorated with high-quality eucalyptus, tea roses, and lambs ear, ensuring its beauty and longevity."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters seeking a stylish and versatile wreath for their front door or interior décor",
          "useCase": "Adding a touch of natural elegance and curb appeal to their home, while enjoying year-round greenery indoors or outdoors."
        },
        {
          "targetAudience": "Professionals or busy individuals with a limited amount of time for home décor",
          "useCase": "Easily incorporating a handmade and unique piece into their living space without the need for extensive maintenance or assembly."
        },
        {
          "targetAudience": "Those with a love for farmhouse or rustic décor",
          "useCase": "Enhancing the cozy and inviting atmosphere of their home with a wreath that complements their existing aesthetic."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1223343994/farmhouse-wreath-for-front-door?click_key=15133188b5a21788e5649f727e944a3b4e2fb9c6%3A1223343994&click_sum=b1ec6bd8&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:17:30.955345",
      "productId": "rLQKKmMaMU"
    }
  },
  {
    "data": {
      "product": "Last Name Doormat",
      "description": "This personalized doormat is made from natural coir fibers and features a vinyl back for durability. It is a perfect housewarming, wedding, or closing gift and can be used to welcome guests to your home. The doormat is available in a variety of designs, including custom designs, and can be personalized with your last name or other text. It is easy to care for and can be used in a covered area to protect it from the elements.",
      "uniqueAttributes": {
        "Eco-friendly": "Our high-quality doormats are made from all-natural coir fibers, making them eco-friendly.",
        "Sturdiness": "They feature a vinyl back for durability and sturdiness.",
        "Customization": "This listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing.",
        "Personalized": "If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below.",
        "Handmade": "All mats are hand cut, so please allow for a 1 inch +/- variance in length."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners who value eco-friendly and durable home décor products",
          "useCase": "Using the doormat to welcome guests and protect their floors from dirt and moisture"
        },
        {
          "targetAudience": "Individuals looking for personalized and stylish home décor items",
          "useCase": "Customizing the doormat with their family name or a special message to create a unique and inviting entrance to their home"
        },
        {
          "targetAudience": "Gift-givers seeking thoughtful and practical housewarming or wedding presents",
          "useCase": "Purchasing the doormat as a gift to help friends and family personalize and enhance their living spaces"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1168985443/last-name-doormat-housewarming-gift?click_key=b1098f91a88060f62d43045a6b407a1bcf3ce19c%3A1168985443&click_sum=5605043b&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-29T13:17:44.881519",
      "productId": "FebdFaEKSZ"
    }
  },
  {
    "data": {
      "product": "Pizza Doormat",
      "description": "This hand-painted pizza doormat is made from durable PVC and natural coir, making it suitable for both indoor and outdoor use. It is a unique and personal gift that can be used as a welcome mat, housewarming gift, wedding gift, or bridesmaid gift. The seller offers custom doormat designs, allowing customers to create a mat that perfectly fits their needs and preferences.",
      "uniqueAttributes": {
        "Hand painted": "Each welcome mat is hand painted, making it a unique and personal gift.",
        "Durable materials": "The doormat is made from a durable PVC back and a natural coir front, making it suitable for both indoor and outdoor use.",
        "Customizable": "The seller offers custom doormat designs, allowing customers to create a mat that perfectly fits their needs and preferences.",
        "Versatile": "The doormat can be used as a welcome mat, housewarming gift, wedding gift, or bridesmaid gift, making it a versatile and practical choice.",
        "Eco-friendly": "Coir doormats are made from natural materials and are biodegradable, making them an eco-friendly option."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a unique and personal way to welcome guests to their home.",
          "useCase": "The hand-painted pizza doormat can be used to add a touch of personality to the front step of a home."
        },
        {
          "targetAudience": "Individuals searching for a durable and practical welcome mat that can withstand the elements.",
          "useCase": "The doormat's durable PVC back and natural coir front make it suitable for both indoor and outdoor use, ensuring it can endure various weather conditions."
        },
        {
          "targetAudience": "People seeking a customizable gift for a special occasion, such as a housewarming or wedding.",
          "useCase": "The seller offers custom doormat designs, allowing customers to create a mat that perfectly fits the recipient's style and preferences."
        },
        {
          "targetAudience": "Eco-conscious consumers looking for a sustainable home décor option.",
          "useCase": "Coir doormats are made from natural materials and are biodegradable, making them an environmentally friendly choice for homeowners."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=b653ff16f1cf704c6711daa768004b22d5b98e33%3A612462127&click_sum=657a7a13&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:18:07.411894",
      "productId": "xklhLwMQOx"
    }
  },
  {
    "data": {
      "product": "Custom Last Name Retro Doormat",
      "description": "This personalized doormat is made from high-quality 100% coir and hand-painted with outdoor industrial paint that has built-in UV protection, ensuring that the design will not fade or wear away easily. Each mat is backed with a slip-resistant PVC rubber backing and comes in a variety of sizes to fit any doorway. The doormat can be personalized with the customer's last name, making it a unique and special addition to their home. The seller is also willing to create custom doormats with designs or text of the customer's choosing.",
      "uniqueAttributes": {
        "Personalized": "This doormat can be personalized with the customer's last name, making it a unique and special addition to their home.",
        "Handmade": "The doormat is hand-painted by the seller, giving it a one-of-a-kind touch and ensuring that no two mats are exactly the same.",
        "High-quality materials": "The doormat is made from 100% coir, a natural fiber that is durable and weather-resistant. The paint used is outdoor industrial paint with built-in UV protection, ensuring that the design will not fade or wear away easily.",
        "Slip-resistant backing": "The doormat has a slip-resistant PVC rubber backing, making it safe to use on all types of flooring.",
        "Variety of sizes": "The doormat is available in a variety of sizes to fit any doorway.",
        "Custom orders": "The seller is willing to create custom doormats with designs or text of the customer's choosing, making it possible to create a truly unique and personalized mat."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners who value personalization and unique home decor",
          "useCase": "Placing the doormat at their front door to welcome guests with a custom touch that reflects their family name."
        },
        {
          "targetAudience": "Individuals looking for a durable and stylish doormat for their home or office",
          "useCase": "Using the doormat to keep their floors clean and add a touch of style to their entryway."
        },
        {
          "targetAudience": "Businesses seeking a custom doormat to promote their brand or welcome customers",
          "useCase": "Placing the doormat outside their establishment to create a welcoming and memorable first impression."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1183106995/custom-last-name-retro-doormat-home?click_key=7b62c1a9518ecbf5a51ab11b13e591e12439e35f%3A1183106995&click_sum=edea5b44&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:18:28.505212",
      "productId": "PhuVkQO3LG"
    }
  },
  {
    "data": {
      "product": "WELCOME SIGN",
      "description": "This adorable WELCOME sign will add a colorful touch to your front door is our latest design, capturing the trendy floral designs so prevalent in today's decor. The sign is made of solid wood with painted on letters.\n\n* **Solid wood**: The sign is made of solid wood, making it durable and long-lasting. This sets it apart from generic signs made of flimsy materials.\n* **Hand-painted letters**: The letters on the sign are hand-painted, which gives them a unique and personal touch. This is in contrast to generic signs that often have vinyl stickers or spray-painted letters which can peel or fade over time.\n* **Distressed look**: The sign has a distressed look, which adds to its rustic charm. This is achieved through a specific staining and distressing process, giving the sign a unique and aged appearance.\n* **Accuracy in spacing and centering**: The sign has been designed with precision in the spacing and centering of the letters. This ensures that the sign looks balanced and well-made, unlike generic signs that may have uneven or off-center lettering.\n* **Customization options**: The sign can be customized to suit individual preferences. This includes the option to have it hung on a wall or to have a freestanding design. Generic signs typically do not offer such customization options.",
      "uniqueAttributes": {
        "Solid wood": "The sign is made of solid wood, making it durable and long-lasting. This sets it apart from generic signs made of flimsy materials.",
        "Hand-painted letters": "The letters on the sign are hand-painted, which gives them a unique and personal touch. This is in contrast to generic signs that often have vinyl stickers or spray-painted letters which can peel or fade over time.",
        "Distressed look": "The sign has a distressed look, which adds to its rustic charm. This is achieved through a specific staining and distressing process, giving the sign a unique and aged appearance.",
        "Accuracy in spacing and centering": "The sign has been designed with precision in the spacing and centering of the letters. This ensures that the sign looks balanced and well-made, unlike generic signs that may have uneven or off-center lettering.",
        "Customization options": "The sign can be customized to suit individual preferences. This includes the option to have it hung on a wall or to have a freestanding design. Generic signs typically do not offer such customization options."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners who value aesthetic appeal and durability in their home décor",
          "useCase": "Placing the sign by their front door to create a welcoming and stylish entryway."
        },
        {
          "targetAudience": "Individuals seeking unique and personalized home décor",
          "useCase": "Using the sign as a statement piece in their living room or bedroom, adding a touch of rustic charm to their space."
        },
        {
          "targetAudience": "Businesses looking to enhance their storefront or reception area",
          "useCase": "Displaying the sign prominently to create a warm and inviting atmosphere for customers and clients."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=950c45282fcb043b54892ca907f815fbc7d84844%3A775841802&click_sum=b51ef572&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-29T13:18:47.041662",
      "productId": "qwDfhIFpCE"
    }
  },
  {
    "data": {
      "product": "Large Wooden Porch Vases with Welcome Sign",
      "description": "This set of 2 large wooden porch vases features a unique farmhouse design that combines functionality and style. They serve as both a welcome sign and decorative pieces, adding a rustic charm to any porch or living room. The vases are made from reclaimed wood, giving them a sustainable and eco-friendly appeal. The large vase measures 24\" x 6\" and the smaller one measures 18\" x 6\". They are perfect for displaying large stems or branches, creating a beautiful and eye-catching entry to your home.",
      "uniqueAttributes": {
        "Rustic Charm": "This set of wooden porch vases adds a rustic charm to any porch or living room, creating a warm and inviting atmosphere.",
        "Multifunctional": "These vases serve as both a welcome sign and decorative pieces, combining functionality and style.",
        "Unique Farmhouse Decor": "The vases feature a unique farmhouse design that sets them apart from generic porch decor, adding a touch of personality and character to your home.",
        "Eye-Catching Entry": "The large size and eye-catching design of these vases make them a statement piece that will draw attention to your entryway.",
        "Reclaimed Wood": "The vases are made from reclaimed wood, giving them a sustainable and eco-friendly appeal."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters who enjoy rustic or farmhouse-style decor and want to add a touch of charm to their porch or living room.",
          "useCase": "Placing these vases on their porch or in their living room to create a welcoming and stylish atmosphere."
        },
        {
          "targetAudience": "Individuals who are looking for a unique and functional way to display large stems or branches in their home.",
          "useCase": "Filling the vases with greenery to add a touch of nature and beauty to their living space."
        },
        {
          "targetAudience": "People who are interested in eco-friendly and sustainable home decor.",
          "useCase": "Choosing these vases made from reclaimed wood, which helps reduce waste and promote environmental conservation."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=7ad9a23df887e29d4d643325b5ee7a1285b6b7db%3A511215666&click_sum=70e7cf2c&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:19:07.063805",
      "productId": "CDSZPMggxc"
    }
  },
  {
    "data": {
      "product": "Metal Wall Art",
      "description": "Elevate your home decor with a beautiful metal sign. Made with 18 guage steel and powder coated in your choice of 5 colors, this sign is built to withstand the elements for years of enjoyment. Add a touch of elegance to your home on the inside, outside, or both!",
      "uniqueAttributes": {
        "Durability": "Made with 18 gauge steel and powder coated, this sign is built to withstand the elements for years of enjoyment.",
        "Customization": "Each sign is designed by hand to accommodate personalization and ensure the best possible result.",
        "Variety": "Available in 5 color options and 6 sizes, allowing for a customized fit to any home decor.",
        "Versatility": "Can be used for both indoor and outdoor decoration, adding a touch of elegance to any space.",
        "Personalized Design": "Designed by hand to accommodate personalization and ensure the best possible result."
      },
      "targetAudience": [
        {
          "targetAudience": "Families looking for a personalized and meaningful home décor item",
          "useCase": "Displaying the sign in their home as a cherished keepsake that represents their family's unity and history."
        },
        {
          "targetAudience": "Couples seeking a unique and elegant way to commemorate their wedding",
          "useCase": "Using the sign as a wedding welcome sign or as a personalized piece of art in their new home."
        },
        {
          "targetAudience": "Homeowners seeking a stylish and durable outdoor decoration",
          "useCase": "Displaying the sign on their porch, patio, or garden as a way to add a touch of personalization and curb appeal to their property."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1095987590/family-gift-family-name-welcome-sign?click_key=2975da989550db39ffbf25daa16b8f0caf0b64a6%3A1095987590&click_sum=80a6bef0&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:19:22.169145",
      "productId": "KYnRmugJgO"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce",
      "description": "This utility-style sconce is an excellent addition to any room, featuring a gloss black finish 10-inch shade with a white interior. The sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.",
      "uniqueAttributes": {
        "Industrial Style": "The sconce embodies an industrial style, featuring a gloss black finish and a white interior, which adds a touch of edginess and modernity to any room.",
        "Adjustable Shade": "The sconce's shade can be tilted from 90 to 180 degrees, allowing for customization of light direction and ambiance.",
        "Key Switch": "The sconce is conveniently equipped with a key switch located on the socket for easy on/off operation.",
        "Finish Options": "The sconce is available in three finish options - black, brushed nickel, and antique brass - to complement different décor styles and preferences.",
        "UL Listed": "The sconce is meticulously tested and UL listed, ensuring its safety and reliability, providing peace of mind for customers."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking an industrial-style lighting solution for their home or workspace.",
          "useCase": "Creating a modern and edgy ambiance in a living room, bedroom, or office."
        },
        {
          "targetAudience": "Homeowners and renters looking for a versatile and adjustable light fixture.",
          "useCase": "Customizing the light direction to highlight artwork, create a reading nook, or provide ambient lighting."
        },
        {
          "targetAudience": "Consumers prioritizing safety and reliability in their lighting choices.",
          "useCase": "Ensuring the sconce meets UL safety standards and provides peace of mind."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=f40e0d5e59fce4acbb85f4c063463934343eedb3%3A615762911&click_sum=4daef902&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:19:39.349670",
      "productId": "bpUPSihqNf"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern",
      "description": "This outdoor wall lantern combines contemporary European design with integrated LED technology. Its sleek and minimalist style, featuring a unique reflective center cone, creates a distinct and tasteful appearance. Constructed from sturdy die-cast aluminum and sealed with a weather-proof coating, this ETL-certified lantern is built to withstand the elements in wet locations and all climates. The energy-efficient integrated LED lights provide long-lasting illumination, eliminating the need for frequent bulb replacements and reducing energy consumption. Its versatile design makes it suitable for both residential and commercial use, including exterior entrances, garages, patios, porches, restaurants, common buildings, office spaces, and multi-use buildings. The patented easy installation hardware allows for quick and hassle-free mounting, making it accessible to anyone.",
      "uniqueAttributes": {
        "Integrated LED lights": "This wall lantern features integrated LED lights, eliminating the need for replaceable bulbs and providing long-lasting energy efficiency.",
        "Unique reflective center cone": "The lantern's distinctive reflective center cone enhances light distribution and creates a visually appealing effect.",
        "Farmhouse design": "Its farmhouse design adds a touch of rustic charm to any outdoor space, complementing both traditional and modern architectural styles.",
        "ETL certified for wet locations": "The ETL certification ensures the lantern's durability and suitability for use in exposed outdoor areas, regardless of weather conditions.",
        "Easy installation": "The patented easy installation hardware allows for quick and hassle-free mounting, making it accessible to anyone."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners seeking to upgrade their outdoor lighting with a stylish and energy-efficient fixture.",
          "useCase": "Installing the lantern to illuminate entryways, patios, or porches, enhancing safety and curb appeal."
        },
        {
          "targetAudience": "Businesses and commercial establishments aiming to create a welcoming and visually appealing outdoor ambiance.",
          "useCase": "Utilizing the lantern to brighten entrances, common areas, or office spaces, fostering a comfortable and inviting atmosphere."
        },
        {
          "targetAudience": "Design enthusiasts seeking a unique and modern touch for their outdoor décor.",
          "useCase": "Incorporating the lantern into a contemporary outdoor design scheme, adding a touch of sophistication and elegance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=a57f3ec672232f8b5fdf5046add089a76289575c%3A1165269880&click_sum=dc68bd1d&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:19:54.433472",
      "productId": "ChNFwufXKC"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce",
      "description": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade. It comes in multiple finish options, including raw brass, black, brushed nickel, polished nickel, and antique brass. The lamp is UL listed and thoroughly tested before leaving the shop, ensuring its safety and reliability. It is compatible with a dimmer switch and various bulb types, including incandescent, LED, compact fluorescent, and standard E26 base bulbs up to 60 watts. Customers can choose to install the light fixture as direct wired into the wall or add an on/off switch or make it a plug-in fixture.",
      "uniqueAttributes": {
        "Handcrafted": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade, adding a unique and artisanal touch.",
        "Customizable Finish": "The sconce offers multiple finish options, including raw brass, black, brushed nickel, polished nickel, and antique brass. This allows customers to choose the finish that best complements their decor, making it a more personalized lighting solution.",
        "UL Listed": "The lamp is UL listed and thoroughly tested before leaving the shop, ensuring its safety and reliability. This provides peace of mind and sets it apart from generic lamps that may not meet safety standards.",
        "Compatibility": "The light fixture is compatible with a dimmer switch and various bulb types, including incandescent, LED, compact fluorescent, and standard E26 base bulbs up to 60 watts. This versatility makes it easy to customize the lighting and create the desired ambiance.",
        "Installation Options": "Customers can choose to install the light fixture as direct wired into the wall or add an on/off switch or make it a plug-in fixture. This flexibility allows for easy installation and customization to suit different needs."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and interior designers seeking stylish and customizable lighting solutions.",
          "useCase": "Upgrading their home decor with a unique and eye-catching wall sconce that complements their existing furnishings and style preferences."
        },
        {
          "targetAudience": "Businesses and commercial spaces looking to create a warm and inviting ambiance.",
          "useCase": "Enhancing the atmosphere of their establishment with a well-crafted lighting fixture that adds a touch of sophistication and functionality."
        },
        {
          "targetAudience": "DIY enthusiasts and home renovators with an appreciation for quality craftsmanship.",
          "useCase": "Installing the sconce as a part of a larger home improvement project, utilizing its versatility and compatibility with various bulb types and installation options."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=a52d9d3d166dfc474a9c68e330a061f6f665e7d9%3A1051791566&click_sum=f221e642&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:20:17.664760",
      "productId": "tuLqtXilcl"
    }
  },
  {
    "data": {
      "product": "Linen bedding set, Double king duvet cover and pillows in Green color, 100% natural flax sheets set custom sizes",
      "description": "- Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.\n\n- Includes one duvet cover + 2 pillowcases\n- Composition: 100% linen\n- Color: Green\n- Duvet cover closure type - buttons\n- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)\n- Hypoallergenic, thermoregulating, breathable\n- Ethically made in Lithuania\n- Write in the comments if you need to attach ties to the corners of your duvet cover.\n\n- Organic, enzyme-washed flax fabric: Our linen is made from top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home. The more you use it, the more fabulous, soft, and YOURS it will become!\n\n- Directly from Lithuanian flax mills: We use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.\n\n- Antibacterial, antistatic, and hygroscopic properties: Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold.\n\n- Hypoallergenic, thermoregulating, breathable: Our linen bedding is hypoallergenic, thermoregulating, and breathable, making it perfect for people with sensitive skin or allergies.\n\n- Ethically made in Lithuania: Our linen bedding is ethically made in Lithuania, ensuring that it is produced in a sustainable and responsible manner.\n\n- Customizable: We offer custom sizes to ensure that our linen bedding fits your bed perfectly.\n\n- Ready as a gift: Our linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.",
      "uniqueAttributes": {
        "Organic, enzyme-washed flax fabric": "Our linen is made from top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home. The more you use it, the more fabulous, soft, and YOURS it will become!",
        "Directly from Lithuanian flax mills": "We use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.",
        "Antibacterial, antistatic, and hygroscopic properties": "Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold.",
        "Hypoallergenic, thermoregulating, breathable": "Our linen bedding is hypoallergenic, thermoregulating, and breathable, making it perfect for people with sensitive skin or allergies.",
        "Ethically made in Lithuania": "Our linen bedding is ethically made in Lithuania, ensuring that it is produced in a sustainable and responsible manner.",
        "Customizable": "We offer custom sizes to ensure that our linen bedding fits your bed perfectly.",
        "Ready as a gift": "Our linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals with sensitive skin or allergies",
          "useCase": "The hypoallergenic, thermoregulating, and breathable properties of the linen bedding make it ideal for those with sensitive skin or allergies, providing a comfortable and restful sleep experience."
        },
        {
          "targetAudience": "People who value sustainability and ethical production",
          "useCase": "The linen bedding is ethically made in Lithuania, ensuring that it is produced in a sustainable and responsible manner, appealing to those who prioritize ethical and environmentally conscious consumption."
        },
        {
          "targetAudience": "Individuals seeking a luxurious and comfortable bedding experience",
          "useCase": "The organic, enzyme-washed flax fabric provides a soft and luxurious feel, enhancing the overall sleep experience for those who value comfort and indulgence."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=ebbf765b750b9cab1137733f9e17cdc6a4dac848%3A1316603667&click_sum=47137b9d&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:20:40.396668",
      "productId": "KgqWbdzGRn"
    }
  },
  {
    "data": {
      "product": "Cappuccino Linen Pillowcase",
      "description": "This premium quality linen pillowcase is made from 100% extra soft linen, providing maximum comfort and a luxurious feel. Its natural breathability promotes airflow, keeping you cool and comfortable throughout the night. The fabric is certified by Oeko Tex 100, ensuring it is free from harmful chemicals and safe for use. The pillowcase is available in a range of US, EU, and UK sizes, as well as custom sizes upon request. This allows for a perfect fit for various pillows and bed sizes. Handcrafted in Lithuania, this pillowcase ensures high quality and attention to detail.",
      "uniqueAttributes": {
        "Premium quality linen": "The pillowcase is made from 100% extra soft linen, providing maximum comfort and a luxurious feel.",
        "Natural breathability": "Linen's natural qualities promote airflow, keeping you cool and comfortable throughout the night.",
        "Oeko Tex 100 certification": "The fabric is certified by Oeko Tex 100, ensuring it is free from harmful chemicals and safe for use.",
        "Customizable sizes": "The pillowcase is available in a range of US, EU, and UK sizes, as well as custom sizes upon request. This allows for a perfect fit for various pillows and bed sizes.",
        "Handmade in Lithuania": "The pillowcase is handcrafted in Lithuania, ensuring high quality and attention to detail."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals who prioritize comfort and quality sleep",
          "useCase": "The pillowcase provides a luxurious and comfortable sleeping experience due to its premium quality linen and natural breathability."
        },
        {
          "targetAudience": "Those concerned about health and well-being",
          "useCase": "The Oeko Tex 100 certification ensures that the pillowcase is free from harmful chemicals, promoting a safe and healthy sleeping environment."
        },
        {
          "targetAudience": "People who value customization and a perfect fit",
          "useCase": "The availability of various sizes, including custom options, allows for a tailored fit to different pillows and bed sizes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=2e8c84a390a3842e81021efb78371ec0a8a77302%3A1295727796&click_sum=abdbacf3&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:21:04.669001",
      "productId": "ZrURmqgcqX"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set",
      "description": "The linen bedding set includes a duvet cover and two pillowcases, crafted from high-quality European linen. It is certified by OEKO-TEX, ensuring that it is free from harmful chemicals and safe for human use. The linen is naturally strong, lustrous, and durable, making the bedding set long-lasting. The bedding is hypoallergenic, thermoregulating, and breathable, providing a comfortable and healthy sleep environment. It is also ethically made in Lithuania, ensuring fair labor practices and sustainable production. The bedding set is lightweight and easy to pack, making it convenient for travel or storage. Custom orders for sizes not listed are accepted, allowing customers to get a perfect fit for their beds. The bedding can be beautifully packaged as a gift, with personalized gift messages available on the seller's branded card.",
      "uniqueAttributes": {
        "OEKO-TEX certified": "The duvet covers are made of OEKO-TEX certified linen, which means that they are free of harmful chemicals and safe for human use.",
        "Durable": "The linen duvet covers are incredibly durable and their texture only improves with time.",
        "Customizable": "The seller accepts custom orders for sizes that are not listed, allowing customers to get a perfect fit for their beds.",
        "Gift-ready": "The bedding can be beautifully packaged as a gift, with personalized gift messages available on the seller's branded card.",
        "Hypoallergenic and breathable": "The linen is hypoallergenic, thermoregulating, and breathable, providing added comfort and a healthy sleep environment.",
        "Ethically made": "The products are ethically made in Lithuania, ensuring fair labor practices and sustainable production.",
        "Lightweight and easy to pack": "Unique fiber softening techniques make the products lightweight and easy to pack, saving space and making them convenient for travel or storage."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking high-quality and durable bedding",
          "useCase": "Upgrading their sleep experience with luxurious and long-lasting linen bedding that enhances comfort and relaxation."
        },
        {
          "targetAudience": "People with sensitive skin or allergies",
          "useCase": "Finding hypoallergenic and breathable bedding that promotes a healthy and comfortable sleep environment, minimizing skin irritation and allergies."
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Choosing ethically made and sustainable bedding products that align with their values of environmental protection and fair labor practices."
        },
        {
          "targetAudience": "Individuals who value aesthetics and style",
          "useCase": "Adding a touch of sophistication and elegance to their bedroom décor with high-quality linen bedding that complements their personal taste and home aesthetics."
        },
        {
          "targetAudience": "Those looking for customizable bedding options",
          "useCase": "Tailoring their bedding to their specific needs and preferences by ordering custom sizes or adding personal touches such as embroidered monograms."
        },
        {
          "targetAudience": "People who appreciate thoughtful gifts",
          "useCase": "Gifting loved ones with beautifully packaged, high-quality linen bedding that provides both comfort and style, creating lasting memories."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=25e54bf9b762d49e8b6651ef3de9ece1312d8bbb%3A1066602418&click_sum=8159b3bf&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:21:24.145699",
      "productId": "RdIEYlewQl"
    }
  },
  {
    "data": {
      "product": "Wall art decor print",
      "description": "This is a high-quality Giclée print, which uses archival pigment inks and acid-free fine art paper, ensuring long-lasting colors and durability. Each print is signed by the artist, adding a personal touch and authenticity to the artwork. The print is available in three optional sizes, allowing customers to choose the size that best fits their space and framing needs. The print includes a white border for framing, making it easy to frame and display the artwork professionally.",
      "uniqueAttributes": {
        "Fine art Giclée print": "This print is a high-quality Giclée print, which uses archival pigment inks and acid-free fine art paper, ensuring long-lasting colors and durability.",
        "Signed by the artist": "Each print is signed by the artist, adding a personal touch and authenticity to the artwork.",
        "Optional sizes": "The print is available in three optional sizes, allowing customers to choose the size that best fits their space and framing needs.",
        "White border for framing": "The print includes a white border for framing, making it easy to frame and display the artwork professionally."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in interior design and architectural aesthetics",
          "useCase": "Displaying the artwork in their homes or workspaces to enhance the ambiance and reflect their personal style."
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Adding the print to their collection as a valuable piece of contemporary art."
        },
        {
          "targetAudience": "Design professionals and architects",
          "useCase": "Incorporating the print into their interior design projects to create visually stunning and meaningful spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/576508683/wall-art-decor-print-interior-decor?click_key=e87754ed665cac6185cb2b70a2fbbabee46555ab%3A576508683&click_sum=02bb0a07&ref=stl_listing-1",
      "dateCreated": "2024-02-29T13:21:37.642416",
      "productId": "cMEpSycRfK"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable",
      "description": "This is a digital download of two high-resolution JPEG images, with a maximum size of A2 International Paper size, with no white borders. The image ratio is 5x7 and the file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.",
      "uniqueAttributes": {
        "Digital and printable": "This is a digital download, so you can instantly download and print the artwork at home or through a printing service, saving you the cost and time of shipping.",
        "High-resolution images": "The images are provided in high-resolution JPEG format, ensuring crisp and clear prints up to A2 International Paper size.",
        "Versatile size options": "The images can be cropped to fit various paper sizes or frame sizes, giving you the flexibility to customize the artwork to your specific needs.",
        "Exclusive original painting option": "For larger sizes, the artist offers the sale of the limited edition original painting on high-quality paper or canvas, providing a unique and valuable piece of art.",
        "Support for small artists": "By purchasing this digital download, you are directly supporting an emerging small artist and helping them to continue creating and growing."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators and art enthusiasts who appreciate modern and abstract art",
          "useCase": "To enhance their living spaces with stylish and visually appealing artwork that complements their contemporary home décor."
        },
        {
          "targetAudience": "Individuals seeking affordable and accessible art options",
          "useCase": "To add a touch of sophistication and elegance to their homes or offices without breaking the bank."
        },
        {
          "targetAudience": "Small businesses and startups looking for professional-looking wall art",
          "useCase": "To create a welcoming and inspiring work environment that reflects their brand's image and values."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/834853057/emerald-green-painting-abstract-art?click_key=9a377e301fc36d7d7cac47afa6d877c9588fe8a9%3A834853057&click_sum=20dbb497&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-29T13:21:50.733013",
      "productId": "cGsMuBUGZv"
    }
  },
  {
    "data": {
      "product": "Dip dye tapestry",
      "description": "This beautiful boho wall art is constructed from hundreds of recycled cotton threads, each thread is then hand-dyed and finished on a hand-stained wood panel. Each wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.",
      "uniqueAttributes": {
        "Handmade": "Each wall hanging is handmade and cannot be duplicated to appear exact, which means each one is one of a kind and has its own individual style.",
        "Recycled materials": "This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look",
        "Customizable": "Feel free to contact me if you would like to order this piece in a different size or colour.",
        "Original design": "This is an original design © bourneandthread 2019. All rights reserved."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and handmade home décor.",
          "useCase": "Adding a touch of bohemian flair and warmth to their living spaces, creating a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Eco-conscious consumers.",
          "useCase": "Incorporating sustainable and recycled materials into their home décor, reducing their environmental impact."
        },
        {
          "targetAudience": "Art enthusiasts and collectors.",
          "useCase": "Displaying the tapestry as a statement piece in their homes, showcasing their appreciation for original and handmade artwork."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=537491880fab15bc7d04f151e40fd31d5c9e2590%3A991191051&click_sum=89852432&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:22:04.951194",
      "productId": "LuUJfsxKMO"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "This product is a handmade, bubble-shaped candle made from a blend of high-quality, pure soy wax and white beeswax. It is available in a variety of scents, including High Tide, Pink Sugar Crystals, Magnolia Peony, and Pine Forest. Each candle is hand-poured and wrapped by hand, and due to the nature of this, they may vary slightly. Some small imperfections may be present, which does not affect the use.",
      "uniqueAttributes": {
        "Bubble shape": "The bubble shape of this candle is highly unique and visually appealing, setting it apart from generic candles with standard shapes.",
        "Handmade": "Each candle is handmade and wrapped by hand, adding a personal touch and making each piece slightly different.",
        "Soy and beeswax blend": "The candle is made from a blend of high-quality, pure soy wax and white beeswax, which provides a healthy and environmentally friendly aroma when burned.",
        "Scent options": "The candle comes in a variety of scents, including High Tide, Pink Sugar Crystals, Magnolia Peony, and Pine Forest, offering a range of options to suit different preferences.",
        "Customization": "The candle can be customized with different scents and colors, allowing customers to create a truly unique and personalized product."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking for unique and stylish accents",
          "useCase": "Adding a touch of elegance and sophistication to their living spaces, creating a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Gift-givers seeking thoughtful and memorable presents",
          "useCase": "Expressing appreciation or affection for loved ones, creating lasting memories through a unique and handmade gift."
        },
        {
          "targetAudience": "Individuals seeking a healthy and eco-friendly way to enhance their well-being",
          "useCase": "Creating a relaxing and soothing ambiance in their homes, promoting relaxation and reducing stress."
        },
        {
          "targetAudience": "Aesthetes and collectors drawn to handmade and artisanal products",
          "useCase": "Appreciating the unique craftsmanship and individuality of each candle, adding to their collection of cherished objects."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=89dd3b2faa1ecaa79386a47c51c839cd946226da%3A774551709&click_sum=f42d887e&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:22:23.147735",
      "productId": "iSFqoxnQvt"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle",
      "description": "Hand-poured soy candle with a blend of Peruvian palo santo wood, neroli, saffron, cedarwood, amber, and moss. Made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks. Burns for approximately 45-50 hours. Made in New York.",
      "uniqueAttributes": {
        "Handmade": "Hand-poured in small batches",
        "Natural ingredients": "Made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks",
        "Long burn time": "This candle will burn for approximately 45-50 hours",
        "Made in the USA": "All of our candles are made, packaged, and shipped from our New York Studio"
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators who value ambiance and natural scents",
          "useCase": "Using the candle to create a relaxing and inviting atmosphere in their homes."
        },
        {
          "targetAudience": "Individuals seeking natural and eco-friendly home products",
          "useCase": "Choosing the candle for its sustainable soy wax composition and lead-free wick."
        },
        {
          "targetAudience": "Aromatherapy enthusiasts interested in the grounding and earthy scent of palo santo",
          "useCase": "Using the candle to promote relaxation and stress relief through its calming aroma."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=f375963ae83beb6383c44fe416d0e93ab8691d07%3A785763623&click_sum=839a6608&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:22:35.033919",
      "productId": "pXtsiEVWMs"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle",
      "description": "This candle is made from 100% natural soy and essential oils, and is scented exclusively with essential oils. It is hand-poured in Rhode Island and has a burn time of up to 50 hours. The candle is inspired by the sacred Hinoki tree of Japan, known for its purifying and restorative properties. It is also linked to the practice of Forest Bathing (Shinrin-Yoku), which involves immersing oneself in the serene atmosphere of forests. The candle is said to promote clarity, awareness, and a sense of well-being.",
      "uniqueAttributes": {
        "100% Natural": "Made with 100% natural soy and essential oils, this candle is free from harmful chemicals and synthetic fragrances.",
        "Scented with essential oils": "The candle is scented exclusively with essential oils, providing a natural and therapeutic aroma. This differs from generic candles that often use artificial fragrances, which can be irritating or overwhelming.",
        "Hand-poured in Rhode Island": "The candle is hand-poured in Rhode Island, supporting local artisans and ensuring a high level of quality and craftsmanship.",
        "Japanese Hinoki wood inspiration": "The candle draws inspiration from the sacred Hinoki tree of Japan, known for its purifying and restorative properties. This unique cultural connection adds a layer of depth and meaning to the candle's aroma.",
        "Forest Bathing connection": "The candle is linked to the practice of Forest Bathing (Shinrin-Yoku), which involves immersing oneself in the serene atmosphere of forests. This connection reinforces the candle's ability to promote clarity, awareness, and a sense of well-being."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking natural and therapeutic home fragrances",
          "useCase": "Creating a calming and restorative atmosphere in their living spaces, promoting relaxation and stress relief."
        },
        {
          "targetAudience": "Environmental enthusiasts and those interested in Japanese culture",
          "useCase": "Appreciating the natural and cultural significance of the Hinoki tree, fostering a connection with nature and well-being."
        },
        {
          "targetAudience": "Wellness-oriented individuals and practitioners",
          "useCase": "Enhancing meditation, yoga, or other mindfulness practices, facilitating clarity, awareness, and a sense of spiritual connection."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=28c8e9a0bfbc67aae9bcdc4f179e0b5ef43b6ba7%3A879866486&click_sum=5cf5beff&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-29T13:22:51.470874",
      "productId": "FuCCpEHIeP"
    }
  },
  {
    "data": {
      "product": "Scandinavian decor side table Short Wooden Stool",
      "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.\n\n**STOOL DETAILS**\n- COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: \n- Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or Black\n\nWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.\n\n- Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.\n- Finished with a natural hard wax oil.\n- Weight limit is 120kg\n- You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.\n- Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.\n- Easy to assemble in 5 minutes.\n\n**STOOL DIMENSIONS**\n- Seat diameter: 32 cm (12.59\")\n- Height: 41 cm (16.14\")\n\n**IMPORTANT**\nYou have three way to see our stains:\n- Third photo shows our samples of colors\n- When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option\n- You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want",
      "uniqueAttributes": {
        "Versatile": "This stool is incredibly versatile, offering a wide range of customization options. You can choose from two color samplers, allowing you to select the perfect shade to match your decor. You can also change the size, material, and surface treatment to create a stool that is tailored to your specific needs.",
        "High-quality materials": "The stool is made from high-quality plywood produced by one of the biggest plywood suppliers in the world based in Finland. This ensures durability and longevity.",
        "Easy to assemble": "The stool is designed for easy assembly, taking only 5 minutes to put together. This makes it a convenient option for those who want to avoid complicated assembly processes.",
        "Natural finish": "The stool is finished with a natural hard wax oil, which enhances its natural beauty and provides protection. This finish is environmentally friendly and gives the stool a warm, inviting look.",
        "Weight limit": "The stool has a weight limit of 120kg, making it sturdy and suitable for everyday use."
      },
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators seeking to add a touch of Scandinavian charm to their projects",
          "useCase": "Using the stool as a stylish and functional accent piece in living rooms, bedrooms, or entryways"
        },
        {
          "targetAudience": "Individuals looking for a versatile and durable stool for everyday use",
          "useCase": "Utilizing the stool as extra seating, a footrest, or a plant stand"
        },
        {
          "targetAudience": "People interested in sustainable and eco-friendly home furnishings",
          "useCase": "Choosing the stool for its natural hard wax oil finish and responsibly sourced plywood construction"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=72f8980b430ffdc539267b26e424e22381b7c4d4%3A570862928&click_sum=2b329283&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:23:17.682879",
      "productId": "gVHTtEcHxu"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.\nThe stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.\nThis collection combines the use of a natural material and simple forms.\nCollection: Furniture Collection\nMaterial: Natural Cork\nDimensions:\nCork stool #1 - Ø 30 x H 39 cm\nCork stool #2 - Ø 32 x H 45 cm\nYear: 2020\nCare instructions\nYou should:\n> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;\nYou should not:\n>clean it with any type of chemical and abrasive product;\n> place hot or sharp objects on the surfaces;\n> expose it to direct sunlight.\nCork is a natural material, therefore susceptible to shade variations over the years.",
      "uniqueAttributes": {
        "Natural material": "Made of natural cork, offering a unique and eco-friendly design.",
        "Versatile design": "Available in two dimensions and featuring a recess around the perimeter for easy carrying and moving, making it suitable for a wide range of environments.",
        "Smooth texture": "The smooth texture of cork combined with the simple design creates a sophisticated and tactile experience.",
        "Sustainable": "Cork is a renewable resource, making these stools an environmentally conscious choice.",
        "Handcrafted": "Each stool is handcrafted, ensuring attention to detail and quality."
      },
      "targetAudience": [
        {
          "targetAudience": "Interior designers and homeowners seeking eco-friendly and stylish furniture",
          "useCase": "Using the stools to add a touch of nature and functionality to living rooms, bedrooms, and public spaces."
        },
        {
          "targetAudience": "Owners of Eames lounge chairs",
          "useCase": "Complementing the iconic design of the Eames lounge chair with a natural and sustainable footrest."
        },
        {
          "targetAudience": "Individuals seeking unique and handcrafted home decor",
          "useCase": "Adding a touch of artisanal charm and organic beauty to their living spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/793579884/cork-stools-home-living-bedroom-living?click_key=ad49ac18924f04d5bcbe0568a447071a045f1240%3A793579884&click_sum=f5151a0f&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:23:34.443824",
      "productId": "MhkeRxWGoM"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "The Bonnet Wood Stool is a versatile and durable piece of furniture that can be used as an end table, side table, stool, or plant stand. It is handmade in Indianapolis, Indiana, with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels. The stool is hand finished with three coats of wipe-on poly-oil wax finish for a durable, water-resistant satin glow. It is available in two sizes and a variety of colors. Customers can also reach out for custom colors and sizes, allowing them to create a stool that perfectly matches their decor and needs.",
      "uniqueAttributes": {
        "Handmade": "The Bonnet Stool is handmade in Indianapolis, Indiana, with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels. This craftsmanship ensures durability and a unique, one-of-a-kind look.",
        "Durable finish": "The stool is hand finished with three coats of wipe-on poly-oil wax finish for a durable, water-resistant satin glow. This finish protects the wood and enhances its natural beauty, making the stool suitable for both indoor and outdoor use.",
        "Customizable": "The Bonnet Stool is available in two sizes and a variety of colors. Customers can also reach out for custom colors and sizes, allowing them to create a stool that perfectly matches their decor and needs. This level of customization is not typically found in generic stools.",
        "Functional versatility": "The Bonnet Stool can function as an end table, side table, stool, or plant stand, offering multiple uses in different spaces. This versatility makes it a practical and space-saving solution for homes or offices.",
        "Sustainable materials": "The stool is made from solid wood, including Douglas Fir, Sycamore, and Oak, which are all sustainable and eco-friendly materials. This sets it apart from generic stools that may use less durable or environmentally conscious materials."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and apartment dwellers looking for a stylish and functional piece of furniture",
          "useCase": "Adding a touch of Scandinavian design to their living room, bedroom, or office; using it as an end table, side table, stool, or plant stand"
        },
        {
          "targetAudience": "Interior designers and decorators",
          "useCase": "Incorporating the stool into their clients' homes or offices as a unique and eye-catching accent piece"
        },
        {
          "targetAudience": "Plant enthusiasts",
          "useCase": "Displaying their favorite plants in a stylish and elevated way"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=f77ba6d3a671595059911d4a88e7b742ce4004f4%3A1198929077&click_sum=6b4d7b98&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:23:52.088839",
      "productId": "UyTtcwswal"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "The Coiled planter is designed to add style to your plants, featuring a bauhaus/Japanese cool aesthetic. It is made from a plant-based bioplastic eco-friendly material, with the natural wood and black wood matte finish mixed with real recycled wood. The planter is lightweight, durable, and won't break if accidentally dropped. It comes with a drainage hole and 3 little \"feet\" for optimal plant health. Available in a variety of sizes and colors, the Coiled planter is perfect for modernizing and showcasing the beauty of your plants.",
      "uniqueAttributes": {
        "Eco-friendliness": "The planter is made from a plant-based bioplastic material, making it eco-friendly and sustainable. This sets it apart from generic planters made from non-renewable or less environmentally friendly materials.",
        "Original design": "The design of the planter is original to Morse Studio Co., making it unique and exclusive to the brand. This differentiates it from generic planters that may have common or unoriginal designs.",
        "Customization options": "The planter is available in a variety of sizes and colors, allowing customers to choose the best fit for their plants and home decor. This level of customization is not typically found in generic planters.",
        "Durability": "The planter is made from a durable material that won't break if accidentally dropped. This makes it a more practical and long-lasting option compared to generic planters that may be more fragile or prone to damage.",
        "Drainage hole and feet": "The planter comes with a built-in drainage hole and three small feet, which are essential for plant health and preventing waterlogging. This attention to detail sets it apart from generic planters that may not have these features."
      },
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts and home decorators who prioritize aesthetics and sustainability",
          "useCase": "Upgrading their indoor plant displays with a stylish and eco-friendly planter that complements their home decor."
        },
        {
          "targetAudience": "Individuals seeking unique and original home accessories",
          "useCase": "Adding a touch of exclusivity to their living spaces with a planter that boasts an original design from Morse Studio Co."
        },
        {
          "targetAudience": "Practical gardeners and plant owners",
          "useCase": "Ensuring the health and longevity of their plants with a planter that provides proper drainage and stability through its built-in drainage hole and feet."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=79eaedb1d3461c15080dda471887639e8953fefa%3A865339439&click_sum=4b75e813&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-29T13:24:09.191641",
      "productId": "Dyv6hSsJFW"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter",
      "description": "A metal plant pot with a brass stand, available in nude pink. The pot is 20cm in diameter and 30cm tall, while the brass stand is 18cm tall. The pot has a perforated separator inside to collect excess water and protect the roots of the plant. Plants can also be placed inside the pot with their own pots, using the separator as a platform.",
      "uniqueAttributes": {
        "Size": "Globe Planter is now suitable for all house plants with its maxi size!",
        "Direction adjustment": "As being able to rotate to any direction on its brass stand, Globe Planter lets you to adjust your plants position easily.",
        "Floor placement": "And it can now be placed on the floor with longer and spreading plants.",
        "Drainage system": "With the perforated separator inside, excessive water is collected at the bottom not to harm the roots.",
        "Versatile usage": "Plants can also be placed with their pots inside Globe Planter. In that case the seperator functions as a platform for your your pot."
      },
      "targetAudience": [
        {
          "targetAudience": "Home decorators and plant enthusiasts looking to add a touch of elegance to their living spaces",
          "useCase": "Using the planter to display their favorite plants in a stylish and functional way, potentially in a living room or bedroom"
        },
        {
          "targetAudience": "Individuals seeking a versatile plant container that can accommodate various plant sizes and shapes",
          "useCase": "Utilizing the planter's adjustable base to accommodate different plant heights and the drainage system to prevent overwatering, making it suitable for a variety of plant species"
        },
        {
          "targetAudience": "Consumers searching for a durable and long-lasting plant pot",
          "useCase": "Appreciating the planter's construction from brass and aluminum with static paint, ensuring its longevity and resistance to wear and tear, making it a worthwhile investment for plant care"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=fa38c6c790c419b886b1b7789b1c61035f01a2c5%3A728731403&click_sum=c5bbe507&ref=stl_listing-2",
      "dateCreated": "2024-02-29T13:24:25.664503",
      "productId": "lyUkGtRRMA"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter / Small Indoor Planter / Cactus Plant Pot / Succulent Plant Pot",
      "description": "This handmade stoneware planter features hand-carved details in a vibrant red and pink combination. Its compact size makes it perfect for displaying small cacti or succulents, providing a stylish and functional home for your beloved greenery. Thoughtfully designed with a small drainage hole at the bottom, this planter ensures proper water drainage, promoting the health and longevity of your plants. Whether used indoors or outdoors, this charming planter adds a touch of artistic flair to any space.",
      "uniqueAttributes": {
        "Made to order": "This planter is made to order and will ship in 2-3 weeks, ensuring that each piece is crafted with care and attention to detail.",
        "Hand-carved details": "The planter features hand-carved details in a bright red and pink combo, adding a unique and artistic touch that sets it apart from generic planters.",
        "Perfect for small plants": "The small size of the planter makes it ideal for small cacti or succulents, providing a charming and functional home for these popular houseplants.",
        "Drainage hole": "The small hole in the bottom of the pot allows for proper water drainage, ensuring the health and longevity of your plants.",
        "Versatile use": "The planter can be used for both indoor and outdoor plants, offering versatility and adaptability to different environments."
      },
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who appreciate unique and handcrafted home décor",
          "useCase": "Displaying small cacti or succulents in a stylish and eye-catching planter that adds a touch of artistry to their home or workspace."
        },
        {
          "targetAudience": "Individuals seeking small and functional planters for their indoor or outdoor gardening needs",
          "useCase": "Growing small plants, such as herbs or flowers, in a convenient and attractive planter that complements their home décor and provides proper drainage."
        },
        {
          "targetAudience": "Home decorators looking for unique and artistic accents to enhance their living spaces",
          "useCase": "Incorporating the planter into their interior design scheme as a decorative piece, adding a pop of color and texture to shelves, windowsills, or tabletops."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=6c82fe82721e65ca169172bb56335ded416f729b%3A1435558019&click_sum=2a0ef4d1&ref=stl_listing-3",
      "dateCreated": "2024-02-29T13:24:40.832431",
      "productId": "AfUZaedfGX"
    }
  },
  {
    "data": {
      "product": "Engraved Working Compass with Custom Handwriting",
      "description": "The Engraved Working Compass with Custom Handwriting is a unique and personalized gift, made from top quality solid brass. It is durable for outdoor use and can be engraved with a custom handwriting, name, initials, text, symbol, or logo on the front, back, and inside. This makes it a versatile and meaningful gift for any occasion. With a fast turnaround time and express delivery options, the compass can be quickly personalized and delivered, ensuring timely gift-giving or personal use.",
      "uniqueAttributes": {
        "Personalized": "The compass can be engraved with a custom handwriting, name, initials, text, symbol, or logo, making it a truly unique and personalized gift.",
        "Durable materials": "Made from top quality solid brass, the compass is durable and built to last, unlike generic compasses that may use cheaper materials.",
        "Versatile engraving options": "The compass can be engraved on the front, back, and inside, providing ample space for customization and allowing for creative designs.",
        "Handwriting engraving": "The option to engrave handwriting adds a sentimental touch and makes the compass a cherished keepsake.",
        "Fast turnaround time": "With a turnaround time of 1 business day and express delivery options, the compass can be quickly personalized and delivered, ensuring timely gift-giving or personal use."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a unique and personalized gift for a special occasion, such as an anniversary or birthday",
          "useCase": "The compass can be engraved with a custom handwriting, name, initials, text, symbol, or logo, making it a meaningful and memorable keepsake."
        },
        {
          "targetAudience": "Outdoor enthusiasts and adventurers who value durability and functionality",
          "useCase": "Made from top quality solid brass, the compass is durable and built to last, ensuring reliable navigation during outdoor activities."
        },
        {
          "targetAudience": "Creative individuals who appreciate versatile customization options",
          "useCase": "The compass can be engraved on the front, back, and inside, providing ample space for creative designs and allowing for the expression of personal style."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/264013568/personalized-engraved-working-compass?click_key=0904e1d75e2a112e460a5760e8a7440a0138185a%3A264013568&click_sum=ad7b3241&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-1&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:25:00.800854",
      "productId": "OxTu1sX3eK"
    }
  },
  {
    "data": {
      "product": "Personalized Printed Wood Family Name Sign",
      "description": "This 16x20 sign is made from high-quality wooden plaque and features your family name printed in a sophisticated font. It is the perfect gift for new homeowners, newlyweds, or for those looking to commemorate a family name. The sign is easy to hang and versatile, making it suitable for a variety of rooms. Each sign is meticulously crafted with the utmost care and attention to detail, ensuring both its beauty and durability.",
      "uniqueAttributes": {
        "Personalized": "This sign is personalized with your family name and established date, making it a unique and meaningful piece of décor.",
        "High-quality materials": "The sign is made from high-quality wooden plaque, ensuring its durability and longevity.",
        "Versatile": "The sign is suitable for a variety of rooms including living rooms, dining rooms, family rooms and more, adding a touch of personalized style to any space.",
        "Handmade": "Each sign is meticulously crafted with the utmost care and attention to detail, ensuring both its beauty and durability.",
        "Easy to hang": "The sign includes a saw tooth hanger on the back for easy hanging, making it a breeze to display in your home."
      },
      "targetAudience": [
        {
          "targetAudience": "Newly homeowners",
          "useCase": "Enhance their new home's décor with a personalized and meaningful piece that celebrates their family name."
        },
        {
          "targetAudience": "Newlyweds",
          "useCase": "Commemorate their union and create a unique keepsake that symbolizes their new family."
        },
        {
          "targetAudience": "Individuals seeking to honor their family heritage",
          "useCase": "Preserve their family name and commemorate its history with a custom-made sign that can be passed down through generations."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385848388/personalized-printed-wood-family-name?click_key=0f155ee89234aea6eab6fd936a7ef8f729610e8b%3A385848388&click_sum=51ba4186&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-2&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:25:15.959127",
      "productId": "aqODxAMjcB"
    }
  },
  {
    "data": {
      "product": "Personalized Driftwood Sign with Latitude and Longitude Coordinates",
      "description": "This personalized coordinate sign is hand engraved on a unique piece of driftwood and is drilled and strung with durable twine for hanging. In addition to your custom coordinates, your personalized sign includes an engraved arrow compass. If you would prefer an alternate image, please specify.\n\nFORMAT OPTIONS\nDecimal Degree:  41.8781° N, 87.6297° W\nLat Long: 41.8781, -87.6297\nGPS: 41° 52' 41.21'' N, 87° 37' 47.27'' W\n\nIf you do not specify your format preference, we will engrave the Decimal Degree format.\n\n**PLEASE NOTE**:  If you have a preference for a certain size, shape or color of driftwood based on photos within our shop, please let us know and we'll do our best to use materials similar to your preferences. We are limited to the driftwood and sizes we have available and cannot guarantee availability of preferences. Also, please remember, part of what makes our artwork so special is that no two pieces of wood are the same, and so everything is one of a kind.\nA custom GPS coordinate sign is a unique gift and perfect for any home. Makes a great housewarming gift, wedding gift, Christmas gift, anniversary gift, or gift for the family with a cottage, lake house, shore house, cabin, or beach house.",
      "uniqueAttributes": {
        "Unique driftwood": "Each sign is hand-engraved on a unique piece of driftwood, giving it a natural and organic look that is not found in generic signs made from standard materials.",
        "Customizable coordinates": "The sign can be personalized with custom GPS coordinates, making it a meaningful and thoughtful gift for any occasion.",
        "Versatile design": "The sign is available in multiple size options and can be used for a variety of purposes, from home decor to wedding gifts and anniversary presents.",
        "Handmade craftsmanship": "The sign is handcrafted with care and precision, ensuring that each piece is of the highest quality and attention to detail.",
        "Unique aesthetic": "The combination of the driftwood and custom engraving creates a unique and eye-catching aesthetic that is sure to make a statement in any home."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a unique and personalized touch to their decor",
          "useCase": "Using the sign as a decorative piece to enhance the ambiance of their living space."
        },
        {
          "targetAudience": "Individuals seeking thoughtful and meaningful gifts for special occasions such as housewarmings, weddings, and anniversaries",
          "useCase": "Purchasing the sign as a personalized and memorable gift that reflects the recipient's special connection to a particular location."
        },
        {
          "targetAudience": "Couples or families with a shared love of travel and exploration",
          "useCase": "Using the sign to commemorate a special journey or mark the coordinates of a cherished destination, serving as a tangible reminder of their shared experiences."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/256801592/personalized-driftwood-sign-longitude?click_key=ed5b4458bbe4d2db5f21627f7d8605bc24aacc91%3A256801592&click_sum=286851fe&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-3&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:25:35.211586",
      "productId": "gdTPOsPcUK"
    }
  },
  {
    "data": {
      "product": "Large Piggy Bank, Black & White Piggy Bank, Ceramic Piggy Bank, Modern Piggy Bank, Personalized Piggy Bank, Christmas Gift, Desk Accessory",
      "description": "The Large Piggy Bank is a modern and stylish piggy bank that is perfect for saving money or using as a desk accessory. It is made out of double burned ceramic to ensure quality and durability, and it features a matte or glossy finish. The piggy bank is available in two sizes, the original size being 8\"x8\"x6\" and the mini size being 5\"x5\"x4\". It can be personalized with a name or message, making it a unique and meaningful gift.",
      "uniqueAttributes": {
        "Large size": "The piggy bank is available in two sizes, the original size being 8\"x8\"x6\" and the mini size being 5\"x5\"x4\". This is larger than most generic piggy banks, providing more space for savings.",
        "Modern design": "The piggy bank features a modern and minimalist design, with a round and chubby shape and a matte or glossy finish. This sets it apart from traditional piggy banks with more whimsical or decorative designs.",
        "Ceramic material": "The piggy bank is made out of double burned ceramic, ensuring quality and durability. This makes it more resistant to breakage and chipping compared to generic piggy banks made from cheaper materials.",
        "Personalized option": "The piggy bank can be personalized with a name or message, making it a unique and meaningful gift. This feature is not commonly found in generic piggy banks.",
        "Versatile use": "The piggy bank can be used not only as a savings tool but also as a desk accessory or decorative piece. This versatility makes it more functional than generic piggy banks that are solely designed for saving money."
      },
      "targetAudience": [
        {
          "targetAudience": "Parents of young children",
          "useCase": "A stylish and durable piggy bank to teach their children about saving money, while adding a modern touch to their child's room."
        },
        {
          "targetAudience": "Home decorators and design enthusiasts",
          "useCase": "A unique and eye-catching home decor piece that adds a touch of personality and functionality to any space."
        },
        {
          "targetAudience": "Professionals and students",
          "useCase": "A functional desk accessory that keeps their workspace organized and adds a touch of style, while also serving as a reminder to save money."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/512748060/large-piggy-bank-black-white-piggy-bank?click_key=45b429c1570f76883d531f60910d2be1386223f8%3A512748060&click_sum=22c2be1c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-4&pro=1",
      "dateCreated": "2024-02-29T13:25:49.218596",
      "productId": "ROgjfpZqhr"
    }
  },
  {
    "data": {
      "product": "Engraved Compass",
      "description": "This custom engraved compass is made from top quality solid brass, and durable for outdoor use.\n\nDiameter: 1.96 inch\nMaterial: Brass\nChain: Comes with the same chain as in the listing pictures\nCharacters Limit: 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side.\n\nEngraving: We can engrave whatever you want and we can use every font that you want.\n\nThis engraved compass is one of the perfect personalized gifts. We can engrave the front side, back side, and inside of the working compass with a photo, name, initials, text, your own handwriting text, symbol, or logo. It will be a good unique gift idea for husband, boyfriend, valentines, fathers day, birthday, groomsmen, and anniversary. Your own handwriting engraving on the compass looks very nice and unforgettable keepsake.",
      "uniqueAttributes": {
        "Personalized": "This compass can be engraved with a photo, name, initials, text, your own handwriting text, symbol, or logo, making it a unique and personal gift.",
        "Handwriting engraving": "The compass can be engraved with your own handwriting, creating a keepsake that is both meaningful and unforgettable.",
        "Durable materials": "The compass is made from top-quality solid brass, making it durable for outdoor use.",
        "Customizable": "The compass can be engraved with up to 140 characters on the top side, 140 characters on the inside, and 50 characters on the bottom side, allowing for a wide range of customization options.",
        "Unique gift idea": "The engraved compass is a one-of-a-kind gift that is perfect for any occasion, from anniversaries to birthdays."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a unique and personalized gift for a special occasion",
          "useCase": "Gifting the engraved compass as a meaningful keepsake for anniversaries, birthdays, or other important milestones."
        },
        {
          "targetAudience": "Outdoor enthusiasts and adventurers",
          "useCase": "Using the compass for navigation and orientation during hiking, camping, or other outdoor activities."
        },
        {
          "targetAudience": "Collectors of unique and handcrafted items",
          "useCase": "Adding the engraved compass to a collection of fine craftsmanship or as a display piece for appreciation and admiration."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/214526797/engraved-compass-personalized-gifts-for?click_key=d72a52ceab3decaaa5fb5164a9dc6da3f8841b61%3A214526797&click_sum=8c47a93f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-5&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:26:07.159819",
      "productId": "FgCNewIOfB"
    }
  },
  {
    "data": {
      "product": "Giant Wall Hanging Poppy Set of 3 Red Metal Flowers",
      "description": "These handcrafted wall flowers are made from welded plate steel, ensuring durability and a unique, artisanal touch. The set includes three poppies in varying sizes, with two smaller ones measuring 6 inches wide by 6 inches tall and a larger one measuring 12 inches tall and 12 inches wide. Each flower has a small hanger welded to the back for easy mounting using a simple wood screw or nail. The versatile design and customizable options allow for creative arrangements and a personalized touch to any outdoor space, making them perfect as wall or privacy fence accents.",
      "uniqueAttributes": {
        "Handcrafted": "These wall flowers are handcrafted from welded plate steel, ensuring durability and a unique, artisanal touch that sets them apart from mass-produced counterparts.",
        "Versatile design": "The flowers come in a set of three, with two smaller poppies measuring 6 inches wide by 6 inches tall and a larger poppy measuring 12 inches tall and 12 inches wide. This variety in size allows for creative arrangements and adds visual interest to any outdoor space.",
        "Customizable": "The artist offers the option to customize the design of the flowers, allowing customers to choose from a variety of flower shapes and request a set in their preferred style. This level of customization is not typically found in generic wall art.",
        "Outdoor durability": "The flowers are made from metal and are designed to withstand the elements, making them suitable for outdoor use as wall or privacy fence accents. This durability ensures longevity and resistance to fading or damage from sun exposure or moisture.",
        "Functional hanger": "Each flower has a small hanger welded to the back, making it easy to secure using a simple wood screw or nail. This functional feature eliminates the need for additional mounting hardware and allows for flexible placement."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners and gardeners with a desire to enhance the aesthetics of their outdoor spaces",
          "useCase": "Decorating walls or privacy fences with unique and eye-catching metal flowers, adding color and visual interest to patios, gardens, and other outdoor areas."
        },
        {
          "targetAudience": "Artists and designers seeking handmade and customizable wall art",
          "useCase": "Incorporating the flowers into indoor or outdoor art installations, creating a focal point or adding a touch of whimsy to living spaces, studios, or exhibition halls."
        },
        {
          "targetAudience": "Individuals seeking durable and weather-resistant outdoor decorations",
          "useCase": "Utilizing the metal flowers as accents on fences, sheds, or other outdoor structures, providing a long-lasting and vibrant addition to their property."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/523854497/giant-wall-hanging-poppy-set-of-3-red?click_key=a72ceed10513ab10499c1339cb25983666a08ada%3A523854497&click_sum=a9ea3e74&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-6&frs=1&etp=1",
      "dateCreated": "2024-02-29T13:26:29.553045",
      "productId": "vBrrb9GheB"
    }
  },
  {
    "data": {
      "product": "Wedding Marquee Lights",
      "description": "These modern and contemporary marquee letters are sure to make a statement at your special occasion!\n\nItem Details:\n-White LED Marquee Metal Marquees\n-Marquees stand 12\" tall\n-2 openings on the back of each letter so it can be hung up\n-Available in letters A-Z, numbers and the \"&\" sign\n-On/Off switch\n-Cordless\n-Requires 2 AA batteries (not included)\n-Indoor use only",
      "uniqueAttributes": {
        "Personalized": "These marquee letters can be customized to spell out names, words, or phrases, making them a unique and personal decoration for special occasions.",
        "Modern and contemporary design": "The marquee letters have a modern and contemporary design that sets them apart from traditional marquee lights. This makes them suitable for a range of decor styles, from classic to modern.",
        "Sturdy and durable": "The marquee letters are made of metal, making them sturdy and durable. This ensures that they can withstand use at events and parties without breaking or being damaged.",
        "Battery-operated": "The marquee letters are battery-operated, making them easy to place and use anywhere without the need for an electrical outlet. This adds to their versatility and convenience.",
        "Indoor use only": "The marquee letters are designed for indoor use only, making them ideal for parties, weddings, showers, and other indoor events. This ensures that they are protected from the elements and can be used safely in any indoor setting."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals planning special occasions such as weddings, bridal showers, baby showers, birthdays, and parties",
          "useCase": "Using the marquee letters to create personalized decorations that add a unique and stylish touch to their event."
        },
        {
          "targetAudience": "Home decorators and interior designers looking for modern and contemporary lighting solutions",
          "useCase": "Incorporating the marquee letters into their designs to create eye-catching and personalized lighting displays."
        },
        {
          "targetAudience": "Event planners and party organizers",
          "useCase": "Utilizing the marquee letters as versatile and convenient lighting options for a wide range of events and parties, both indoors and outdoors."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/536408395/wedding-marquee-lights-light-up-names?click_key=6d5b901fad6e742d16b200ac0eb8793697fda8a0%3A536408395&click_sum=24e98f90&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-7&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:26:55.082570",
      "productId": "bTaeyIOK9G"
    }
  },
  {
    "data": {
      "product": "Custom Christmas Ornament - House - Family - Housewarming Gift - First - New Home",
      "description": "This custom Christmas ornament is a unique and personal way to celebrate the holidays. It features a 3.2\" skeleton style key in your choice of color, a 1.75\" x 0.375\" aluminum rectangle tag hand-stamped with your wording of choice, a 7/8\" aluminum heart hand-stamped with your address, an antique silver tone house charm, a 050\" aluminum round hand-stamped with your choice of year, aluminum jump rings, rustic/red/green bakers twine, and a metal ornament hook.",
      "uniqueAttributes": {
        "Customizable": "The ornament can be customized with the recipient's name, address, and year of purchase.",
        "Hand-stamped": "Each letter and number on the ornament is hand-stamped, giving it a unique and personal touch.",
        "Durable materials": "The ornament is made of durable aluminum and bronze, ensuring it will last for many years."
      },
      "targetAudience": [
        {
          "targetAudience": "New homeowners who want to commemorate their first home",
          "useCase": "The ornament can be customized with the family's name, address, and year of purchase, making it a unique and personal keepsake."
        },
        {
          "targetAudience": "Parents or grandparents who want to give a meaningful gift to their children or grandchildren",
          "useCase": "The ornament can be customized with the recipient's name, address, and year of purchase, making it a thoughtful and cherished gift."
        },
        {
          "targetAudience": "People who are looking for a unique and personalized Christmas ornament",
          "useCase": "The ornament can be customized with any wording of choice, making it a one-of-a-kind decoration that can be treasured for years to come."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/491927411/home-sweet-home-custom-christmas?click_key=1d25c6c04961235fa42dd15366c9eb4110050291%3A491927411&click_sum=b7597848&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-8&pro=1&sts=1",
      "dateCreated": "2024-02-29T13:27:08.702158",
      "productId": "gEAmYcGbZA"
    }
  },
  {
    "data": {
      "product": "Outdoor Sign",
      "description": "**Personalized:** The sign can be personalized with any text or design, making it a unique and meaningful piece of decor.\n\n**Handcrafted:** Each sign is handcrafted to order using high-quality lumber, ensuring durability and attention to detail.\n\n**Natural materials:** The sign is made from natural pine wood, giving it a rustic and organic aesthetic.\n\n**Rustic edge:** The sign features a hand-cut rustic edge, adding a touch of charm and authenticity.\n\n**Weather resistance:** The sign is treated to be rot-resistant, making it suitable for outdoor use and ensuring longevity.",
      "uniqueAttributes": {
        "Personalized": "The sign can be personalized with any text or design, making it a unique and meaningful piece of decor.",
        "Handcrafted": "Each sign is handcrafted to order using high-quality lumber, ensuring durability and attention to detail.",
        "Natural materials": "The sign is made from natural pine wood, giving it a rustic and organic aesthetic.",
        "Rustic edge": "The sign features a hand-cut rustic edge, adding a touch of charm and authenticity.",
        "Weather resistance": "The sign is treated to be rot-resistant, making it suitable for outdoor use and ensuring longevity."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a rustic and personalized touch to their outdoor space.",
          "useCase": "Displaying the sign as a decorative accent on a porch, patio, or garden."
        },
        {
          "targetAudience": "Business owners seeking unique and eye-catching signage for their establishment.",
          "useCase": "Using the sign as a custom welcome sign, address plaque, or promotional display."
        },
        {
          "targetAudience": "Individuals searching for a meaningful gift for a cabin, lakehouse, or cottage owner.",
          "useCase": "Gifting the sign as a personalized and practical keepsake for a special occasion."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/520505868/outdoor-sign-rot-resistant-wooden-carved?click_key=52699ae507d952736db16f87137dcbde29cce67c%3A520505868&click_sum=79365ce1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-9&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:27:23.318909",
      "productId": "yeKTpAf5cy"
    }
  },
  {
    "data": {
      "product": "Magic Box",
      "description": "The Magic Box is a unique and customizable gift that allows users to project a personalized message on a wall. It is made from high-quality wood and features intricate laser-cut designs, making it a visually appealing and durable gift. The Magic Box is perfect for expressing love and affection towards loved ones and can be used in multiple scenarios, such as family events, anniversaries, and birthdays.",
      "uniqueAttributes": {
        "Personalized message": "The Magic Box allows users to customize the message projected on the wall, making it a unique and personal gift for special occasions.",
        "Customizable design": "The message can be customized to suit the recipient's preferences, creating a meaningful and memorable experience.",
        "Unique craftsmanship": "The Magic Box is made from high-quality wood and features intricate laser-cut designs, making it a visually appealing and durable gift.",
        "Emotional impact": "The product is designed to create a romantic and emotional ambiance, making it a perfect choice for expressing love and affection towards loved ones.",
        "Versatile functionality": "The Magic Box can be used in multiple scenarios, such as family events, anniversaries, and birthdays, making it a versatile gift that can be appreciated on various occasions."
      },
      "targetAudience": [
        {
          "targetAudience": "Couples looking for a unique and romantic way to express their love",
          "useCase": "The Magic Box can be used to project a special message on a wall, creating a romantic and intimate ambiance for couples."
        },
        {
          "targetAudience": "Individuals looking for a personalized gift for a special occasion",
          "useCase": "The Magic Box allows users to customize the message projected on the wall, making it a unique and memorable gift for birthdays, anniversaries, or other special occasions."
        },
        {
          "targetAudience": "People who value craftsmanship and appreciate unique handmade items",
          "useCase": "The Magic Box is made from high-quality wood and features intricate laser-cut designs, making it a visually appealing and durable gift that can be cherished for years to come."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251037170/girlfriend-gift-gift-for-her-unique-gift?click_key=9d28e69e34fd52a9d9f503cae28cad03959011fc%3A251037170&click_sum=d57dc4c5&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-10&pro=1&sts=1",
      "dateCreated": "2024-02-29T13:27:37.211652",
      "productId": "IxbGdUxSSV"
    }
  },
  {
    "data": {
      "product": "Custom Photo on Wood",
      "description": "- Printed directly onto round basswood with no margins or gaps\n- Rustic and natural look with the natural wood showing through the photo\n- Available in several size options\n- Optional gift wrapping\n- Clear protective coating for durability\n- Versatile for various occasions\n- Optional engraving options for personalization",
      "uniqueAttributes": {
        "Rustic and natural look": "The photo is printed directly onto round basswood, with no margins or gaps, giving it a rustic and natural look. The natural wood shows through the photo for a beautiful, worn effect.",
        "Customizable": "Customers can choose from several size options and add-on gift wrapping options to personalize their wood photo.",
        "Durable and protective": "A clear protective coating is applied over the wood photo to help protect against stains, water, and scratching, ensuring its longevity.",
        "Versatile": "Wood photos can be used for various occasions, including anniversaries, weddings, housewarmings, and more.",
        "Engraving options": "Customers can choose from a variety of premade and personalized designs to have engraved onto the back of their wood photo, making it a truly unique and special gift."
      },
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 5th wedding anniversary",
          "useCase": "A wood anniversary gift is a traditional and meaningful way to commemorate this milestone, and the rustic and natural look of the wood photo adds a touch of warmth and charm to the occasion."
        },
        {
          "targetAudience": "Individuals looking for a unique and personalized gift for a special occasion",
          "useCase": "The wood photo can be customized with a cherished photo and an engraved message, making it a thoughtful and heartfelt gift for birthdays, weddings, housewarmings, or any other special event."
        },
        {
          "targetAudience": "Homeowners and interior designers seeking rustic and natural home decor",
          "useCase": "The wood photo's rustic and natural look complements a variety of home decor styles, adding a touch of warmth and character to any room."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/207134258/5th-anniversary-gift-photo-on-wood?click_key=d31665fb07c3101a018f9dfbcc43f439a3ab1816%3A207134258&click_sum=23d0ed55&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-11&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:28:08.708403",
      "productId": "cjckmyULoS"
    }
  },
  {
    "data": {
      "product": "10th Anniversary Tin Rose",
      "description": "This solid cast tin rose is a stunning and meaningful gift for the 10th wedding anniversary. Made from pure tin, it is a lasting symbol of love and commitment. The rose is beautifully crafted and polished to a shine, and comes with a free 10th anniversary presentation tin. It is a heavy quality rose, not dipped or plated, and is sure to be treasured for years to come.",
      "uniqueAttributes": {
        "Solid Cast Tin": "This rose is made of solid cast tin, not dipped or plated, giving it a heavy, quality feel and ensuring its durability.",
        "Lasting Symbolism": "The rose is made from pure tin, which is traditionally given for the 10th wedding anniversary, making it a meaningful and lasting gift.",
        "Handmade Craftsmanship": "The rose is stunningly designed and crafted, and polished to a shine, showcasing the skill and attention to detail of the artisans who made it.",
        "Free Anniversary Presentation": "The rose comes with a free 10th anniversary presentation tin and a slip inside that explains the significance of tin for the 10th anniversary, adding to its sentimental value.",
        "Quality Assurance": "The rose includes a date of manufacture stamp and a tin purity stamp, ensuring its authenticity and quality."
      },
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their 10th wedding anniversary",
          "useCase": "As a meaningful and lasting gift that symbolizes their love and commitment."
        },
        {
          "targetAudience": "Individuals looking for a unique and thoughtful gift for a special occasion",
          "useCase": "To express appreciation, gratitude, or love to a partner, family member, or friend."
        },
        {
          "targetAudience": "Collectors of tin items or those interested in traditional wedding anniversary gifts",
          "useCase": "To add to their collection or as a cherished keepsake to commemorate a special milestone."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/251651487/10th-anniversary-tin-rose-solid-pure?click_key=72367db3e06d6722226f31dcd47231d365603266%3A251651487&click_sum=c815946c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-12&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:28:30.932102",
      "productId": "fOkSjBBsXB"
    }
  },
  {
    "data": {
      "product": "New Home Ornament",
      "description": "This custom ornament is a perfect way to commemorate your first holiday in your new home. Each ornament is made from a very lightweight metal and is hand-stamped with your house number and street name. You can choose from several ribbons or cord to complete your ornament. The ornament comes packaged in a white organza bag appropriate for gifting.",
      "uniqueAttributes": {
        "Customizable": "This ornament can be personalized with your house number and street name, making it a unique and meaningful keepsake for your first holiday in your new home.",
        "Hand-stamped": "Each ornament is hand-stamped to order, giving it a one-of-a-kind look and feel.",
        "Lightweight": "The ornament is made from a very lightweight metal, making it easy to hang on your tree or display in your home.",
        "Versatile": "The ornament can be used as a Christmas ornament, a housewarming gift, or a hostess gift, making it a versatile and thoughtful present.",
        "Packaged in a gift box": "The ornament comes packaged in a white organza bag appropriate for gifting, making it ready to give to someone special."
      },
      "targetAudience": [
        {
          "targetAudience": "First-time homebuyers",
          "useCase": "Commemorating their first holiday in their new home with a unique and personalized ornament."
        },
        {
          "targetAudience": "Homeowners who are looking for a thoughtful housewarming gift",
          "useCase": "Giving a gift that is both meaningful and decorative, and that can be treasured for years to come."
        },
        {
          "targetAudience": "Real estate agents who are looking for a unique and memorable closing gift",
          "useCase": "Providing their clients with a gift that celebrates their new home and helps them to create lasting memories."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/170071374/new-home-ornament-housewarming-gift?click_key=25e1790fc2dc54c94cbfcb999d5e07852172c1d6%3A170071374&click_sum=e53d6cf9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-13&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:28:46.187856",
      "productId": "SPXiwqgDHc"
    }
  },
  {
    "data": {
      "product": "Scratch Off Map Poster",
      "description": "The Scratch Off Map Poster is a detailed and up-to-date world map that allows users to scratch off the destinations they have visited, revealing a beautifully styled world map underneath. It is made of high-quality silk art paper with a gloss coating, giving it a luxurious and premium finish. The map is 33.11\" (w) x 23.39\" (h) inches or 22\" (w) x 17\" (h) inches in size and comes with free shipping.",
      "uniqueAttributes": {
        "Free shipping": "The product offers free shipping, which is a significant advantage over generic counterparts that may charge additional shipping fees.",
        "Nostalgic and personalized": "The scratch-off map allows users to document their travel memories and create a personalized map that reflects their unique travel story. This emotional and sentimental value sets it apart from generic maps.",
        "Detailed and up-to-date": "The map features detailed and up-to-date information, including cities, making it a more comprehensive and useful travel resource compared to generic maps.",
        "Glossy coating": "The map is printed on high-quality silk art paper with a gloss coating, giving it a luxurious and premium finish that enhances its visual appeal.",
        "Durable and long-lasting": "The scratch-off material is durable and long-lasting, ensuring that the map can be used and enjoyed for many years to come."
      },
      "targetAudience": [
        {
          "targetAudience": "Travel enthusiasts and adventurers",
          "useCase": "Documenting their travel experiences and creating a personalized map that reflects their unique travel story."
        },
        {
          "targetAudience": "Home decorators seeking unique and meaningful wall art",
          "useCase": "Adding a touch of wanderlust and nostalgia to their living spaces by displaying a map that showcases their past travels and inspires future adventures."
        },
        {
          "targetAudience": "Educators and geography enthusiasts",
          "useCase": "Teaching geography and world cultures to students in an engaging and interactive way, using the map as a visual aid to explore different countries and regions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/475931494/scratch-off-map-poster-most-detailed?click_key=85f0f7ae3c5705e5c7e713ba233e986bbd85f595%3A475931494&click_sum=cb225552&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-14&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:29:00.763500",
      "productId": "ErYojYbfHD"
    }
  },
  {
    "data": {
      "product": "Married to the Sea . giclee art print",
      "description": "This is a \"Giclée\" print of the original painting, made with archival pigment inks on heavy stock, environmentally friendly Hahnemühle Bamboo fine art paper. The matte paper nicely presents the brushstrokes and texture of my original paintings. All prints are signed with pencil in the border beneath the image unless you request otherwise. Sizes available: 5.5 x 7, 8 x 10, 11 x 14, 16 x 20, 22 x 28, 30 x 40, 40 x 50. Promotions: Free shipping with orders of $75 or more. Free 16x20 print with 30 and 40 inch prints.",
      "uniqueAttributes": {
        "Archival pigment inks": "This print is made with archival pigment inks, which are known for their longevity and resistance to fading over time.",
        "Heavy stock, environmentally friendly Hahnemühle Bamboo fine art paper": "The print is made on heavy stock, environmentally friendly Hahnemühle Bamboo fine art paper, which gives it a high-quality look and feel.",
        "Matte paper": "The matte paper nicely presents the brushstrokes and texture of the original paintings, giving the print a more artistic and authentic appearance.",
        "Signed by the artist": "All prints are signed with pencil in the border beneath the image unless you request otherwise, adding a personal touch from the artist.",
        "Free shipping with orders of $75 or more": "This offer provides an incentive for customers to purchase multiple prints or larger sizes, making it more cost-effective and convenient.",
        "Free 16x20 print with 30 and 40 inch prints": "This promotion encourages customers to purchase larger prints by offering a free 16x20 print, adding value to their order.",
        "Unframed": "The print comes unframed, giving customers the flexibility to choose a frame that matches their personal style and decor."
      },
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the print in their homes, offices, or galleries to appreciate its artistic value and enhance their living spaces."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the print into their design projects to create a unique and visually appealing atmosphere for their clients."
        },
        {
          "targetAudience": "Gift-givers looking for meaningful and thoughtful presents",
          "useCase": "Purchasing the print as a gift for loved ones who appreciate art, nature, or coastal themes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/83383628/married-to-the-sea-giclee-art-print?click_key=cbe3961131bbfbd459c789a6699c148345abae02%3A83383628&click_sum=fe7fddfa&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-15&frs=1&etp=1",
      "dateCreated": "2024-02-29T13:29:19.979691",
      "productId": "gNCdxGJbMn"
    }
  },
  {
    "data": {
      "product": "Home sweet home sign",
      "description": "This home sweet home sign is made from 100% wood, with a matte white background and lettering printed directly onto the wood. It is available in a variety of sizes, from 10\"x20\" to 20\"x48\". The sign is easy to hang, with saw-tooth hangers installed on the back. It is made in the USA and comes with a 100% satisfaction guarantee.",
      "uniqueAttributes": {
        "100% wood": "Both the frame and the background of the sign are made from 100% wood, giving it a natural and rustic look that sets it apart from generic signs made from cheaper materials.",
        "Direct printing": "The lettering is printed directly onto the wooden background, which ensures durability and a high-quality finish. This is in contrast to generic signs that may use stickers or other methods that can peel or fade over time.",
        "Matte white background": "The wood background is painted in matte white, which gives the sign a clean and modern look. The matte finish also helps to reduce glare and reflections, making it easier to read.",
        "Easy hanging": "Saw-tooth hangers are installed on the back of the sign for easy hanging. This eliminates the need for additional hardware and makes it simple to display the sign on any wall.",
        "Made in the USA": "The sign is made in the USA, which supports local businesses and ensures high quality standards.",
        "Exceptional customer service": "The seller offers exceptional customer service and is committed to ensuring customer satisfaction. This sets the sign apart from generic products that may not provide the same level of support."
      },
      "targetAudience": [
        {
          "targetAudience": "Families looking to add a personal touch to their home decor",
          "useCase": "Displaying the sign in a living room, hallway, or bedroom to create a warm and welcoming atmosphere."
        },
        {
          "targetAudience": "Individuals who appreciate rustic and farmhouse-inspired home decor",
          "useCase": "Incorporating the sign into a cozy and inviting living space, showcasing their love for nature and traditional aesthetics."
        },
        {
          "targetAudience": "Couples or individuals who want to commemorate a special occasion",
          "useCase": "Personalizing the sign with their family name or a meaningful date to create a cherished keepsake that celebrates their journey together."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/401089083/home-sweet-home-sign-wood-framed-sign?click_key=dd794daeede390154e3735a71f93c919a588b840%3A401089083&click_sum=1840db49&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-16&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:29:42.239668",
      "productId": "TgCUlBCyim"
    }
  },
  {
    "data": {
      "product": "Custom Engraved Wood Photo",
      "description": "Custom Engraved Wood Photo is a unique and stylish way to display your cherished memories. Made from real wood, each photo is printed directly onto the wood, creating a beautiful and rustic look. The wood photos are coated with a protective finish to help protect them from stains, water, and scratching, making them more durable than traditional photo prints. With a variety of sizes, wood types, and finishes to choose from, you can create a wood photo that perfectly matches your needs and preferences. Whether you're looking for a special gift or a unique way to decorate your home, a Custom Engraved Wood Photo is the perfect choice.",
      "uniqueAttributes": {
        "Customizable": "Customers can choose from a variety of sizes, wood types, and finishes to create a wood photo that perfectly matches their needs and preferences.",
        "Natural materials": "The wood photos are made from real wood, giving them a rustic and natural look that is not found in generic photo prints.",
        "Durable": "The wood photos are coated with a protective finish to help protect them from stains, water, and scratching, making them more durable than traditional photo prints.",
        "Versatile": "The wood photos can be used as wall art, table top displays, or even as gifts, making them a versatile and meaningful way to display cherished memories.",
        "Handmade": "The wood photos are handmade in Florida, U.S.A., ensuring that each one is unique and made with care."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a unique and rustic way to display cherished memories",
          "useCase": "Using the wood photos as wall art or table top displays to add a personal touch to their homes"
        },
        {
          "targetAudience": "Nature enthusiasts and lovers of the outdoors",
          "useCase": "Using the wood photos to showcase their favorite outdoor adventures and create a connection with nature in their homes"
        },
        {
          "targetAudience": "People looking for a meaningful and memorable gift",
          "useCase": "Gifting the wood photos to loved ones as a way to preserve special moments and create lasting memories"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/240735247/picture-on-wood-custom-photo-on-wood?click_key=75bebf17674e389147282e2737e5827558b62fa9%3A240735247&click_sum=4d06d514&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-17&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:29:59.080225",
      "productId": "CkbXNhVwsG"
    }
  },
  {
    "data": {
      "product": "Welcome Wood Door Sign",
      "description": "**Handmade, painted wood sign.**\n\n* Lettering is painted on (no vinyl or stickers).\n* Measures approximately 5\" x 16\" (can vary up to 1/2\").\n* Made with new solid wood.\n* Dark Walnut Stain Background\n* Lettering - White paint \n* Back is unsanded but stained, Stamped with our logo.\n* Poly Sealant added for extra protection\n* Recommended use under Covered Area/Porch.\n* Twine attached for easy hanging.",
      "uniqueAttributes": {
        "Handmade": "Handmade, painted wood sign. Lettering is painted on.(No vinyl or stickers on sign whatsoever)",
        "Customization": "Personalized with Last name",
        "Durability": "Made with new solid wood.",
        "Protective finish": "Poly Sealant added for extra protection",
        "Natural materials": "Wood is natural and unique with knots and cracks giving it a vintage worn look."
      },
      "targetAudience": [
        {
          "targetAudience": "Families looking to personalize their home",
          "useCase": "Welcome guests with a custom-made sign featuring their last name or a special phrase."
        },
        {
          "targetAudience": "Homeowners seeking unique outdoor decor",
          "useCase": "Add a touch of warmth and personality to their front door or porch with a handcrafted wooden sign."
        },
        {
          "targetAudience": "Individuals seeking thoughtful housewarming or wedding gifts",
          "useCase": "Present a meaningful and practical gift that celebrates a new home or a special occasion."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/399982215/welcome-sign-welcome-door-sign-front?click_key=aed145ba62d6ef37d15043d150b5397c65932bfa%3A399982215&click_sum=ecbf9090&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-18&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:30:13.125837",
      "productId": "lkVJqhigsm"
    }
  },
  {
    "data": {
      "product": "Latitude Longitude Sign",
      "description": "The latitude longitude sign is a custom-made, personalized piece of art that serves as a unique wedding or bridal shower gift. It features the coordinates of a special location, making it a meaningful keepsake for couples or individuals. Each sign is handcrafted from solid wood and professionally printed with state-of-the-art processes, ensuring durability and a high-quality finish. It comes in various sizes and finishes to match different home décor styles, and includes a hanger and felt pads for easy display and protection. The sign is also gift-ready, complete with tissue paper wrapping, a gift message card, envelope, and ribbon for a thoughtful presentation.",
      "uniqueAttributes": {
        "Customizable": "Each sign is personalized with your information, making it a truly unique and meaningful piece of art.",
        "Handmade": "Each sign is expertly handcrafted and fashioned from solid wood, giving it a unique and rustic charm.",
        "Professionally printed": "Letters are professionally & permanently printed (no stickers or stencils), ensuring durability and a high-quality finish.",
        "Versatile": "Available in different sizes and finishes (brown stained wood, grey stained wood, or white painted textured faux wood), making it suitable for various home décor styles.",
        "Gift-ready": "All signs include a hanger + felt pads on the back, making them easy to display and protect from scratches."
      },
      "targetAudience": [
        {
          "targetAudience": "Couples getting married or celebrating a bridal shower",
          "useCase": "A unique and meaningful wedding or bridal shower gift that serves as a personalized home decoration after the event."
        },
        {
          "targetAudience": "Homeowners looking for personalized home décor",
          "useCase": "A beautiful piece of art that reflects the coordinates of their home, adding a touch of sentimentality and uniqueness to their living space."
        },
        {
          "targetAudience": "Individuals seeking thoughtful and memorable gifts",
          "useCase": "A thoughtful and personalized gift that celebrates a special location or memory, such as a first home, honeymoon destination, or childhood neighborhood."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/498315936/latitude-longitude-sign-gps-sign?click_key=f455010c6c70f67ba7c7766aaef31d9050e1ba9c%3A498315936&click_sum=5210e9da&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-19&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:30:40.876901",
      "productId": "ZczSUfmwiq"
    }
  },
  {
    "data": {
      "product": "Family Gift Reclaimed Wood Custom Family Name Signs",
      "description": "Made from hand-picked, reclaimed wood with a touch of rustic charm. Top board measures approximately 15x5 inches and can be personalized with your chosen last name or couple's names, along with an established date. Smaller kids boards (7x3 inches) can be personalized with first names and birth dates. Hangers on the back for easy installation, twine included. Signs are 100% wood with knots and imperfections, adding to their unique beauty. Handcrafted with care in our shop",
      "uniqueAttributes": {
        "Rustic charm": "Made from reclaimed wood with knots and imperfections, adding to their unique beauty",
        "Personalized": "Can be personalized with your chosen last name, couple's names, and established date, along with first names and birth dates for kids boards",
        "Handcrafted": "Handcrafted with care in our shop",
        "Free shipping": "Free shipping on additional kids boards or pet boards",
        "Growing family options": "Additional kids boards or pet boards can be purchased to accommodate a growing family",
        "Versatile": "Can be used as a family name sign, a gift for parents, a gift for mom, a personalized Valentine's Day gift, or a grandparent version is available"
      },
      "targetAudience": [
        {
          "targetAudience": "Families looking for a personalized and meaningful home decor piece, particularly those who value rustic charm and craftsmanship",
          "useCase": "Displaying the sign in a prominent location in the home, such as above the fireplace or in the living room, to create a sense of warmth and belonging"
        },
        {
          "targetAudience": "Couples celebrating a special occasion, such as an anniversary or Valentine's Day, who want a unique and sentimental gift that symbolizes their love and commitment",
          "useCase": "Placing the sign in the bedroom or living room as a reminder of their special day and the journey they have shared together"
        },
        {
          "targetAudience": "Parents or grandparents who want a thoughtful and personalized gift for their children or grandchildren that will be cherished for years to come",
          "useCase": "Hanging the sign in the child's room or playroom, where it can serve as a constant reminder of the love and support of their family"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/493349587/family-gift-reclaimed-wood-custom-family?click_key=a2a7115e9ecc995ed3e946692b5629ddd63fbe0d%3A493349587&click_sum=9fdccfcd&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-20&frs=1&etp=1",
      "dateCreated": "2024-02-29T13:30:56.133973",
      "productId": "XIsAmjjycr"
    }
  },
  {
    "data": {
      "product": "Mountain Shelf",
      "description": "The Mountain Shelf is a geometric shelf inspired by nature, designed to display trinkets and items found outdoors. It is handmade from pine and can be finished in a stain of your choice. The shelf is approximately 21\" wide, 12.5\" at its highest peak, and 3.5\" deep. It is perfect for bringing a bit of the outdoors into your home and is an ideal gift for nature lovers. The shelf can be used in a variety of settings, from woodland-themed nurseries to summer cabins and unique home additions.",
      "uniqueAttributes": {
        "Inspired by nature": "The Mountain Shelf is inspired by the beauty of nature, bringing a bit of the outdoors into your home.",
        "Handmade": "Each shelf is built from pine and finished in the stain of your choice, ensuring that each piece is unique and made with care.",
        "Functional and decorative": "The shelf can be used to display trinkets and items found in nature, making it both functional and decorative.",
        "Perfect for nature lovers": "The Mountain Shelf is an ideal gift for nature lovers, adding a touch of adventure and travel to any room.",
        "Versatile": "The shelf can be used in a variety of settings, from woodland-themed nurseries to summer cabins and unique home additions."
      },
      "targetAudience": [
        {
          "targetAudience": "Nature lovers and adventure enthusiasts",
          "useCase": "Displaying travel souvenirs, trinkets, and items found in nature to evoke memories and inspire future explorations."
        },
        {
          "targetAudience": "Home decorators seeking unique and rustic accents",
          "useCase": "Adding a touch of the outdoors to their living spaces, creating a cozy and inviting atmosphere."
        },
        {
          "targetAudience": "Parents of young children",
          "useCase": "Decorating woodland-themed nurseries or playrooms, fostering a connection to nature and encouraging imaginative play."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/525919176/mountain-shelf-geometric-shelf-triangle?click_key=4a9c7796399074825f9ac5532eb379f72af44274%3A525919176&click_sum=841d77c1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-21&frs=1&etp=1",
      "dateCreated": "2024-02-29T13:31:10.447175",
      "productId": "nEeugJDulU"
    }
  },
  {
    "data": {
      "product": "Home Sweet Home Sign",
      "description": "This customizable wooden sign features the phrase \"Home Sweet Home\" and is available in a range of dimensions to suit various spaces. It is easy to hang thanks to its built-in system and comes with hanging instructions. The sign is crafted from high-quality wood, ensuring durability and longevity. Its versatile design complements a wide range of home decor styles, adding a touch of warmth and personalization to any living room, family room, or entryway.",
      "uniqueAttributes": {
        "Customizable": "Customers can choose from various dimensions, hanging options, and finishes to tailor the sign to their specific needs and preferences.",
        "Handmade": "Each sign is handmade with care, ensuring a unique and personal touch that adds character to any home.",
        "Durable materials": "The sign is constructed from high-quality wood, ensuring durability and longevity.",
        "Easy to hang": "The sign comes with a built-in hanging system and clear instructions, making it easy to display in any desired location.",
        "Versatile design": "The versatile design of the sign allows it to complement a wide range of home decor styles, from modern to rustic."
      },
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to add a personalized and welcoming touch to their living spaces.",
          "useCase": "Displaying the sign above a couch or in a prominent area of the living room to create a warm and inviting atmosphere."
        },
        {
          "targetAudience": "Individuals seeking a thoughtful and meaningful gift for family or friends who have recently moved into a new home.",
          "useCase": "Presenting the sign as a housewarming gift to express well wishes and create a lasting memory."
        },
        {
          "targetAudience": "Interior designers or home decorators looking for unique and stylish accents to complement their projects.",
          "useCase": "Incorporating the sign into home decor schemes to enhance the overall aesthetic and create a cohesive look."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/519055208/home-sweet-home-sign-above-couch-sign?click_key=e84133c1f62fe8fd59c1c670820d0b6dec895f3d%3A519055208&click_sum=5279f7d1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-22&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:31:26.582623",
      "productId": "oOBocmJubk"
    }
  },
  {
    "data": {
      "product": "Personalized Leather Tray",
      "description": "This personalized leather tray is a thoughtful gift for a third anniversary. It is made of durable leather and can be personalized with initials and a date. The tray is available in a variety of sizes and can be used for a variety of purposes, making it a functional and stylish addition to any home décor.",
      "uniqueAttributes": {
        "Personalized": "The tray can be personalized with initials and a date, making it a unique and thoughtful gift for a third anniversary.",
        "Durable material": "The tray is made of leather, a traditional and durable material that is known for its ability to withstand wear and tear.",
        "Functional and stylish": "The tray can be used for a variety of purposes, from holding keys and change to pens and pencils, and it can be a stylish addition to any home décor.",
        "Various sizes": "The tray is available in a variety of sizes to suit different needs and preferences.",
        "High-quality craftsmanship": "The tray is made with high-quality craftsmanship, ensuring that it will last for many years to come."
      },
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their third wedding anniversary",
          "useCase": "A personalized and thoughtful gift that can be used to hold keys, change, or other small items, and can be a stylish addition to any home décor."
        },
        {
          "targetAudience": "Individuals looking for a durable and functional tray",
          "useCase": "A high-quality tray made of leather that can withstand wear and tear, and can be used for a variety of purposes, from holding keys and change to pens and pencils."
        },
        {
          "targetAudience": "Homeowners and interior designers looking for stylish home décor",
          "useCase": "A stylish and functional tray that can be a unique addition to any home décor, and can be used to hold a variety of items, from keys and change to pens and pencils."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/385709588/third-anniversary-gift-for-him?click_key=e39202eef3dd3efa5b07f04ce22ab4575b65d95b%3A385709588&click_sum=250a5b9f&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-23&pro=1&frs=1",
      "dateCreated": "2024-02-29T13:31:41.353235",
      "productId": "IVmcCroMFn"
    }
  },
  {
    "data": {
      "product": "Extra Large Farmhouse Window Pane Mirror",
      "description": "This Super Extra Large Farmhouse Reclaimed Wood Window Pane Mirror is constructed with butt joints and features a combination of 2.5\" & 3.25\" wide molding on the outside, 1\" dividers and 12 --10\" Square Panes, this barnwood window pane mirror is the perfect addition to your rustic or farmhouse decor.  This reclaimed barnwood mirror is available in Natural Barnwood* (this is real aged/weathered wood and colors and textures vary, from browns to grays), Reclaimed Natural (reclaimed wood sanded and sealed to a light brown natural color) any of the painted wellworn color finishes as shown and includes frame, mirror, solid hardboard backing and wire/hangers for hanging the mirror.SHUTTERS SOLD SEPARATELY . Check them out at:https://www.etsy.com/listing/201635725NOW AVAILABLE in horizontal orientation with the handles on the long side (46 wide X 36 tall) or Vertical orientation (36 wide X 46 tall) with the handles on the shorter side.\nCompare similar products at $299+-Since we send these out with hanging wire installed and hook hardware included, this windowpane mirror is easy to hang.-Includes: mirror, pull handles (optional), card board backing and sawtooth picture hangers.-Choose between natural/unpainted wood for a more primitive decor or have it painted to give your decor a pop of color.* (If you would prefer a frame more gray or brown just add a note when checking out or send us an email). They will also have knots, nail holes, weathered cracks and other characteristics adding to its rustic beauty.*If you enjoy this product, check out our Etsy shop for more rustic barn wood decor.https://www.etsy.com/shop/ABWframes***SHARE THE LOVE...click on the pinterest \"pin it\" button just under the \"Add to Cart\" button***",
      "uniqueAttributes": {
        "Extra Large Size": "This mirror measures 46\"X36\", making it exceptionally large and a striking addition to any room.",
        "Reclaimed Wood": "The mirror is constructed from reclaimed barnwood, giving it a unique and rustic aesthetic that cannot be replicated by new wood.",
        "Combination of Moldings": "The mirror features a combination of 2.5\" & 3.25\" wide molding on the outside and 1\" dividers, creating a visually interesting and detailed frame.",
        "Choice of Natural or Painted Finish": "Customers can choose between a natural/unpainted wood finish for a more primitive decor or have it painted to give their decor a pop of color, allowing for customization to match any décor.",
        "Optional Pull Handles": "The mirror comes with optional pull handles, adding functionality and a touch of rustic charm. These handles are not typically found on generic mirrors.",
        "Easy to Hang": "The mirror comes with hanging wire installed and hook hardware included, making it easy to hang without the need for additional hardware or tools."
      },
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate rustic or farmhouse decor",
          "useCase": "Enhancing the aesthetic appeal of their living rooms, overmantles, or bedrooms with a unique and eye-catching statement piece."
        },
        {
          "targetAudience": "Homeowners looking to add a touch of warmth and character to their space",
          "useCase": "Creating a cozy and inviting atmosphere by incorporating the mirror's reclaimed wood texture and weathered finish."
        },
        {
          "targetAudience": "Interior designers seeking to incorporate unique and sustainable elements into their projects",
          "useCase": "Utilizing the mirror's combination of natural materials and high-quality craftsmanship to elevate the overall design and appeal of a space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/192707281/extra-large-farmhouse-window-pane-mirror?click_key=ccc7c59364b411307eb131b905d7ef0fa52aa7a6%3A192707281&click_sum=d12a04d9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-24&pro=1&frs=1&sts=1",
      "dateCreated": "2024-02-29T13:32:00.544941",
      "productId": "VOkaJWEHQw"
    }
  },
  {
    "data": {
      "product": "Library Card Pillows",
      "description": "These Library Card Pillows will have you waxing nostalgic for the days when the librarian would flip to the back of the book and hand stamp the due date. Each pillow is screen printed by hand on cotton canvas, ensuring a unique and artisanal touch. Both front and back look like a classic library checkout card. Pillows measure approximately 12\" x 16\", poly-fil insert with zipper closure along bottom.",
      "uniqueAttributes": {
        "Handmade": "Each pillow is screen printed by hand on cotton canvas, ensuring a unique and artisanal touch.",
        "Nostalgic design": "The pillows resemble classic library checkout cards, evoking a sense of nostalgia for traditional library experiences.",
        "Versatile use": "The pillows can be used for both decorative and functional purposes, adding a touch of literary flair to any space.",
        "Durable construction": "Made from cotton canvas and featuring a zipper closure, the pillows are built to last.",
        "Poly-fil insert": "The pillows come with a poly-fil insert, providing a comfortable and supportive feel."
      },
      "targetAudience": [
        {
          "targetAudience": "Book lovers and avid readers",
          "useCase": "Decorating their homes or reading nooks with a unique and nostalgic piece that celebrates their passion for reading."
        },
        {
          "targetAudience": "Librarians and library enthusiasts",
          "useCase": "Displaying the pillows in their libraries or homes as a tribute to their profession and love of books."
        },
        {
          "targetAudience": "Individuals seeking unique and literary-themed home décor",
          "useCase": "Adding a touch of literary charm and nostalgia to their living spaces, bedrooms, or offices."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/249386293/library-card-pillows-librarian-gift?click_key=b9797f48ad7a118ae12c46c095403f87965448f4%3A249386293&click_sum=bd57a2b6&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-25&etp=1",
      "dateCreated": "2024-02-29T13:32:23.482010",
      "productId": "OygyzhswUm"
    }
  },
  {
    "data": {
      "product": "Silkscreen Sleeping Cat Pillow",
      "description": "This one color silkscreen pillow is perfect for the cat lover in your life.\n\nPillow measures 16\"x7\"\n\nLooking to get a custom cat pillow? Check out our custom pet pillows here:\nhttps://www.etsy.com/listing/95995567/custom-silkscreen-pet-pillow\n\nMaterials: All pillows have been silkscreened with non-toxic water based acrylic paint. They are printed on muslin fabric and stuffed with 100% poly-fil.",
      "uniqueAttributes": {
        "Customizable": "You can get a custom cat pillow with your own cat's image on it. This makes it a truly unique and personal gift for any cat lover.",
        "Non-toxic materials": "The pillows are silkscreened with non-toxic water based acrylic paint and stuffed with 100% poly-fil, making them safe for even the most sensitive individuals.",
        "Durable": "The pillows are made from durable muslin fabric and are stuffed with 100% poly-fil, making them able to withstand even the most enthusiastic cuddles.",
        "Comfortable": "The pillows are soft and comfortable, making them perfect for snuggling up with on the couch or in bed."
      },
      "targetAudience": [
        {
          "targetAudience": "Cat lovers",
          "useCase": "The pillow can be used as a decorative item in their home or as a cuddly companion."
        },
        {
          "targetAudience": "People who have lost a cat",
          "useCase": "The pillow can provide comfort and companionship during a difficult time."
        },
        {
          "targetAudience": "Children who love cats",
          "useCase": "The pillow can be used as a toy or as a comforting object at bedtime."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/244235802/silkscreen-sleeping-cat-pillow?click_key=5de11d9e74ee0dbb20ca3e365d4128d12624fa1a%3A244235802&click_sum=12360200&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-26&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:32:35.429604",
      "productId": "FhTysC5GZy"
    }
  },
  {
    "data": {
      "product": "Metal Bookend",
      "description": "The metal bookend is a modern and stylish L-shaped holder that measures 5\" long on the bottom, 6\" tall, and 3.5\" wide. It is made from 16 gauge steel, which is approximately the thickness of a quarter coin, making it durable and sturdy. The metal is left untreated to maintain its natural finish, resulting in slight variations in coloration and markings, giving each piece its own unique characteristics. The bookend is designed and created by the shop-owner and her father, giving it a personal touch and supporting local artisanship. The shop also gives back 10% of its profit to partners with Jubilee Trading Co., which employs artisans in Morocco to create dignified jobs with fair wages. This social responsibility aspect sets it apart from generic bookends. The bookend is sold individually, allowing customers to purchase the exact quantity they need, unlike generic bookends that may come in fixed sets.",
      "uniqueAttributes": {
        "Durable": "The item is cut from 16 gauge steel, approximately the thickness of a quarter coin, making it durable and sturdy.",
        "Unique characteristics": "The metal is left untreated to maintain its natural finish, resulting in slight variations in coloration and markings, giving each piece its own unique characteristics.",
        "Local production": "The item is designed and created by the shop-owner and her father, giving it a personal touch and supporting local artisanship.",
        "Charitable contribution": "The shop gives back 10% of its profit to partners with Jubilee Trading Co., which employs artisans in Morocco to create dignified jobs with fair wages. This social responsibility aspect sets it apart from generic bookends.",
        "Customizable quantity": "The item is sold individually, allowing customers to purchase the exact quantity they need, unlike generic bookends that may come in fixed sets."
      },
      "targetAudience": [
        {
          "targetAudience": "Homemakers and interior enthusiasts seeking functional and stylish home décor",
          "useCase": "Organizing bookshelves, adding a touch of farmhouse charm to living rooms or home offices"
        },
        {
          "targetAudience": "Individuals seeking durable and visually appealing bookends for their personal libraries",
          "useCase": "Supporting heavy books, displaying prized collections, and adding a touch of industrial chic to reading nooks"
        },
        {
          "targetAudience": "Gift-givers searching for unique and thoughtful housewarming presents",
          "useCase": "Gifting a practical and stylish addition to a new home, demonstrating thoughtfulness and appreciation for the recipient's taste"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/listing/517695044/metal-bookend-home-office-bookend-simple?click_key=b991ec797e8f7c0af27965262b18e4cd8d3e9595%3A517695044&click_sum=78736773&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-699303-1-27&frs=1&etp=1&sts=1",
      "dateCreated": "2024-02-29T13:33:02.803988",
      "productId": "NxlctYgjBV"
    }
  }
]
