[
  {
    "data": {
      "product": "Pendant Ceramic Light Fixture",
      "description": "Handmade pendant ceramic light fixture with a hanging ceiling design. It features a printed decoration of green leaves and is suitable for use in living rooms, offices, and other spaces. The light fixture was designed by Noa Razer and is part of the Apilar collection, which is inspired by Spanish ceramics. The fixture is available in a variety of colors, including forest green, white, mint, burgundy, and orange. It measures 17.7 inches in height and 7.9 inches in diameter.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the lamp as a unique and decorative piece in their homes or art galleries."
        },
        {
          "targetAudience": "Interior designers and homeowners seeking unique lighting solutions",
          "useCase": "Incorporating the lamp into residential or commercial spaces to create a distinct and stylish ambiance."
        },
        {
          "targetAudience": "Individuals seeking handmade and sustainable home decor",
          "useCase": "Using the lamp to add a touch of artistry and craftsmanship to their living spaces while supporting local artisans."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=e8d950f3575e7464c59ce61d372d7a06ba4195a9%3A724851215&click_sum=991964c2&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:29:34.462630",
      "productId": "eBgpVcdSZz"
    }
  },
  {
    "data": {
      "product": "Pendant Ceramic Lamp, Hanging Lampshade, Handmade Design, Contemporary Artwork Creation, Unique Light Fixture Gift",
      "description": "This pendant ceramic lamp is a unique piece of contemporary artwork that is perfect for adding a touch of style to any room. It is handmade in Tel Aviv, Israel, and features a unique design that is inspired by Spanish ceramics. The lamp is made of high-quality ceramic and features a beautiful glaze finish. It is available in a variety of colors, so you can choose the perfect one to match your décor. The lamp comes with a hanging lampshade, so you can easily install it in your home. It is also a great gift for any occasion.\n\n**Measurements:**\n\n* Height: 5.9 inches\n* Diameter: 5.5 inches",
      "targetAudience": [
        {
          "targetAudience": "Interior designers, architects, and homeowners with a modern aesthetic.",
          "useCase": "Using the pendant ceramic lamp as a statement piece in living rooms, dining areas, or other central spaces to create a unique and contemporary atmosphere."
        },
        {
          "targetAudience": "Art collectors and enthusiasts interested in unique and handmade pieces.",
          "useCase": "Displaying the lamp as a collectible item or as part of an eclectic art collection to add a touch of creativity and cultural expression to their living spaces."
        },
        {
          "targetAudience": "Individuals seeking eco-friendly and sustainable lighting solutions.",
          "useCase": "Utilizing the ceramic lamp as a durable and energy-efficient light source that complements their eco-conscious lifestyle."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=29f6da8860044924d2ab0296c3e8e4d09491e7cd%3A654638870&click_sum=68951a9a&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:29:47.307590",
      "productId": "ZenEryHWMK"
    }
  },
  {
    "data": {
      "product": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture",
      "description": "Give your home a boost of warmth and a homely feel with a delicate natural terracotta lamp.\nMade by hand in a small boutique studio in Tel Aviv\nAll necessary fitting parts are included.\nTechnical:\nLamp holder: E27\nTransparent cable : 150 cm / 60 inches\nCeiling rose: 10 cm / 4 inches\nEnergy-saving LED light bulbs are recommended. We prefer the Edison Vintage style Bulb.\nVoltage 110V-250V | 25 to 40W max\nThis piece is part of the Apilar collection.\nThe Apilar collection (Stack in Spanish) began to take shape during a family roots trip to southern Spain, influenced by the Differentiated and unique Spanish ceramics. In this collection, there are nine different shapes, from which all structures of the collection are built. Countless of creation options are formed by stacking the shapes one on top of the other into a new complex with spectacular colors.\nPlease note that this object is handmade, and each piece is unique.\nThis object can be ordered in various colors and prints, talk to us for more info.",
      "targetAudience": [
        {
          "targetAudience": "Homemakers and interior design enthusiasts",
          "useCase": "Enhancing the ambiance and aesthetics of their living spaces by adding a touch of warmth and natural charm with the terracotta lamp."
        },
        {
          "targetAudience": "Individuals seeking sustainable and eco-friendly home decor",
          "useCase": "Incorporating the handmade, natural terracotta lamp into their living spaces to align with their values of sustainability and environmental consciousness."
        },
        {
          "targetAudience": "Collectors of unique and artisanal homeware",
          "useCase": "Adding the one-of-a-kind, handcrafted terracotta lamp to their collection of cherished and distinctive home decor pieces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=a20f3e45be89a11d1583bfae28fe0ece4b815ae3%3A776223242&click_sum=6d4dc964&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:30:05.626283",
      "productId": "lovroqskeB"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair from Mid Century, Mustard, Restored",
      "description": "Unique Armchair from 1960's, which has been professionally reupholstered throughout to a very high standard\nThe frame are in original condition and have been retouched. The chair is vintage and over 50 years old, but our work gave it a new look and freshness.\nWood has been sanded and secured with high quality oil to expose the beautiful wood grains.\nThe shape has been preserved in every detail as original.\nDimensions:\nWidth - 22.8 in, 58 cm\nHeight - 31.4 in, 80 cm\nDepth - 24.8 in, 63 cm\nSeat Width - 18.1 in, 46 cm\nSeat Height - 14.2 in, 36 cm",
      "targetAudience": [
        {
          "targetAudience": "Nostalgic individuals with a passion for mid-century design",
          "useCase": "Using the armchair as a statement piece in their living room or study, evoking a sense of vintage charm and history"
        },
        {
          "targetAudience": "Interior designers and collectors seeking unique and stylish pieces",
          "useCase": "Incorporating the armchair into their projects or collections, adding character and sophistication to spaces"
        },
        {
          "targetAudience": "Homeowners seeking comfortable and visually appealing furniture",
          "useCase": "Placing the armchair in their living room, bedroom, or home office, enjoying its comfort and adding a touch of elegance to their decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/712573399/vintage-armchair-from-mid-century?click_key=3c8b1287bffc912bfed8d1f2ae564fab0026818b%3A712573399&click_sum=e62ab1c0&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:30:16.973527",
      "productId": "F2MwHrFyVp"
    }
  },
  {
    "data": {
      "product": "Black and White cocktail chair from 1970's",
      "description": "Dimensions in cm\nH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ich\nH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in\n\nThe mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move.\nWe used high quality, black and white colored upholstery fabric for the refurbishment.\nOur manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.",
      "targetAudience": [
        {
          "targetAudience": "Mid-century modern enthusiasts",
          "useCase": "Using the chair as a statement piece in their living room or home office to evoke a retro-chic aesthetic."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporating the chair into their clients' homes to create a stylish and functional seating solution."
        },
        {
          "targetAudience": "Collectors of vintage furniture",
          "useCase": "Adding the chair to their collection of iconic mid-century modern pieces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/649720699/completely-restored-black-and-white?click_key=c5b31fa1f1cf1c531ec6f1ca843212ca0ab2c0c7%3A649720699&click_sum=d495f956&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:30:26.679893",
      "productId": "aEtTDoeHlw"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set",
      "description": "Our Mid century armchair is made from solid wood and upholstered with brown faux leather. ⚒ All furniture is handmade in our shop! Armchairs can be upholstered in another fabric or stained in another color, contact me for more info➤ **note for NON-EU buyers - please be aware of possible import fees and taxes, these are calculated additionally when the items are sent and these fees are collected by the delivery company and paid on your behalf to your government. The amount of these fees varies in every non-EU country.*** We are sending from Croatia which is a part of the EU - for EU buyers there are no additional fees *➤ Check out my shop for more Mid Century Vintage Furniture ➤https://www.etsy.com/shop/RetroDesignCRO Dimensions: • Overall height: 74 Centimeters / 29.6 inches • Overall width: 63 Centimeters / 25.2 inches • Overall depth: 70 Centimeters / 28 inches • Seat height: 40 Centimeters / 16 inches • Seat width: 50 Centimeters / 20 inches • Seat depth: 50 Centimeters / 20 inches Materials: • Stained Solid Beech Wood • Boucle teddy fabric • High quality furniture foam density 30 *simple assembly required instructions included",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking stylish and comfortable seating for their living rooms or other home spaces.",
          "useCase": "Adding a touch of mid-century modern design to their decor while providing a cozy spot to relax and entertain guests."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the armchair and ottoman set into their projects to create a unique and inviting atmosphere for clients."
        },
        {
          "targetAudience": "Vintage furniture enthusiasts",
          "useCase": "Adding the set to their collection of mid-century modern pieces or using it as a statement piece in their home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=1d3bb7ec649af46bf155dbd8bfd53e69697096a5%3A1110352719&click_sum=a8d6977d&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:30:38.235138",
      "productId": "UaLDZSMpoA"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion",
      "description": "This floor cushion is made of 100% polyester vegan suede fabric, which is soft, cozy, easy to clean, and durable. It has a wooden ring tie that is handmade by a wood turner. The cushion is 75X75 cm / 30X30 inch in size and 35 cm / 14 inch in height. It is filled with stiff foam and is spot cleanable with cold water and mild soap. It is recommended to vacuum the cushion once a week to keep it fresh and clean. Custom orders are available for walnut or black stained wooden rings.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators and interior designers seeking unique and stylish accent pieces",
          "useCase": "Adding a touch of elegance and unexpected whimsy to a space, such as a vanity or living room"
        },
        {
          "targetAudience": "Individuals looking for comfortable and functional seating options",
          "useCase": "Providing extra seating in a small space or creating a cozy reading nook"
        },
        {
          "targetAudience": "Vegans and individuals concerned with ethical consumption",
          "useCase": "Offering a stylish and sustainable alternative to traditional leather or wool poufs"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=9435afe93b99d6620ded8489deb8c67d305d1615%3A903050205&click_sum=511eb3e5&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:30:48.177364",
      "productId": "X3HWQPrUgE"
    }
  },
  {
    "data": {
      "product": "Floor Pillow | Meditation Cushion | Floor Cushion | Floor Pouf | Floor Seating | Round Floor Pillow | Square Floor Pillow | Teal Home Decor",
      "description": "Get ready to get comfy with the new floor pillows! Imagine moving dinner parties to the floor, lounging in a reading nook, or creating a magical, comfortable playroom. With the new floor pillows those dreams are now realities!\n\nThe original print for this floor pillow was created in a design studio in Maine & the floor pillow is made to order thanks to the help of a fabulous sewing partner.\n\nTwo different shapes-the circle and the square-plus two different sizes... All those choices equals soft, comfy, and oh-so-pretty floor pillows that are great on their own, or stacked for even more comfort. Let's be honest-chairs are so last year.\n\nPLEASE NOTE\n\nThe pillows have a small \"X\" stitch detail in the center of the pillow... tacking the front & back together. This stitch detail helps secure the pillow filling so it doesn't shift around over time... keeping your pillow plump and comfy sit after sit after sit :)\n\nPRODUCT DIMENSIONS\n(Please note there is a 1\"-2\" tolerance on all printed textile products)\n\n23\" Round : 23\" x 7\" Tall\n26\" Round : 26\" x 7\" Tall\n23\" Square : 23\" x 23\" x 7\" Tall\n26\" Square : 26\" x 26\" x 7\" Tall\n\nPRODUCT DETAILS\n\n100% woven polyester printed fabric\nSewn closed with premium poly fill\n\nCARE INSTRUCTIONS\n\nSpot clean only\n\nPRODUCTION\n\nPlease allow up to 5 - 10 business days for production of your custom made item.\n\nPLEASE NOTE\n\nI am currently unable to deliver to PO Boxes. Please provide a physical mailing address with your order. Thanks!\n\nRETURN POLICY FOR THIS PRODUCT\n\nYour floor pillow is custom made just for you and as a result I am unable to offer returns/exchanges unless your item arrives damaged or defective.",
      "targetAudience": [
        {
          "targetAudience": "Families with young children",
          "useCase": "The floor pillows can create a comfortable and inviting play area for children, providing a soft and safe surface for them to play and relax on."
        },
        {
          "targetAudience": "Individuals who enjoy entertaining",
          "useCase": "The floor pillows can be used to create a cozy and welcoming seating area for guests, allowing them to relax and enjoy each other's company in a comfortable and informal setting."
        },
        {
          "targetAudience": "Individuals who value comfort and style",
          "useCase": "The floor pillows can add a touch of style and comfort to any room, providing a comfortable and stylish seating option that can be used for a variety of purposes, such as reading, watching TV, or simply relaxing."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=ace767681c81a9b0823f6106c91ad8dc0598b77b%3A904960951&click_sum=cb1cb2aa&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:31:04.780582",
      "productId": "GaRSmDPmoE"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool",
      "description": "This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.",
      "targetAudience": [
        {
          "targetAudience": "Parents of young children",
          "useCase": "Provides a cozy and comfortable seating option for children to play, read, or rest."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Adds a stylish and functional accent piece to nurseries, children's rooms, or play areas."
        },
        {
          "targetAudience": "Individuals seeking sustainable and durable home decor",
          "useCase": "Constructed from durable cotton cord and can be easily maintained by removing the knitted cover for washing."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=8404afd2483f5f2eebf83b627975eba358957490%3A266515154&click_sum=3eeb33f5&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:31:13.152754",
      "productId": "weRAFgqsRw"
    }
  },
  {
    "data": {
      "product": "Stroke / Brushstroke Illustrated Parian Porcelain Vase",
      "description": "The Stroke Long Vase is a declaration of a love of pattern and bold design. Perfect as a stand out piece for a mantlepiece, sideboard, or as a center piece for your dining table. Ideal for holding bundles of your favorite blooms and leafy bouquets, the Stroke Long Vase will be sure to make an impact with or without foliage. \n\nSlipcast in Parian porcelain, the Big Pot is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay, which is marble smooth and delicately translucent. Each piece is polished by hand to create objects with a silky smooth finish which are a joy to hold and interact with. \n\nFrom start to finish, every piece is handmade and individually illustrated, meaning no two will ever be exactly the same. Each piece is imperfectly unique, with subtle differences worth celebrating.\n\nMaterial: Parian porcelain\nFinish: Matte outside, glossy inside\nSize: 21.5cm x 9cm (ø)",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts who appreciate unique and visually striking home décor",
          "useCase": "Displaying the vase as a statement piece on a mantlepiece or sideboard, showcasing its bold brushstroke design and semi-translucent material"
        },
        {
          "targetAudience": "Interior designers and home stylists seeking to add a touch of sophistication and individuality to their projects",
          "useCase": "Incorporating the vase into a curated interior design scheme, complementing other decorative elements and creating a cohesive and stylish ambiance"
        },
        {
          "targetAudience": "Individuals seeking functional and aesthetically pleasing tableware for special occasions or everyday use",
          "useCase": "Using the vase as a centerpiece on a dining table, holding arrangements of fresh flowers or greenery and enhancing the ambiance of gatherings"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=6139e75747e462cf794becc15163216d9209e37d%3A811521978&click_sum=9c8db571&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:31:23.042699",
      "productId": "KWdRTDYsHS"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "This hand-built small amphora vase features a black and white triangle pattern. It is made of speckled stoneware clay, handpainted with black underglaze, and dipped in glossy white. Fired to cone 8 (1250C) in an electric kiln, the base is left unglazed and impressed with the maker's mark.\n\nDIMENSIONS & MATERIALS:\n~ speckled stoneware clay \n~ non toxic glossy white glaze\n~ app. 13.5cm high and 9cm wide (5.3\" x 3.5\")\n\nDishwasher safe.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking to add a unique and stylish touch to their living space",
          "useCase": "Displaying the vase as a decorative piece on a shelf, mantel, or table"
        },
        {
          "targetAudience": "Florists or plant enthusiasts seeking a small and elegant vase for floral arrangements or small plants",
          "useCase": "Using the vase to hold a bouquet of flowers or a small plant, adding a touch of natural beauty to a room"
        },
        {
          "targetAudience": "Collectors of handmade ceramics or ancient Greek-inspired art",
          "useCase": "Adding the vase to their collection, appreciating its craftsmanship and historical inspiration"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=fc56957f9f9a6b9b4682e8ccefface2f70dd7ed1%3A986518800&click_sum=e9e548bd&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:31:33.701696",
      "productId": "QqnqhOlKQE"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase, Hand Painted, Black and White, Home Decor Art, Unique Gifts",
      "description": "- Hand painted burlap vase in black, cream, and gold in an abstract mosaic design.\n- Handcrafted with jute, burlap fabric, and glass bottle.\n- Dimensions - 5\" tall; base 5.5\" wide.\n- Beautiful addition to your home or office decor.\n- Indoor use only.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators with a taste for eclectic and unique decor.",
          "useCase": "Adding a touch of artistic flair to their living room, bedroom, or office with a hand-painted burlap vase that combines earthy textures with a modern mosaic design."
        },
        {
          "targetAudience": "Art collectors looking for one-of-a-kind pieces.",
          "useCase": "Displaying the vase as a functional art object, appreciating its intricate craftsmanship and unique aesthetic."
        },
        {
          "targetAudience": "Gift-givers searching for thoughtful and memorable presents.",
          "useCase": "Choosing the vase as a special gift for friends, family, or colleagues who value handmade items and appreciate home decor with a touch of artistry."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=ec2db49f5e91c6658f23a654932d737ae2da260c%3A908084516&click_sum=9adac0a8&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:31:49.131457",
      "productId": "QDoAnXGQdh"
    }
  },
  {
    "data": {
      "product": "Cushion covers",
      "description": "These cushion covers are digitally designed with an exclusive pattern and printed in the South of France. They are then handcrafted in a workshop and produced in a limited edition series.\n\nThe covers are made with a water-repellent and UV-resistant fabric on the front and a heavy duty 100% cotton twill on the back. The print quality is slightly textured and the covers are fully overlocked on the reverse.\n\nThe cushion covers can be washed at 30°C and should be dried naturally. Do not wring the covers and iron them at a low temperature.\n\nShipments are sent by post with tracking.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking unique and stylish home décor",
          "useCase": "Enhancing the aesthetic appeal of their living spaces by adding a touch of exclusivity and originality"
        },
        {
          "targetAudience": "Homeowners and interior designers with a preference for handmade and ethically crafted products",
          "useCase": "Supporting sustainable practices and adding a personal touch to their homes"
        },
        {
          "targetAudience": "People who value durability and functionality in their home décor",
          "useCase": "Protecting their cushions from spills, stains, and UV damage while adding a decorative element"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=bfc12b64e7f792985c5dce93adb9029eb02cb148%3A1206357075&click_sum=a191fb9c&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:32:07.567504",
      "productId": "Ry7DRAMIzW"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "This is a colorful pillow cover made from 100% hand-loomed cotton. The pillow is 19\" x 19\" and has a hidden zipper at the bottom. It is very soft to the touch and is made by an indigenous family in Ecuador. The colorful stripes are woven on an antique loom and take weeks to make. The pattern is inspired by the traditional clothing worn by the women and girls of this community. When you see this pillow in your home, imagine the women and girls who wear this cloth as a skirt, and remember that we are all connected to each other in a sisterhood of love and empowerment.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking to brighten up their living spaces and add a touch of color and cheer to their homes.",
          "useCase": "Displaying the pillow as a decorative accent on sofas, beds, or chairs to create a vibrant and welcoming atmosphere."
        },
        {
          "targetAudience": "People who value unique and ethically sourced home décor.",
          "useCase": "Using the pillow as a conversation piece that reflects their appreciation for traditional craftsmanship and the empowerment of indigenous communities."
        },
        {
          "targetAudience": "Individuals who seek comfort and softness in their everyday lives.",
          "useCase": "Placing the pillow on a bed or sofa for a cozy and inviting touch, providing a relaxing and comfortable experience."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/566822148/color-therapy-pillowcolorful?click_key=a252dd4962fe140754267de9799abb7333578c78%3A566822148&click_sum=853cd7b0&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:32:18.178798",
      "productId": "NVMUmhSvtH"
    }
  },
  {
    "data": {
      "product": "Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.\n100% cotton with zipper closing\n16\" square\nDesigned in Canada • Made in India\nPillow form not included.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate modern and mid-century design aesthetics.",
          "useCase": "Using the pillow as a decorative accent piece to enhance the style and comfort of their living spaces."
        },
        {
          "targetAudience": "Individuals looking for a unique and artistic gift for friends or family members.",
          "useCase": "Gifting the pillow as a thoughtful and visually appealing present that reflects their appreciation for contemporary art and design."
        },
        {
          "targetAudience": "Homeowners seeking to add a touch of color and vibrancy to their interiors.",
          "useCase": "Incorporating the pillow into their home décor to create a lively and inviting atmosphere, particularly in living rooms or bedrooms."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=f6fa54914ce2a267b976bdca39d580019cadcff0%3A1168874671&click_sum=e53672d3&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:32:38.556243",
      "productId": "ECAmrDgJWu"
    }
  },
  {
    "data": {
      "product": "Address Sign, Modern House Numbers, House Number Sign, Personalized Address Sign",
      "description": "**Wood Address Sign**\n- Note in the personalization area your address. If your address is not obvious with only numbers and a street name please specify which goes on the top of the graphic bar and which goes on the bottom.\n**FINISHES**\n- These will come painted with black exterior grade paint if ordering painted unless otherwise specified (See our color chart). Unpainted comes sanded and ready to be finished at home. Keep in mind these are still wood and being under a covered area is still advised to preserve and protect the wood.\n**MEASUREMENTS**\n- The sign is 14.5\" wide and the height will vary depending on the length of the address.\n**MATERIAL**\n- We use a high-quality cabinet grade 1/4\" thick baltic birch wood.\n**HANGING**\n- These come with two drill holes in the graphic bar. Be careful not to drill too far and crack the wood when installing.\n**FINISH OPTIONS**\n- If you order painted and do not note a color in the personalization area, your cutout will automatically be painted black.\n- Unfinished means your order comes sanded and ready to be painted or stained at home.\n**Shipping to AK and HI may incur additional shipping charges, please reach out before ordering if you would like to get the cost.**",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to improve the curb appeal of their property.",
          "useCase": "Displaying the house number in a stylish and modern way."
        },
        {
          "targetAudience": "People who live in areas with difficult-to-see house numbers.",
          "useCase": "Making their house number more visible to visitors and emergency responders."
        },
        {
          "targetAudience": "Individuals who are looking for a unique and personalized way to display their address.",
          "useCase": "Creating a custom address sign that reflects their personal style."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/790049531/address-sign-modern-house-numbers-house?click_key=e5152cb0468b7ecd159695725d3bad845c96d6a7%3A790049531&click_sum=fea5fd98&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:32:49.713267",
      "productId": "DjOOXbsDyd"
    }
  },
  {
    "data": {
      "product": "Round Address Sign, Geometric Address Sign, Round House Numbers, Modern Address Plaque, Custom Address Sign, House Number Plaque",
      "description": "Geometric carved design with acrylic house numbers, perfect modern piece for your home address sign. Great housewarming gifts, realtor closing gifts, or to spruce up your front porch or door decor.\n\nTo order: \n- Choose your size\n- Note your text color\n- Note your background paint or stain color choice in the personalization area.\n\nComes with a sawtooth hanger to hang.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to upgrade their address sign with a stylish and modern option",
          "useCase": "To display their house number prominently and enhance the aesthetic appeal of their home's exterior"
        },
        {
          "targetAudience": "Realtors seeking unique and thoughtful closing gifts for their clients",
          "useCase": "To provide a personalized and practical present that will be cherished by new homeowners"
        },
        {
          "targetAudience": "Individuals seeking decorative accents for their front porch or door",
          "useCase": "To add a touch of modern design and personalization to their outdoor space"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1439690652/round-address-sign-geometric-address?click_key=e2c7e9246b2b0ad15099d291426b648b2f195a1b%3A1439690652&click_sum=e307a39c&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:33:07.229417",
      "productId": "mpGMuvizsd"
    }
  },
  {
    "data": {
      "product": "Modern Herringbone House Number Sign",
      "description": "This modern house number sign is perfect for adding a touch of style to your home exterior. The backer is made out of wood and the numbers are acrylic, and the wood is sealed with an exterior grade sealer to help preserve its life. The backer can be any stain or paint color shown on the color charts, and the text can only be black or white. The numbers will be made to fit the sign regardless of how many numbers you order, and the sign comes with either a sawtooth hanger on the back or a d-ring for hanging.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to upgrade the exterior of their modern home.",
          "useCase": "The modern design and durable materials make this address sign a stylish and practical addition to any modern home. It can enhance the curb appeal and provide clear visibility for visitors and delivery services."
        },
        {
          "targetAudience": "Real estate agents or home stagers seeking a thoughtful closing gift or housewarming present.",
          "useCase": "The personalized nature of the address sign and its high-quality craftsmanship make it an ideal gift for new homeowners or those looking to add a touch of sophistication to their homes. It can serve as a lasting reminder of the real estate transaction and create a welcoming atmosphere for guests."
        },
        {
          "targetAudience": "Individuals or businesses looking for a unique and eye-catching way to display their address or business name.",
          "useCase": "The customizable design and durable construction of the address sign make it suitable for a variety of applications. It can be used to create a distinctive visual statement for homes, offices, shops, or other commercial establishments."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1453867189/herringbone-address-sign-modern-house?click_key=42837fe32ba489b314764b3f974779b31603037d%3A1453867189&click_sum=6c71488a&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:33:18.088498",
      "productId": "XxDKSfYwnX"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath",
      "description": "This faux olive wreath is made on a rustic grapevine base with artificial olives and leaves. It is perfect for adding a touch of rustic charm to your home décor. The wreath is available in three sizes: 18\", 22\", and 28\" (tip to tip). It is suitable for both indoor and outdoor use, but a covered or sheltered area is recommended. Direct sunlight and rain will fade the wreath over time. Please note that the grapevine wreath is natural, so all the grapevines are different.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators with a rustic aesthetic",
          "useCase": "Adding a touch of rustic charm and greenery to their living spaces"
        },
        {
          "targetAudience": "Homeowners looking for unique and handmade home decor",
          "useCase": "Personalizing their homes with a one-of-a-kind wreath"
        },
        {
          "targetAudience": "Individuals seeking a thoughtful and unique gift for friends or family",
          "useCase": "Expressing their love and appreciation with a beautiful and practical gift"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=e43336b32cd1dc1d2a922a44fe9588eea079d7b2%3A630678328&click_sum=c083685c&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:33:26.713348",
      "productId": "QGvOwZV9TF"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender Dreams\" wreath is beautiful for all seasons.The pale faux lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath.The natural or darker stained wooden hoop has a modern farmhouse vibe....OR choose a gold metal hoop.This high quality faux lavender looks so realistic with the pretty beautiful artificial silver greenery.This beauty can be hung at any angle. I include twine, that you can choose to use or not...Give this wreath to Mom, and make her Mother's day.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who value rustic and natural aesthetics",
          "useCase": "Adding a touch of farmhouse charm to their front door or interior decor"
        },
        {
          "targetAudience": "Individuals seeking a unique and eye-catching wreath for special occasions",
          "useCase": "Creating a welcoming and festive atmosphere for gatherings or celebrations"
        },
        {
          "targetAudience": "Nature enthusiasts who appreciate the beauty of plants",
          "useCase": "Bringing the outdoors indoors and enjoying the calming and refreshing effects of greenery"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=1789ed78e9695b61514b95b508a849c00fe8c007%3A962426777&click_sum=349bf9e1&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:33:37.057270",
      "productId": "cfyedWuvnc"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath",
      "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\"\nCan be enjoyed inside or outside year round for curb appeal!",
      "targetAudience": [
        {
          "targetAudience": "Homeowners or renters looking to enhance their home's curb appeal with a stylish and natural-looking wreath.",
          "useCase": "Year-round decoration for the front door to create a welcoming and inviting atmosphere."
        },
        {
          "targetAudience": "Interior decorators or home enthusiasts interested in adding rustic charm and greenery to their living spaces.",
          "useCase": "Indoor decoration above a fireplace, on a wall, or in a dining area to bring a touch of nature indoors."
        },
        {
          "targetAudience": "Individuals seeking gifts for housewarmings, weddings, or other special occasions.",
          "useCase": "Thoughtful and unique present that combines natural elements and artisanal craftsmanship."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1223343994/farmhouse-wreath-for-front-door?click_key=6fd6c2e5fa8892af1e1a085e5f3ee1bfb9eb0c70%3A1223343994&click_sum=3282ef57&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:33:44.092321",
      "productId": "jlpBJZRXbO"
    }
  },
  {
    "data": {
      "product": "Last Name Doormat",
      "description": "Our high-quality doormats are made from all-natural coir fibers, making them eco-friendly. They feature a vinyl back for durability and sturdiness.\n\nCARE INSTRUCTIONS\nWe recommend that coir doormats be used in a covered area to be sheltered from the elements. When coir doormats get wet and cannot dry properly, the fibers can soak up the water. The water then pushes the natural coconut oil to the surface of the fibers giving it a darker and stained appearance. This can also deteriorate the design causing it to fade quickly.\nShedding is expected in the beginning while loose fibers from manufacturing are knocked out. Giving your mat a gentle shake can speed the process up. Sweeping or vacuuming can also help.\nAll rugs are unique. Some may be darker or lighter than the photo or have variances of color in the mat. Since coir doormats are made from the husks of coconuts, some fibers may be thicker or thinner than others. There may also be chunks of husks in the fibers.\nAll mats are hand cut, so please allow for a 1 inch +/- variance in length. If you are needing an exact measurement, please reach out to us so we can verify that we can provide one that fits your needs.\nDoormats are .5 to .75 inches thick.\n\nCUSTOM DESIGN OR PERSONALIZATION ADD-ON\nThis listing is for the design featured in the photos. However, we love to create custom designs. Follow the link below for our custom design listing. If you want this design but want to add to it, such as pawprints, family names, hearts, etc., you can purchase our personalization add-on listing, which is also linked below. Please note that we DO NOT offer proofs for pre-designed items unless specifically requested. All custom orders will get a proof, including orders with personalization add-ons. No proofs will be provided until after purchase.\nPERSONALIZATION ADD-ON: https://bit.ly/PersonalizedAddOn\nCUSTOM DESIGN LISTING: https://bit.ly/CustomDesignDoormat\nIf you have questions regarding proofs, personalizations, or custom options, please feel free to send us a message. We would be glad to answer them for you.\n\nBLEMISHED OPTION\nSometimes we get mats with dark spots or other stains and blemishes beyond the natural ones mentioned above. However, they do not inhibit the actual function of the doormat. As a company, we try to be mindful of our waste and genuinely hate the thought of throwing them in a landfill; therefore, we choose to offer them at cost. Please note that we do not provide photos of our blemished doormats because our items are made to order, and we cannot guarantee which one you will receive.\nWe usually have at least a few blemished items in stock. If you are interested in purchasing the blemished option, please let us know, and we will be glad to add one if available to the listing inventory. There is a limit of 1 per customer per purchase. By buying a blemished mat, you agree to its flaws, and all sales are final.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a stylish and personalized way to welcome guests",
          "useCase": "Placing the doormat outside their front door to create a warm and inviting entryway"
        },
        {
          "targetAudience": "Couples getting married or celebrating a housewarming",
          "useCase": "Using the doormat as a unique and memorable gift to commemorate their special occasion"
        },
        {
          "targetAudience": "Individuals who value eco-friendly products",
          "useCase": "Choosing the doormat because it is made from natural coir fibers and features a vinyl back for durability"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1168985443/last-name-doormat-housewarming-gift?click_key=8c2231bc66a91438e8d81b66f49ddbae88ffa6d9%3A1168985443&click_sum=2cd40184&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T14:34:09.591644",
      "productId": "weKXNUDVIl"
    }
  },
  {
    "data": {
      "product": "Hand painted pizza doormat, Coir welcome mat, Housewarming gift, Wedding gift, Custom door mat, Cute doormat, Bridesmaid gift",
      "description": "This hand painted pizza doormat is made from a durable back and a natural coir front that's perfect for the outdoors or inside.  The doormat measures 18\" x 30\" and is made from natural coir (coconut husk) front and paint. \n\nTo care for your doormat, simply shake it or spot clean. If the design starts to fade, you can easily touch it up using black paint and a small firm bristle brush.\n\nThis doormat is a fun and unique way to add some personality to your home. It's also a great gift for a housewarming, wedding, or any other occasion.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a unique and welcoming touch to their front entrance",
          "useCase": "Placing the pizza doormat at their front door to greet guests and add a touch of personality to their home"
        },
        {
          "targetAudience": "Individuals seeking a thoughtful and practical housewarming or wedding gift",
          "useCase": "Gifting the pizza doormat to loved ones as a unique and memorable present that adds a touch of coziness and functionality to their new home"
        },
        {
          "targetAudience": "People who appreciate handmade, artisanal products",
          "useCase": "Displaying the pizza doormat as a decorative piece within their home, showcasing their appreciation for unique and handcrafted items"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=98f0ec7fb98f4b3bdc463530fe396aca341855ab%3A612462127&click_sum=3e4cddc2&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:34:19.804720",
      "productId": "tInHKQpGsg"
    }
  },
  {
    "data": {
      "product": "Custom Last Name Retro Doormat",
      "description": "Personalized Welcome Doormat\nPLEASE READ, IMPORTANT INFORMATION ABOUT PERSONALIZATION\nWe will copy and paste the personalization exactly as you type it into the personalization box for the last name on this design. \"THE\" is automatically applied to the top of the doormat (just like the listing photo) UNLESS you specifically ask us to leave it off in the personalization box. If you do not give us an EST. date, we will automatically leave that off. We can also put anything else on this design besides a last name, PLEASE make sure that you are very clear in your description when placing your order. If you have any questions, please send us a message and we'd be happy to help!\nOur doormats are high quality 100% coir. They are hand painted by me with outdoor industrial paint that has a built in UV protection to help protect the design from wear and fading. Each mat is backed with a slip-resistant sturdy PVC rubber backing. We offer a variety of sizes and all of our mats are 1 inch thick.\nThe mats are best placed under a covered area such as a porch, we do not recommend placing mat in areas of direct sunlight, rain, or snow.\nCARE: clean by giving the mat a good shake. Best to keep in a dry area such as a covered entryway, we DO NOT recommend direct sunlight, rain or snow as that will fade & cause wear to your doormat!\nDue to the nature of our product, RETURNS WILL NOT BE ACCEPTED DUE TO WEAR OR FADING. Doormats will not be refunded or replaced from wear.*FLAWED DOORMATS: When we order our doormats, some come with slight imperfections such as dark spots, slight staining, small chipped corner or a small hole on the back of the mat not visible from the front of the doormat. If you are interested in a flawed doormat please send us a message and we will let you know if we have any in stock. If we do have any available, we will send you a photo of the doormat for you to approve before moving forward on the order. PLEASE NOTE, all flawed doormats are sold at a HUGE discounted price and all sales are FINAL. You are agreeing to the flaws during messaging and finalize the sale when you purchase the doormat.\nWe suggest replacing your doormat every few months as doormats tend to be a seasonal item. We are always adding more items so be sure to check back here for our new designs :)\nEach mat is unique. Some may be darker or lighter than the photo, coir is made from the husks of coconuts and some fibers might be thicker or thinner than others. There may also be chunks of the husks in the fibers.\nWe love CUSTOM ORDERS! Message us and let us know what you have in mind and we'll make it happen",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to personalize their entryway",
          "useCase": "Using the doormat to create a welcoming and unique first impression for guests"
        },
        {
          "targetAudience": "Individuals who value custom home decor",
          "useCase": "Using the doormat as a way to express their personal style and make their home feel more unique"
        },
        {
          "targetAudience": "People who are looking for a durable and weather-resistant doormat",
          "useCase": "Using the doormat in high-traffic areas or in areas with inclement weather to protect their floors and keep their entryway clean"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1183106995/custom-last-name-retro-doormat-home?click_key=01442b7aea5c3b298b09c6ee2a49af66d7c856cf%3A1183106995&click_sum=a684a2d7&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:34:39.888458",
      "productId": "bBGVWtDGUv"
    }
  },
  {
    "data": {
      "product": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign",
      "description": "This adorable welcome sign will add a colorful touch to your front door. It is made of solid wood with painted on letters, not vinyl stickers or spray painted. The sign is highly durable and it looks great! It has a distressed look and can be hung on a wall. It is also a great gift. The product is made in the USA and custom orders are accepted.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to add a welcoming and stylish touch to their front door or porch.",
          "useCase": "Displaying the welcome sign on their front door, porch, or patio to greet guests and create a warm and inviting atmosphere."
        },
        {
          "targetAudience": "Individuals who appreciate rustic and farmhouse-style decor.",
          "useCase": "Incorporating the welcome sign into their home's interior decor, such as hanging it on a wall in their entryway or living room."
        },
        {
          "targetAudience": "People who are looking for a unique and thoughtful gift for a friend or family member.",
          "useCase": "Purchasing the welcome sign as a housewarming or wedding gift, knowing that it will be a cherished addition to their new home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=ba5ff5568050c8dbfea90ccb565cc8fd35bc4dee%3A775841802&click_sum=32b7c1c4&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T14:34:52.292009",
      "productId": "2RKSAXFe4K"
    }
  },
  {
    "data": {
      "product": "Set of 2 Large Wooden Porch Vases with Welcome Sign",
      "description": "This set of 2 large wooden porch vases will add a little rustic charm to your porch or living room! A welcome sign and rustic vases all in one! Unique farmhouse and  porch decor will welcome your guests to your home! Fill with large stems or branches and you will have a beautiful eye-catching entry. The large vase measures 24\" x 6 and the smaller one measures 18\" x 6\".  These vases are made form reclaimed wood that has been sanded and stained gray.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking to add rustic charm to their porch or living room",
          "useCase": "Decorating their porch or living room with a unique and eye-catching welcome sign and floor vases"
        },
        {
          "targetAudience": "Individuals who enjoy farmhouse and rustic decor",
          "useCase": "Adding a touch of rustic style to their home with these wooden porch vases"
        },
        {
          "targetAudience": "People who are looking for a unique and functional way to welcome guests to their home",
          "useCase": "Using the welcome sign and vases to create a warm and inviting entryway"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=714f8188a6a2790dc4d0bb3e1fa44637cecdcbb7%3A511215666&click_sum=6167b4ac&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:35:07.140857",
      "productId": "rfLbsFhHzy"
    }
  },
  {
    "data": {
      "product": "Metal Wall Art",
      "description": "**Product Details:**\n\n- Made from 18 gauge steel\n- Powder coated in your choice of 5 colors (Black, Red, White, Copper, Silver)\n- Available in 6 sizes (36\", 30\", 24\", 18\", 14\", 12\")\n- Mounting hardware not included\n\n**Customization:**\n\n- Each sign is designed by hand to accommodate personalization\n- You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name.",
      "targetAudience": [
        {
          "targetAudience": "Families looking for a personalized and meaningful gift for their home",
          "useCase": "Families can use this custom metal sign to display their last name and welcome guests to their home."
        },
        {
          "targetAudience": "Couples getting married who want a unique and lasting way to commemorate their wedding",
          "useCase": "Couples can use this metal sign as a wedding sign to display their new last name and welcome guests to their wedding reception."
        },
        {
          "targetAudience": "Homeowners who want to add a touch of elegance to their home decor",
          "useCase": "Homeowners can use this metal sign to add a personal touch to their home decor and create a welcoming atmosphere."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1095987590/family-gift-family-name-welcome-sign?click_key=d15102ece968aaea01b80f0919cbf4dd8fee803b%3A1095987590&click_sum=aefdca22&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:35:19.837717",
      "productId": "afacfmgQNK"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Bathroom Sconce - Light Fixture",
      "description": "This utility style sconce is perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.\nThe sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.\nFINISH OPTIONS\n-----------------------\n• Black - Durable satin powder coated finish\n• Brushed Nickel - Lightly brushed with a semi-satin finish\n• Antique Brass - Made of solid brass that has been aged and lacquer sealed\nThis lamp is UL listed and thoroughly tested before leaving our shop!\nBULBS NOT INCLUDED\nRecommended Bulb:\nLED Edison 7w (60w)\nBulbs for your light can be purchased in our “Bulbs” section\nDIMENSIONS\n-------------------\nHeight: 10\"\nWidth: 10\"\nDepth: 12.5\"\nShade\nHeight: 3.25\"\nWidth: 10\"\n5\" Wall Canopy\nClearance From Wall: 2\"\nThis light fixture is compatible with a dimmer switch.\n\nSocket: Standard Medium Base (e26/e27)\nOn/off type: Turns on and off at socket.\nInstallation: Direct Wired into wall (Installation Hardware Included)\nIf you would like to make this light a plug-in fixture:\nPlease visit our “Add Ons for Fixtures” section to customize your fixture.\nThis Light fixture is compatible with Incandescents, LEDs, Compact Fluorescents, or any other standard E26 base bulb up to 60 watts.\nPlease provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a stylish and functional lighting solution for their home décor",
          "useCase": "Using the sconce as a bedside light to provide ambient illumination and a touch of industrial aesthetic to their bedroom."
        },
        {
          "targetAudience": "Homeowners looking to enhance the ambiance of their bathroom with a unique and practical light fixture",
          "useCase": "Installing the sconce above the mirror to provide ample lighting for daily grooming tasks while adding a touch of industrial flair to the bathroom."
        },
        {
          "targetAudience": "Commercial establishments, such as restaurants or coffee shops, seeking to create a warm and inviting atmosphere",
          "useCase": "Mounting the sconce on walls to cast a soft glow and contribute to the overall ambiance of the space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=d25d37112bff2e520fe7adbe58d4a085568cee4f%3A615762911&click_sum=77d614d2&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:35:37.886545",
      "productId": "ts3ALdWwSw"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern With Integrated LED's and Unique Reflective Center Cone - Farmhouse Design",
      "description": "Contemporary and Minimalist European Lantern design with sleek integrated LED that provides an ample amount of light. This wall sconce creates a distinct yet tasteful appearance wherever you choose to install.\nAll ECD Lighting Fixtures are made of sturdy die-caste aluminum and sealed with a weather-proof coating that will ensure the longevity of your fixtures.\nAll ECD Lighting fixtures have ETL certifications for the driver and fixture. This fixture is suitable for wet locations and all climates.\nIntegrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours and putting an end to the constant need to change burnt out bulbs. SAVE THOUSANDS on bulbs!!\nPerfect for residential spaces such as exterior entrances, garage, patio, porch, etc. Additionally a great fixture for commercial use in restaurants, common buildings, office spaces, and multi-use buildings.\nAll ECD Lighting fixtures include our patented easy installation hardware!\nNo electrician required and every fixture can be installed with 3 steps in less than 10 minutes.\nALWAYS make sure your power is turned off before installation",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a stylish and energy-efficient outdoor lighting solution",
          "useCase": "Installing the lantern on the exterior of their home to provide ample lighting and a modern aesthetic."
        },
        {
          "targetAudience": "Architects and designers seeking a contemporary lighting fixture for commercial spaces",
          "useCase": "Incorporating the lantern into the design of restaurants, office buildings, and other commercial properties to create a sleek and sophisticated ambiance."
        },
        {
          "targetAudience": "Individuals who appreciate the unique and modern design of the lantern",
          "useCase": "Adding the lantern to their home or workspace as a decorative statement piece that provides both functional lighting and a touch of artistic flair."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=65b26d2a093df0f1b704a9e082ab40603d91df8c%3A1165269880&click_sum=382cf4c6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:35:50.763657",
      "productId": "Sb5CqiOiKV"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748",
      "description": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade. FINISH OPTIONS \n\n• Our Raw Brass finish features solid unfinished brass that is hand cleaned before leaving our shop. The brass will age and patina over time giving the finish a soft natural look.\nPlease wear gloves while installing all fixtures. Touching raw brass with bare hands will tarnish the brass.\nIf you would like the brass to be sealed:\nPlease purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section.\n\n• Black - Durable satin powder coated finish\n• Brushed Nickel - Lightly brushed with a semi-satin finish\n• Polished Nickel - Mirror like metallic finish with a warm feel\n• Antique Brass - Made of solid brass that has been aged and lacquer sealed\nThis lamp is UL listed and thoroughly tested before leaving our shop!\n\nBULBS NOT INCLUDED\nRecommended Bulb:\nLED Edison 7w (60w)\nBulbs for your light can be purchased in our Bulbs section\n\nDIMENSIONS\n\nHeight: 9\"\nWidth: 7\"\nDepth: 10\"\n\nShade:\nHeight: 4.25\"\nWidth: 7\"\nClearance from Wall: 2.55\" Wall Canopy\nThis light fixture is compatible with a dimmer switch.\n\nLAMP SPECS\n\nSocket: Standard Medium Base (e26/e27)\nOn/off type: Controlled from light switch\nInstallation: Direct Wired into Wall  (Installation Hardware Included)\nIf you would like to add an On/Off switch or make this light a plug-in fixture:\nPlease visit our Add-Ons for Fixtures section to customize your fixture.\n\nThis Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts.\nIn order to keep the lamp temperature cool, please use LED bulbs only.\nPlease provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.\nDon't hesitate to reach out if you have questions!",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters who are looking for stylish and functional lighting for their homes.",
          "useCase": "This lamp can be used in a variety of rooms in the home, including the living room, bedroom, dining room, or kitchen."
        },
        {
          "targetAudience": "Interior designers and architects who are looking for unique and stylish lighting fixtures for their clients.",
          "useCase": "This lamp can be used in a variety of commercial settings, including restaurants, hotels, and offices."
        },
        {
          "targetAudience": "People who are looking for a unique and stylish gift for a friend or family member.",
          "useCase": "This lamp would make a great gift for a wedding, anniversary, or birthday."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=150046f5d5665198a6301e8ebab2f8fa92378b45%3A1051791566&click_sum=e9bbeca7&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:36:19.880488",
      "productId": "bcubfagXQI"
    }
  },
  {
    "data": {
      "product": "Linen bedding set",
      "description": "Our green linen bedding set it’s not just soft. It’s the kind of soft that feels like wrapping yourself in a best friend’s hug after a long day.\nHere at SOUTH, we don't do shortcuts. We are crazy about effortless luxury, comfort, sustainability, and quality. That means we use only top-notch CERTIFIED 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home - the more you use it, the more fabulous, soft, and YOURS it will become!\n\nWHY OUR LINEN IS SO AMAZING?\nLinen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. Also, we use only the highest quality linen directly from Lithuanian flax mills, which means it's very durable and you will use it for many many years.\n\n🎁 READY AS A GIFT\nA linen bedding set with pillows can be the perfect gift for your beloved one! Just let us know and we will pack it as a gift! Personalised Gift messages are available on our branded card.randed card.\n\n💌  DETAILS:\n- Includes one duvet cover + 2 pillowcases;\n- Composition: 100% linen;\n- Color: Green;\n- Duvet cover closure type - buttons.\n- Pillowcase closure type - envelope (please contact us if you want to have pillows with button closure)\n- Hypoallergenic, thermoregulating, breathable.\n- Ethically made in Lithuania;\n- Write in the comments if you need to attach ties to the corners of your duvet cover.\n\n💌SIZE CHART:\nUNITED STATES\nUS Twin + Standard pillowcases\nDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cm\nUS Full + Standard pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cm\nUS Full + Queen pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cm\nUS Queen + Standard pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cm\nUS Queen + Queen pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cm\nUS Queen + King pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cm\nUS King + Standard pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cm\nUS King + Queen pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cm\nUS King + King pillowcases\nDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cm\nUS CA King + Standard pillowcases\nDuvet 104x94” / 264x239cm, pillowcases\\t20x26” / 51x66cm\n\nUK / EUROPE\nEU Single + Standard pillowcases\nDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cm\nEU Double + Standard pillowcases\nDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cm\nEU King + Standard pillowcases\nDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cm\nUK Single + Standard pillowcases\nDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cm\nUK Double + Standard pillowcases\nDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cm\nUK King + Standard pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cm\nUK King + King pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cm\n\nAUSTRALIA\nAU Queen + Standard pillowcases\nDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cm\nAU King + Standard pillowcases\nDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm\n\nCUSTOM SIZES:\nIf your comforters are a different size than our standards - no worries, just message us with your measurements and we will make you your perfect bedding set. No extra charge\n\n💌  EFFICIENCY\nUnique fiber softening techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.\n\n💌  CARE GUIDE:\n- Wash at or below 60 C/140F;\n- Do not bleach;\n- Tumble dry on low heat;\n- Iron on low heat;\n- Do not dry clean.\n\n✈️ SHIPPING:\nWe ship worldwide:\n- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).\n- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value comfort, luxury, and sustainability in their bedding.",
          "useCase": "Upgrading their sleep experience with soft, breathable, and durable organic linen sheets that provide a cozy and restful night's sleep."
        },
        {
          "targetAudience": "Homemakers and interior design enthusiasts seeking high-quality, eco-friendly home textiles.",
          "useCase": "Elevating the aesthetics of their bedrooms with stylish and sustainable linen bedding that complements their interior decor and creates a serene and inviting ambiance."
        },
        {
          "targetAudience": "Couples and families looking for hypoallergenic and thermoregulating bedding.",
          "useCase": "Ensuring a comfortable and healthy sleep environment for themselves and their loved ones, especially those with sensitive skin or allergies."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=82599848f6d1ec778b0c9fc8d62a92ee12c6c143%3A1316603667&click_sum=ea928fad&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:36:50.404705",
      "productId": "GrwVBgLUWh"
    }
  },
  {
    "data": {
      "product": "Linen Pillowcase",
      "description": "Pure 100% Linen pillow cover will provide you maximum comfort. Because of linen's natural qualities, you will feel better and sleep deeper.\n- Price includes 1 Pillowcase\n- Pillowcase closure type - envelope;\n- Color: Almon\n- 100%  Extra Soft Linen ;\n- Fabric is: Oeko Tex 100 certified;\n- Made in Lithuania",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking comfortable and luxurious bedding",
          "useCase": "Enhancing sleep quality by providing a soft, breathable, and temperature-regulating pillowcase made from premium linen."
        },
        {
          "targetAudience": "Home decorators seeking stylish and sophisticated bedding",
          "useCase": "Elevating the aesthetic appeal of bedrooms with a versatile pillowcase available in various sizes and a warm, inviting cappuccino color."
        },
        {
          "targetAudience": "Individuals with sensitive skin or allergies",
          "useCase": "Offering a hypoallergenic and Oeko Tex 100 certified pillowcase that is gentle on the skin and free from harmful chemicals."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=1fe6c855481dba8714725bbdb24775154d679f1f%3A1295727796&click_sum=e12514f2&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:37:07.160492",
      "productId": "mDfUXokPhb"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes",
      "description": "Airy and lightweight, SAUTHS linen bedding is all about the luxury we love to embrace. Our OEKO-TEX certified linen duvet covers are also incredibly durable, and their texture – can you believe it? – only improves with time.\nTop-quality European linen out all other materials and makes all our products naturally strong, lustrous, and durable. Our products are organic and fully biodegradable.\nThe natural properties of linen provide added comfort, allow your skin to breathe, and maintain optimum skin temperature and PH balance.\nPre-washed linen collection has a special stone wash finish. The fabric feels soft yet very strong and long-lasting.\nWe accept CUSTOM , so if you haven't found the size needed, let us know!\nLinen bedding can be the perfect gift for your beloved one and we will beautifully pack it for you, just give it as a note. Personalized Gift messages are available on our branded card.\n\nDETAILS:\n- Includes one duvet cover + 2 pillowcases;\n- Composition: 100% linen;\n- Color: Cinnamon;\n- Duvet cover closure type - buttons.\n- Pillowcase closure type - envelope (please contact us if you want to have a pillows with button closure)\n- Hypoallergenic, thermoregulating, breathable.\n- Ethically made in Lithuania;\n- Write in the comments if you need to attach ties to the corners of your duvet cover.\n\nSIZE CHART:\nUNITED STATES\nUS Twin + Standard pillowcases\nDuvet 66x86\" / 168x219cm, pillowcases 20x26” / 51x66cm\nUS Full + Standard pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x26” / 51x66cm\nUS Full + Queen pillowcases\nDuvet 80x80” / 203x203cm, pillowcases 20x30” / 51x76cm\nUS Queen + Standard pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x26” / 51x66cm\nUS Queen + Queen pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x30” / 51x76cm\nUS Queen + King pillowcases\nDuvet 90x88” / 229x224cm, pillowcases 20x36” / 51x91cm\nUS King + Standard pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x26” / 51x66cm\nUS King + Queen pillowcases\nDuvet 102x90” / 259x229cm, pillowcases 20x30” / 51x76cm\nUS King + King pillowcases\nDuvet 102x90” / 259x229cm, pillowcases20x36” / 51x91cm\n\nUK / EUROPE\nEU Single + Standard pillowcases\nDuvet 55x79” / 140x200cm, pillowcases 20x27” / 50x70cm\nEU Double + Standard pillowcases\nDuvet 87x79” / 220x200cm, pillowcases 20x27” / 50x70cm\nEU King + Standard pillowcases\nDuvet 94x87” / 240x220cm, pillowcases 20x27” / 50x70cm\nUK Single + Standard pillowcases\nDuvet 59x79” / 150x200cm, pillowcases 20x30” / 50x75cm\nUK Double + Standard pillowcases\nDuvet 79x79” / 200x200cm, pillowcases 20x30” / 50x75cm\nUK King + Standard pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x30” / 50x75cm\nUK King + King pillowcases\nDuvet 91x79” / 230x200cm, pillowcases 20x36” / 50x90cm\n\nAUSTRALIA\nAU Queen + Standard pillowcases\nDuvet 83x83” / 210x210cm, pillowcases 20x27” / 50x70cm\nAU King + Standard pillowcases\nDuvet -96x83” / 245x210cm, pillowcases20x27” / 50x70cm\n\nEFFICIENCY\nUnique fiber techniques makes our products lightweight and easy– to–pack, so you can forget the worries associated with a limited suitcase or home storage space.\n\nCARE GUIDE:\n- Wash at or below 60 C/140F;\n- Do not bleach;\n- Tumble dry on low heat;\n- Iron on low heat;\n- Do not dry clean.\n\nSHIPPING:\nWe ship worldwide:\n- Standard Priority mail from Lithuania: This shipping method usually takes 5-15 business days to Europe and 9-21 business days to overseas (USA, Australia, New Zealand).\n- Express. It takes 2-4 business days worldwide. IMPORTANT: If you choose the express shipping method, please write down your phone number in the note section, it helps to avoid delivery problems",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking natural and sustainable bedding options.",
          "useCase": "Enhancing sleep quality and comfort with breathable and hypoallergenic linen bedding."
        },
        {
          "targetAudience": "Interior design enthusiasts aiming for a cozy and sophisticated bedroom aesthetic.",
          "useCase": "Transforming bedroom decor with high-quality linen bedding that adds a touch of elegance and warmth."
        },
        {
          "targetAudience": "Couples or individuals with specific bedding size requirements.",
          "useCase": "Customizing bedding dimensions to perfectly fit their bed and enhance their sleep experience."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=6a4a655323104dfea52e89f717dab89790454005%3A1066602418&click_sum=b85378a9&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:37:33.696163",
      "productId": "MZJmXuNYFe"
    }
  },
  {
    "data": {
      "product": "Wall art decor print, Interior decor giclée art print, architectural space, depeapa illustration - INTERIOR II -",
      "description": "Fine art Giclée print, printed on acid free and warm white fine art paper (200 gms), saturated colours using archival pigment inks for long life.- INTERIOR II -This print is available in three optional sizes:A4 - 9” x 12” (21 x 29.7 cm)A3 - 11.7” x 16.5” (29.7 x 42 cm)A2 - 16.5” x 23.4” (42 x 59.4 cm)Each print is signed and including a white border for framing.Important note: The frame is not includedThe small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. The medium and large prints are shipped in a tube. If small prints are purchased along medium or large ones, they will be shipped together in a tube.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Enhancing their home décor with unique and visually appealing artwork that reflects their personal style and aesthetic preferences."
        },
        {
          "targetAudience": "Interior designers and decorators",
          "useCase": "Incorporating the print into their clients' interior design projects, adding a touch of sophistication and artistic flair to living spaces."
        },
        {
          "targetAudience": "Architects and home renovators",
          "useCase": "Using the print as a source of inspiration or reference for creating visually cohesive and aesthetically pleasing architectural spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/576508683/wall-art-decor-print-interior-decor?click_key=281fe8a2374c090601a06131fe0eba88dd7bc76f%3A576508683&click_sum=2da75830&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:37:47.261047",
      "productId": "bvKUM6tTfz"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting, abstract art print set of 2, minimalist art print, contemporary wall art, Forest Green Large Prints, 16x20 Printable",
      "description": "Mid Century Modern, Fine Art Prints, Contemporary Art Prints, Abstract Art Style, Mid Century Poster, Midcentury Art Print, Abstract Print File, Fine Art Print For Sale Online, Entrance Wall Art, Apartment Wall Decor, Printable Guest Room, Printable Women Gift, Downloadable Art Prints.\n\nTHIS IS A DIGITAL DOWNLOAD, originated from Kala's original painting. Perfect for your home or office decor. Instant download and easy to print, without paying the shipping fee.\n\nYour order will consist of TWO high-resolution 300 DPI JPEG images, with a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide), with no white borders, image ratio is 5x7.\n\nThis file image is on CMYK format. You may crop the images based on your paper size or frame size. Make sure the print size is no bigger than the size mentioned above, to produce a nice quality crispt print.\n\nUpon purchase of this listing, Etsy will immediately provide you with a link to your download. Click on the link to download the file and save it to your computer! It’s that simple! You can print the artwork at your local printing center or by using online printing services.\n\nKINDLY NOTE:\n\nNo physical product will be shipped and the frame is not included. Colors may vary slightly due to different color monitors and/or your printer or printing company's settings.\n\nTERMS & CONDITIONS:\n\nThe images that are being provided to you are licensed copies for any reasonable PERSONAL PURPOSES, including but not limited to: printing, copying, emailing, and web publishing.\n\nYour license does not include use that results in financial gain, including but not limited to: advertising, stock photography, print sale profits, or resale of any nature.\n\nIMPORTANT:\n\n- Please do not! Share or sell digital files or printed versions via any online or physical channel.\n- I don't accept returns, exchanges, or cancellations. But please contact me if you have any problems with your order.\n\nFor a much bigger size than this, I only sell the limited edition original painting, both on high-quality paper (Fedrigoni Paper or Hahnemuehle Paper) or on canvas, and the size is according to your preference. To discuss for a custom abstract original painting like this, please contact me through email:  kalamasa.gallery [!at] gmail.com\n\nThank you for your purchase, It will surely help me as a small artist to keep creating and growing.\n\nCLICK here for similar individual art print:\n\nhttps://www.etsy.com/listing/833978801/abstract-green-prints-minimalist?ref=shop_home_active_16\nhttps://www.etsy.com/listing/833958685/abstract-emerald-green-prints-emerald?ref=shop_home_active_15\nhttps://www.etsy.com/listing/833971655/abstract-green-prints-emerald-green?ref=shop_home_active_14\nhttps://www.etsy.com/listing/833944255/abstract-botanical-prints-emerald-green?ref=shop_home_active_13\n\nCLICK here for the similar set of 2 prints option:\n\nhttps://www.etsy.com/listing/834855825/emerald-green-print-set-abstract-art?ref=shop_home_active_19&crt=1\n\nCLICK here for the similar set of 3 prints option:\n\nhttps://www.etsy.com/listing/830353484/emerald-green-wall-art-set-of-3-prints?ref=shop_home_active_4\n\nPlease visit my main SHOP to see what is new and exciting!\n\nhttps://www.etsy.com/shop/KALAMASArtgallery",
      "targetAudience": [
        {
          "targetAudience": "Individuals who appreciate modern and contemporary art",
          "useCase": "Decorating their homes or offices with aesthetically pleasing and stylish artwork"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Sourcing unique and affordable artwork for their clients' spaces"
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Expanding their collections with limited-edition original paintings or high-quality prints"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/834853057/emerald-green-painting-abstract-art?click_key=f05c882cc7de602b4c1f01acfad1e0b06c2b413b%3A834853057&click_sum=7a8778a6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:38:08.595740",
      "productId": "ZTtCnodJOZ"
    }
  },
  {
    "data": {
      "product": "Dip dye tapestry, Ombre wall art, Macrame dip dye, Dip dye decor, Dip dye wall hanging, Green wall hanging, Green Décor, Boho wall hanging",
      "description": "This beautiful boho wall art is constructed from hundreds of recycled cotton threads that give the piece a raw and natural look, each thread is then hand-dyed and finished on a hand-stained wood panel.",
      "targetAudience": [
        {
          "targetAudience": "Bohemian home decor enthusiasts",
          "useCase": "They will appreciate the unique, handcrafted aesthetic of the tapestry, which will complement their eclectic and artistic style."
        },
        {
          "targetAudience": "Individuals seeking a statement piece for their living space",
          "useCase": "The tapestry's large size and eye-catching design will make it the focal point of any room, adding a touch of drama and personality."
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "The tapestry is made from recycled cotton threads, making it an environmentally friendly choice for those concerned about sustainability."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=4e6e6321824bde681fc65066c3e85d6c71d7dc5e%3A991191051&click_sum=8daa42df&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:38:18.647077",
      "productId": "zRWTQWPVOM"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "This unique bubble-shaped candle is perfect for home decor or as a gift. It is made from high-quality, pure soy wax and blended with white beeswax, and when burned, it releases a healthy and environmentally friendly aroma. The candle is available in a variety of scents, including High Tide, Pink Sugar Crystals, Magnolia Peony, Pine Forest, and Moonflower. Each candle is hand-poured and wrapped by hand, and due to the nature of this, they may vary slightly. Some small imperfections may be present, which does not affect the use.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate unique and aesthetically pleasing objects",
          "useCase": "Using the candle as a decorative element in their homes, adding a touch of elegance and sophistication to their living spaces."
        },
        {
          "targetAudience": "Individuals seeking personalized and handmade gifts",
          "useCase": "Purchasing the candle as a thoughtful and unique gift for loved ones, expressing their creativity and celebrating special occasions."
        },
        {
          "targetAudience": "People who prioritize well-being and enjoy creating a cozy and relaxing atmosphere",
          "useCase": "Lighting the candle to enhance their self-care routines, promoting relaxation and creating a soothing ambiance in their homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=26be8555fd4d96c66b0f5f8624cd0811ec522f6c%3A774551709&click_sum=1c053c21&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:38:28.929812",
      "productId": "UXXRVFGTle"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle - Hand-Poured",
      "description": "Peruvian palo santo wood blended with top notes of neroli and saffron - this rich and woody scent also has hints of cedarwood, amber, and moss. \nTop: Neroli, Saffron\nMiddle: Cedarwood, Palo Santo\nBase: Amber, Moss\n\nABOUT OUR SOY CANDLES\nHand-poured in small batches, made with 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks.\nAll of our candles are made, packaged, and shipped from our New York Studio.\nBURN TIME\nThis candle will burn for approximately 45-50 hours.\nCANDLE CARE\nOn the first burn, allow the melt pool to reach the edges of the metal tin.\nThis will help to prevent tunneling and give your candle a nice even burn.\nTrim the wick to about 1/4\" before each use.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy earthy and masculine scents",
          "useCase": "Creating a relaxing and inviting atmosphere in their homes or offices"
        },
        {
          "targetAudience": "People who are interested in natural and eco-friendly products",
          "useCase": "Using the candle as a sustainable and stylish way to enhance their living spaces"
        },
        {
          "targetAudience": "Customers seeking high-quality and long-lasting candles",
          "useCase": "Enjoying the extended burn time and even burn of the candle, making it a valuable addition to their homes"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=194a5ddba80989f53c4e1abac69c7a15a37dbfb7%3A785763623&click_sum=fdc72a94&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:38:40.925968",
      "productId": "RlDJfwDMjJ"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle",
      "description": "**Scent:** Grapefruit, Hinoki, Cypress\n\n**Attributes:**\n\n- 100% Natural Soy + Essential Oil\n- 8 oz / up to 50 hr\n- Vegan\n- USA Made Vessel\n- Hand-poured in Rhode Island\n- 3.5\" high x 2.5\" wide\n\n**Folklore:**\n\n- The Tree of Purity\n- Once worshiped as a symbol of the sun goddess\n- The timber of the fragrant wood has been traditionally used to build the most sacred of places; shrines and temples.\n- Still used in many Shinto ceremonies today\n- Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.\n- Uniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking relaxation and tranquility in their living spaces",
          "useCase": "Using the candle to create a calming and serene atmosphere in their homes, promoting mindfulness and stress reduction."
        },
        {
          "targetAudience": "Health-conscious consumers who prioritize natural and sustainable products",
          "useCase": "Choosing the candle as a non-toxic and eco-friendly way to enhance the ambiance of their homes while avoiding synthetic fragrances and chemicals."
        },
        {
          "targetAudience": "Those interested in aromatherapy and the benefits of essential oils",
          "useCase": "Utilizing the candle to incorporate the therapeutic properties of grapefruit, hinoki, and cypress essential oils into their daily routine, promoting clarity, awareness, and overall well-being."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=e58d82bccd57e526a531391738afdff212f4aff1%3A879866486&click_sum=f6b559dd&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:38:52.318209",
      "productId": "ULEEZbFafW"
    }
  },
  {
    "data": {
      "product": "Small Wooden Stool",
      "description": "This small wooden stool embodies Scandinavian decor with its minimalist design and natural wood finish. Crafted for versatility, it seamlessly fits into any space, offering both functionality and timeless style. A perfect addition for those seeking a touch of Nordic charm.\n\n**STOOL DETAILS**\n\n- COLOR CHOICE - We have two color samplers. Sampler 1 is our standard swatch. You can choose a shade by changing the color on the right side of the product. Among the shades available for selection are: Natural, Walnut, Oak, Light Oak, Antic Oak, Teak or Black\nWe also have an additional swatch - Sampler 2. These are our latest colors. If frozen green, winter blush, or other shades from this swatch caught your eye, you can purchase a piece of furniture by selecting any shade from the list, and in the comments to your order, enter the correct name of the shade you would like to receive, or contact me by sending a private message - I will guide you through the purchase process.\n\n- Manufactured entirely from plywood produced by one of the biggest plywood suppliers in the world based in Finland.\n\n- Finished with a natural hard wax oil.\n\n- Weight limit is 120kg\n\n- You can change the size, material, surface treatment. Just contact us prior to purchasing for a quote.\n\n- Stool is sent with dismounted legs (accordingly numbered) with a mounting kit.\n\n- Easy to assemble in 5 minutes.\n\n**STOOL DIMENSIONS**\n\n- Seat diameter: 32 cm (12.59\")\n- Height: 41 cm (16.14\")\n\n**IMPORTANT**\n\nYou have three way to see our stains:\n\n- Third photo shows our samples of colors\n- When you change \"Select color\" just above ADD TO CARD bottom, photos should change so you can see how our furniture looks like in different color option\n- You can always write to me and I will send you photos - ours or from our clients - of each stain. Thats not a problem at all - its very important so you will get what you want",
      "targetAudience": [
        {
          "targetAudience": "Home decorators seeking a minimalist and stylish touch to their space",
          "useCase": "Creating a versatile accent piece that effortlessly complements any room's aesthetic, providing both functionality and visual appeal"
        },
        {
          "targetAudience": "Plant enthusiasts looking for an elevated display for their greenery",
          "useCase": "Providing a sturdy and aesthetically pleasing platform to showcase plants, adding a touch of nature to their living space"
        },
        {
          "targetAudience": "Individuals seeking a durable and eco-conscious furniture option",
          "useCase": "Investing in a high-quality piece crafted from sustainable materials that can withstand daily use while complementing their environmentally conscious lifestyle"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=0ce9341871b025abc2fc073f6101f28b78ac753d%3A570862928&click_sum=ca696b28&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:39:06.653760",
      "productId": "NCOZWvGigI"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "Cork stools is a collection of stools made of natural cork. It offers a simple, versatile and functional design.\nThe stools are available in two dimensions. The recess around the perimeter makes it easier to carry and move them. The smooth texture of cork combined with a simple design makes the stools perfect for a wide range of public and private environments.\nThis collection combines the use of a natural material and simple forms.\n\nCollection: Furniture Collection\nMaterial: Natural Cork\nDimensions:\nCork stool #1 - Ø 30 x H 39 cm\nCork stool #2 - Ø 32 x H 45 cm\nYear: 2020\n\nCare instructions\nYou should:\n> clean it with a soft cloth or with a cloth slightly moistened with water. After cleaning always use a dry cloth;\nYou should not:\n>clean it with any type of chemical and abrasive product;\n> place hot or sharp objects on the surfaces;\n> expose it to direct sunlight. Cork is a natural material, therefore susceptible to shade variations over the years.",
      "targetAudience": [
        {
          "targetAudience": "Eco-conscious individuals interested in sustainable home decor",
          "useCase": "Incorporating natural materials into their living spaces to reduce environmental impact while maintaining style and functionality."
        },
        {
          "targetAudience": "Interior designers and architects seeking versatile and sustainable furniture solutions",
          "useCase": "Creating unique and eco-friendly spaces that cater to the needs of environmentally conscious clients."
        },
        {
          "targetAudience": "Homeowners looking for durable and stylish seating options for various rooms",
          "useCase": "Adding a touch of nature and functionality to their living rooms, bedrooms, or other living areas."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/793579884/cork-stools-home-living-bedroom-living?click_key=64f32cddd3971733b5f34ffe672896b93df313ab%3A793579884&click_sum=ecb110f6&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:39:23.752869",
      "productId": "rCvwmTnxSK"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "The Bonnet Stool is a hardy, solid-wood functional object for the home or office that can function as an end table, side table, stool, or plant stand and will look dynamite in combination with just about any thoughtfully decorated space.\nIt is Handmade in Indianapolis, Indiana with 2.5\" round Douglas Fir legs and a Sycamore top accented with Oak Dowels.\nThe Bonnet Stool is hand finished with three coats of wipe on poly-oil wax finish for a durable, water-resistant satin glow.\nIt's available in two sizes and a variety of colors. \nAlso, feel free to reach out for custom colors and sizes either through our Etsy store or through email at  info [!at] whalecreek.co.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners and renters looking for stylish and functional furniture",
          "useCase": "Using the Bonnet Stool as an end table, side table, stool, or plant stand in their living room, bedroom, or office."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Incorporating the Bonnet Stool into their designs to create a Scandinavian-inspired or modern aesthetic."
        },
        {
          "targetAudience": "Plant enthusiasts",
          "useCase": "Displaying their plants on the Bonnet Stool to elevate them and create a focal point."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=3888af3b62a03fe5809cd820a07dbac86ebbb690%3A1198929077&click_sum=f3c75c88&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:39:36.544095",
      "productId": "TiDuwHPaDI"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "The Coiled was designed to dress your plants in style, just like the owner! Our planters will modernize and bring out the beauty of your plants. \"The Coiled\" exudes a bauhaus/Japanese cool!\n\nThey all come with a drainage hole and 3 little \"feet\". If you prefer not to have the hole or feet, please leave me a note.\n\nSizes (Inside diameter and all measurements are approximate):\n\n- 2.5\" diameter x 2.25\" tall (6.4 cm x 5.7 cm) (fits standard 2 inch pots)\n- 4.18\" diameter x 3.75\" tall (10.6 cm x 9.5 cm) (fits standard 4 inch pots) (video shown in this size)\n- 6.18\" diameter x 5.4\" tall (15.7 cm x 13.7 cm) (fits standard 6 inch pots)\n\nThe colors come in a matte or sheen finish. This listing is for the matte finish colors only. You can find the sheen finish colors in my other listings. I have 2 blacks: the matte black is a soft non-reflective finish while the sheen black has a slight shine to it and a darker black finish. The white and light grey is a sheen finish but appears matte.\n\nAll products are 3D printed out of a plant based bioplastic eco-friendly material. The natural wood and black wood matte finish is mixed with real recycled wood. They're all lightweight, durable and won't break if you accidentally drop them!",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who value style and sustainability",
          "useCase": "Using the planter to showcase their collection of indoor plants, adding a touch of sophistication to their living space while supporting eco-friendly practices."
        },
        {
          "targetAudience": "Home decorators seeking unique and modern pieces",
          "useCase": "Incorporating the planter into their interior design scheme, complementing their existing furnishings and creating a visually appealing atmosphere."
        },
        {
          "targetAudience": "Gift-givers searching for thoughtful and practical presents",
          "useCase": "Selecting the planter as a gift for plant-loving friends or family members, demonstrating care and consideration for their interests and well-being."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=db275bc61e378780e4de0413330d573d73b0c61a%3A865339439&click_sum=19a22b52&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:39:58.239794",
      "productId": "rLuvxEMUhd"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter",
      "description": "A floor planter made of brass and aluminium with a static paint finish. The planter has a diameter of 20cm and a height of 30cm, while the brass stand is 18cm high. The planter is suitable for all house plants, especially those that like facing the sun. It can be rotated to any direction on its brass stand, allowing you to adjust your plants position easily. The planter also has a perforated separator inside that collects excessive water at the bottom to prevent root damage. Plants can be placed with their pots inside the planter, and the separator will act as a platform for the pot.",
      "targetAudience": [
        {
          "targetAudience": "Home decor enthusiasts who appreciate stylish and functional planters",
          "useCase": "Elevate the aesthetic of their living spaces by displaying their plants in a chic and modern way."
        },
        {
          "targetAudience": "Plant lovers who want to keep their plants healthy and thriving",
          "useCase": "Utilize the perforated separator to prevent waterlogging and promote optimal root health."
        },
        {
          "targetAudience": "Individuals looking for a versatile planter that accommodates various plant sizes and types",
          "useCase": "Take advantage of the adjustable brass stand and spacious pot to showcase a range of plants, from small succulents to larger indoor trees."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=811d62354e4e3beaa09e2d115ea22934d75b44b3%3A728731403&click_sum=9f21c88b&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:40:06.660505",
      "productId": "nzGjjoCoxy"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter",
      "description": "Stoneware planter with hand carved details in a bright red and pink combo. Perfect size for a small cactus or succulent.  Small hole in bottom of pot for water drainage.Approx 2.5” height x 3” diameter",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who appreciate unique and stylish home decor",
          "useCase": "Displaying small cacti or succulents in their home or office, adding a touch of greenery and artistic flair to their living spaces."
        },
        {
          "targetAudience": "Homeowners or apartment dwellers with limited space who are looking for a compact and visually appealing way to incorporate plants into their decor",
          "useCase": "Growing small plants in the planter, which can be placed on desks, windowsills, or shelves, bringing a sense of nature and freshness to their living environments."
        },
        {
          "targetAudience": "Gift givers searching for a thoughtful and aesthetically pleasing present for plant lovers or home decorators",
          "useCase": "Purchasing the planter as a gift, knowing that it will be appreciated by those who value unique and stylish home accessories and enjoy adding a touch of greenery to their surroundings."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=f2f9a17a3d3a9cf5251ca92fcf423d046c7ac34f%3A1435558019&click_sum=35ba8a96&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:40:15.262532",
      "productId": "9wrPDbtMwg"
    }
  },
  {
    "data": {
      "product": "Art print",
      "description": "The art print is unframed, matte, 4\"x6\" and 200g/m2.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts and collectors",
          "useCase": "Displaying the art print in their homes or offices to enhance their aesthetic appeal"
        },
        {
          "targetAudience": "Individuals seeking unique and thoughtful gifts",
          "useCase": "Purchasing the art print as a gift for friends, family, or colleagues who appreciate art and design"
        },
        {
          "targetAudience": "Decorators and home designers",
          "useCase": "Using the art print as a decorative element in interior design projects to create a visually appealing and personalized space"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1657888576/art-print-4-x-6?click_key=239009c8fbd5c04a2cccf1fbece1315330114ecc%3A1657888576&click_sum=e4c270e8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-1",
      "dateCreated": "2024-02-20T14:40:22.775515",
      "productId": "hWrdPpISyE"
    }
  },
  {
    "data": {
      "product": "Infinity Symbol SVG, Infinity PNG Bundle, Infinity Clipart, Infinity SVG Cut Files for Cricut, Infinity Silhouette, Infinity Heart Svg",
      "description": "This digital download includes over 230 high-quality files in SVG, EPS, PDF, and PNG formats. The files are perfect for Cricut or Silhouette projects to make t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, print n’ cuts & more!",
      "targetAudience": [
        {
          "targetAudience": "Crafters and hobbyists",
          "useCase": "Creating personalized t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, and print n’ cuts."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Selling handmade crafts and personalized items featuring infinity symbol designs."
        },
        {
          "targetAudience": "Teachers and educators",
          "useCase": "Creating educational materials and visual aids for lessons related to infinity and mathematics."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1521258520/infinity-symbol-svg-infinity-png-bundle?click_key=4ec8fed791a62ac7d0ad20f7956cf2330a84679f%3A1521258520&click_sum=708a6ad9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-2&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:40:30.316179",
      "productId": "YUsyUvYc8y"
    }
  },
  {
    "data": {
      "product": "Super SVG for Cricut and Sublimation",
      "description": "This is a digital delivery that includes SVG files for use with Cricut and sublimation machines. The files include a variety of Super SVG designs, as well as a font. The files are stored on a Google Drive and can be accessed without a Google account. The seller grants permission to use the files for personal and small commercial purposes, but they cannot be shared or resold. The seller does not offer refunds due to the digital nature of the product.",
      "targetAudience": [
        {
          "targetAudience": "Parents of young children who enjoy Super Mario",
          "useCase": "Create personalized Mario-themed items for their children, such as shirts, party decorations, or school supplies."
        },
        {
          "targetAudience": "Crafters and hobbyists who enjoy making and selling handmade items",
          "useCase": "Use Mario-themed designs to create unique and eye-catching products, such as tumblers, signs, or cards, to sell at craft fairs or online marketplaces."
        },
        {
          "targetAudience": "Teachers and educators who want to incorporate Super Mario into their lessons",
          "useCase": "Use Mario-themed designs to create engaging and educational materials, such as worksheets, flashcards, or posters, to help teach children about various subjects."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1581333291/super-mario-svg-bundle-for-cricut-and?click_key=53b019aebd273e0441c5d544c424d41fd6878df9%3A1581333291&click_sum=f1359119&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-3&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:40:40.765841",
      "productId": "pQ3Vm9FYXf"
    }
  },
  {
    "data": {
      "product": "Amor tumbado Svg, CT Svg, Cut Files for Cricut & Silhouette, Svg, Png, Dxf",
      "description": "This is a digital download of several files in zip archive. Inside zip archive you will find:\n5 X SVG for Cricut Design Space\n5 X PNG - 300 dpi with transparent background\n5 X DXF - for Silhouette Studio Basic Edition\n\nPLEASE NOTE:\nIf the download link does not appear, please feel free to contact me directly within Etsy.",
      "targetAudience": [
        {
          "targetAudience": "Hobbyists and crafters",
          "useCase": "Creating custom designs for use in projects such as scrapbooking, card making, and home décor."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Designing products to sell, such as t-shirts, mugs, and tote bags."
        },
        {
          "targetAudience": "Graphic designers",
          "useCase": "Incorporating the SVG, PNG, and DXF files into their design work."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1648658969/amor-tumbado-svg-ct-svg-cut-files-for?click_key=2ec7ca8947051a8ee280245ef9d3b3b71a984ade%3A1648658969&click_sum=75a0188d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-4&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:40:54.276878",
      "productId": "s4LHMNqmqi"
    }
  },
  {
    "data": {
      "product": "Amazing Watercolor Painting kit for Procreate 2023",
      "description": "This is a digital product that includes over 25 brushes, a regular watercolor paper texture, and over 100 tutorial videos. \n\nThe brushes are designed to be easy to use and can be used to paint anything. They are also compatible with traditional watercolor tutorials on YouTube and Pinterest.\n\nThe blending brush is a unique feature of this kit and allows you to mix any colors together to create realistic spidery water patterns or smooth ombre style blends.\n\nThis product is suitable for unlimited commercial use and is compatible with all models of the iPad that can run Procreate 5.3 or higher.",
      "targetAudience": [
        {
          "targetAudience": "Artists and designers who use Procreate for digital painting",
          "useCase": "Using the brushes and textures to create realistic watercolor paintings in Procreate"
        },
        {
          "targetAudience": "Beginners who want to learn how to paint with watercolors",
          "useCase": "Following the included tutorials to learn the basics of watercolor painting and using the brushes to practice"
        },
        {
          "targetAudience": "Educators who teach digital art or watercolor painting",
          "useCase": "Using the product as a teaching tool to demonstrate watercolor techniques and principles"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/773250221/amazing-watercolor-painting-kit-for?click_key=a61341489f4a02c1537626638f274ff320baa260%3A773250221&click_sum=9845ab7d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-5&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:41:09.674596",
      "productId": "COuyQrOpys"
    }
  },
  {
    "data": {
      "product": "455 Unique Project Proposal Presentation Templates",
      "description": "This package includes 455 unique slides, 4000 unique icons, and 60 color themes. These templates are fully customizable, allowing you to easily add your own content and tailor the presentation to your specific needs. Additionally, these templates are compatible with all major presentation software, so you can use them with your preferred platform. Choose from a variety of templates that include cover slides, project timelines, team introductions, budget breakdowns, and much more. These templates will help you organize your ideas and present them in a clear and concise manner, making it easy for your audience to understand your vision and get excited about your project.",
      "targetAudience": [
        {
          "targetAudience": "Professionals who need to create professional-looking project proposals",
          "useCase": "The templates can be used to create proposals for a variety of purposes, such as funding, partnerships, or new initiatives."
        },
        {
          "targetAudience": "Students who need to create project proposals for school or university",
          "useCase": "The templates can help students to organize their ideas and present them in a clear and concise manner."
        },
        {
          "targetAudience": "Entrepreneurs who need to create project proposals for investors or potential partners",
          "useCase": "The templates can help entrepreneurs to make a strong impression on potential investors or partners."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1458050784/455-unique-project-proposal-presentation?click_key=41c958069769dfac8637b2f7e20b0efb0d5f8857%3A1458050784&click_sum=ed04c105&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-6&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:41:21.391977",
      "productId": "vNUxG4qt0G"
    }
  },
  {
    "data": {
      "product": "Wonka Tshirt",
      "description": "Wonka Tshirt, Movie Shirt, Willy Wonka, Wonka Factory Top, Golden Ticket, Wonka Logo, charlie svg, wonka png, Wonka Chocolate Factory. This is a great file for heat transferring vinyl to a shirt, cutting vinyl into suitable materials, or making cards. Use your imagination and create as you wish!",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in the movie and character Willy Wonka",
          "useCase": "Creating custom t-shirts or other merchandise featuring the Wonka logo or imagery."
        },
        {
          "targetAudience": "DIY enthusiasts or small business owners",
          "useCase": "Using the SVG or PNG files to create custom cutouts or designs for various projects, such as personalized gifts or home decor."
        },
        {
          "targetAudience": "Teachers or educators",
          "useCase": "Incorporating the Wonka-themed designs into educational materials or classroom decorations for lessons related to the movie or the concept of imagination."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665889182/wonka-tshirtmovie-shirtwilly-wonkawonka?click_key=8da8e08d5953684f85938483bd124a9e13be1d0c%3A1665889182&click_sum=802ad04d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-7&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:41:41.648974",
      "productId": "bJmDSWwmxm"
    }
  },
  {
    "data": {
      "product": "Laser cut Mega Bundle",
      "description": "This mega bundle includes 248 Easter designs in SVG and DXF formats. The designs include 3D Easter lanterns, boxes, decor stands, Doh holders, egg baskets, gift card holders, round signs, stands, 3D Easter eggs, Easter signs, keychains, ornaments, pop up cards, single egg holders, single egg holder 2s, single egg holder 3s, tray laser cuts, signs, 3D Round Easter egg baskets, gnomes, letter keychains, money holders, egg holders, and interchangeable rabbit stands.",
      "targetAudience": [
        {
          "targetAudience": "Parents or guardians looking for creative and educational activities for their children",
          "useCase": "The Easter Laser cut Mega Bundle provides a variety of Easter-themed designs that can be used to create fun and engaging crafts with children, fostering creativity and fine motor skills."
        },
        {
          "targetAudience": "Crafters and makers looking to create unique and personalized Easter decorations and gifts",
          "useCase": "The bundle's extensive collection of designs allows crafters to create a wide range of Easter-themed items, such as ornaments, gift card holders, and decorations, adding a personal touch to their holiday celebrations."
        },
        {
          "targetAudience": "Educators and event planners looking for engaging and festive resources for Easter-themed lessons or events",
          "useCase": "The designs can be incorporated into educational activities, such as teaching children about Easter symbols and traditions, or used to create festive decorations for Easter-themed events, bringing a touch of joy and creativity to the occasion."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1676983339/easter-laser-cut-mega-bundle-248-easter?click_key=cb2e3041b4e17ce8b9ccc9afe57ddb4cccb8dc17%3A1676983339&click_sum=f54b38f9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-8&pro=1&dd=1",
      "dateCreated": "2024-02-20T14:41:52.238683",
      "productId": "PUklwOKb8E"
    }
  },
  {
    "data": {
      "product": "Kawaii Digital Paper Set, S-anrio Digital Paper Set, Cute K-uromi, My m-elody, H-ello Kitty, Digital Art, Digital Printable Papers",
      "description": "Digital download\nDigital file type(s):\n\n1 PDF:\n･ﾟ✧ *:･ﾟ✧ *:･ﾟ✧ cute s-anrio Digital Papers🎀*:･ﾟ.✧:･ﾟ.✧ *:･.┊　　┊　　┊　　┊┊　　┊　　┊　　❀ PDF┊　　┊　　✧ high quality┊　　❀ 2000x2000 px.\n✧ 20 pcs PNG\n\nHow to download? :Etsy > Your account > Purchases and Reviews\n\nREFUND, EXCHANGE or CANCELLATION\nDue to the digital nature of this product refunds, exchanges and cancellations WILL NOT be issued. Please make sure the formats provided are compatible with your machine BEFORE purchasing.\n\nPlease make sure you know at least one of the file types, including opening and using the files. Make sure your machine and software are compatible before purchasing.\n\nIf you have a problem with the product, please contact me first.\ni am ready to help",
      "targetAudience": [
        {
          "targetAudience": "Digital artists and crafters who enjoy creating cute and whimsical designs.",
          "useCase": "Using the digital papers to create digital scrapbooking pages, printable stickers, planner inserts, and other personal crafts."
        },
        {
          "targetAudience": "Small business owners and entrepreneurs who sell handmade products.",
          "useCase": "Using the digital papers to create packaging, labels, and other branding materials for their products."
        },
        {
          "targetAudience": "Educators and parents looking for engaging and educational materials for children.",
          "useCase": "Using the digital papers to create worksheets, lesson plans, and other educational resources."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1674604893/kawaii-digital-paper-set-s-anrio-digital?click_key=3a899ef97929e9a64ee3fb68e92113fbba4fee21%3A1674604893&click_sum=1bb22140&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-9&pro=1&dd=1",
      "dateCreated": "2024-02-20T14:42:11.843705",
      "productId": "B5xjDoLSjn"
    }
  },
  {
    "data": {
      "product": "Couple Wooden State Sign",
      "description": "This product is a personalized wooden sign that features two states, making it a perfect gift for couples in a long-distance relationship or to commemorate a special place. \n\nThe sign is made of high-quality plywood and comes in three different sizes: 6\" x 6\", 8\" x 8\", and 10\" x 10\". It also comes with a stand for easy display.\n\nTo personalize the sign, simply provide the names of the two states you want featured. The sign will be made to order, and the details of the actual product may vary slightly due to the characteristics of handcrafted products.\n\nThe color of the sign may also vary slightly due to screen settings, and the size may vary slightly due to the nature of individually handmade products.",
      "targetAudience": [
        {
          "targetAudience": "Long-distance couples or couples who want to commemorate a special place",
          "useCase": "Display the sign in their home as a reminder of their love and connection"
        },
        {
          "targetAudience": "Newlyweds or couples celebrating an anniversary",
          "useCase": "Use the sign as a unique and personalized wedding or anniversary gift"
        },
        {
          "targetAudience": "Individuals looking for a thoughtful and meaningful Valentine's Day gift",
          "useCase": "Express their love and affection with a personalized sign that celebrates their special bond"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1658192125/couple-wooden-state-sign-two-states-love?click_key=ad0995a1a9bfb3527f364c4850a86ec31b24fe07%3A1658192125&click_sum=270d7045&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-10&pro=1",
      "dateCreated": "2024-02-20T14:42:33.094318",
      "productId": "fIkNxcpYUE"
    }
  },
  {
    "data": {
      "product": "Pink and Gold Marble Background, Pink Marble Digital Paper, Rose Gold Marble Texture, Digital Scrapbook Paper, Photoshop Backgrounds",
      "description": "A pack of 20 beautiful white pink and gold marble digital papers: 20 Rose Gold Marble Backgrounds.\n\nUse them for your creative digital designs - websites, business cards, invitations, scrapbooking. They are perfect marble textures for Photoshop use.\n\nYou will get:An archive with 20 jpg files of high quality, horizontal format (5000 x 3334).\n\nPlease note: This is a digital product, no physical items will be shipped. Do not redistribute, resell, share or copy. Purchase does not transfer copyright.",
      "targetAudience": [
        {
          "targetAudience": "Designers and creative professionals",
          "useCase": "Creating digital designs for websites, business cards, invitations, and scrapbooking."
        },
        {
          "targetAudience": "Photographers and artists",
          "useCase": "Using the marble textures as Photoshop backgrounds for photo editing and artwork."
        },
        {
          "targetAudience": "Personal users interested in home decor and customization",
          "useCase": "Printing the marble papers for use in home decor projects or personalized stationery."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1430086177/pink-and-gold-marble-background-pink?click_key=a1e68c1d3ec413468b6ca7230e65a06244365c25%3A1430086177&click_sum=f07f285e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-11&dd=1",
      "dateCreated": "2024-02-20T14:42:41.592679",
      "productId": "yGkdYdMyAk"
    }
  },
  {
    "data": {
      "product": "Paw Print Svg Bundle",
      "description": "This bundle includes 1 zipped file with the following high-quality files: \n\n+ 120 SVG files (Includes All + Separate) \n+ 1 EPS file (Includes All) \n+ 120 PDF files (Includes All + Separate) \n+ 120 PNG files (Includes All + Separate) \n\nPerfect for Cricut or Silhouette projects to make t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, print n’ cuts & more!",
      "targetAudience": [
        {
          "targetAudience": "Dog owners and enthusiasts",
          "useCase": "Creating custom designs featuring paw prints and dog-related motifs for personal use, gifts, or small-scale commercial projects"
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Incorporating paw print designs into handmade items such as t-shirts, mugs, cards, and home decor for personal enjoyment or small-scale sales"
        },
        {
          "targetAudience": "Small business owners and entrepreneurs",
          "useCase": "Using the designs to create products for sale in online marketplaces or physical storefronts, catering to dog lovers and craft enthusiasts"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1523224267/paw-print-svg-bundle-paw-heart-svg-dog?click_key=f0c8360f3f26c91a6a4f86dfcb2830d8762f44b1%3A1523224267&click_sum=178a28ea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-12&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:42:50.680911",
      "productId": "fSjerdcjlp"
    }
  },
  {
    "data": {
      "product": "Valentine's Day Calendar Print",
      "description": "This is a digital product that can be used to create a personalized calendar print for Valentine's Day or other special occasions. The template can be edited in Canva to customize the text, fonts, colors, and backgrounds. The final product can be downloaded in PNG, JPEG, or PDF format and used digitally or printed.",
      "targetAudience": [
        {
          "targetAudience": "Couples celebrating their wedding anniversary or Valentine's Day",
          "useCase": "They can use the editable calendar to create a personalized keepsake that commemorates their special date, serving as a thoughtful and romantic gift."
        },
        {
          "targetAudience": "Individuals seeking a unique and thoughtful gift for their significant other",
          "useCase": "They can customize the calendar with meaningful photos and messages, making it a cherished memento that symbolizes their love and appreciation."
        },
        {
          "targetAudience": "Design-savvy individuals or small businesses",
          "useCase": "They can leverage the template's versatility to create eye-catching promotional materials or event announcements, adding a touch of elegance and personalization to their marketing efforts."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1649559018/canva-editable-valentines-day-calendar?click_key=c93572ea163081871975d8f23f202ea0a1b796c2%3A1649559018&click_sum=c890a0a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-13&dd=1",
      "dateCreated": "2024-02-20T14:43:00.193184",
      "productId": "NhhdBuwOrh"
    }
  },
  {
    "data": {
      "product": "Custom order",
      "description": "Please do not buy before contacting. Sample color and quality all good. Great service. Thanks soo much Dasha. 🥰🥰 This seller went out of her way to make sure a mistake i made on a custom order was corrected. I was VERY grateful. I will definitely purchase again! Thanks soo much Lisa.  🥰🥰 customer satisfaction is my priority Fast delivery and good quality sample because it was large and easy to view in the room. Thank you One of my panels tore.  They sent me a new one.  That is amazing customer service !",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking custom-made products",
          "useCase": "The product allows customers to request specific designs or modifications, catering to their unique needs and preferences."
        },
        {
          "targetAudience": "Designers and artists",
          "useCase": "The product provides a platform for designers to showcase their work and offer custom creations to clients."
        },
        {
          "targetAudience": "Businesses seeking personalized merchandise",
          "useCase": "The product enables businesses to create branded items or promotional materials that align with their specific marketing strategies and brand identity."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1494919926/custom-order?click_key=355217b3f77fac22476b29c8b7097973cf0b6c71%3A1494919926&click_sum=d1d3abad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-14&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:43:09.343511",
      "productId": "gaXnjJYwoN"
    }
  },
  {
    "data": {
      "product": "Taylor Swift The Eras Tour 2023 Bundle Png, Taylor Swift Png, TS Swiftie Concert Png, Taylor Swiftie Png, Taylor Swiftie Eras PNG, Bundle",
      "description": "Welcome to HappyNewsCrafts, where you'll discover an exceptional selection of SVG and PNG files for your crafting needs! Our collection offers a diverse range of designs that are compatible with Cricut machines and other crafting tools.\n♡ What's Included:\n♡ PNG File: These high-resolution raster images provide vibrant graphics, ideal for incorporating photographs, artwork, and detailed designs into your projects.\n♡ How to Download:\nYou will receive an email from Etsy with a link to your downloads immediately after purchase. This will be sent to your Etsy account email. You should receive the email for a few minutes. If not, please check in your spam folder. All of the listing downloads will also be available in your purchase history. Files can be downloaded instantly. Please make sure the files listed above will work with your machine and software before purchase.\n♡ Terms Of Use:\n- Unlimited Personal use.\n- Not to be resold as any type of digital download.\n♡ If you want to physically sell the product, you must get my commercial license from below link;\nhttps://www.etsy.com/listing/1524642586/commercial-license-for-all-designs-whole\n♡ Don't forget to check out the whole store package from below link to get all my products in my store and all my future products;\nhttps://www.etsy.com/listing/1538813669/happynewscrafts-whole-entire-shop-svg\nWe're dedicated to providing a seamless experience, so if you have any questions or need assistance, please don't hesitate to reach out. Start exploring our collection now and let your imagination soar with our versatile SVG and PNG files!\nTaylor Swift The Eras Tour 2023 Png | Taylor Swift Png | TS Swiftie Concert Png | Taylor Swiftie Png | Taylor Swiftie Eras PNG\nswiftie png,taylor lover pne,taylor swiftie eras,taylor png,the eras tour png,taylorswiftpng,the eras tour 2023,the eras tour,taylor swift png,swiftie concert,taylor swiftie png,taylor fan gift,taylor fan png",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts who enjoy creating personalized items using digital designs.",
          "useCase": "They can use the SVG and PNG files to design and create unique crafts, such as t-shirts, mugs, home décor, and more."
        },
        {
          "targetAudience": "Fans of Taylor Swift who want to express their support and connect with other fans.",
          "useCase": "They can use the Taylor Swift-themed designs to create custom merchandise, such as posters, stickers, or fan art."
        },
        {
          "targetAudience": "Small business owners or entrepreneurs who sell handmade or digital products.",
          "useCase": "They can purchase a commercial license to use the designs for commercial purposes, such as creating and selling physical products or digital downloads."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665630928/taylor-swift-the-eras-tour-2023-bundle?click_key=aba077c86afba935573d4f5874422158510167a1%3A1665630928&click_sum=7567a403&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-15&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:43:26.333675",
      "productId": "MCgTKUqfFw"
    }
  },
  {
    "data": {
      "product": "The Lakes Poster",
      "description": "A printable wall art digital download that can be printed at home. It features a subtle Swiftie aesthetic home decor design. Customers are responsible for printing the item in the size of their choice. Upon purchase, customers will receive an instant high-resolution ZIP file download containing JPGs. The download includes 6 versions of the same print, each in a different size that correlates with your desired print size. Along with the 6 prints, you will receive a ‘How To Print’ document that will go into the sizing and printing process in more detail. Each ratio is offered with a number of different size print options: 4:5 Ratio: 4”x5”, 8”x10”, 12”x15”, 16”x20”, 3:4 Ratio: 6”x8”, 9”x12”, 12”x16”, 15”x20”, 18”x24”, 2:3 Ratio: 4”x6”, 8”x12”, 12”x18”, 16”x24”, 20”x30”, 24”x36”, 5”x7” = 5”x7”, 11”x14” = 11”x14”, A = A1, A2, A3, A4, A5, A6 Poster Sizes. The customer is responsible for the printing of their digital download. It is highly recommended that for the best results you print your poster professionally. Home printing is possible, but please be aware that the quality will not be as good. Some professional online printing suggestions: Snapfish, Vista print, Photobox, and Shuttersfly. You can also save the file to USB and take it into your local print store. Please be aware that color can vary once the product is printed depending on the monitor/printer/paper used.",
      "targetAudience": [
        {
          "targetAudience": "Fans of Taylor Swift",
          "useCase": "Decorating their homes with subtle references to their favorite artist."
        },
        {
          "targetAudience": "Individuals interested in minimalist and aesthetically pleasing home decor",
          "useCase": "Adding a touch of sophistication and style to their living spaces."
        },
        {
          "targetAudience": "People looking for printable wall art that is easy to download and print at home",
          "useCase": "Creating custom artwork for their walls without the need for professional printing services."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1588333929/the-lakes-poster-printable-wall-art?click_key=25ce33b4b9b627e746a946cc20296dbdbb8dbd8e%3A1588333929&click_sum=6c2d9b3e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-16&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:43:53.530944",
      "productId": "eUrLzhLxqM"
    }
  },
  {
    "data": {
      "product": "Digital print of Jesus as the Shepherd leaving the 99 other to save the one wandering, Jesus Good Shepherd Wall Art",
      "description": "This is a hand-drawn digital print of Jesus as the Shepherd leaving the 99 other to save the one wandering. It is based on the passages Luke 15:4-7 and John 10. The print is available for immediate download in four different ratios (2x3, 3x4, 4x5, and 11x14) and two different color modes (CMYK and RGB). It is recommended to print the design using high-quality paper that is white and matte for the most visually appealing final results.",
      "targetAudience": [
        {
          "targetAudience": "Christian art enthusiasts",
          "useCase": "Decorating their homes with visually stunning and meaningful artwork that reflects their faith."
        },
        {
          "targetAudience": "Individuals seeking unique and personalized gifts",
          "useCase": "Presenting loved ones with a thoughtful and inspiring piece of art that can be cherished for years to come."
        },
        {
          "targetAudience": "Pastors, teachers, and religious leaders",
          "useCase": "Using the artwork as a visual aid for sermons, presentations, or religious education lessons."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1145828694/jesus-leaves-the-99-digital-print-jesus?click_key=b810f9fd0320197d9b5e228368aa052e5c117d99%3A1145828694&click_sum=a6298279&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-17&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:44:10.376962",
      "productId": "auPRBbZLas"
    }
  },
  {
    "data": {
      "product": "Envato Elements Download Package",
      "description": "🚀 Envato Elements Download Package - Fast and Licensed Downloads 🚀\n\n✨ Welcome! Step into the world of the Envato Elements Download Package and unleash your creativity without limits. ✨\n\n🔹 Speed and Convenience: Download the creative content you need instantly! No waiting in line, enjoy downloads within seconds.\n🔹 Full License Access: Licenses for the downloaded files are included! Use them in your projects without worries.\n\n🌟 Package Options:\n👉 1-Month Package\n👉 30 Days Usage Period\n👉 50 Downloads per Day\n👉 750 Downloads in Total.\n\n🎨 What Types of Content Are Included?\n🎥 Video Templates\n🎨 Graphic Designs\n📸 Stock Photos\n🎶 Music and Sound Effects\n📝 Web Templates, and More\n\n📦 Buy Now: Get acquainted with the Envato Elements Download Package, inspiring your creativity. Elevate your projects to the next level. Savor the taste of limitless creativity!\n\n📩 If you have any questions, feel free to send us a message. We're here for you!\n\nDiscover the Envato Elements Download Package to accelerate your creative projects in the digital content world. Unleash your creativity! 💡",
      "targetAudience": [
        {
          "targetAudience": "Content creators and designers looking for a convenient and fast way to access high-quality creative assets.",
          "useCase": "Downloading and using licensed video templates, graphic designs, stock photos, music, sound effects, and web templates to create and enhance their projects."
        },
        {
          "targetAudience": "Professionals and businesses that need to quickly and efficiently acquire digital content for marketing, advertising, and other purposes.",
          "useCase": "Purchasing a 1-month package to download up to 750 pieces of content, including videos, images, and audio files, for use in their marketing campaigns and presentations."
        },
        {
          "targetAudience": "Students and individuals with limited budgets who need access to professional-quality creative assets for personal or educational projects.",
          "useCase": "Utilizing the 1-month package to download a variety of creative content for use in school assignments, personal blogs, or social media posts."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1585218956/envato-elements-download-service-1-month?click_key=5508c66542ff44a2688b57e570e49ae1539d4d6f%3A1585218956&click_sum=8db48212&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-18&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:44:26.149945",
      "productId": "txsVQrxgUv"
    }
  },
  {
    "data": {
      "product": "Clean 1989 Poster",
      "description": "Printable Wall Art | Digital Download Print at Home | Subtle Swiftie Aesthetic Home Decor",
      "targetAudience": [
        {
          "targetAudience": "Fans of Taylor Swift looking to add subtle and stylish Taylor Swift-inspired décor to their homes.",
          "useCase": "Displaying the print in a frame on a wall as a subtle nod to their appreciation for Taylor Swift."
        },
        {
          "targetAudience": "Individuals seeking minimalist and aesthetically pleasing wall art for their homes or offices.",
          "useCase": "Using the print as a standalone piece or as part of a gallery wall to enhance the overall ambiance of a space."
        },
        {
          "targetAudience": "Persons who appreciate digital downloads and printable art for its convenience and affordability.",
          "useCase": "Easily downloading and printing the poster at home or through a professional printing service to create a personalized and budget-friendly wall decoration."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1670924087/clean-1989-poster-printable-wall-art?click_key=4577f2183b61325188fe3149ae31541412be9255%3A1670924087&click_sum=671012e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-19&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:44:38.291283",
      "productId": "OvmwxQbpPn"
    }
  },
  {
    "data": {
      "product": "Loving Them With You Poem for your partner",
      "description": "Appreciation piece for your partner when you're in the trenches.\n(versions mother & father, two mothers & him / her within the one download)\n\n*please respect my work by not forwarding it onto friends for multiple uses x\nThis poem is 8 by 10 inch.\nThese are not to be onsold and are copyrighted as my words.\nDigital high resolution download will not have watermark. See your emails for your pdf download.\nKeep a look out for more poems and extracts added weekly.\nPoetry books and Greeting Cards sold here: www.jessicaurlichs.com\n* I charge a one off small fee for commercial use of my Etsy Prints per poem, please email me on  jess [!at]滸urlichs.com to find out more.",
      "targetAudience": [
        {
          "targetAudience": "Couples in romantic relationships",
          "useCase": "Expressing appreciation and affection for one's partner, especially during challenging times"
        },
        {
          "targetAudience": "Parents",
          "useCase": "Appreciating the bond with their children, particularly in the context of motherhood or fatherhood"
        },
        {
          "targetAudience": "Individuals seeking inspiration or emotional connection",
          "useCase": "Finding solace, inspiration, or a sense of connection through the words and sentiments expressed in the poem"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1400320341/loving-them-with-you-poem-for-your?click_key=d95eef46db594194270a955345a34338650edc6f%3A1400320341&click_sum=7bb33dd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-20&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:44:48.348528",
      "productId": "mPGvmExUNH"
    }
  },
  {
    "data": {
      "product": "Chocolate Lollipop Template",
      "description": "Chocolate Lollipop Template in AI, BMP, DXF, JPG, PNG, SVG format. Gift Design in letter size PNG format. Ready to customize and print. Cutting can be done on a machine or by hand. This digital file includes no advice and cannot be resold, shared, or copied. Create your own designs and share them with us.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and hobbyists interested in creating custom chocolate lollipops for parties or other events.",
          "useCase": "Using the template to design and create unique chocolate lollipops that can be customized with different colors, flavors, and decorations."
        },
        {
          "targetAudience": "Small businesses or entrepreneurs looking to create and sell custom chocolate lollipops.",
          "useCase": "Utilizing the template to develop a range of chocolate lollipop designs that can be marketed and sold to customers."
        },
        {
          "targetAudience": "Individuals who enjoy creating edible art and experimenting with different food crafting techniques.",
          "useCase": "Employing the template as a base for experimenting with various chocolate-working techniques and creating visually appealing chocolate lollipops."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1394859964/clown-chocolate-lollipop-template?click_key=afe4597881c4e8d0a735c9290762383dc19c4113%3A1394859964&click_sum=26e86dad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-21&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:44:56.612848",
      "productId": "DZvew8HEVa"
    }
  },
  {
    "data": {
      "product": "150 Boho Floral Digital Backdrops for Composite Photography, Wedding Backdrop, Maternity Backdrop Overlays, Chiara Arch Backdrops",
      "description": "Elevate your photography with our exquisite collection of 150 Boho Floral Digital Backdrops, specially designed for composite photography. These backdrops infuse a touch of bohemian charm, providing a captivating and artistic ambiance to your photos.\n\nProduct Features:\n- Versatile Selection: This collection comprises 150 digital backdrops featuring boho floral themes, adding a delightful touch of nature to your images.\n- High-Quality Images: Each backdrop boasts a resolution of 5300 x 3500 pixels, ensuring excellent image quality.\n- File Format: All files are provided in high-quality JPG format for your convenience.\n- Instant Download: Gain immediate access to your digital backdrop collection and start enhancing your photos effortlessly.\n- Perfect for Various Occasions: Ideal for composite photography, including weddings, maternity sessions, and artistic overlays.\n\nCompatibility and Usage:\n- Software Compatibility: These digital backdrops are compatible with software like Photoshop, enabling seamless integration into your creative projects.\n- Creative Freedom: Use these backdrops for a wide range of creative purposes, from enhancing your wedding photos to adding a touch of nature to your maternity sessions.",
      "targetAudience": [
        {
          "targetAudience": "Photographers specializing in composite photography, particularly in the bohemian or nature-inspired genres.",
          "useCase": "Using these backdrops to create stunning wedding photos, maternity portraits, and artistic overlays."
        },
        {
          "targetAudience": "Individuals with an appreciation for bohemian aesthetics and natural beauty.",
          "useCase": "Incorporating these backdrops into personal photography projects to evoke a sense of tranquility and connection with nature."
        },
        {
          "targetAudience": "Designers and creative professionals looking to enhance their digital content.",
          "useCase": "Utilizing these backdrops as eye-catching elements in website designs, social media posts, and marketing materials."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1583085373/150-boho-floral-digital-backdrops-for?click_key=78ef0984d2fe77cbee1ea309a7850f643b688a12%3A1583085373&click_sum=7c2b4605&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-22&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:45:12.656857",
      "productId": "FNgfhikapb"
    }
  },
  {
    "data": {
      "product": "Metaphoric Associative Cards",
      "description": "These cards are a coaching and therapy tool that can help you be more creative, gain deep insights, and think in new ways. They are useful for therapists, counselors, designers, teachers, team leaders, and anyone seeking innovative problem-solving methods. They provide new ways to analyze and solve problems.\n\nTo use the cards, select a metaphor that resonates with your focus, challenge, or session objective. Then, explore the metaphor's associations and encourage participants or clients to reflect on its relevance. Watch as fresh insights, unique viewpoints, and innovative ideas emerge, transforming your approach and leading to new experiences.\n\nThe cards are a digital product and include a deck of 65 Metaphorical Associative Cards in digital PNG format. The card size is 7x12 Ratio; Printable version in PDF 7X11 cm.",
      "targetAudience": [
        {
          "targetAudience": "Therapists and counselors",
          "useCase": "Use the cards to help clients explore their thoughts and feelings, identify patterns, and develop new insights."
        },
        {
          "targetAudience": "Designers and teachers",
          "useCase": "Use the cards to generate new ideas, solve problems, and facilitate creative thinking."
        },
        {
          "targetAudience": "Team leaders and anyone seeking innovative problem-solving methods",
          "useCase": "Use the cards to foster collaboration, encourage brainstorming, and develop innovative solutions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1638060836/metaphoric-associative-cards-coaching?click_key=b2f81b2197b23a00a27a7f150ee3da89ea62cb0f%3A1638060836&click_sum=592485ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-23&dd=1",
      "dateCreated": "2024-02-20T14:45:24.848278",
      "productId": "CaRBkYvJVS"
    }
  },
  {
    "data": {
      "product": "P!nk Lyric Album Song Doodle Art Logo PNG Bundle",
      "description": "This PNG is great for creating sublimation products, invitations, framed art, pillows and so much more!",
      "targetAudience": [
        {
          "targetAudience": "Individuals who enjoy creating personalized items, such as sublimation products, invitations, and framed art",
          "useCase": "They can use the PNG bundle to create unique designs that express their creativity and style."
        },
        {
          "targetAudience": "Small business owners who sell handmade items",
          "useCase": "They can use the PNG bundle to create high-quality products that will appeal to their customers and help them grow their business."
        },
        {
          "targetAudience": "Designers and artists who create digital products",
          "useCase": "They can use the PNG bundle to create eye-catching graphics for their products, such as website banners, social media posts, and product mockups."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665392439/pnk-lyric-album-song-doodle-art-logo-png?click_key=0fa2b42741a81f06ec429743eed29320b43dbd6e%3A1665392439&click_sum=e9f76cf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-24&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:45:38.808654",
      "productId": "nEWpjdvpVi"
    }
  },
  {
    "data": {
      "product": "P!nk Lyric Album Song Doodle Art Logo PNG Bundle",
      "description": "This PNG is great for creating sublimation products, invitations, framed art, pillows and so much more!",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Creating personalized T-shirts, mugs, and other sublimation products for personal use or small-scale sale."
        },
        {
          "targetAudience": "Graphic designers and artists",
          "useCase": "Incorporating the PNG design into their own digital creations, such as invitations, printables, and social media graphics."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Using the PNG design to create products for their customers, such as printed T-shirts, mugs, and accessories."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665392439/pnk-lyric-album-song-doodle-art-logo-png?click_key=0fa2b42741a81f06ec429743eed29320b43dbd6e%3A1665392439&click_sum=e9f76cf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-24&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:11:00.981019",
      "productId": "nEWpjdvpVi"
    }
  },
  {
    "data": {
      "product": "P!nk Lyric Doodle Art PNG",
      "description": "This is a DIGITAL file of a printable PNG download - no physical product will be sent!\nPNGs are 300dpi and are sent as finished files and are not for editing.\nThis is not an SVG file and cannot be used as one.\nThis PNG is great for creating sublimation products, invitations, framed art, pillows and so much more!\n\nWhat You Will Receive\nYou will receive a digital download in PNG format. It will be compressed into a ZIP file.\nNo watermark will be on your download.\n300 DPI resolution\nTransparent background\nPlease note that every effort has been made to represent the true colors of this file. However, resolution and final colors may vary from screen to screen and printer to printer.\nUpon purchase your file(s) are sent to you via Etsy's \"instant delivery\" system. Once your payment has cleared, your downloads will be available under You>Purchases and Reviews.\n\nInformation - Please Read\nThis digital download is for personal and small business use only. Mass production is not allowed.\nPlease remember to credit TrendySVGs in your listings or on your item description or website.\nYou are not allowed to sell transfers without the purchase of a commercial license. If you would like to sell transfers please message me!\nAll of the designs we create are original, one of a kind pieces of art. They are protected by copyright upon creation.\n\nPlease Do Not:\nChange or alter the design in any way.\nClaim our design as your own.\nGift, share, or sell the digital file. Each person using this design must have their own purchase.\nUpload the digital file to any sharing site.\nCopy or create items which look very similar to this design in order to get around these policies.\nOutsource your items to be created using the design such as through a print on demand company. All products must be created in house.\nSell printed transfers without a commercial license. If you would like to sell printed transfers you must purchase our commercial license. Please message us for this information.\n\nWe do not offer refunds for digital downloads.",
      "targetAudience": [
        {
          "targetAudience": "People interested in creating custom sublimation products, such as shirts, pillows, and invitations",
          "useCase": "They can use the PNG file to print their designs onto these products."
        },
        {
          "targetAudience": "Artists and designers",
          "useCase": "They can use the PNG file to create framed art prints or other digital products."
        },
        {
          "targetAudience": "People who want to create unique and personalized gifts",
          "useCase": "They can use the PNG file to print their designs onto items such as mugs, phone cases, or tote bags."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665392439/pnk-lyric-album-song-doodle-art-logo-png?click_key=0fa2b42741a81f06ec429743eed29320b43dbd6e%3A1665392439&click_sum=e9f76cf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-24&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:11:52.481515",
      "productId": "nEWpjdvpVi"
    }
  },
  {
    "data": {
      "product": "My varnished feet in pretty black heeled sandals",
      "description": "Here's a collection of photos of my feet wearing pretty black heeled sandals. There are 5 high-quality photos, including the one on the cover, which should catch the eye of any foot lover. They will be delivered to you directly after purchase.You won't be disappointed!",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in foot-related content",
          "useCase": "Exploring a collection of high-quality photos of feet wearing sandals"
        },
        {
          "targetAudience": "Adults over the age of 18",
          "useCase": "Enjoying content that may be considered mature or suggestive"
        },
        {
          "targetAudience": "Individuals seeking a discrete form of entertainment",
          "useCase": "Accessing the product through a private and secure platform"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1678789453/my-varnished-feet-in-pretty-black-heeled?click_key=c9247aba3abdbb0240243f1865bb05c3d63e8918%3A1678789453&click_sum=e2d18195&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-25&dd=1",
      "dateCreated": "2024-02-20T20:12:20.712755",
      "productId": "mFUqZKsXNB"
    }
  },
  {
    "data": {
      "product": "Fleabag Priest Quote Poster",
      "description": "High Quality + Can be printed in any size!\nOriginal Size: A2\nArtwork hand-drawn and designed by me!\nINSTANT DOWNLOAD- This listing is for a digital download only. No physical product will be included.- You will receive 1 PNG file.\nUpon purchase you will receive a link to download the design file/page!\n---- File is for personal use only.- Commercial use and distributing/sharing is prohibited.---",
      "targetAudience": [
        {
          "targetAudience": "Fans of the TV show \"Fleabag\"",
          "useCase": "Displaying their love for the show in their home décor"
        },
        {
          "targetAudience": "Individuals interested in monochrome and retro art",
          "useCase": "Adding a stylish and eye-catching piece to their home décor"
        },
        {
          "targetAudience": "Those seeking a unique and meaningful gift",
          "useCase": "Gifting the poster to a loved one who appreciates thoughtful and personalized presents"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1457663223/fleabag-priest-quote-poster-typography?click_key=cea504ce9966f89ecde420081b98d4902f016a83%3A1457663223&click_sum=043fe4bf&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-26&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T20:12:29.213801",
      "productId": "tVXeDWGAcy"
    }
  },
  {
    "data": {
      "product": "Custom Movie Poster Template for Canva",
      "description": "Create your own movie poster with our fun Canva template. It's easy, customizable, and perfect for any event!\n\n**Features:**\n\n* Free Canva Version Friendly: No pro account? No problem! Edit with ease.\n* Totally Customizable: Play with text, colors, and graphics. Make it yours!\n* Unique Gift: Delight friends and family with this creative, personalized present.\n* Digital Download: Get your template instantly, no waiting for shipping.\n* What You Get: Links to various editable poster styles. Choose and create!\n* Any Size You Need: Just tell us in the personalization box or message.\n\n**Note:**\n\n* Best on Canva's Desktop version.\n* For personal use only. Please don't resell or redistribute.",
      "targetAudience": [
        {
          "targetAudience": "Movie enthusiasts and creatives",
          "useCase": "Creating personalized movie posters for special occasions or as a unique gift for movie buffs."
        },
        {
          "targetAudience": "Event planners and marketers",
          "useCase": "Creating eye-catching and customizable posters for promoting events, parties, or special campaigns."
        },
        {
          "targetAudience": "Couples and individuals seeking personalized gifts",
          "useCase": "Creating meaningful and romantic movie posters to commemorate special moments or express love and affection."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1647343870/custom-movie-poster-template-for-canva?click_key=0f6011c5e1dcdfcba7a4e69c86083b5937f48911%3A1647343870&click_sum=485c52f1&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-27&pro=1&dd=1",
      "dateCreated": "2024-02-20T20:12:41.436398",
      "productId": "EyumFJmvn8"
    }
  },
  {
    "data": {
      "product": "Paper Cup Wrapper Template Bundle",
      "description": "This listing includes of:4, 8, 9, 12, 16 Paper Cup Wrapper Template SVG File4, 8, 9, 12, 16 Paper Cup Wrapper Template PNG File (300 DPI High Resolution)4, 8, 9, 12, 16 Paper Cup Wrapper Template EPS File4, 8, 9, 12, 16 Paper Cup Wrapper Template PDF File4, 8, 9, 12, 16 Paper Cup Wrapper TemplateDXF File4, 8, 9, 12, 16 Paper Cup Wrapper Template PSD File* SVG files are vector file and can be resized larger or smaller without losing it's quality.Each template in this package is meticulously crafted to fit the following cup sizes:4oz Paper Cup Wrapper Template8oz Paper Cup Wrapper Template9oz Paper Cup Wrapper Template12oz Paper Cup Wrapper Template16oz Paper Cup Wrapper TemplateRest assured that all dimensions are clearly outlined in the package, allowing you to create precise and professional cup wrappers.We understand the importance of file compatibility, which is why we've included various file formats for your convenience. Each template is provided in the following formats:SVG (Scalable Vector Graphics)PNG (Portable Network Graphics)DXF (Drawing Exchange Format)EPS (Encapsulated PostScript)PSD (Adobe Photoshop Document)PDF (Portable Document Format)With these diverse file extensions at your disposal, you can effortlessly work with the software of your choice and achieve outstanding results.",
      "targetAudience": [
        {
          "targetAudience": "Small business owners",
          "useCase": "Using the templates to create custom cup wrappers for their products, enhancing their brand identity and adding a professional touch to their offerings."
        },
        {
          "targetAudience": "Event planners",
          "useCase": "Leveraging the templates to design unique and personalized cup wrappers for special occasions, such as weddings, parties, or corporate events, adding a memorable touch to the festivities."
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Utilizing the templates to express their creativity by creating custom cup wrappers for personal use, gifts, or small-scale sales, allowing them to explore their artistic side and share their creations with others."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1505793415/paper-cup-wrapper-template-bundle-5?click_key=bd3764c127e6547d400fd384b96172311a3ee919%3A1505793415&click_sum=dea4be34&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-28&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:12:52.732705",
      "productId": "byFwiUZIXF"
    }
  },
  {
    "data": {
      "product": "Gaming PNG Bundle, Roblocks clipart bundle, digital paper, PNG files with transparent background",
      "description": "This listing is for a DIGITAL file of a printable PNG download, which is suitable for use in sublimation or graphic design. \nNo physical product will be shipped to you.\nThis design is a high-resolution PNG file with 300 DPI, which can be easily resized to fit whatever project you require it for. It is not limited to just skinny tumblers, and can be used for a variety of items.\nPlease ensure that you have prior knowledge of sublimation and all the necessary software and equipment before purchasing this listing, as I am unable to offer support on any processes other than my own files if there is an issue.\nIt is important to note that this file is for personal use only, and you are not permitted to forward, share, sell or distribute the file.\nDue to the digital nature of this product, I cannot offer refunds once the file has been downloaded.",
      "targetAudience": [
        {
          "targetAudience": "Graphic designers and artists",
          "useCase": "Creating digital designs, such as logos, posters, and social media graphics, for personal or commercial use."
        },
        {
          "targetAudience": "Small business owners and entrepreneurs",
          "useCase": "Designing marketing materials, such as flyers, brochures, and social media graphics, to promote their businesses."
        },
        {
          "targetAudience": "Hobbyists and crafters",
          "useCase": "Creating personalized items, such as t-shirts, mugs, and home décor, for their own enjoyment or to sell online."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1481418611/gaming-png-bundle-roblocks-clipart?click_key=cebf98dbd54590e9dbc6c98c20d739b4349e5a90%3A1481418611&click_sum=cb955612&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-29&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:13:08.142878",
      "productId": "sHiSDAeTeJ"
    }
  },
  {
    "data": {
      "product": "130+ Instagram Story Stickers xxl Edition Mixed Basic Daily Mix Bundle Elements Lettering Storysticker family love png",
      "description": "Included are 136 digital hand-drawn stickers for your Instagram Story for Android and IOS.\nCharacteristics:\n✓ high quality\n✓ easy to use\n✓ Sizes scalable\n✓ versatile\nCan be used in a variety of ways in your Instagram story - whether as a video or photo.\nDownload directly after purchase and add to your Instagram story!\nInstructions for installing and using the stickers are available as a link after purchase.\nFeel free to write to me if you have any questions or suggestions.\n#Instasticker #Storysticker #Instagram #Elements #Frames # Brushstrokes #Fashion #Pets #sticker #food #travel",
      "targetAudience": [
        {
          "targetAudience": "Instagram users who want to add visual interest to their stories",
          "useCase": "Using the stickers to enhance photos and videos, create eye-catching effects, or add personalized touches to their stories."
        },
        {
          "targetAudience": "Content creators who want to engage their followers and make their stories more interactive",
          "useCase": "Utilizing the stickers to encourage viewer participation, run polls, or create quizzes."
        },
        {
          "targetAudience": "Businesses and influencers who want to promote their brand or products on Instagram",
          "useCase": "Incorporating the stickers into their stories to showcase products, offer discounts, or run contests."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1002593529/130-instagram-story-stickers-xxl-edition?click_key=b78f5b0b9de97688d8743d191bee34d023eb4184%3A1002593529&click_sum=10d54563&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-30&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T20:13:17.275543",
      "productId": "sqmGFYQcCE"
    }
  },
  {
    "data": {
      "product": "400+ Add Your Own Photo Tumbler Wrap Bundle",
      "description": "This bundle includes 400+ PNG files that can be used to create custom 20 oz sublimation tumblers. The files are high resolution (300 dpi) and measure 9.3\" x 8.2\". The designs are editable in Canva, so you can easily add your own photos and text. The bundle also includes a PDF file with instructions on how to use the files.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts who enjoy creating personalized gifts or home décor",
          "useCase": "Using the tumbler wraps to create custom tumblers with their own photos or designs, for personal use or as gifts"
        },
        {
          "targetAudience": "Small business owners who offer sublimation printing services",
          "useCase": "Using the tumbler wraps to create custom tumblers for their customers, offering a unique and personalized product"
        },
        {
          "targetAudience": "Photographers and graphic designers",
          "useCase": "Using the tumbler wraps to create tumblers featuring their own photography or designs, as a way to showcase their work and offer a tangible product to their clients"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1653702262/400-add-your-own-photo-tumbler-wrap?click_key=90dcc37a6823fe4ec49b0147405d64d8596461d2%3A1653702262&click_sum=2bed3b51&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-31&pro=1&dd=1",
      "dateCreated": "2024-02-20T20:13:25.370309",
      "productId": "PnmnPfdZve"
    }
  },
  {
    "data": {
      "product": "Cartoon Easter Glass Can",
      "description": "This is a 16oz glass can with a retro Easter egg tumbler wrap design. It is a digital download, so no physical product will be mailed. The file can be unzipped by pressing and holding (or right-clicking) the folder, selecting EXTRACT ALL, and following the instructions. To open a PDF file, you can open it in a web browser and click the \"download\" button to redirect to the folder containing the file. Refunds are not offered for this product, but if you encounter any issues with your download, please inform the seller and they will make every effort to help you resolve the problem.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in Easter-themed home decor",
          "useCase": "Using the glass can as a decorative piece for Easter celebrations"
        },
        {
          "targetAudience": "People looking for unique drinkware",
          "useCase": "Utilizing the glass can for serving beverages during parties or gatherings"
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Employing the digital download to create personalized Easter-themed gifts or decorations"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1680045651/cartoon-easter-glass-can-easter-libbey?click_key=f223965cadc707e3a2e5f5d5d2a191e5a2f28cc5%3A1680045651&click_sum=d2abd5c3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-32&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T20:13:33.250804",
      "productId": "ITAhrxjZue"
    }
  },
  {
    "data": {
      "product": "Book Valet Tray",
      "description": "Our \"Well Read Woman\" book Stand digital file is perfect to add to your laser shop or for your personal use.\nThe file is easy to use, cut, stain and prepare for your customers. This is truly a unique item for all book lovers.\nThe finished product measures 10.5 x 8 x 5.5.\nSlots and design are made for 3mm material.\nFiles included\nAI\nSVG\nPNG\nThis is a digital item. No physical product will be shipped.\nDue to this being a digital product, no refunds will be given. If you have any questions or problems please reach out to me. We would love to make sure you are happy with your product.\nIf you would like the physical product, we also carry that in our shop under the gift section.",
      "targetAudience": [
        {
          "targetAudience": "Book lovers",
          "useCase": "To display and organize their favorite books in a stylish and convenient way."
        },
        {
          "targetAudience": "Artists and craftspeople",
          "useCase": "To create and sell unique book valet trays as gifts or for personal use."
        },
        {
          "targetAudience": "Teachers",
          "useCase": "To create personalized book valet trays as gifts for students or to use in the classroom."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1677120753/book-valet-tray-digital-file-wooden-book?click_key=40eab798572add23161479c7232617cc760a30f7%3A1677120753&click_sum=faabc290&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-33&pro=1&dd=1",
      "dateCreated": "2024-02-20T20:13:43.592820",
      "productId": "OFflqNg7eh"
    }
  },
  {
    "data": {
      "product": "Manana sera mas bonito KAROL G svg png",
      "description": "It is the responsibility of the purchaser to make sure they have the knowledge and the right machines, equipment and software to use this format.\nThis is an INSTANT DIGITAL DOWNLOAD. No physical products will be shipped to the purchaser.\nNO PHYSICAL ITEMS OR PRODUCT WILL BE DELIVERED.\nNO REFUNDS WILL BE GIVEN.\nONCE YOU PURCHASE ITEM IT WILL AUTOMATICALLY BE DELIVERED TO YOUR EMAIL.\nIf you do not receive email delivery, go to your profile and scroll down to purchase, select item you want to see and click on it, you will have the option to download again.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in creating custom clothing or accessories featuring the artwork of KAROL G",
          "useCase": "Creating t-shirts, hoodies, phone cases, or other items with the Manana sera mas bonito design."
        },
        {
          "targetAudience": "Graphic designers or crafters looking for high-quality SVG or PNG files to use in their projects",
          "useCase": "Incorporating the Manana sera mas bonito design into digital or physical creations, such as posters, invitations, or home décor."
        },
        {
          "targetAudience": "Fans of KAROL G who want to show their support and express their appreciation for her music",
          "useCase": "Using the Manana sera mas bonito design as a way to connect with other fans and celebrate their shared passion for her work."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1601945751/manana-sera-mas-bonito-karol-g-svg-png?click_key=604b550a3fa60ddbdecae8a73c4208d0cfe733e0%3A1601945751&click_sum=439c049c&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-34&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:13:54.037736",
      "productId": "cORPrQWbAx"
    }
  },
  {
    "data": {
      "product": "set of 3 Bauhaus minimalistic art, boho style printable, boho wall decor, line abstract art, cozy color relaxing wall print, soft colors",
      "description": "This digital product supports printing in five key aspect ratios, enabling compatibility with a wide range of frame sizes. Below are the recommended print sizes for each ratio, provided in both inches and centimeters:\n2:3 Ratio:\n4x6 inches (10.16x15.24 cm)\n8x12 inches (20.32x30.48 cm)\n12x18 inches (30.48x45.72 cm)\n16x24 inches (40.64x60.96 cm)\n20x30 inches (50.8x76.2 cm)\n24x36 inches (60.96x91.44 cm)\n3:4 Ratio:\n6x8 inches (15.24x20.32 cm)\n9x12 inches (22.86x30.48 cm)\n12x16 inches (30.48x40.64 cm)\n15x20 inches (38.1x50.8 cm)\n18x24 inches (45.72x60.96 cm)\n4:5 Ratio:\n8x10 inches (20.32x25.4 cm)\n16x20 inches (40.64x50.8 cm)\n24x30 inches (60.96x76.2 cm)\n11:14 Ratio:\n11x14 inches (27.94x35.56 cm)\n22x28 inches (55.88x71.12 cm)\nISO (International Standard Sizes) Ratio:\nA5 (14.8x21 cm)\nA4 (21x29.7 cm)\nA3 (29.7x42 cm)\nA2 (42x59.4 cm)\nA1 (59.4x84.1 cm)\nWith your purchase, you'll receive 5 Files within every file there is three high-resolution JPEGs (300 x 300 dpi) with 5 different ratios, allowing for high-quality prints either at home or through esteemed printing services such as Costco, Walmart, Walgreens, Shutterfly, Staples, Office Depot, CVS, and more, offering both convenience and rapid service.\nAdditional Information:\nThis item is available as an instant download; no physical items will be dispatched. The artwork provided in this design has been created personal use only; it cannot be utilized for commercial purposes.\nShould you require a custom-sized file, please don't hesitate to get in touch with the me.",
      "targetAudience": [
        {
          "targetAudience": "Art enthusiasts looking to add a touch of bohemian minimalism to their home decor.",
          "useCase": "Using the prints to create a relaxing and inviting atmosphere in their living room or bedroom."
        },
        {
          "targetAudience": "Interior designers seeking unique and stylish wall art for their clients.",
          "useCase": "Incorporating the prints into a cohesive design scheme that reflects the client's personal style."
        },
        {
          "targetAudience": "Individuals who appreciate abstract and calming artwork.",
          "useCase": "Displaying the prints in their office or workspace to promote a sense of tranquility and creativity."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1664696422/set-of-3-bauhaus-minimalistic-art-boho?click_key=812c72359a4aa4909887ca6650296e9932c8dd37%3A1664696422&click_sum=5d2fdb27&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-35&pro=1&dd=1",
      "dateCreated": "2024-02-20T20:14:15.134668",
      "productId": "YMVdAjVXBS"
    }
  },
  {
    "data": {
      "product": "Border Wall Art",
      "description": "This digital artwork, rendered in a wall art style, is a delightful addition to any dog lover's collection. It features a Border Collie indulging in a moment of solitude, catching up on the latest news in a bathroom.",
      "targetAudience": [
        {
          "targetAudience": "Dog lovers",
          "useCase": "Decorating their homes with whimsical and charming artwork featuring their beloved pets."
        },
        {
          "targetAudience": "Individuals seeking unique and humorous bathroom decor",
          "useCase": "Adding a touch of personality and lightheartedness to their personal spaces."
        },
        {
          "targetAudience": "People who appreciate printable digital art",
          "useCase": "Creating affordable and customizable home decor that reflects their personal style and interests."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1668562675/border-terrier-wall-art-funny-bathroom?click_key=bc019f935b71495a5b7463050e4c3f994ebf836a%3A1668562675&click_sum=b7abe037&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-36&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T20:14:25.888262",
      "productId": "AlDhZPWtiL"
    }
  },
  {
    "data": {
      "product": "4 PNG Stitch Splash and Watercolor Digital design PNG file for sublimation",
      "description": "Stitch watercolor and splash 4 PNG - Stitch Clipart - Digital Downloadpopular shirt png Christmas -Valentine PNG, Christmas -Sublimaton, Shirt Design popular png for shirts\n\nResolution : 4096 × 4096 px and Print size : 13.65 × 13.65″ inches (34.7 × 34.7 cm) · 300 DPI Transparent High quality 4png",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in creating personalized merchandise, such as t-shirts, mugs, and other items, featuring the popular Disney character Stitch",
          "useCase": "The high-resolution PNG files can be used for sublimation printing, allowing users to easily create custom designs with vibrant colors and sharp details."
        },
        {
          "targetAudience": "Crafters and designers looking for digital artwork to incorporate into their projects",
          "useCase": "The transparent PNG format provides versatility for use in various design software, enabling users to create unique compositions and printables."
        },
        {
          "targetAudience": "Fans of Stitch and Disney merchandise collectors",
          "useCase": "The PNG files can be used to create custom prints, posters, or other decorative items featuring their favorite character, adding a touch of nostalgia and personality to their living spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1680220207/4-png-stitch-splash-and-watercolor?click_key=503b9dcfd835ec1cdd7d52d29ee507c114d5c460%3A1680220207&click_sum=678bf2ec&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-37&pro=1&dd=1",
      "dateCreated": "2024-02-20T20:14:36.553808",
      "productId": "oopZtObICP"
    }
  },
  {
    "data": {
      "product": "Animated Black and White Stream overlays package for Twitch, Youtube, OBS, Streamlabs in topographic dark style",
      "description": "Animated Black and White Twitch Overlay Package with futuristic lines animation. Black and white Aesthetically pleasing stream package.\nYou will get a txt/pdf file with link inside for a google drive folder, where you can download the package.\nPackage includes:\n✔ 4 Intermission Screens 16:9, 1920x1080:\nJust chatting, 16x9 webcam, 4x3 webcam, and one 1920x1080px fullscreen overlay for 21:9 screen.\n✔ Animated waiting screens:\n-STARTING (animated + static)\n-PAUSE (animated + static)\n-ENDING (animated + static)\n-OFFLINE (animated + static)\n✔ Animated + Static alerts (12+ files):\n- donation\n- Bits\n- New sub\n- New follower\n- Raid\n- Resub\n- Merch\n- Gifted sub\n- Host\n- New cheer\n-Tips\n- Prime sub\n✔ Twitch Panels (50+):\n- About\n- Commands\n- Devices\n- Discord\n- Donate\n- Facebook\n- Instagram\n- Links\n- Music\n- Partners\n- PC specs\n- Rules\n- Schedule\n-Subscribe\n- Tiktok\n- Top donate\n- Twitter\n- Youtube\n- [blank]\nEnd more panels\n✔ Separate elements to specify your scenes in obs\n✔ 1,3,5 minute timers to add them on screens if you need it\n✔ Stream labels, link bars, frames\n✔ 2 Stinger Transitions (webm)\nA-Z Avatars\nProfile banner (psd+png blank)\nYoutube banner (psd+png blank)\nText emotes pack\nChannel points icons\nFeel free to ask me to add something to this package if something is missing here for your stream.\nI can also add a translation, if you need, write to me.\nVIDEO TUTORIAL HOW TO GET ACCESS AND DOWNLOAD FILES:\nhttps://youtu.be/Wp-NcSrww7k\nPlease note:\nYou add your nickname and links to the screens in obs using the text tool. Icons and text bar are included in the package.\nThe package is suitable for OBS STUDIO and STREAMLABS OBS.\nTWITCH STUDIO is still in beta, the possibility of files not working.\nThis is a premade files package.\nPackage does not include source files. No PSD no AE files.\nThese files are for personal use only.\nFiles may not be edited and redistributed.\nIf you need something added to the package, let me know.\nColor and font changes are not accepted.",
      "targetAudience": [
        {
          "targetAudience": "Twitch streamers and content creators looking to enhance their live streams with visually appealing and animated overlays.",
          "useCase": "Use the overlays to create a professional and engaging streaming environment, attracting and retaining viewers."
        },
        {
          "targetAudience": "Individuals interested in customizing and branding their streaming channels with a cohesive and aesthetically pleasing design.",
          "useCase": "Utilize the overlays to establish a consistent visual identity across all streaming platforms and social media channels."
        },
        {
          "targetAudience": "Streamers who value efficiency and ease of use.",
          "useCase": "Benefit from the pre-made overlays that can be easily integrated into OBS Studio and Streamlabs OBS, saving time and effort in creating custom designs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1591684384/animated-black-and-white-stream-overlays?click_key=c4186f5d088bf79f59d294f3950f9dabdb18bf10%3A1591684384&click_sum=15a10b76&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-38&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T20:14:53.334965",
      "productId": "VelyMJfXIG"
    }
  },
  {
    "data": {
      "product": "Corridos Tumbados SVG, CT Svg, Amor Tumbado Png, Svg, dxf, Cut files for Cricut and Silhouette, instant download, COD026",
      "description": "This is a digital download item that includes 4 SVG files for Cricut Design Space, 4 DXF files for Silhouette Studio Basic Edition, and 4 PNG files with high resolution and transparent background. Please note that this is a digital product and no physical item will be shipped.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Creating personalized items such as shirts, mugs, or home decor with a unique and trendy design."
        },
        {
          "targetAudience": "Small business owners and entrepreneurs",
          "useCase": "Incorporating the design into their products or marketing materials to appeal to a specific audience."
        },
        {
          "targetAudience": "Graphic designers and artists",
          "useCase": "Using the design as an element in their own creative projects or commissions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1618172074/corridos-tumbados-svg-ct-svg-amor?click_key=396b6b92d1d9ad8dbb5ce51c4fb7bea639378139%3A1618172074&click_sum=5cf0d2e9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-39&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:15:00.731688",
      "productId": "JxpqYZJGGi"
    }
  },
  {
    "data": {
      "product": "Printable Templates for Knitted Wire | Tricotin | Flowers | Spring | Butterflies",
      "description": "These printable templates are to help you get a more consistent form with your wire bending process.\n\n**THIS IS NOT A PHYSICAL PRODUCT. DIGITAL DOWNLOAD ONLY**\n\nPrinter friendly.\nNo refunds.",
      "targetAudience": [
        {
          "targetAudience": "Knitting hobbyists and enthusiasts",
          "useCase": "Using the templates to achieve consistent form and patterns in their wire bending projects, enhancing the precision and aesthetics of their knitted wire creations."
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Incorporating the templates into their creative projects, such as making handmade jewelry, home décor, or accessories, adding a touch of unique and personalized style to their creations."
        },
        {
          "targetAudience": "Educators and workshop facilitators",
          "useCase": "Utilizing the templates as teaching aids or references in workshops or classes focused on wire bending, embroidery, or other fiber arts, providing a structured and accessible resource for students."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1483196909/printable-templates-for-knitted-wire?click_key=8cfa1e544069228e488cff8192087824697932ba%3A1483196909&click_sum=9e7a2cc4&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-40&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:15:09.406566",
      "productId": "LVlKdvNTcu"
    }
  },
  {
    "data": {
      "product": "6 Digital Templates Printable Light Templates Download LED Shade Framed templates Bedside Picture 6 DIY Paper Cut Templates for lighting box",
      "description": "This is a digital template for printing light painting or shadow painting. Take note that there is NO PHYSICAL ITEM offered.\nGet the freedom to choose your own frame, led strip lights, and digital templates in our collection of digital light painting templates. Feel the art of adding light to a minimalist interior design line style to enjoy your indoor environment especially at dark moments.\nSIZES AVAILABLE\n2:3 RATIO\n20x10 inches\n16x24 inches\n12x18 inches\n8x12 inches\n5x7 inches\n4x6 inches\n3:4 RATIO\n18x24 inches\n15x20 inches\n12x16 inches\n9x12 inches\n6x8 inches\n3x4 inches\nINSTRUCTIONS\n1. Download the PDF file to access the download link.\n2. Open the link in the PDF file.\n3. Select the aspect ratio.\n4. Select the size.\n5. Select your layer \n3.a. layer-03.png - This should be printed in a solid white paper and the patterns here should be cut as that's where the light will enter.\nb. layer-03-film.png - No need to cut but this should be printed in a transparent film paper.\n6. Gather all materials.\na. Led strip lights.\nb. Picture frame that can accommodate clearance between the light and the prints.\nc. Printed copies of all layers.\n7. Combine the materials.\n8. Enjoy your stylish and beautiful indoor light painting that will light up your dark moments!",
      "targetAudience": [
        {
          "targetAudience": "Creative individuals with an interest in home decor",
          "useCase": "Creating personalized light paintings or shadow paintings to enhance their living spaces with a touch of artistry and illumination."
        },
        {
          "targetAudience": "Interior designers and DIY enthusiasts",
          "useCase": "Incorporating the light templates into their design projects to create unique and visually appealing lighting solutions for clients or personal spaces."
        },
        {
          "targetAudience": "Photography and art enthusiasts",
          "useCase": "Utilizing the templates to create light-based artworks or photography that explores the interplay between light and shadow, adding a creative outlet to their artistic pursuits."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1564876011/6-digital-templates-printable-light?click_key=7091ac57051afc6343c8ec90f18f5e98074fbc41%3A1564876011&click_sum=64f40ae9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-41&dd=1",
      "dateCreated": "2024-02-20T20:15:23.495339",
      "productId": "dEJGTNCnbk"
    }
  },
  {
    "data": {
      "product": "יומן דיגיטלי להתאמה אישית",
      "description": "תוכלו להשלים את שמות החודשים כך שיתאים לצרכים שלכם\nהחודשים ריקים\nיש בו הצגה חודשית והצגה יומית",
      "targetAudience": [
        {
          "targetAudience": "Students and professionals who need a customizable digital planner to manage their schedules and tasks.",
          "useCase": "The planner allows them to easily track appointments, deadlines, and other important events, while also providing a customizable layout that can be tailored to their specific needs."
        },
        {
          "targetAudience": "Creative individuals who want to express their style through their planner.",
          "useCase": "The planner's customizable design features allow them to create a unique and visually appealing planner that reflects their personality and interests."
        },
        {
          "targetAudience": "Individuals who want to improve their productivity and time management skills.",
          "useCase": "The planner's daily and monthly views provide a clear overview of their commitments, helping them to prioritize tasks and stay organized."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1490636900/ywmn-dygytly-lhmh-yy?click_key=e179bb18e22bb85e0ae4b06da57bd574b9c97614%3A1490636900&click_sum=60b2190a&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-42&dd=1",
      "dateCreated": "2024-02-20T20:15:36.381110",
      "productId": "bxvWoqUYxH"
    }
  },
  {
    "data": {
      "product": "Credit Card Skin Templates",
      "description": "**Product Includes:**\n\n- Credit Card Template SVG file (for InkScape/ Corel Draw/ Cricut)\n- Credit Card Template PNG file\n- Credit Card Template DXF file\n- Credit Card Template EPS file\n- Credit Card Template AI file\n- Credit Card Template PDF file\n- Credit Card Template JPG file\n\n**Features:**\n\n- SVG files are vector files and can be resized larger or smaller without losing quality.\n- Versatile SVG, PNG, EPS, DXF, AI, and PDF file formats.\n- Easy to use files for both seasoned crafters and beginners.\n- Protects credit cards from wear and tear.\n- Adds a personal touch to credit cards.\n- Allows for self-expression and creativity.\n- Instant download for immediate use.",
      "targetAudience": [
        {
          "targetAudience": "Creative individuals looking to personalize their credit cards and express their style",
          "useCase": "Using the templates to create unique and fashionable credit card skins, transforming their cards into works of art."
        },
        {
          "targetAudience": "Crafters and DIY enthusiasts seeking versatile materials for their projects",
          "useCase": "Utilizing the templates in Cricut machines to cut and create custom credit card skins, adding a personal touch to their creations."
        },
        {
          "targetAudience": "Individuals concerned about protecting their credit cards from wear and tear",
          "useCase": "Applying the skins to their credit cards to safeguard them from scratches, fading, and other damage, ensuring their cards remain pristine."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1476479848/credit-card-skin-template-credit-card?click_key=e049875033438931f434aa70efa904a95acb49db%3A1476479848&click_sum=3c94f341&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-43&bes=1&dd=1",
      "dateCreated": "2024-02-20T20:15:47.758974",
      "productId": "vaDTCHTebF"
    }
  }
]
