[
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "Hanging ceiling lamp with a handmade design featuring a printed decoration of green leaves. This unique light fixture is made of clay and is suitable for living room centers and offices. It is part of the Apilar collection by Noa Razer, an innovative designer-maker from Tel Aviv, Israel. The lamp is available in a variety of colors and comes with a height of 17.7 inches and a diameter of 7.9 inches.",
      "targetAudience": [
        {
          "targetAudience": "Design-focused individuals",
          "useCase": "Adding a unique and artistic touch to their living spaces."
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Expanding their collection with a handmade and distinctive piece."
        },
        {
          "targetAudience": "Home decorators",
          "useCase": "Creating a statement piece and enhancing the ambiance of their interiors."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/724851215/pendant-ceramic-lamp-hanging-ceiling?click_key=e8d950f3575e7464c59ce61d372d7a06ba4195a9%3A724851215&click_sum=991964c2&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:06:46.253349",
      "productId": "eBgpVcdSZz"
    }
  },
  {
    "data": {
      "product": "Pendant Ceramic Lamp",
      "description": "This handmade ceramic lamp is a unique work of art that will add a touch of contemporary style to any space. It is part of the Apilar collection, which is inspired by the differentiated and unique Spanish ceramics. The lamp is made up of nine different shapes that can be stacked on top of each other to create new complex compositions. On top of the pieces are ceramic prints, inspired by traditions from different cultures, creating a contemporary cultural collage. The lamp is available in a variety of colors, including green, pink, and teal, and measures 5.9 inches high with a diameter of 5.5 inches.",
      "targetAudience": [
        {
          "targetAudience": "Art collectors",
          "useCase": "Displaying the lamp as a unique piece of artwork in their collection."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporating the lamp into their designs to create a contemporary and stylish atmosphere."
        },
        {
          "targetAudience": "Homeowners with a taste for unique and handmade decor",
          "useCase": "Adding a touch of personality and artistic flair to their living spaces."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/654638870/pendant-ceramic-lamp-hanging-lampshade?click_key=29f6da8860044924d2ab0296c3e8e4d09491e7cd%3A654638870&click_sum=68951a9a&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:06:55.060800",
      "productId": "ZenEryHWMK"
    }
  },
  {
    "data": {
      "product": "ceiling lamp Pendant TerraCotta Lamp Hanging Light Fixture",
      "description": "This handmade terracotta lamp from Tel Aviv adds warmth and hominess to any space. With its E27 lamp holder, 150 cm transparent cable, and 10 cm ceiling rose, it is easy to install and use. Energy-saving LED light bulbs are recommended, especially the Edison Vintage style. The lamp is part of the Apilar collection, inspired by Spanish ceramics, and comes in various shapes, colors, and prints. It is unique and can be customized upon request.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of warmth and homeliness to their space.",
          "useCase": "Using the lamp as a primary light source in a living room, dining room, or bedroom."
        },
        {
          "targetAudience": "Interior designers seeking unique and handmade pieces for their clients.",
          "useCase": "Incorporating the lamp into a bohemian, eclectic, or Mediterranean-inspired design scheme."
        },
        {
          "targetAudience": "Art enthusiasts and collectors interested in supporting small-scale artisans.",
          "useCase": "Displaying the lamp as a decorative object or conversation piece in a home gallery or studio."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/776223242/ceiling-lamp-pendant-terracotta-lamp?click_key=a20f3e45be89a11d1583bfae28fe0ece4b815ae3%3A776223242&click_sum=6d4dc964&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:07:07.143199",
      "productId": "lovroqskeB"
    }
  },
  {
    "data": {
      "product": "Vintage Armchair from Mid Century, Mustard, Restored",
      "description": "This unique armchair from the 1960s has been professionally reupholstered to a high standard, while preserving its original shape and details. The frame has been retouched, and the wood has been treated with oil to enhance its grains. Despite being over 50 years old, this armchair has been given a fresh look and its dimensions are as follows: width: 22.8 in (58 cm), height: 31.4 in (80 cm), depth: 24.8 in (63 cm), seat width: 18.1 in (46 cm), and seat height: 14.2 in (36 cm).",
      "targetAudience": [
        {
          "targetAudience": "Vintage furniture enthusiasts",
          "useCase": "Adding a touch of mid-century style to their home decor"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporating unique and stylish pieces into their clients' homes"
        },
        {
          "targetAudience": "Collectors of vintage furniture",
          "useCase": "Adding a rare and desirable piece to their collection"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/712573399/vintage-armchair-from-mid-century?click_key=3c8b1287bffc912bfed8d1f2ae564fab0026818b%3A712573399&click_sum=e62ab1c0&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:07:25.137886",
      "productId": "F2MwHrFyVp"
    }
  },
  {
    "data": {
      "product": "Black and White cocktail chair from 1970's",
      "description": "Dimensions in cmH 66 cm (seat 40 cm) W 52 cm x D 47 cmin ichH 25,98 in (seat 15,7 in) W 20,47 in x D 18,5 in\n------------------------------------------------------------------------------------------The mass production of this iconic piece so characteristic of the whole Mid-Century modern era started at the end of the fifties and went on as late as the beginning of the eighties. Mirroring the trends of the times its turned legs were cone shape typically with a nude chellac finish. The fan shaped steaming of the upholstery elegantly emphasizes the curve of the back. Due to its size this comfortable and versatile piece is also easy to move. We used high quality, black and white colored upholstery fabric for the refurbishment.\nOur manufactory is specialized in the restoration of mid century modern furniture from the 50’s, 60’s, and 70’s.",
      "targetAudience": [
        {
          "targetAudience": "Mid-century modern furniture enthusiasts",
          "useCase": "Adding a stylish and comfortable piece of furniture to their collection"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Using the chair as a statement piece in their designs"
        },
        {
          "targetAudience": "Homeowners looking for unique and stylish furniture",
          "useCase": "Adding a touch of vintage charm to their living room or den"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/649720699/completely-restored-black-and-white?click_key=c5b31fa1f1cf1c531ec6f1ca843212ca0ab2c0c7%3A649720699&click_sum=d495f956&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:07:41.243331",
      "productId": "aEtTDoeHlw"
    }
  },
  {
    "data": {
      "product": "Vintage Boucle armchair and ottoman set, Teddy armchair, Handmade Sherpa chair mid century set, small comfy armchair for living room",
      "description": "This vintage Boucle armchair and ottoman set is a handmade piece of furniture that brings a 60's Furniture feel into your home. It is made from solid wood and upholstered with brown faux leather. The armchair can be upholstered in another fabric or stained in another color. It requires simple assembly and instructions are included. The dimensions are: Overall height: 74 Centimeters / 29.6 inches, Overall width: 63 Centimeters / 25.2 inches, Overall depth: 70 Centimeters / 28 inches, Seat height: 40 Centimeters / 16 inches, Seat width: 50 Centimeters / 20 inches, Seat depth: 50 Centimeters / 20 inches. The materials used are: Stained Solid Beech Wood, Boucle teddy fabric, High quality furniture foam density 30.",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in vintage and mid-century modern furniture",
          "useCase": "Adding a touch of retro charm to their living room or den"
        },
        {
          "targetAudience": "Design enthusiasts seeking unique and stylish pieces",
          "useCase": "Creating a statement piece in their home décor"
        },
        {
          "targetAudience": "Homeowners looking for comfortable and cozy seating options",
          "useCase": "Providing a comfortable and inviting space for relaxation and entertaining"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1110352719/vintage-boucle-armchair-and-ottoman-set?click_key=1d3bb7ec649af46bf155dbd8bfd53e69697096a5%3A1110352719&click_sum=a8d6977d&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:07:54.042662",
      "productId": "UaLDZSMpoA"
    }
  },
  {
    "data": {
      "product": "Large Vegan Suede Yellow Desert Knot Floor Cushion, suede ottoman, Knot Floor Pillow, Modern pouf, ottoman cushion, pouf ottoman, suede pouf",
      "description": "Soft, cozy with beautiful earthy tones. We can't get enough of the new vegan suede collection!  The vegan suede fabric looks and feels like suede, made of 100% polyester, which makes it easy to clean, super durable and most important- vegan friendly. These floor cushions are beautiful and functional. The wooden rings, that tie the cushion together are hand made by our wonderful wood turner.\n\nSize: 75X75 cm / 30X30 inch\nHeight: 35 cm / 14 inch\nMaterials: Beech wood, stiff foam filling, upholstery materials, polyester vegan suede fabric.\n\nCare: Spot clean with cold water and mild soap. Vacuum once a week to keep the cushion fresh and clean.\n\nProduction and shipping time: We make each piece to order in our studio. Please allow 10 - 15 business days for us to make & ship your purchase.\n\nCustom order: We can stain paint the wooden rings to walnut or black. if you are interested, just add a note with the color of your choice at the note section at checkout.\n\nPlease Read about our shipping, refunds and exchanges policies.\n\nFor any thoughts or questions please send us a Message and We'll be happy to answer ASAP.\n\nBuyers are responsible for any customs and import taxes that may apply. We are not responsible for delays due to customs.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value unique and elegant home decor.",
          "useCase": "Adding a touch of sophistication and visual interest to their living space by using the floor cushion as an ottoman or decorative accent."
        },
        {
          "targetAudience": "People who prioritize comfort and functionality in their home furnishings.",
          "useCase": "Enjoying the soft and cozy texture of the cushion while lounging or using it as extra seating during gatherings."
        },
        {
          "targetAudience": "Individuals who are environmentally conscious and prefer vegan-friendly products.",
          "useCase": "Choosing the floor cushion as an ethical and sustainable alternative to traditional suede products."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/903050205/large-vegan-suede-yellow-desert-knot?click_key=9435afe93b99d6620ded8489deb8c67d305d1615%3A903050205&click_sum=511eb3e5&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:08:10.430016",
      "productId": "X3HWQPrUgE"
    }
  },
  {
    "data": {
      "product": "Floor Pillow",
      "description": "These floor pillows are made with 100% woven polyester printed fabric and sewn closed with premium poly fill. They are available in two shapes (circle and square) and two sizes (23\" and 26\"). The pillows have a small \"X\" stitch detail in the center to help secure the filling and keep the pillow plump. They are spot clean only and custom made to order, so please allow up to 5-10 business days for production. Returns/exchanges are not offered unless the item arrives damaged or defective.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who are looking for a stylish and comfortable way to add extra seating to their living room or den.",
          "useCase": "These floor pillows can be used to create a cozy reading nook, a comfortable spot to watch TV, or a stylish accent piece in any room."
        },
        {
          "targetAudience": "Parents who are looking for a safe and comfortable place for their children to play.",
          "useCase": "These floor pillows are perfect for creating a soft and inviting play area for children of all ages."
        },
        {
          "targetAudience": "Yoga and meditation enthusiasts who are looking for a comfortable and supportive cushion to use during their practice.",
          "useCase": "These floor pillows are perfect for providing support and comfort during yoga and meditation sessions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/904960951/floor-pillow-meditation-cushion-floor?click_key=ace767681c81a9b0823f6106c91ad8dc0598b77b%3A904960951&click_sum=cb1cb2aa&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:08:20.364634",
      "productId": "GaRSmDPmoE"
    }
  },
  {
    "data": {
      "product": "Kids Knitted Footstool",
      "description": "This handmade footstool pouffe is constructed using durable and thick 100% cotton cord. It is knitted with love and inspected carefully for the utmost quality and satisfaction. Would fit perfectly to any boys or girls bedroom.",
      "targetAudience": [
        {
          "targetAudience": "Parents of young children",
          "useCase": "A comfortable and safe place for their child to sit, play, climb, and rest."
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "A stylish and functional addition to a nursery or young child's room."
        },
        {
          "targetAudience": "People who appreciate handmade and sustainable products",
          "useCase": "A unique and eco-friendly piece of furniture."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/266515154/kids-knitted-footstool-crochet-pouf?click_key=8404afd2483f5f2eebf83b627975eba358957490%3A266515154&click_sum=3eeb33f5&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:08:30.647600",
      "productId": "weRAFgqsRw"
    }
  },
  {
    "data": {
      "product": "Stroke / Brushstroke Illustrated Parian Porcelain Vase",
      "description": "With bold brushstrokes against a white base, the long vase declares a love of pattern and design. Perfect as a stand out piece for a mantlepiece, sideboard, or as a centre piece for a dining table. Slipcast in Parian porcelain, the vase is glazed inside and left matte and unglazed outside to celebrate the material qualities of the clay. Each piece is polished by hand to create a silky smooth finish. Every piece is handmade and individually illustrated, meaning no two will ever be exactly the same.",
      "targetAudience": [
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Displaying the vase as a decorative object in their collection"
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Using the vase as a decorative accent in interior design projects"
        },
        {
          "targetAudience": "Plant lovers and gardeners",
          "useCase": "Using the vase as a container for plants and flowers"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/811521978/illustrated-parian-porcelain-vase-stroke?click_key=6139e75747e462cf794becc15163216d9209e37d%3A811521978&click_sum=9c8db571&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:08:41.561852",
      "productId": "KWdRTDYsHS"
    }
  },
  {
    "data": {
      "product": "Small amphora vase",
      "description": "A beautiful hand-built small amphora vase with black and white triangle pattern. It can be used as a decorative item or to hold a bouquet of small flowers or a small tree branch. It is made of clay, handpainted with black underglaze, and dipped in glossy white. It was fired to cone 8 (1250C) in an electric kiln. The base is unglazed and impressed with the maker's mark. It is approximately 13.5cm high and 9cm wide (5.3\" x 3.5\"). It is dishwasher safe. All pieces are handcrafted, so there may be minor variations from item to item. Orders outside of Europe are shipped with DHL Express with delivery within 4-6 working days. All EU and non-EU orders are shipped with Standard International Tracked Shipping with The Post of. Expected deliveries EU 4-8 working days, Non-EU 6-10 working days. There is a shipping upgrade option to Express DHL for European orders.",
      "targetAudience": [
        {
          "targetAudience": "Middle-class families who enjoy having flowers in their home",
          "useCase": "The amphora vase can be used to hold a small bouquet of flowers on a table or windowsill"
        },
        {
          "targetAudience": "Art collectors who appreciate handmade ceramics",
          "useCase": "The amphora vase can be displayed as a decorative item in a home or office"
        },
        {
          "targetAudience": "People who are looking for a unique and stylish gift",
          "useCase": "The amphora vase can be given as a gift for a birthday, wedding, or other special occasion"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/986518800/small-amphora-vase-old-greek-pottery?click_key=fc56957f9f9a6b9b4682e8ccefface2f70dd7ed1%3A986518800&click_sum=e9e548bd&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:09:05.373432",
      "productId": "QqnqhOlKQE"
    }
  },
  {
    "data": {
      "product": "Burlap Jute Glass Vase",
      "description": "The Burlap Jute Glass Vase is a one-of-a-kind piece of home decor that is sure to add a touch of style to any room. It is hand painted in black, cream, and gold in an abstract mosaic design and is handcrafted with jute, burlap fabric, and a glass bottle. The vase is 5\" tall and has a 5.5\" wide base. It is perfect for adding a touch of elegance to your home or office decor.",
      "targetAudience": [
        {
          "targetAudience": "Home Decor Enthusiasts",
          "useCase": "Adding a unique and stylish touch to their home decor with a hand-painted burlap vase that complements their existing aesthetic."
        },
        {
          "targetAudience": "Art Collectors",
          "useCase": "Acquiring a one-of-a-kind piece of art that combines traditional jute and burlap materials with modern abstract design."
        },
        {
          "targetAudience": "Gift Givers",
          "useCase": "Finding a unique and thoughtful gift for a special occasion, such as a housewarming, birthday, or anniversary."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/908084516/burlap-jute-glass-vase-hand-painted?click_key=ec2db49f5e91c6658f23a654932d737ae2da260c%3A908084516&click_sum=9adac0a8&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:09:13.513617",
      "productId": "QDoAnXGQdh"
    }
  },
  {
    "data": {
      "product": "Cushion covers",
      "description": "These cushion covers are handmade and feature an exclusive digitally designed pattern. They are printed in the South of France and handcrafted in a workshop. The covers are made of water-repellent and UV-resistant fabric on the face and heavy duty 100% cotton twill on the back. The print quality is slightly textured and the covers are fully overlocked on the reverse. They can be washed at 30°C and should be dried naturally. Do not wring or iron at high temperatures. Shipments are by post with tracking.",
      "targetAudience": [
        {
          "targetAudience": "People who appreciate unique and handmade home decor",
          "useCase": "To add a touch of style and personality to their home"
        },
        {
          "targetAudience": "People who are looking for a gift for a friend or family member who loves home decor",
          "useCase": "To give as a thoughtful and unique gift"
        },
        {
          "targetAudience": "People who are interested in supporting small businesses",
          "useCase": "To support a local artisan and their business"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1206357075/cushion-covers-exclusive-pattern-unique?click_key=bfc12b64e7f792985c5dce93adb9029eb02cb148%3A1206357075&click_sum=a191fb9c&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:09:22.562423",
      "productId": "Ry7DRAMIzW"
    }
  },
  {
    "data": {
      "product": "Color Therapy Pillow",
      "description": "This pillow is made from 100% hand-loomed cotton and features a colorful striped pattern. It is soft to the touch and has a hidden zipper at the bottom. The pillow insert is not included. The pillow is made by an indigenous family in Ecuador who use an antique loom to weave the fabric. The pattern is inspired by the traditional skirts worn by women and girls in this community. The pillow is a reminder of the sisterhood of love and empowerment that connects all women.",
      "targetAudience": [
        {
          "targetAudience": "LGBTQ individuals",
          "useCase": "To show support for the LGBTQ community and add a touch of pride to their home decor."
        },
        {
          "targetAudience": "People who love bright colors and cheerful patterns",
          "useCase": "To add a pop of color and joy to their living space."
        },
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "To add a unique and stylish touch to their clients' homes."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/566822148/color-therapy-pillowcolorful?click_key=a252dd4962fe140754267de9799abb7333578c78%3A566822148&click_sum=853cd7b0&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:09:32.047564",
      "productId": "NVMUmhSvtH"
    }
  },
  {
    "data": {
      "product": "Throw Pillow",
      "description": "A square Parquet print pillow sham made of cotton with a side zip closure. The Parquet pattern was designed in 2021 by Vikki Wiercinski.100% cotton with zipper closing, 16\" square, Designed in Canada • Made in India. Pillow form not included.",
      "targetAudience": [
        {
          "targetAudience": "People who are interested in mid-century modern design",
          "useCase": "Use it to add a touch of style to their living room or bedroom."
        },
        {
          "targetAudience": "People who are looking for a colorful and unique pillow",
          "useCase": "Use it to add a pop of color to their couch or bed."
        },
        {
          "targetAudience": "People who are looking for a gift for someone who loves mid-century modern design",
          "useCase": "Give it as a gift to a friend or family member who loves mid-century modern design."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1168874671/throw-pillow-parquet-design-modern-mid?click_key=f6fa54914ce2a267b976bdca39d580019cadcff0%3A1168874671&click_sum=e53672d3&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:09:38.955027",
      "productId": "ECAmrDgJWu"
    }
  },
  {
    "data": {
      "product": "Address Sign",
      "description": "Personalized Address Sign made from high-quality 1/4\" thick baltic birch wood, available in painted or unpainted finishes. The sign is 14.5\" wide and the height varies depending on the address length. It comes with pre-drilled holes for easy hanging and is recommended to be placed under a covered area for protection. The design is owned by Michael Miles Creations and cannot be copied.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to modernize the appearance of their home",
          "useCase": "To display their address in a stylish and contemporary way"
        },
        {
          "targetAudience": "Businesses that want to make their premises more visible",
          "useCase": "To display their address and business name in a prominent and eye-catching way"
        },
        {
          "targetAudience": "People who are looking for a unique and personalized gift",
          "useCase": "To give as a housewarming or wedding gift"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/790049531/address-sign-modern-house-numbers-house?click_key=e5152cb0468b7ecd159695725d3bad845c96d6a7%3A790049531&click_sum=fea5fd98&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:09:53.552589",
      "productId": "DjOOXbsDyd"
    }
  },
  {
    "data": {
      "product": "Geometric Address Sign",
      "description": "Geometric carved design with acrylic house numbers. Perfect for modern home address signs, housewarming gifts, realtor closing gifts, or to spruce up your front porch or door decor. Choose your size, text color, and background paint or stain color. Comes with a sawtooth hanger to hang.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to spruce up their front porch or door decor",
          "useCase": "To add a modern touch to their home's exterior"
        },
        {
          "targetAudience": "Realtors looking for a unique and stylish closing gift",
          "useCase": "To give to clients as a way to commemorate their new home"
        },
        {
          "targetAudience": "People looking for a unique housewarming gift",
          "useCase": "To give to friends or family members who are moving into a new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1439690652/round-address-sign-geometric-address?click_key=e2c7e9246b2b0ad15099d291426b648b2f195a1b%3A1439690652&click_sum=e307a39c&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:10:01.189990",
      "productId": "mpGMuvizsd"
    }
  },
  {
    "data": {
      "product": "Modern Herringbone House Number Sign",
      "description": "This modern herringbone house number sign is perfect for a modern home exterior. The sign is made out of wood and the numbers are acrylic. The wood is sealed with an exterior grade sealer to help preserve the life. The sign can be any stain or paint color and the text can only be black or white. The numbers will be made to fit the sign regardless of how many numbers are ordered. The sign comes with either a sawtooth hanger on the back or a d-ring.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to update their house exterior with a modern touch",
          "useCase": "To display their house number in a stylish and visible way"
        },
        {
          "targetAudience": "Realtors looking for a unique and personalized closing gift for their clients",
          "useCase": "To give as a thoughtful and practical gift that will be appreciated by new homeowners"
        },
        {
          "targetAudience": "Individuals looking for a housewarming gift that is both stylish and functional",
          "useCase": "To give as a gift that will be both decorative and useful in the recipient's new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1453867189/herringbone-address-sign-modern-house?click_key=42837fe32ba489b314764b3f974779b31603037d%3A1453867189&click_sum=6c71488a&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:10:14.951373",
      "productId": "XxDKSfYwnX"
    }
  },
  {
    "data": {
      "product": "Faux olive wreath",
      "description": "The wreath is made on a rustic grapevine base with artificial olives and leaves. It is ideal for indoor or outdoor use, but a covered or sheltered area is recommended. Direct sunlight and rain will fade your wreath over time. The wreath is great for double doors, and is made from 14\", 18\" and 24\" natural rustic grapevines. The size is approximately 18\", 22\" and 28\" (tip to tip). It is a great piece for rustic home decoration, and is a perfect accent to your home or gift to your friends.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for a rustic home decoration",
          "useCase": "To add a touch of nature to their home"
        },
        {
          "targetAudience": "People who are looking for a gift for a friend or family member",
          "useCase": "To give as a gift to someone who appreciates rustic home decor"
        },
        {
          "targetAudience": "People who are looking for a wreath for their front door",
          "useCase": "To add a touch of curb appeal to their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/630678328/faux-olive-wreath-every-day-wreath?click_key=e43336b32cd1dc1d2a922a44fe9588eea079d7b2%3A630678328&click_sum=c083685c&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:10:24.714469",
      "productId": "QGvOwZV9TF"
    }
  },
  {
    "data": {
      "product": "Lavender Hoop Wreath",
      "description": "This romantic \"Lavender\" wreath is beautiful for all seasons. The pale lavender is perfection with artificial lambs ear & eucalyptus accenting this wreath. The natural or wooden hoop has a modern farmhouse style. OR choose a gold metal hoop. This high-quality lavender looks so realistic with the pretty beautiful artificial silver greenery. This beauty can be hung at any angle. It includes twine, that you can choose to use or not. Give this wreath to Mom, and make her Mother's day. 𝗪𝗿𝗲𝗮𝘁𝗵 𝗗𝗲𝘁𝗮𝗶𝗹𝘀 • Arrives ready to display • Made on an 12\" 14\" 16\" or 18\" wooden or gold metal ring • Hand designed using premium materials • Wreath is sprayed with a UV protectant 𝗪𝗿𝗲𝗮𝘁𝗵 𝗖𝗮𝗿𝗲 • Indoor/Outdoor covered use only • This wreath cannot be directly exposed to moisture 𝗜𝘁𝗲𝗺 𝗗𝗲𝘁𝗮𝗶𝗹𝘀 • Some greenery may vary slightly • I do hand pick each wreath and take great care in finding quality vine. • Do to the nature of the vine wreath, I cannot guarantee a perfectly round wreath, or exact measurement( 1-2 inches) 𝗦𝘁𝗮𝘆 𝗜𝗻 𝗧𝗼𝘂𝗰𝗵 Instagram.com/twistedpine.wreaths/ pinterest.com/twistedpinewreaths/ View our Entire Collection of Wreaths: www.etsy.com/shop/twistedpinewreaths THE FRAUDULENT WEBSITE WREATHFALL /FACEBOOK COPIED SEVERAL OF MINE & OTHER ETSY SELLERS ORIGINAL IMAGES.. PLEASE DO NOT FROM THAT SITE. THEY ARE NOT ORIGINAL PRODUCTS",
      "targetAudience": [
        {
          "targetAudience": "Individuals looking to add a touch of nature and elegance to their home decor",
          "useCase": "Displaying the wreath on their front door, interior walls, or above a fireplace"
        },
        {
          "targetAudience": "Homeowners seeking to create a welcoming and inviting atmosphere",
          "useCase": "Hanging the wreath on their porch, patio, or garden to enhance the outdoor space"
        },
        {
          "targetAudience": "Mothers and gift-givers searching for a unique and thoughtful present",
          "useCase": "Gifting the wreath to a loved one for Mother's Day, birthdays, or other special occasions"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/962426777/lavender-hoop-wreathmodern-summer?click_key=1789ed78e9695b61514b95b508a849c00fe8c007%3A962426777&click_sum=349bf9e1&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:10:44.361898",
      "productId": "cfyedWuvnc"
    }
  },
  {
    "data": {
      "product": "Farmhouse wreath for front door",
      "description": "This classic lush year round greenery wreath is constructed on a 14\" grapevine and decorated with sage green eucalyptus in varying sizes, cream tea roses, and lambs ear. Accented with a caramel velvet hand torn ribbon. Total diameter is ~20.\". Can be enjoyed inside or outside year round for curb appeal! Handmade in Northern, Virginia with love. This item is made to order.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators with a farmhouse or French country aesthetic",
          "useCase": "Adding a touch of rustic charm to their front door or interior"
        },
        {
          "targetAudience": "Individuals seeking year-round greenery for their homes",
          "useCase": "Creating a welcoming and inviting atmosphere"
        },
        {
          "targetAudience": "Homeowners looking for a unique and handmade wreath",
          "useCase": "Adding a personal touch to their home decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1223343994/farmhouse-wreath-for-front-door?click_key=6fd6c2e5fa8892af1e1a085e5f3ee1bfb9eb0c70%3A1223343994&click_sum=3282ef57&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:10:55.402090",
      "productId": "jlpBJZRXbO"
    }
  },
  {
    "data": {
      "product": "Personalized Last Name Doormat",
      "description": "High-quality and eco-friendly doormat, made from all-natural coir fibers with a durable vinyl back. It features a custom-designed monogram with the family's last name, making it a unique and thoughtful gift for housewarmings, weddings, or closing gifts. The doormat is designed to be used in covered areas to protect it from water damage and prolong its lifespan. It is hand-cut and may have slight variations in length and thickness. Custom designs and personalization add-ons are available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking for a personalized and stylish way to welcome guests",
          "useCase": "Placing the doormat at the front door to create a welcoming and inviting atmosphere"
        },
        {
          "targetAudience": "Couples celebrating a wedding or housewarming",
          "useCase": "Using the doormat as a thoughtful and practical gift that will be treasured for years to come"
        },
        {
          "targetAudience": "Real estate agents looking for a unique and memorable closing gift",
          "useCase": "Presenting the doormat to clients as a way to commemorate their new home and wish them well"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1168985443/last-name-doormat-housewarming-gift?click_key=8c2231bc66a91438e8d81b66f49ddbae88ffa6d9%3A1168985443&click_sum=2cd40184&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T14:11:16.810546",
      "productId": "weKXNUDVIl"
    }
  },
  {
    "data": {
      "product": "Pizza Doormat",
      "description": "This hand-painted doormat is made of durable PVC and natural coir, making it suitable for both indoor and outdoor use. It features a pizza design and is a perfect housewarming or wedding gift. The mat is easy to clean by shaking it. Custom designs are also available.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who love pizza and want to add a touch of whimsy to their front door",
          "useCase": "Welcome mat to greet guests and add a personal touch to their home"
        },
        {
          "targetAudience": "People looking for a unique and thoughtful housewarming or wedding gift",
          "useCase": "Gift to show appreciation and celebrate a new home or marriage"
        },
        {
          "targetAudience": "Individuals who value durability and easy maintenance in their home decor",
          "useCase": "Durable and easily cleaned doormat that can withstand outdoor elements and everyday use"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/612462127/pizza-doormat-welcome-mat-gift-for-her?click_key=98f0ec7fb98f4b3bdc463530fe396aca341855ab%3A612462127&click_sum=3e4cddc2&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:11:36.470256",
      "productId": "tInHKQpGsg"
    }
  },
  {
    "data": {
      "product": "Custom Last Name Retro Doormat",
      "description": "Personalized welcome doormat hand-painted with outdoor industrial paint that has built-in UV protection to protect the design from wear and fading. Made from high-quality 100% coir with a slip-resistant sturdy PVC rubber backing. Available in various sizes and 1 inch thick. Best placed under a covered area like a porch, avoid direct sunlight, rain, or snow. Clean by shaking; keep in a dry area for longevity. Disclaimer: Due to the nature of the product, returns will not be accepted due to wear or fading. Flawed doormats with slight imperfections such as dark spots, slight staining, small chipped corners, or small holes on the back (not visible from the front) may be available at a discounted price; sales are final. Custom orders are welcome.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners",
          "useCase": "Decorating their front door or entryway with a personalized welcome mat."
        },
        {
          "targetAudience": "People looking for a unique housewarming gift",
          "useCase": "Gifting a custom doormat with the recipient's last name or a special message."
        },
        {
          "targetAudience": "Businesses looking to promote their brand",
          "useCase": "Ordering custom doormats with their logo or branding to place at their entrance."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1183106995/custom-last-name-retro-doormat-home?click_key=01442b7aea5c3b298b09c6ee2a49af66d7c856cf%3A1183106995&click_sum=a684a2d7&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:11:46.663261",
      "productId": "bBGVWtDGUv"
    }
  },
  {
    "data": {
      "product": "WELCOME SIGN, wreath sign, welcome sign for front door, rustic welcome sign, outdoor welcome sign, vertical welcome sign, wood welcome sign",
      "description": "This adorable WELCOME sign will add a colorful touch to your front door. The sign is made of solid wood with painted on letters, highly durable and it looks great! Our top seller is our 5' x 10\" sign. Check out our reviews!\n\nWe stain and then give it a distressed and rustic look. Please note, these signs are indeed RUSTIC, and are made one-by-one to that effect which means that each piece has some variation. The distressed look means that the painted letters are given an \"aged\" look. Please review all of the photos and note that parts of the letters have \"aged\" away giving a partly \"erased\" or \"smudged\" look, perhaps even creating some asymmetry in the letters, as well as some color variation in the stain. Given that distressing is done on each piece individually each piece is unique, so expect some slight variation from the model pictured.\n\nSPACING & CENTERING ACCURACY: We've made & sold over 15,000 Welcome Signs and one of the things we've been striving for is more precision in the spacing and centering of the letters on our signs. We've invested in new technology and tools that allow us to finely tune the spacing and centering of the letters on our signs so you can be sure that when you receive one of our signs it doesn't look off center or have spacing errors between the letters.\n\nSIZES\n\nRead our sizes as Height x Width. So if it is a 5' x 10\" sign when reading the measurements the first figure is the height, so 5 feet, and the second number is the width, so 10 inches (technically 9 1/4\" in lumber measurements).  This WELCOME sign comes in 4 sizes!  5 feet x 9 1/4\" , 4 feet by 6 1/2\", 3 feet by 5.5\" inches, and 2 feet by 5.5 inches wide.\n\nHOW TO USE IT\n\nYour new solid wood welcome sign can be placed anywhere you like by simply resting it back against something as pictured  (For a long life we keep it in a covered location such as a porch with an awning, etc.). Most folks place them near their front door, on a porch, a patio, a deck, walkway or even in a guest room.  If you would like a freestanding sign it is possible to attach a stake on the back and stake it into the ground.\n\nPRODUCT CARE\n\nWe use one of the most expensive and most durable paints available. This ensures the durability of your sign.  However, like anything exposed to the natural elements (sun, wind, water, etc.) it will wear. We recommend that you place this sign in a covered location, such as a covered porch area.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to add a rustic touch to their front door.",
          "useCase": "Displaying the sign on their front door to welcome guests."
        },
        {
          "targetAudience": "Business owners who want to create a welcoming atmosphere for their customers.",
          "useCase": "Displaying the sign in their business's entryway or reception area."
        },
        {
          "targetAudience": "Individuals who are looking for a unique and personalized gift.",
          "useCase": "Giving the sign as a gift to a friend or family member who has recently moved into a new home."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/775841802/welcome-sign-wreath-sign-welcome-sign?click_key=ba5ff5568050c8dbfea90ccb565cc8fd35bc4dee%3A775841802&click_sum=32b7c1c4&ref=stl_listing-1&bes=1&sts=1",
      "dateCreated": "2024-02-20T14:12:03.988371",
      "productId": "2RKSAXFe4K"
    }
  },
  {
    "data": {
      "product": "Set of 2 Large Wooden Porch Vases",
      "description": "The set of two large wooden porch vases is a rustic addition to any porch or living room. The vases are made from reclaimed wood that has been sanded and stained gray. The larger vase stands at 24 inches tall by 6 inches wide, while the smaller one is 18 inches tall by 6 inches wide. The vases can be filled with large stems or branches to create a beautiful and eye-catching entryway. The vases also feature a welcome sign, making them a unique and practical decoration.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value rustic and farmhouse decor.",
          "useCase": "Add a touch of rustic charm to their porch or living room by using the vases as planters for large stems or branches."
        },
        {
          "targetAudience": "Homeowners who want to create a welcoming entryway.",
          "useCase": "Use the vase with the welcome sign to greet guests and create a warm and inviting atmosphere."
        },
        {
          "targetAudience": "Individuals who want to add unique and handmade touches to their home.",
          "useCase": "Display the vases as decorative pieces on a shelf or mantle, or use them to create a unique centerpiece for a table."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/511215666/large-wooden-porch-vases-welcome-sign?click_key=714f8188a6a2790dc4d0bb3e1fa44637cecdcbb7%3A511215666&click_sum=6167b4ac&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:12:20.014915",
      "productId": "rfLbsFhHzy"
    }
  },
  {
    "data": {
      "product": "Metal Wall Art",
      "description": "This metal sign is made with 18 gauge steel and powder coated in your choice of 5 colors. It is built to withstand the elements for years of enjoyment. Each sign is designed by hand to accommodate personalization and ensure the best possible result. You may notice slight variations from the design you see here, such as changes in line thickness, placement of small elements like wreath leaves, and the placement of the name. Mounting hardware is not included.",
      "targetAudience": [
        {
          "targetAudience": "Families with a strong sense of togetherness",
          "useCase": "Displaying the sign in their home as a symbol of their family unity"
        },
        {
          "targetAudience": "Couples getting married",
          "useCase": "Using the sign as a personalized wedding gift that can be displayed in their new home"
        },
        {
          "targetAudience": "Individuals looking for a unique and meaningful housewarming gift",
          "useCase": "Gifting the sign to friends or family members who are moving into a new home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1095987590/family-gift-family-name-welcome-sign?click_key=d15102ece968aaea01b80f0919cbf4dd8fee803b%3A1095987590&click_sum=aefdca22&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:12:31.134543",
      "productId": "afacfmgQNK"
    }
  },
  {
    "data": {
      "product": "Black Shade Wall Sconce - Bedside Light - Industrial Lighting - Sconce - Light Fixture - Model No. 2911",
      "description": "This utility style sconce is a perfect addition to any room. The sconce features a gloss black finish 10inch shade with a white interior.\nThe sconce can be turned on/off using the key switch located on the socket. The shade tilt is adjustable from 90 to 180 degrees.\n\n**FINISH OPTIONS**\n-----------------------\n• Black - satin powder coated finish\n• Brushed - Lightly brushed with a semi-satin finish\n• Antique Brass - Made of solid brass that has been aged and lacquer sealed\n\nThis lamp is UL listed and thoroughly tested before leaving our shop!\n\n**BULBS NOT INCLUDED**\n\n**Recommended Bulbs:**\nLED bulbs 7w (60w)\n\nBulbs for your light can be purchased in our Bulbs section\n\n**DIMENSIONS**\n-------------------\nHeight: 10\"\nWidth: 10\"\nDepth: 12.5\"\nShade\nHeight: 3.25\"\nWidth: 10\"\n5\" Wall Canopy\nClearance From Wall: 2\"\n\nThis light fixture is compatible with a dimmer switch.\n\n**LAMP SPECS**\n------------------\nSocket: Standard Medium Base (e26/e27)\nOn/off type: Turns on and off at socket.\nInstallation: Direct Wire into wall (Installation Hardware Included)\n\nIf you would like to make this light a plug-in fixture:\nPlease visit our Add Ons for Fixtures section to customize your fixture.\n\nThis Light fixture is compatible with Incandescents, Halogens, Compact Fluorescents, or any other standard E26 base bulb up to 60w.\n\nPlease provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.\nDon't hesitate to reach out if you have questions.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for a stylish and functional wall sconce",
          "useCase": "This sconce is perfect for use in a bedroom, living room, or office."
        },
        {
          "targetAudience": "People who are looking for a sconce that is adjustable",
          "useCase": "The shade tilt is adjustable from 90 to 180 degrees, making it perfect for use in a variety of settings."
        },
        {
          "targetAudience": "People who are looking for a sconce that is easy to install",
          "useCase": "This sconce is direct wired into the wall, making it easy to install."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/615762911/black-shade-wall-sconce-bedside-light?click_key=d25d37112bff2e520fe7adbe58d4a085568cee4f%3A615762911&click_sum=77d614d2&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:12:58.238150",
      "productId": "ts3ALdWwSw"
    }
  },
  {
    "data": {
      "product": "Outdoor Modern Wall Lantern",
      "description": "This contemporary and minimalist European Lantern design wall sconce has a sleek integrated LED that provides an ample amount of light, creating a distinct yet tasteful appearance. It's made of sturdy die-caste aluminum and sealed with a weather-proof coating for longevity and is suitable for wet locations and all climates. The integrated LED lights are energy saving and cost reducing, lasting an average of 40,000 hours, eliminating the need for constant bulb changes. It's perfect for residential spaces like exterior entrances, garage, patio, porch, etc., and also suitable for commercial use in restaurants, common buildings, office spaces, and multi-use buildings. Installation is easy with the patented easy installation hardware, allowing for installation in less than 10 minutes without the need for an electrician.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners who want to update the look of their home's exterior",
          "useCase": "Installing the wall lantern on the front porch, patio, or garage to provide ample lighting and create a modern, welcoming ambiance."
        },
        {
          "targetAudience": "Business owners who want to enhance the ambiance of their commercial spaces",
          "useCase": "Using the wall lantern to illuminate entrances, walkways, or common areas in restaurants, office buildings, or multi-use facilities, creating a stylish and inviting atmosphere."
        },
        {
          "targetAudience": "Architects and designers seeking unique and energy-efficient lighting solutions",
          "useCase": "Incorporating the wall lantern into residential or commercial projects to achieve a contemporary aesthetic while reducing energy consumption and maintenance costs."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1165269880/outdoor-modern-wall-lantern-with?click_key=65b26d2a093df0f1b704a9e082ab40603d91df8c%3A1165269880&click_sum=382cf4c6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:13:11.335757",
      "productId": "Sb5CqiOiKV"
    }
  },
  {
    "data": {
      "product": "Antique Brass Sconce - Multiple Finish Options - Lighting Fixture - Wall Sconce - Black Shade - Model No. 3748",
      "description": "This modern farmhouse wall sconce features a hand spun matte finish porcelain enamel coated shade.\n\nFINISH OPTIONS\n-----------------------\n• Our Raw Brass finish features solid unfinished brass that is hand cleaned before leaving our shop. The brass will age and patina over time giving the finish a soft natural look.\nPlease wear gloves while installing all fixtures. Touching raw brass with bare hands will tarnish the brass.\nIf you would like the brass to be sealed:\nPlease purchase our “Add-on - Lacquer Application” from our Add-Ons for Fixtures section.\n• Black - Durable satin powder coated finish\n• Brushed Nickel - Lightly brushed with a semi-satin finish\n• Polished Nickel - Mirror like metallic finish with a warm feel\n• Antique Brass - Made of solid brass that has been aged and lacquer sealed\n\nThis lamp is UL listed and thoroughly tested before leaving our shop!\n\nBULBS NOT INCLUDED\nRecommended Bulb:\nLED Edison 7w (60w)\nBulbs for your light can be purchased in our Bulbs section\n\nDIMENSIONS\n-------------------\nHeight: 9\"\nWidth: 7\"\nDepth: 10\"\nShade:\nHeight: 4.25\"\nWidth: 7\"\nClearance from Wall: 2.55\" Wall Canopy\n\nThis light fixture is compatible with a dimmer switch.\n\nLAMP SPECS\n------------------\nSocket: Standard Medium Base (e26/e27)\nOn/off type: Controlled from light switch\nInstallation: Direct Wired into Wall  (Installation Hardware Included)\n\nIf you would like to add an On/Off switch or make this light a plug-in fixture:\nPlease visit our Add-Ons for Fixtures section to customize your fixture.\n\nThis Light fixture is compatible with Incandescents, LEDs, Compact Fluorescent, or any other standard E26 base bulb up to 60 watts.\n\nIn order to keep the lamp temperature cool, please use LED bulbs only.\n\nPlease provide a physical address to qualify for free shipping. Due to package size, additional charges may apply for shipping to a P.O. Box.\n\nDon't hesitate to reach out if you have questions!",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking modern farmhouse decor",
          "useCase": "Enhance the ambiance of living rooms, bedrooms, or hallways with rustic charm"
        },
        {
          "targetAudience": "Design-conscious homeowners",
          "useCase": "Elevate the aesthetic appeal of their homes with a statement lighting piece that combines functionality and style"
        },
        {
          "targetAudience": "Commercial establishments seeking ambient lighting",
          "useCase": "Create a warm and inviting atmosphere in cafes, restaurants, or retail spaces"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1051791566/antique-brass-sconce-multiple-finish?click_key=150046f5d5665198a6301e8ebab2f8fa92378b45%3A1051791566&click_sum=e9bbeca7&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:13:36.679800",
      "productId": "bcubfagXQI"
    }
  },
  {
    "data": {
      "product": "Linen bedding set, Double king duvet cover and in Green color, 100% natural flax sheets set custom sizes",
      "description": "The green linen bedding set is incredibly soft and comfortable, made from 100% organic, enzyme-washed flax fabric that won't shrink and will become an heirloom piece at your home. Linen is a very durable, strong fabric that has antibacterial, antistatic, and hygroscopic properties. Also due to its natural qualities, linen is comfortable in all seasons as it keeps you cool when it is hot and warm when it is cold. This bedding set includes one duvet cover and two pillowcases, and is available in a variety of sizes to fit your needs. It can also be customized to your desired size. The set is hypoallergenic, thermoregulating, and ethically made in Lithuania.",
      "targetAudience": [
        {
          "targetAudience": "People who are looking for high-quality, sustainable bedding.",
          "useCase": "Upgrade their sleep experience with luxurious and comfortable bedding."
        },
        {
          "targetAudience": "People who are interested in eco-friendly and ethical home products.",
          "useCase": "Decorate their homes with bedding that is made from natural materials and produced in an environmentally responsible way."
        },
        {
          "targetAudience": "People who want to add a touch of luxury to their homes.",
          "useCase": "Create a stylish and inviting bedroom with bedding that is both beautiful and functional."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1316603667/linen-bedding-set-double-king-duvet?click_key=82599848f6d1ec778b0c9fc8d62a92ee12c6c143%3A1316603667&click_sum=ea928fad&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:13:46.303035",
      "productId": "GrwVBgLUWh"
    }
  },
  {
    "data": {
      "product": "Linen Pillowcase",
      "description": "This pillowcase is made from 100% pure linen, which is naturally soft and breathable. It is available in a variety of sizes to fit different pillows, and it comes in a variety of colors to match your décor. The pillowcase is machine-washable and dryable for easy care. It is also OEKO-TEX 100 certified, which means that it is free of harmful chemicals and is safe for your skin.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking comfort and luxury in their bedding",
          "useCase": "Upgrading their sleep experience with a soft, breathable, and durable pillowcase made from natural materials."
        },
        {
          "targetAudience": "Home decorators with a penchant for natural and neutral tones",
          "useCase": "Adding a touch of understated elegance to their bedrooms with a pillowcase in a versatile Cappuccino shade."
        },
        {
          "targetAudience": "Individuals with sensitive skin or allergies",
          "useCase": "Finding a hypoallergenic and Oeko Tex 100 certified pillowcase that provides a healthier sleep environment."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1295727796/linen-pillowcase-linen-pure-pillowcase?click_key=1fe6c855481dba8714725bbdb24775154d679f1f%3A1295727796&click_sum=e12514f2&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:13:56.757571",
      "productId": "mDfUXokPhb"
    }
  },
  {
    "data": {
      "product": "Linen Bedding Set in Cinnamon Color, Duvet Cover and 2 linen pillowcases, Linen comforter set Queen King Custom sizes",
      "description": "This linen bedding set is made from high-quality European linen, which is naturally strong, lustrous, and durable. The fabric has a special stone wash finish, which makes it soft yet very strong and long-lasting. The set includes one duvet cover and two pillowcases. The duvet cover has a button closure, and the pillowcases have an envelope closure. The set is available in a variety of sizes, including custom sizes. It is also available in a variety of colors, including cinnamon. The set is hypoallergenic, thermoregulating, and breathable. It is also ethically made in Lithuania.",
      "targetAudience": [
        {
          "targetAudience": "Individuals who value comfort and luxury in their bedding",
          "useCase": "Upgrade their sleep experience with high-quality, breathable, and durable linen bedding"
        },
        {
          "targetAudience": "People with sensitive skin or allergies",
          "useCase": "Enjoy the hypoallergenic and thermoregulating properties of linen to create a healthier sleeping environment"
        },
        {
          "targetAudience": "Eco-conscious consumers",
          "useCase": "Choose sustainable and biodegradable linen bedding that aligns with their environmental values"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1066602418/linen-bedding-set-in-cinnamon-color?click_key=6a4a655323104dfea52e89f717dab89790454005%3A1066602418&click_sum=b85378a9&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:14:05.757384",
      "productId": "MZJmXuNYFe"
    }
  },
  {
    "data": {
      "product": "Wall art decor print",
      "description": "Giclée art print, architectural space, depeapa illustration. Fine art Giclée print, printed on acid free and warm white fine art paper (200 gsm), saturated colours using archival pigment inks for long life. Available in three optional sizes: A4 - 9” x 12” (21 x 29.7 cm), A3 - 11.7\" x 16.5\" (29.7 x 42 cm) and A2 - 16.5\" x 23.4\" (42 x 59.4 cm). Each print is signed and includes a white border for framing. Frame is not included. Small print is shipped in a sleeve in a fiberboard mailer with an extra cardboard inside. Medium and large prints are shipped in a tube.",
      "targetAudience": [
        {
          "targetAudience": "Interior designers and home decorators",
          "useCase": "Using the print to enhance the visual appeal of interior spaces, creating a sophisticated and stylish atmosphere."
        },
        {
          "targetAudience": "Art collectors and enthusiasts",
          "useCase": "Acquiring the print as a valuable addition to their collection, appreciating its artistic merit and unique design."
        },
        {
          "targetAudience": "Individuals seeking unique and meaningful home décor",
          "useCase": "Displaying the print in their living spaces to express their personal style and create a welcoming and inspiring environment."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/576508683/wall-art-decor-print-interior-decor?click_key=281fe8a2374c090601a06131fe0eba88dd7bc76f%3A576508683&click_sum=2da75830&ref=stl_listing-1",
      "dateCreated": "2024-02-20T14:14:21.631220",
      "productId": "bvKUM6tTfz"
    }
  },
  {
    "data": {
      "product": "Emerald Green Painting",
      "description": "This product is a digital download of two high-resolution 300 DPI JPEG images of an emerald green abstract painting. The images have a maximum size of A2 International Paper size (59,4 cm height x 42 cm wide or 23,39 inch height x 16,54 inch wide) and can be cropped to fit different paper or frame sizes. The images are in CMYK format and are suitable for printing at a local printing center or using online printing services. The product includes a license for personal use, including printing, copying, emailing, and web publishing, but does not include use for financial gain.",
      "targetAudience": [
        {
          "targetAudience": "Homeowners looking to add a touch of modern elegance to their living spaces",
          "useCase": "Decorating their living rooms, bedrooms, or hallways with abstract art prints that complement their existing décor"
        },
        {
          "targetAudience": "Interior designers seeking unique and eye-catching artwork for their clients' homes or commercial spaces",
          "useCase": "Incorporating the prints into their design schemes to create a sophisticated and contemporary ambiance"
        },
        {
          "targetAudience": "Art collectors interested in acquiring affordable and accessible abstract art",
          "useCase": "Adding the prints to their collections or displaying them in their homes as conversation pieces"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/834853057/emerald-green-painting-abstract-art?click_key=f05c882cc7de602b4c1f01acfad1e0b06c2b413b%3A834853057&click_sum=7a8778a6&ref=stl_listing-2&sts=1",
      "dateCreated": "2024-02-20T14:14:33.049397",
      "productId": "ZTtCnodJOZ"
    }
  },
  {
    "data": {
      "product": "Dip Dye Tapestry",
      "description": "This boho wall art is made from recycled cotton threads that are hand-dyed and finished on a hand-stained wood panel. It is a made to order item, so it can be customized in size and color. Each wall hanging is handmade and unique, with slight color variations possible. It measures 120cm in height and 90cm in width.",
      "targetAudience": [
        {
          "targetAudience": "Boho-chic home decorators",
          "useCase": "Adding a touch of bohemian style to their living spaces."
        },
        {
          "targetAudience": "Nature-loving individuals",
          "useCase": "Bringing the beauty of nature indoors with a unique and eco-friendly piece."
        },
        {
          "targetAudience": "Art collectors",
          "useCase": "Acquiring a one-of-a-kind handmade piece that will enhance their collection."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/991191051/dip-dye-tapestry-ombre-wall-art-macrame?click_key=4e6e6321824bde681fc65066c3e85d6c71d7dc5e%3A991191051&click_sum=8daa42df&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:14:45.731897",
      "productId": "zRWTQWPVOM"
    }
  },
  {
    "data": {
      "product": "Bubble Cube Shaped Candle",
      "description": "Handmade and made to order, this unique bubble-shaped candle is perfect for home decor or as a gift. It is made with natural soy wax and pure white beeswax, and comes in a variety of scents. The candle is hand-poured and has a burn time of up to 2 hours. It is important to keep the candle away from drafty areas and to trim the wick to 1/8\"-1/4\" before lighting. The candle comes in a variety of colors and scents, and is made in the USA.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators looking for unique and stylish pieces",
          "useCase": "Using the candles as decorative accents in their homes"
        },
        {
          "targetAudience": "Gift-givers looking for thoughtful and unique presents",
          "useCase": "Gifting the candles to friends, family, or colleagues as a special gesture"
        },
        {
          "targetAudience": "Aromatherapy enthusiasts seeking natural and eco-friendly scents",
          "useCase": "Using the candles to create a relaxing and inviting atmosphere in their homes"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/774551709/bubble-cube-shaped-candle-home-decor?click_key=26be8555fd4d96c66b0f5f8624cd0811ec522f6c%3A774551709&click_sum=1c053c21&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:14:58.758828",
      "productId": "UXXRVFGTle"
    }
  },
  {
    "data": {
      "product": "PALO SANTO - 8 oz Soy Candle - Hand-Poured - Candlefolk",
      "description": "This candle features a blend of Peruvian palo santo wood, neroli, saffron, cedarwood, amber, and moss. It is hand-poured in small batches using 100% American-grown natural soy wax, premium grade fragrance oils, and lead-free cotton-core wicks. The candle has a burn time of approximately 45-50 hours. It is recommended to trim the wick to about 1/4\" before each use to ensure an even burn.",
      "targetAudience": [
        {
          "targetAudience": "People who enjoy earthy and masculine scents",
          "useCase": "Using the candle for aromatherapy or to create a relaxing atmosphere."
        },
        {
          "targetAudience": "People who are looking for a long-lasting candle",
          "useCase": "Using the candle for long periods of time, such as in a bedroom or living room."
        },
        {
          "targetAudience": "People who are interested in natural and eco-friendly products",
          "useCase": "Using the candle as a way to support sustainable practices."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/785763623/palo-santo-8-oz-soy-candle-hand-poured?click_key=194a5ddba80989f53c4e1abac69c7a15a37dbfb7%3A785763623&click_sum=fdc72a94&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:15:11.149660",
      "productId": "RlDJfwDMjJ"
    }
  },
  {
    "data": {
      "product": "HINOKI Essential Oil Candle",
      "description": "100% Natural Soy + Essential Oil CandleCypress / Hinoki / Grapefruit\nThe scent of fresh mountain air.  A cloud of cool mist, rolling through old-growth forests.  The clean aroma of Japanese Cypress and dry Cedar,  washed clean in a bath of sparkling Pink Grapefruit,  create an atmosphere of clarity and tranquility.\nUse for:  Clarity and Awareness ( see below )\n+ 100% Natural\n+ Scented exclusively with essential oils\n+ 8 oz  /  up to 50 hr\n+ Vegan\n+ USA Made Vessel\n+ Hand-poured in Rhode Island\n+ 3.5\" high x 2.5\" wide\n---- Folklore ----\nThe Tree of Purity\nOnce worshiped as a symbol of the sun goddess, The Hinoki tree has been revered as sacred in Japan for centuries. An emblem of purity and grace, the timber of the fragrant wood has been a traditionally used to build the most sacred of places; shrines and temples.\nStill used in many Shinto ceremonies today, Its been said that even when cut down, the spiritual essence of the tree is still intact, aiding in its ability to create a restorative atmosphere.\nUniquely, the Hinoki woods of Japan fail to prosper in polluted environments, such as cities. Instead, growing mainly in areas where the air and water are exceptionally pure. The birthplace of Shirin-Yoku ( Forest Bathing ) originated in the Hinoki forests of Akasawa.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking a sense of clarity and awareness",
          "useCase": "Use the candle during meditation, yoga, or other mindfulness practices to promote a clear and focused mind."
        },
        {
          "targetAudience": "People who appreciate natural and eco-friendly products",
          "useCase": "Use the candle to create a calming and refreshing atmosphere in their homes, knowing that it is made with natural ingredients."
        },
        {
          "targetAudience": "Those interested in Japanese culture and traditions",
          "useCase": "Use the candle to experience the traditional Japanese concept of Shirin-Yoku (Forest Bathing) in their own homes, promoting relaxation and well-being."
        },
        {
          "targetAudience": "Individuals who enjoy unique and high-quality home fragrances",
          "useCase": "Use the candle to create a distinctive and inviting ambiance in their living spaces, impressing guests with its sophisticated and alluring scent."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/879866486/hinoki-essential-oil-candle-grapefruit?click_key=e58d82bccd57e526a531391738afdff212f4aff1%3A879866486&click_sum=f6b559dd&ref=stl_listing-3&sts=1",
      "dateCreated": "2024-02-20T14:15:28.662097",
      "productId": "ULEEZbFafW"
    }
  },
  {
    "data": {
      "product": "Small Wooden Stool",
      "description": "This small wooden stool, embodying Scandinavian decor, is a versatile piece that can be used as a side table, plant stool, or simply as a decorative accent. It is made from plywood and finished with a natural hard wax oil, and it can support up to 120kg. The stool is easy to assemble and comes with dismounted legs that are numbered for easy assembly. It is available in a variety of colors, including natural, walnut, oak, light oak, antic oak, teak, black, frozen green, and winter blush.",
      "targetAudience": [
        {
          "targetAudience": "Minimalists",
          "useCase": "Add a touch of Scandinavian charm to their home with a versatile piece that can serve as a side table, plant stool, or extra seating."
        },
        {
          "targetAudience": "Mid-century modern enthusiasts",
          "useCase": "Incorporate the timeless style of mid-century modern design into their home with a piece that complements their existing furniture and decor."
        },
        {
          "targetAudience": "Nature lovers",
          "useCase": "Bring a touch of nature indoors with a stool made from natural wood, adding warmth and organic beauty to their space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/570862928/small-wooden-stool-scandinavian-decor?click_key=0ce9341871b025abc2fc073f6101f28b78ac753d%3A570862928&click_sum=ca696b28&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:16:10.040766",
      "productId": "NCOZWvGigI"
    }
  },
  {
    "data": {
      "product": "Cork Stools",
      "description": "The Cork Stools collection is a set of stools made from natural cork. They offer a simple, versatile, and functional design. The stools are available in two dimensions and feature a recess around the perimeter for easy carrying and moving. The smooth texture of the cork and the simple design make these stools perfect for a wide range of public and private environments. This collection combines the use of a natural material with simple forms, creating a unique and stylish addition to any space.",
      "targetAudience": [
        {
          "targetAudience": "Individuals seeking eco-friendly home decor",
          "useCase": "Adding a sustainable and stylish touch to their living spaces"
        },
        {
          "targetAudience": "Interior designers and architects",
          "useCase": "Creating functional and aesthetically pleasing spaces for clients"
        },
        {
          "targetAudience": "Owners of public spaces such as cafes and libraries",
          "useCase": "Providing comfortable and durable seating options that complement the ambiance of their establishments"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/793579884/cork-stools-home-living-bedroom-living?click_key=64f32cddd3971733b5f34ffe672896b93df313ab%3A793579884&click_sum=ecb110f6&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:16:17.367513",
      "productId": "rCvwmTnxSK"
    }
  },
  {
    "data": {
      "product": "Bonnet Wood Stool",
      "description": "The Bonnet Wood Stool is a versatile and stylish piece of furniture that can be used as an end table, side table, stool, or plant stand. It is handmade in Indianapolis, Indiana with durable materials and a water-resistant finish. The stool is available in two sizes and a variety of colors, and custom colors and sizes are also available upon request.",
      "targetAudience": [
        {
          "targetAudience": "Homemakers looking for a stylish and functional piece of furniture",
          "useCase": "Using the stool as an end table, side table, or plant stand in their living room or bedroom."
        },
        {
          "targetAudience": "Office workers looking for a comfortable and stylish place to sit or put their feet up",
          "useCase": "Using the stool as a footrest or extra seating in their office."
        },
        {
          "targetAudience": "Plant enthusiasts looking for a unique and stylish way to display their plants",
          "useCase": "Using the stool as a plant stand to elevate their plants and create a more visually appealing display."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1198929077/bonnet-wood-stool-golden-yellow?click_key=3888af3b62a03fe5809cd820a07dbac86ebbb690%3A1198929077&click_sum=f3c75c88&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:16:31.729107",
      "productId": "TiDuwHPaDI"
    }
  },
  {
    "data": {
      "product": "Wood \"COILED PLANTER\" Matte Finish Mid Century Indoor Planter",
      "description": "This mid-century modern planter is 3D printed using a plant-based bioplastic eco-friendly material. It is lightweight, durable, and won't break if dropped. The planter has a drainage hole and three small feet, but these can be omitted upon request. It is available in a variety of matte finish colors, including black, white, and light grey. The natural wood and black wood matte finishes are mixed with real recycled wood. This planter is perfect for small to medium-sized plants and makes a great gift. Free domestic shipping is available on orders over $35, and international customers can contact the seller for a $20 discount code on orders over $150.",
      "targetAudience": [
        {
          "targetAudience": "Plant enthusiasts who appreciate modern and stylish home decor",
          "useCase": "Displaying their plants in a visually appealing way that complements their home's aesthetic"
        },
        {
          "targetAudience": "Individuals looking for unique and eco-friendly home accessories",
          "useCase": "Adding a touch of nature and sustainability to their living space while showcasing their plants"
        },
        {
          "targetAudience": "Gift-givers seeking thoughtful and practical presents for plant-loving friends or family members",
          "useCase": "Expressing their appreciation for the recipient's passion for plants and adding a stylish touch to their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/865339439/wood-coiled-planter-matte-finish-mid?click_key=db275bc61e378780e4de0413330d573d73b0c61a%3A865339439&click_sum=19a22b52&ref=stl_listing-1&sts=1",
      "dateCreated": "2024-02-20T14:16:52.566559",
      "productId": "rLuvxEMUhd"
    }
  },
  {
    "data": {
      "product": "Nude Pink and Brass Metal Floor Planter",
      "description": "This planter is made of brass and aluminum with a static paint finish. It is nude pink in color and has a diameter of 20 cm and a total height of 30 cm. The brass stand is 18 cm high. The planter is suitable for all house plants, especially those that like facing the sun. It can be rotated to any direction on its brass stand, making it easy to adjust the plant's position. The planter has a perforated separator inside that collects excessive water at the bottom to prevent root damage. Plants can also be placed with their pots inside the planter, in which case the separator functions as a platform for the pot.",
      "targetAudience": [
        {
          "targetAudience": "Home decorators who appreciate stylish and functional home accessories.",
          "useCase": "Displaying plants in a modern and elegant way."
        },
        {
          "targetAudience": "Plant enthusiasts who want to create a unique and personalized indoor garden.",
          "useCase": "Growing and showcasing plants in a space-saving and visually appealing way."
        },
        {
          "targetAudience": "Individuals looking for a gift for a plant lover or home decor enthusiast.",
          "useCase": "Giving a thoughtful and practical gift that enhances the recipient's living space."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/728731403/nude-pink-and-brass-metal-floor-planter?click_key=811d62354e4e3beaa09e2d115ea22934d75b44b3%3A728731403&click_sum=9f21c88b&ref=stl_listing-2",
      "dateCreated": "2024-02-20T14:17:09.367140",
      "productId": "nzGjjoCoxy"
    }
  },
  {
    "data": {
      "product": "Tile Pattern Ceramic Planter",
      "description": "This handmade stoneware planter features hand-carved details in a vibrant red and pink combination. Its small size makes it ideal for housing a petite cactus or succulent. A small drainage hole at the bottom ensures proper water drainage. Measuring approximately 2.5 inches in height and 3 inches in diameter, this planter adds a touch of charm to any indoor space.",
      "targetAudience": [
        {
          "targetAudience": "People who like to decorate their homes with plants",
          "useCase": "Using the planter to hold a small cactus or succulent"
        },
        {
          "targetAudience": "People who are looking for a unique and stylish gift",
          "useCase": "Giving the planter as a gift to a friend or family member"
        },
        {
          "targetAudience": "People who are interested in handmade and artisan products",
          "useCase": "Using the planter as a decorative piece in their home"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1435558019/tile-pattern-ceramic-planter-small?click_key=f2f9a17a3d3a9cf5251ca92fcf423d046c7ac34f%3A1435558019&click_sum=35ba8a96&ref=stl_listing-3",
      "dateCreated": "2024-02-20T14:17:28.600885",
      "productId": "9wrPDbtMwg"
    }
  },
  {
    "data": {
      "product": "Art print",
      "description": "• unframed\n• matte\n• 4\"x6\"\n• 200g/m2!! !!Every order comes with standard shipping. It is ̸ - without a̸ number. EU delivery estimated to around 2 weeks, 6 weeks to arrive anywhere outside of EU.There are two upgrades available:\n• ̸ will require to be signed upon delivery and will give you a̸ number within EU.\n• ̸, ̸ Is the fastest and safest way to ship your order from Europe to America. It provides you a̸ number that works",
      "targetAudience": [
        {
          "targetAudience": "Art collectors",
          "useCase": "To add to their collection of art prints."
        },
        {
          "targetAudience": "People who want to decorate their home with art",
          "useCase": "To hang on their wall as a decorative piece."
        },
        {
          "targetAudience": "People who are looking for a gift for someone who loves art",
          "useCase": "To give as a gift to someone who appreciates art."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1657888576/art-print-4-x-6?click_key=239009c8fbd5c04a2cccf1fbece1315330114ecc%3A1657888576&click_sum=e4c270e8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-1",
      "dateCreated": "2024-02-20T14:17:36.913775",
      "productId": "hWrdPpISyE"
    }
  },
  {
    "data": {
      "product": "Infinity Symbol SVG, Infinity PNG Bundle, Infinity Clipart, Infinity SVG Cut Files for Cricut, Infinity Silhouette, Infinity Heart Svg",
      "description": "This digital download includes over 230 high-quality SVG, EPS, PDF, and PNG files featuring infinity symbols. The files are compatible with cutting machines like Cricut and Silhouette, making them ideal for creating a variety of crafts, such as t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, and more.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and hobbyists",
          "useCase": "Creating personalized t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, and print n’ cuts."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Selling handmade items featuring the infinity symbol on Etsy or other online marketplaces."
        },
        {
          "targetAudience": "Teachers and educators",
          "useCase": "Creating educational materials or classroom decorations featuring the infinity symbol."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1521258520/infinity-symbol-svg-infinity-png-bundle?click_key=4ec8fed791a62ac7d0ad20f7956cf2330a84679f%3A1521258520&click_sum=708a6ad9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-2&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:17:44.762272",
      "productId": "YUsyUvYc8y"
    }
  },
  {
    "data": {
      "product": "Super Mario SVG Bundle for Cricut and Sublimation, Mario Cut Files, Mario Clipart, Super Mario Font, Mario PNG",
      "description": "This bundle includes SVG, PNG, JPG, and FONT files of Super Mario Bros. characters and designs. It is suitable for use with Cricut machines and sublimation printing. The designs can be used to create physical items for personal and small commercial purposes, such as shirts, tumblers, signs, cards, blankets, and more. It is prohibited to share or resell the design files.",
      "targetAudience": [
        {
          "targetAudience": "People who own Cricut or sublimation machines",
          "useCase": "They can use these files to create physical items for personal and small commercial purposes, such as shirts, tumblers, signs, cards, blankets, and more."
        },
        {
          "targetAudience": "Parents of young children",
          "useCase": "They can use these files to create items for their children, such as personalized t-shirts, backpacks, or room decor."
        },
        {
          "targetAudience": "Teachers",
          "useCase": "They can use these files to create educational materials for their students, such as worksheets, posters, or flashcards."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1581333291/super-mario-svg-bundle-for-cricut-and?click_key=53b019aebd273e0441c5d544c424d41fd6878df9%3A1581333291&click_sum=f1359119&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-3&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:17:56.368564",
      "productId": "pQ3Vm9FYXf"
    }
  },
  {
    "data": {
      "product": "Amor tumbado Svg, CT Svg, Cut Files for Cricut & Silhouette, Svg, Png, Dxf",
      "description": "This is a digital download of several files in a zip archive. Inside the zip archive, you will find 5 SVG files for Cricut Design Space, 5 PNG files with a transparent background, and 5 DXF files for Silhouette Studio Basic Edition. Reselling or sharing these files is strictly prohibited in any digital format.",
      "targetAudience": [
        {
          "targetAudience": "Crafters who use Cricut machines",
          "useCase": "Creating custom designs for t-shirts, mugs, and other items using the SVG files"
        },
        {
          "targetAudience": "Designers who use Silhouette machines",
          "useCase": "Creating custom designs for t-shirts, mugs, and other items using the DXF files"
        },
        {
          "targetAudience": "People who want to print and cut designs",
          "useCase": "Using the PNG files to print and cut designs for scrapbooking, card making, and other paper crafts"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1648658969/amor-tumbado-svg-ct-svg-cut-files-for?click_key=2ec7ca8947051a8ee280245ef9d3b3b71a984ade%3A1648658969&click_sum=75a0188d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-4&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:18:12.245938",
      "productId": "s4LHMNqmqi"
    }
  },
  {
    "data": {
      "product": "Amazing Watercolor Painting kit for Procreate 2023",
      "description": "This digital product is a watercolor painting kit for Procreate. It includes over 25 brushes, a watercolor paper texture, and over 100 tutorial videos. The brushes are designed to create realistic watercolor effects, and the kit is compatible with all versions of the iPad that can run Procreate 5.3 or higher. The kit comes with a commercial use license, so it can be used to create products for sale. The reviews are positive, with customers praising the brushes and the tutorials.",
      "targetAudience": [
        {
          "targetAudience": "Professional and aspiring digital artists",
          "useCase": "Creating realistic watercolor paintings using the latest Procreate features."
        },
        {
          "targetAudience": "Art educators and students",
          "useCase": "Teaching and learning watercolor painting techniques within the Procreate platform."
        },
        {
          "targetAudience": "Hobbyists and enthusiasts",
          "useCase": "Exploring and experimenting with watercolor painting as a creative outlet."
        },
        {
          "targetAudience": "Content creators",
          "useCase": "Producing high-quality watercolor artwork for social media, websites, and other digital platforms."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/773250221/amazing-watercolor-painting-kit-for?click_key=a61341489f4a02c1537626638f274ff320baa260%3A773250221&click_sum=9845ab7d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-5&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:18:21.765233",
      "productId": "COuyQrOpys"
    }
  },
  {
    "data": {
      "product": "455 Unique Project Proposal Presentation Templates",
      "description": "This package contains 455 unique slides, 4000 unique icons, and 60 color themes. These fully customizable templates are compatible with all major presentation software. Choose from a variety of templates, including cover slides, project timelines, team introductions, budget breakdowns, and more. These templates will help you organize your ideas and present them clearly and concisely.",
      "targetAudience": [
        {
          "targetAudience": "Students",
          "useCase": "Creating project proposals for academic assignments"
        },
        {
          "targetAudience": "Business professionals",
          "useCase": "Developing presentations for project proposals or pitches"
        },
        {
          "targetAudience": "Non-profit organizations",
          "useCase": "Creating presentations for grant proposals or fundraising campaigns"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1458050784/455-unique-project-proposal-presentation?click_key=41c958069769dfac8637b2f7e20b0efb0d5f8857%3A1458050784&click_sum=ed04c105&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-6&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:18:35.680465",
      "productId": "vNUxG4qt0G"
    }
  },
  {
    "data": {
      "product": "Wonka Tshirt",
      "description": "This Wonka T-shirt is perfect for fans of the classic movie, Willy Wonka & the Chocolate Factory. The shirt features a colorful print of the iconic Wonka logo, as well as the words \"Wonka Chocolate Factory.\" It's made from a soft, comfortable cotton blend, and is available in a variety of sizes. Whether you're wearing it to a movie screening or just around the house, this Wonka T-shirt is sure to be a hit.",
      "targetAudience": [
        {
          "targetAudience": "Fans of Willy Wonka and the Chocolate Factory",
          "useCase": "Create Wonka-themed shirts, accessories, or decorations"
        },
        {
          "targetAudience": "Educators",
          "useCase": "Use the SVG file to create educational materials about Willy Wonka and the Chocolate Factory"
        },
        {
          "targetAudience": "Crafters",
          "useCase": "Use the PNG or JPG files to create Wonka-themed cards, scrapbooks, or other crafts"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665889182/wonka-tshirtmovie-shirtwilly-wonkawonka?click_key=8da8e08d5953684f85938483bd124a9e13be1d0c%3A1665889182&click_sum=802ad04d&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-7&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:18:45.630096",
      "productId": "bJmDSWwmxm"
    }
  },
  {
    "data": {
      "product": "Easter Laser cut Mega Bundle",
      "description": "This product includes 248 Easter designs in SVG and DXF formats. These designs can be used to create a variety of Easter-themed items, such as 3D Easter lanterns, Easter boxes, Easter decor stands, Easter Doh holders, Easter egg baskets, Easter gift card holders, Easter round signs, Easter stands, 3D easter eggs, Alphabet Easter Signs, Easter keychains, Easter ornaments, Easter pop up cards, Easter single egg holders, Easter single egg holder 2, Easter single egg holder 3, Easter tray Laser cut, Easter directional sign, 3D Round Easter egg basket, Easter gnomes, Easter letter keychains, Easter money holder and Egg holders.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and makers",
          "useCase": "Creating personalized Easter decorations and gifts using laser cutting machines."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Selling laser-cut Easter products to customers, such as ornaments, keychains, and home decor."
        },
        {
          "targetAudience": "DIY enthusiasts",
          "useCase": "Designing and creating unique Easter decorations and gifts for personal enjoyment."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1676983339/easter-laser-cut-mega-bundle-248-easter?click_key=cb2e3041b4e17ce8b9ccc9afe57ddb4cccb8dc17%3A1676983339&click_sum=f54b38f9&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-8&pro=1&dd=1",
      "dateCreated": "2024-02-20T14:19:03.458147",
      "productId": "PUklwOKb8E"
    }
  },
  {
    "data": {
      "product": "Kawaii Digital Paper Set, S-anrio Digital Paper Set, Cute K-uromi, My m-elody, H-ello Kitty, Digital Art, Digital Printable Papers",
      "description": "This digital paper set features 20 high-quality PNG images with a resolution of 2000x2000 px. The images depict cute Sanrio characters such as K-uromi, My Melody, and Hello Kitty. The papers are perfect for creating digital art projects, printable papers, and more.",
      "targetAudience": [
        {
          "targetAudience": "Crafters who enjoy creating cute and whimsical items",
          "useCase": "Using the digital papers to create scrapbook pages, cards, gift tags, and other paper crafts."
        },
        {
          "targetAudience": "Digital artists who want to add a touch of kawaii to their designs",
          "useCase": "Using the digital papers as backgrounds, textures, or elements in their digital artwork."
        },
        {
          "targetAudience": "Teachers and educators who want to create engaging and visually appealing materials for their students",
          "useCase": "Using the digital papers to create worksheets, lesson plans, and other educational resources."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1674604893/kawaii-digital-paper-set-s-anrio-digital?click_key=3a899ef97929e9a64ee3fb68e92113fbba4fee21%3A1674604893&click_sum=1bb22140&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-9&pro=1&dd=1",
      "dateCreated": "2024-02-20T14:19:12.261077",
      "productId": "B5xjDoLSjn"
    }
  },
  {
    "data": {
      "product": "Couple Wooden State Sign",
      "description": "This personalized state to state sign is a unique and thoughtful gift for couples. It features custom location art and can be used to commemorate the place you met or your destination wedding. The sign is made of high-quality plywood and comes with a stand. It is available in three sizes: 6\"x6\", 8\"x8\", and 10\"x10\". The sign is made to order and the color and size may vary slightly due to the nature of handcrafted products.",
      "targetAudience": [
        {
          "targetAudience": "Couples in long-distance relationships",
          "useCase": "Commemorate the place they met or their destination wedding"
        },
        {
          "targetAudience": "Couples celebrating anniversaries or Valentine's Day",
          "useCase": "Express their love and cherish their memories"
        },
        {
          "targetAudience": "Individuals looking for a unique and personalized gift",
          "useCase": "Create a special keepsake for a loved one"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1658192125/couple-wooden-state-sign-two-states-love?click_key=ad0995a1a9bfb3527f364c4850a86ec31b24fe07%3A1658192125&click_sum=270d7045&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-10&pro=1",
      "dateCreated": "2024-02-20T14:19:23.118011",
      "productId": "fIkNxcpYUE"
    }
  },
  {
    "data": {
      "product": "Pink and Gold Marble Background",
      "description": "This pack includes 20 beautiful white pink and gold marble digital papers with rose gold marble textures. These high-quality JPG files are perfect for creative digital designs, websites, business cards, invitations, and scrapbooking. They are also suitable for use as Photoshop backgrounds.",
      "targetAudience": [
        {
          "targetAudience": "Graphic designers",
          "useCase": "Creating digital designs, such as websites, business cards, invitations, and scrapbooking"
        },
        {
          "targetAudience": "Photographers",
          "useCase": "Using the marble textures as backgrounds for their photos"
        },
        {
          "targetAudience": "Crafters",
          "useCase": "Using the marble textures to create their own products, such as jewelry, home décor, and accessories"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1430086177/pink-and-gold-marble-background-pink?click_key=a1e68c1d3ec413468b6ca7230e65a06244365c25%3A1430086177&click_sum=f07f285e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-11&dd=1",
      "dateCreated": "2024-02-20T14:19:30.557164",
      "productId": "yGkdYdMyAk"
    }
  },
  {
    "data": {
      "product": "Paw Print Svg Bundle",
      "description": "This bundle includes a variety of paw print SVG, EPS, PDF, and PNG files that are perfect for Cricut or Silhouette projects. The files can be used to make t-shirts, mugs, birthday cards, wall decals, car decals, stickers, birthday party decorations, iron ons, print n’ cuts, and more.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts who enjoy making personalized items such as t-shirts, mugs, and stickers.",
          "useCase": "Using the SVG files to create custom designs for their projects."
        },
        {
          "targetAudience": "Small business owners who sell handmade goods on platforms like Etsy.",
          "useCase": "Using the SVG files to create unique designs for their products, such as paw print-themed jewelry or home décor."
        },
        {
          "targetAudience": "Teachers and educators who use digital resources in their classrooms.",
          "useCase": "Using the SVG files to create educational materials, such as paw print-shaped flashcards or worksheets about animals."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1523224267/paw-print-svg-bundle-paw-heart-svg-dog?click_key=f0c8360f3f26c91a6a4f86dfcb2830d8762f44b1%3A1523224267&click_sum=178a28ea&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-12&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:19:39.947438",
      "productId": "fSjerdcjlp"
    }
  },
  {
    "data": {
      "product": "Canva Editable, Valentine's Day Calendar Print, Wedding Date Keepsake, Anniversary Gifts for Him or Her, Canva Template, Special Date",
      "description": "This product is a digital template that allows you to create a personalized calendar print for Valentine's Day, anniversaries, or other special occasions. The template can be edited in Canva, a free online design platform, and customized with text, fonts, colors, backgrounds, and elements. The edited template can be downloaded in PNG, JPEG, or PDF format for digital or print use. The product also includes excellent customer service, with assistance available for finding the file or with design help.",
      "targetAudience": [
        {
          "targetAudience": "People who want to create a personalized gift for their partner on a special occasion such as an anniversary, Valentine's Day, or other special occasions.",
          "useCase": "They can use the template to create a custom calendar print that includes important dates and milestones in their relationship."
        },
        {
          "targetAudience": "People who are looking for a unique and thoughtful way to commemorate a special date.",
          "useCase": "They can use the template to create a keepsake that they can cherish for years to come."
        },
        {
          "targetAudience": "People who are looking for a way to add a personal touch to their home décor.",
          "useCase": "They can use the template to create a custom calendar print that reflects their own style and personality."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1649559018/canva-editable-valentines-day-calendar?click_key=c93572ea163081871975d8f23f202ea0a1b796c2%3A1649559018&click_sum=c890a0a3&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-13&dd=1",
      "dateCreated": "2024-02-20T14:19:52.451584",
      "productId": "NhhdBuwOrh"
    }
  },
  {
    "data": {
      "product": "Custom order",
      "description": "This product is a custom order, and the seller requires that buyers contact them before purchasing. The product has received positive reviews for its color, quality, and customer service. One reviewer mentioned that a panel tore, but the seller sent a new one, which demonstrates excellent customer service.",
      "targetAudience": [
        {
          "targetAudience": "People looking for custom orders",
          "useCase": "To order custom products"
        },
        {
          "targetAudience": "People who want to sample colors and quality",
          "useCase": "To get a sample of the product before ordering"
        },
        {
          "targetAudience": "People who need customer service",
          "useCase": "To get help with their order"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1494919926/custom-order?click_key=355217b3f77fac22476b29c8b7097973cf0b6c71%3A1494919926&click_sum=d1d3abad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-14&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:20:00.070709",
      "productId": "gaXnjJYwoN"
    }
  },
  {
    "data": {
      "product": "Taylor Swift The Eras Tour 2023 Bundle Png, Taylor Swift Png, TS Swiftie Concert Png, Taylor Swiftie Png, Taylor Swiftie Eras PNG, Bundle",
      "description": "This product includes a PNG file with high-resolution raster images, providing vibrant graphics for crafting projects. It is compatible with Cricut machines and other crafting tools. The terms of use allow for unlimited personal use and prohibit reselling as a digital download. The commercial license must be purchased to sell the physical product. The seller also offers a whole store package for access to all products and future additions.",
      "targetAudience": [
        {
          "targetAudience": "Fans of Taylor Swift",
          "useCase": "Creating personalized merchandise, such as t-shirts, mugs, and posters"
        },
        {
          "targetAudience": "Crafters and hobbyists",
          "useCase": "Incorporating the designs into scrapbook pages, greeting cards, and other paper crafts"
        },
        {
          "targetAudience": "Event planners and party hosts",
          "useCase": "Creating decorations and party favors for Taylor Swift-themed events"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665630928/taylor-swift-the-eras-tour-2023-bundle?click_key=aba077c86afba935573d4f5874422158510167a1%3A1665630928&click_sum=7567a403&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-15&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:20:20.346227",
      "productId": "MCgTKUqfFw"
    }
  },
  {
    "data": {
      "product": "The Lakes Poster | Wall Art | Digital Download Print at Home | Subtle Swiftie Aesthetic Home Decor",
      "description": "This is a digital download, a physical copy will not be sent to you. Customers are responsible for printing their item in the size of their choice. You will receive 6 versions of the same print, each a different size that correlates with your preferred printing size. Along with the 6 prints, you will receive a ‘How To Print’ document. Each Ratio is compatible with a number of different size print options. Customer is responsible for the printing of their digital download. It is highly recommended that for the best results you print your poster professionally. Home printing is possible, but please be aware that the quality will not be as good.",
      "targetAudience": [
        {
          "targetAudience": "Swifties (fans of Taylor Swift)",
          "useCase": "Decorating their homes with subtle Taylor Swift-inspired artwork"
        },
        {
          "targetAudience": "Individuals looking for printable wall art",
          "useCase": "Printing and framing the artwork for display in their homes or offices"
        },
        {
          "targetAudience": "Interior designers",
          "useCase": "Incorporating the artwork into their design schemes for clients who are fans of Taylor Swift or appreciate subtle and sophisticated home decor"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1588333929/the-lakes-poster-printable-wall-art?click_key=25ce33b4b9b627e746a946cc20296dbdbb8dbd8e%3A1588333929&click_sum=6c2d9b3e&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-16&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:20:34.283868",
      "productId": "eUrLzhLxqM"
    }
  },
  {
    "data": {
      "product": "Jesus Leaves the 99, DIGITAL PRINT!, Jesus Art, Bible Art, Jesus Good Shepherd, WALL Art, Rejoices over One Lost Sheep",
      "description": "This is a digital download of a hand-drawn sketch of Jesus as the Shepherd leaving the 99 other sheep to save the one wandering sheep. The sketch is based on the passages Matthew 18:12-14 and Luke 15:4-7, and also references Jesus as the Good Shepherd in John 10. The artist, Micah Martin, hopes that this drawing will remind people of scripture and the rejoicing in heaven over one sinner who repents. The listing includes four zip files, with two files in each (a CMYK JPEG and a RGB JPEG). In total there's eight (8) instantly printable downloadable digital files (without framed background)! Your order will include the following: 2x3 RATIO FILES FOR PRINTING: 20\"x30\" (Can also be printed at 6\"x9\", 8\"x12\", 10\"x15\" or 12\"x18\" if you resize document, or change page sizing in printing preferences.) 3x4 RATIO FILES FOR PRINTING: 18”x24” (Can also be printed at 6\"x8\", 9\"x12\", or 12\"x16\" if you resize document, or change page sizing in printing preferences.) 4x5 RATIO FILES FOR PRINTING: 16\"x20\" (Can also be printed at 4\"x5\" or 8\"x10\" if you resize document, or change page sizing in printing preferences.) 11x14 RATIO FILES FOR PRINTING: 11”x14”",
      "targetAudience": [
        {
          "targetAudience": "Individuals interested in Christian art and imagery",
          "useCase": "Displaying the print in their home or office as a reminder of the story of Jesus and the lost sheep"
        },
        {
          "targetAudience": "Sunday school teachers and other religious educators",
          "useCase": "Using the print as a teaching aid to illustrate the parable of the lost sheep"
        },
        {
          "targetAudience": "People who appreciate unique and meaningful gifts",
          "useCase": "Giving the print as a gift to a friend or family member who is a Christian or who enjoys religious art"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1145828694/jesus-leaves-the-99-digital-print-jesus?click_key=b810f9fd0320197d9b5e228368aa052e5c117d99%3A1145828694&click_sum=a6298279&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-17&pro=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:20:48.301310",
      "productId": "auPRBbZLas"
    }
  },
  {
    "data": {
      "product": "Envato Elements Download Service",
      "description": "Envato Elements Download Service is a subscription-based service that provides unlimited downloads of digital assets from Envato Elements. It includes video templates, graphic designs, stock photos, music and sound effects, and web templates. The service is available in 1-month and 30-day usage period packages, with 50 downloads per day and 750 downloads in total. It offers fast downloads, full license access, and 24/7 customer support.",
      "targetAudience": [
        {
          "targetAudience": "Content creators who need a wide variety of creative content for their projects",
          "useCase": "Downloading high-quality video templates, graphic designs, stock photos, music, sound effects, and web templates for use in their projects."
        },
        {
          "targetAudience": "Businesses and organizations that need to create marketing materials, presentations, and other creative content",
          "useCase": "Downloading pre-made templates and assets to save time and effort in creating their own content."
        },
        {
          "targetAudience": "Students and educators who need access to a wide range of educational resources",
          "useCase": "Downloading videos, images, and other resources to use in their presentations, assignments, and other projects."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1585218956/envato-elements-download-service-1-month?click_key=5508c66542ff44a2688b57e570e49ae1539d4d6f%3A1585218956&click_sum=8db48212&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-18&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:21:00.830406",
      "productId": "txsVQrxgUv"
    }
  },
  {
    "data": {
      "product": "Clean 1989 Poster",
      "description": "Printable wall art, digital download print at home, subtle Swiftie aesthetic home decor. Instant high-resolution ZIP file download containing JPGs. Six versions of the same print, each a different size that correlates with your preferred printing size. Compatible with a number of different size print options. Customer is responsible for the printing of their digital download. It is highly recommended that for the best results you print your poster professionally. Some professional online printing suggestions: Snapfish, Vistaprint, Photobox, Shutterfly. UK Stores that commonly offer professional printing: Boots, ASDA, Tesco. USA Stores that commonly offer professional printing: Walmart, Walgreens, CVS. You can also save file to USB and take into your local printing store. Please be aware that colour can vary once the product is printed depending on the monitor/printer/paper used.",
      "targetAudience": [
        {
          "targetAudience": "Fans of Taylor Swift",
          "useCase": "Decorating their homes with subtle Swiftie-themed art"
        },
        {
          "targetAudience": "People who appreciate minimalist and aesthetic home decor",
          "useCase": "Adding a touch of elegance and sophistication to their living spaces"
        },
        {
          "targetAudience": "Individuals looking for affordable and printable wall art",
          "useCase": "Creating a personalized and stylish gallery wall without breaking the bank"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1670924087/clean-1989-poster-printable-wall-art?click_key=4577f2183b61325188fe3149ae31541412be9255%3A1670924087&click_sum=671012e2&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-19&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:21:11.390249",
      "productId": "OvmwxQbpPn"
    }
  },
  {
    "data": {
      "product": "Loving Them With You Poem",
      "description": "This is an appreciation poem for your partner, available in different versions including Him/Her, mother/father, and two mothers. It is an 8 by 10 inch digital high-resolution download that will not have a watermark. The poem is copyrighted and not to be onsold. Commercial use of the poem requires a one-off small fee. More poems and extracts are added weekly. Poetry books and greeting cards are also available for purchase.",
      "targetAudience": [
        {
          "targetAudience": "Couples looking for a meaningful way to express their love and appreciation for each other",
          "useCase": "Anniversaries, Valentine's Day, or other special occasions"
        },
        {
          "targetAudience": "Parents looking for a special way to show their love and appreciation for their children",
          "useCase": "Mother's Day, Father's Day, or other special occasions"
        },
        {
          "targetAudience": "People looking for a unique and personal gift for a loved one",
          "useCase": "Birthdays, holidays, or other special occasions"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1400320341/loving-them-with-you-poem-for-your?click_key=d95eef46db594194270a955345a34338650edc6f%3A1400320341&click_sum=7bb33dd0&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-20&bes=1&sts=1&dd=1",
      "dateCreated": "2024-02-20T14:21:24.933211",
      "productId": "mPGvmExUNH"
    }
  },
  {
    "data": {
      "product": "Clown Chocolate Lollipop Template",
      "description": "This template includes AI, BMP, DXF, JPG, PNG, SVG format and gift design in letter size PNG format. It is ready to customize and print, and can be cut on a plotter or by hand. This digital file is for personal use only and cannot be resold, shared, or copied.",
      "targetAudience": [
        {
          "targetAudience": "Artists",
          "useCase": "Artists may use the template to create custom chocolate lollipops for sale or as gifts."
        },
        {
          "targetAudience": "Party planners",
          "useCase": "Party planners may use the template to create custom chocolate lollipops for parties or events."
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Small business owners may use the template to create custom chocolate lollipops for sale online or in stores."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1394859964/clown-chocolate-lollipop-template?click_key=afe4597881c4e8d0a735c9290762383dc19c4113%3A1394859964&click_sum=26e86dad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-21&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:21:38.401038",
      "productId": "DZvew8HEVa"
    }
  },
  {
    "data": {
      "product": "Boho Floral Digital Backdrops",
      "description": "This collection of 150 digital backdrops features boho floral themes, adding a delightful touch of nature to your images. Each backdrop boasts a resolution of 5300 x 3500 pixels, ensuring excellent image quality. These backdrops are compatible with software like Photoshop, enabling seamless integration into your creative projects. They are perfect for composite photography, including weddings, maternity sessions, and artistic overlays.",
      "targetAudience": [
        {
          "targetAudience": "Wedding photographers",
          "useCase": "Creating stunning wedding backdrops that capture the essence of the special day."
        },
        {
          "targetAudience": "Maternity photographers",
          "useCase": "Offering a range of beautiful and artistic backdrops for maternity shoots, allowing expectant mothers to preserve the memories of this special time."
        },
        {
          "targetAudience": "Artists and photographers looking to add a touch of nature and creativity to their projects",
          "useCase": "Using the backdrops as overlays or as inspiration for creating unique and eye-catching artwork."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1583085373/150-boho-floral-digital-backdrops-for?click_key=78ef0984d2fe77cbee1ea309a7850f643b688a12%3A1583085373&click_sum=7c2b4605&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-22&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:21:53.158126",
      "productId": "FNgfhikapb"
    }
  },
  {
    "data": {
      "product": "Metaphoric Associative Cards",
      "description": "These cards help users to be more creative, gain deep insights, and think in new ways. They are useful for therapists, counselors, designers, teachers, and team leaders, and anyone seeking innovative problem-solving methods. They provide new ways to analyze and solve problems. Each deck includes 65 cards with different metaphors, and they can be used digitally or printed out. The cards are designed to help users break free from usual thought patterns and explore fresh ideas.",
      "targetAudience": [
        {
          "targetAudience": "Therapists and counselors",
          "useCase": "Use the cards to help clients explore their thoughts and feelings, gain new perspectives, and develop more effective coping mechanisms."
        },
        {
          "targetAudience": "Designers and teachers",
          "useCase": "Use the cards to generate new ideas, solve problems, and foster creativity."
        },
        {
          "targetAudience": "Team leaders and anyone seeking innovative problem-solving methods",
          "useCase": "Use the cards to facilitate brainstorming sessions, generate new ideas, and develop more effective solutions."
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1638060836/metaphoric-associative-cards-coaching?click_key=b2f81b2197b23a00a27a7f150ee3da89ea62cb0f%3A1638060836&click_sum=592485ad&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-23&dd=1",
      "dateCreated": "2024-02-20T14:22:03.490884",
      "productId": "CaRBkYvJVS"
    }
  },
  {
    "data": {
      "product": "P!nk Lyric Album Song Doodle Art Logo PNG Bundle",
      "description": "This is a digital file of a printable PNG download for creating sublimation products, invitations, framed art, pillows, and more. The PNGs are 300dpi and have a transparent background. The download includes a ZIP file with a PNG file of the design. Please note that this is not an SVG file and cannot be used as one. The design is for personal and small business use only. Commercial and mass production is not allowed.",
      "targetAudience": [
        {
          "targetAudience": "Crafters and DIY enthusiasts",
          "useCase": "Creating custom t-shirts, tote bags, and other sublimation products"
        },
        {
          "targetAudience": "Artists and graphic designers",
          "useCase": "Incorporating the doodle art logo into their own designs"
        },
        {
          "targetAudience": "Small business owners",
          "useCase": "Selling printed products featuring the doodle art logo"
        }
      ]
    },
    "metadata": {
      "url": "https://www.etsy.com/il-en/listing/1665392439/pnk-lyric-album-song-doodle-art-logo-png?click_key=0fa2b42741a81f06ec429743eed29320b43dbd6e%3A1665392439&click_sum=e9f76cf8&ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=&ref=search_grid-759968-3-24&bes=1&dd=1",
      "dateCreated": "2024-02-20T14:22:12.220898",
      "productId": "nEWpjdvpVi"
    }
  }
]
